{
  "generated_at_utc": "2026-02-22T21:39:27.141771+00:00",
  "iteration": 2,
  "weighted_heading_split_score": 0.804461499536139,
  "delta_from_previous": 0.0,
  "standalone_total": 19077.0,
  "glued_total": 4637.0,
  "docs_ok": 517,
  "issue_groups": {
    "plain_heading_runon": 16,
    "header_then_abstract_runon": 9,
    "toc_inline_navigation": 4,
    "numbered_heading_runon": 2
  },
  "examples": {
    "plain_heading_runon": [
      [
        "2cd48cee301f5432effbe034b1c18e10c19c8d1c9c9e57e0d8b128ada7c286f7.json",
        "Discussion of deterrence often arises from advocates of strong and swift military responses to terrorist attacks. They argue that force is necessary as 'an effective counterweight to extremism'.¹⁰⁷ Even so, some experts question the deterre"
      ],
      [
        "5be87f5ef5b5099687a4c8bce3416812bf0f6fe4cbe7460ed7c6b5736901e955.json",
        "## Conclusion: Addressing the contestability of attribution discourse"
      ],
      [
        "8f11710cb0974f980020246e436352c213b2cb1d47b303d0a8078ce9d4b321d4.json",
        "Abstract While no State may claim sovereignty over cyberspace, States may exercise jurisdiction, which is the authority of the State to regulate conduct of natural persons or legal entities by its own domestic law, over cyber activities ins"
      ],
      [
        "35c18b198e19a95f5bd8e216d09c2761634fe2ddb51bae470998adefb6370634.json",
        "ABSTRACT Who did it? Attribution is fundamental. Human lives and the security of the state may depend on ascribing agency to an agent. In the context of computer network intrusions, attribution is commonly seen as one of the most intractabl"
      ],
      [
        "bf15de86e7924d3cb531b4725262888ca4fa9212813a30d6f1b850eaea457c72.json",
        "Abstract This Chapter explores the acceptability under the *jus ad bellum*, that body of international law governing the resort to force as an instrument of national policy, of computer network attack. Analysis centers on the United Nations"
      ],
      [
        "b993b6d5b78e38c15813490f848e731603c1058e7b9b2f6194696150b079ff10.json",
        "Method of the attack—in cases where the attack method is considered sophisticated, chances of the perpetrator publicly claiming credit rather than maintaining silence are 7.8 times lower than in cases of less sophisticated attacks. It appea"
      ],
      [
        "b993b6d5b78e38c15813490f848e731603c1058e7b9b2f6194696150b079ff10.json",
        "Method of the attack—countries attacked by more sophisticated methods were 7 times less likely to publicly reveal both the attack and the perpetrator than countries attacked by less sophisticated methods."
      ],
      [
        "9a827a299118fd68052880cf5bbaec5475a11f6d8e35acd73be0bc8284e5d97a.json",
        "Abstract: Attributing a cyberattack to the attacker is difficult. Cyberspace is conducive to anonymity and many attackers actively hide their tracks by using false flags that point to other culprits. On the other hand, the difficulties of a"
      ]
    ],
    "header_then_abstract_runon": [
      [
        "f4dbfa18ea5e7072e52795c3546216d7c1f13c27c64f216a3d4cc478c1939a9e.json",
        "jklscott@dmu.ac.uk DOI: 10.34190/EWS.21.046 Abstract:\"Our enemies are innovative and resourceful, and so are we. They never stop thinking about new ways to harm our country and our people, and neither do we.\"(George W. Bush) The purpose of "
      ],
      [
        "7e8cacf72003bb205fdecf2c4d5429d5e4a95212816bd96ddd02c56572d6b95e.json",
        "The particular conception of State silence that forms the focus of this volume is 'reactive State silence' – the absence of physical or verbal acts of a State against the background of someone else's conduct or claim.5 As this volume's intr"
      ],
      [
        "94a75eeaa326e53c81027fd16401435741f9493618321491f58d768c4fe25faf.json",
        "⁴⁰ See U.S. Department of State Foreign Affairs Manual Volume 7 – Consular Affairs, at http://www.state.gov/documents/organization/86558.pdf (“A demarche is a formal diplomatic representation of one government’s official position, views, or"
      ],
      [
        "94a75eeaa326e53c81027fd16401435741f9493618321491f58d768c4fe25faf.json",
        "Then on January 22, 2010 the Washington Post reported that a demarche had already been issued,\"according to a State Department official\".51 However, any ambiguity regarding the issuance of the demarche was removed on January 22, 2010, when "
      ],
      [
        "94a75eeaa326e53c81027fd16401435741f9493618321491f58d768c4fe25faf.json",
        "In transnational practice, “repeated interactions among states and a variety of domestic and transnational actors produce interpretations of applicable global norms which can be and are eventually internalized into states’ domestic values a"
      ],
      [
        "73a35f85eab928b56f395d380950f8834eed94c0459c4e1effc13f272f43f652.json",
        "Third, information about cyber incidents is regularly not forthcoming, reinforcing the perception of hidden processes and making cyber attack causal narratives very similar to conspiracy theories (i.e. “a proposed explanation of some histor"
      ],
      [
        "64c7005eaed374ffa00861b78f9f23e7fccda2a5fb482a1f6e10e135cedc2b84.json",
        "The most likely international law obligation to be breached by a state's cyber operation against a health facility or capability, or public health activities, is the obligation to respect the sovereignty of other states. Before discussing t"
      ],
      [
        "64c7005eaed374ffa00861b78f9f23e7fccda2a5fb482a1f6e10e135cedc2b84.json",
        "[Vol. 11:247] both symbolic and practical, should not be underplayed in situations in which a state is causing harm primarily to human beings, as opposed to other states as abstract entities. Human rights law is in many ways normatively a b"
      ]
    ],
    "toc_inline_navigation": [
      [
        "19d8bb77f42d0280840aefa0c9af7b767abed34de1842c5476898083fdb51e1e.json",
        "# Table of Contents"
      ],
      [
        "c7abe1816adc0298f889835ed4e4813d2e7be9b4b4a9fc60bdbaed418a4e3feb.json",
        "TABLE OF CONTENTS"
      ],
      [
        "5d981ba16a79ee87ebf70ed75c7915a7cbf0db19f74165b259e7e69f35e707de.json",
        "Previous article View issue table of contents Next article"
      ],
      [
        "7da9998ed0e085dba55e0988d1a46267b5d7d8dd2fb70f7849efcbdf7f63a70f.json",
        "# TABLE OF CONTENTS"
      ]
    ],
    "numbered_heading_runon": [
      [
        "c7abe1816adc0298f889835ed4e4813d2e7be9b4b4a9fc60bdbaed418a4e3feb.json",
        "V. CONCLUSION... 238 * J.D. Candidate, University of Georgia School of Law, 2022. B.A. in Criminology and Law, University of Florida, 2019. B.A. in English, University of Florida, 2019."
      ],
      [
        "28626425158d38ac231d5ad500b307290ad5950a746e3c09f53780296a5e10b9.json",
        "# 5. Conclusion/Proposing a Dispute Resolution Mechanism"
      ]
    ]
  }
}