{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\NGXDZG5T\\YHVAWNQ2.pdf",
  "custom_id": "360",
  "response": {
    "id": "batch-b6235e9e-361-12e579fb-dca1-4300-bee2-1cbfabdee7e3",
    "custom_id": "360",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n\n# Conceptualising Cyber Deterrence and Policy Options for Pakistan\n\nSyed Ahmed Ali* and Nasir Mehmood*\n\n## Abstract\n\nThe research paper attempts to explore and analyse how traditional deterrence concepts would operate in the cyber domain employing a comparative analysis model to compare Cyber deterrence with conventional and nuclear deterrence. Through this analysis, the research found that the cyber domain has an incognito environment with multiple actors that have low costs and high returns, incentivizing hostile cyber actions. This means that traditional concepts of deterrence such as Mutually Assured Destruction are not possible. For this reason, new approaches to cyber deterrence such as cumulative deterrence embody the “Punishment” approach. Cyber norms and cyber hardening represent deterrence through a “denial” approach. The research concludes that the denial approach, while more resource-intensive and requires international cooperation, is a more sustainable way to counter cyber threats. In the case of deterrence failure Pakistan may resort to a cumulative strategy, which may allow Pakistan to retaliate, can also lead to escalation. Pakistan needs to adopt both a denial and punishment approach, but a strong emphasis on cyber security is a priority.\n\nKey Words: Pakistan, Cyber Deterrence, Nuclear Deterrence, Cyber Threats, Cumulative deterrence.\n\n* Syed Ahmed Ali has graduated in Strategic Studies from National Defense University, Islamabad.\n* Nasir Mehmood is professor of Strategic Studies at the National Defense University, Islamabad.\n\n118",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 1,
            "markdown": "Conceptualising Cyber Deterrence and Policy Options for Pakistan\n\n# Introduction\n\nSouth Asia is a complex region, marked by political tensions alongside military confrontations between the nuclear-armed states of Pakistan and India. The South Asian strategic stability is realized in the form of nuclear deterrence and is reinforced by a position of mutual vulnerability which acts as a disincentive to alter the status quo through the use of coercion or military force.\n\nNew technologies create new ways to exercise military power and create new threat vectors that need to be addressed. The evolution of the Internet of Things (IoT) and the reliance on computers to increase the efficiency and effectiveness of modern weaponry has given birth to new cyber threats. These cyber-threats become more dangerous as the states start to adopt IoT solutions and integrate them into their military capabilities. The evolution of threats from the cyber domain has challenged the traditional concepts of deterrence, which must be investigated and understood to conceptualise new ways of deterrence in cyber domain. Hence, the study investigates the impact of cyber threats on nuclear deterrence between Pakistan and India. Additional variables such as differences in doctrine, the evolution in delivery mechanisms and nuclear capability and the role of non-state actors will not be discussed.\n\n# Evolution of the Deterrence Theory\n\nTraditionally, deterrence theory refers to the threat of use of overwhelming force (nuclear weapons) by a state to cause unacceptable damage in order to stop another state not to initiate aggression or an undesired act. This concept has seen constant change and evolution due to changes in technology and strategic thinking about these weapons. Robert Jervis has identified three main waves that mark different schools of thought which have evolved regarding the nature and use of nuclear weapons.¹\n\nThe initial phase of deterrence theory was heavily influenced by the advent of nuclear weapons. Bernard Brodie elaborated this idea in his\n\n¹ Robert Jervis, “Deterrence Theory Revisited,” *World Politics* 31, no. 2 (January 1, 1979): 289–324, https://doi.org/10.2307/2009945.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 2,
            "markdown": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n\nbook “The Absolute Weapon”, where he argued that the primary purpose of previous military establishments had been to win wars. However, with the introduction of nuclear weapons, the purpose of the military establishment shifted to preventing wars altogether.² Meanwhile, Thomas Schelling developed the game theory model which explored the rational cost and benefit involved in decision making. This model largely rested on rational decision-making in matters related to foreign policy and national security. In his models, Schelling explained that the concept of nuclear deterrence largely rests on rational decision-making and credibility.³\n\nWhile the first wave saw no space for warfare with the introduction of nuclear weapons, the second wave however was more flexible in this position. Lawrence Freedman summarized the stance of the second wave, stating that total war could be threatened but never fought. First-wave deterrence theorists studied how the use of nuclear weapons could be used as a threat and how such dynamics operated.⁴\n\nThe third wave represents the antithesis of the second wave, and criticises ideas of rational deterrence by pointing out the failure of rational decision-making. Third-generation deterrence theorists like Irving Janis in their work point out the weaknesses in rational decision-making. It was during this generation that new fields were introduced in nuclear decision making such as behavioural sciences and cognitive psychology.⁵\n\nThe above account explains how the theory of deterrence has evolved with time and how various strategists have thought about nuclear deterrence. While strategists may differ in how deterrence is viewed, there is consensus in the community that all deterrence strategies must discourage hostile actions. To achieve this effect strategists can use the\n\n² Bernard Brodie and Frederick Sherwood Dunn, *The Absolute Weapon: Atomic Power and World Order* (Freeport, New York State: Books for Libraries Press, 1972).\n³ Thomas C. Schelling, “Chapter 2: The Art of Commitment,” essay, in *Arms and Influence*, 1st ed., vol. 1 (New Haven, Connecticut: Yale University Press, 1966), 36–40.\n⁴ Freedman, Lawrence. 2004. Deterrence. Cambridge: Polity Press: 21.\n⁵ Irving Janis, *Groupthink: Psychological Studies of Policy Decisions and Fiascoes*, 1st ed., vol. 1 (Boston, Massachusetts: Houghton Mifflin Harcourt, 1982).",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 3,
            "markdown": "Conceptualising Cyber Deterrence and Policy Options for Pakistan\n\n\"Deterrence by Denial Approach\" or \"Deterrence by Punishment Approach\"⁶. In deterrence by punishment, the state threatens to retaliate with devastating force (nuclear weapons), which will offset the benefit of any military gain. Alexander and Richard explain that in the case of deterrence, the commitment of intent should be clear, the credibility of the threat should be well established and lastly, the threat should be communicated.⁷ In Deterrence by Denial, states try to deny the opponent achievement of its war aims. This means a state would harden itself by building stronger infrastructure and better security systems. For instance, the Strategic Defense Initiative (Star Wars), if successfully built, would have been deterrence by denial. Such measures often fail when they lack the material to deny, the Maginot line is a good example of such failure.⁸\n\n## Impact of Cyber Threats\n\nIn traditional deterrence, in case of a nuclear attack on a city, the proportional response would typically involve a counterattack on a city of the adversary. This concept relies on the fact that a city is geographically fixed and immovable, both logically and physically. However, this logic does not apply in cyberspace, where targets and their impacts are not confined to physical locations. With the introduction of the cyber domain, new technical issues have arisen which have complicated the certainty of nuclear deterrence.\n\nFirstly, the victim state bears the responsibility of proving the identity of the individual responsible for an action. The assessment of potential retaliation and the possibility of preemptive actions hinge on accurate attribution. Engaging in retaliation without substantial evidence\n\n⁶ Michael Rühle, “Deterrence: What It Can (and Cannot) Do,” NATO Review, April 20, 2015, https://www.nato.int/docu/review/articles/2015/04/20/deterrence-what-it-can-and-cannot-do/index.html.\n\n⁷ Alexander L. George and Richard Smoke, “Chapter 3 The Normative Use of the Abstract Deterrence Model,” essay, in Deterrence in American Foreign Policy: Theory and Practice, 1st ed., vol. 1 (New York, New York State: Columbia University Press, 1974), 63–64.\n\n⁸ Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n\n121",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 4,
            "markdown": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n\nincreases the risk of misidentifying the culprit and escalating the situation unnecessarily. Secondly, a state must respond to an incident within a close time frame. If state X lacks detailed intelligence about the target it intends to retaliate against, the process of gathering intelligence and developing a cyber weapon extends the time frame for response. This extension can stretch from days to weeks, months, or even years beyond the original attack prompting retaliation. The possibility of facing consequences for an attack exists but is so temporally distant that it is disregarded as insignificant. 9 Thirdly, effective deterrence through punishment necessitates proportionality. To prevent escalation or breaches of international law, it is crucial to possess comparable assets for retaliation. However, within cyberspace, identifying such assets can be challenging as they are not always readily comparable. 10 Fourthly, a state must possess a tailored cyber weapon system designed for its specific target. If state X notifies state Y of its intention to retaliate against an asset, or if state X repeatedly employs a cyber weapon against state Y's system, the effectiveness of such actions diminishes over time due to the implementation of updated perimeter defenses. These defences may include intrusion detection and prevention systems (IDPS), antivirus programs, or various other security measures. 11\n\nComplications extend beyond the cyber domain and to the critical infrastructure which is a core focus of cyber security. Several limitations make the protection of critical infrastructure complicated. Firstly is the issue of denial of access which is easier in physical infrastructure than in digital infrastructure. Issues like Backdoor portals, zero-day exploits, and other cyber vulnerabilities make security difficult. Secondly, unlike physical deterrence where attacks against it are known and evident,\n\n9 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n10 Martin C. Libicki, Cyberspace in Peace and War, Second Edition, 2nd ed. (Annapolis, Maryland: Naval Institute Press, 2021), 262.\n11 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n\n122",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 5,
            "markdown": "Conceptualising Cyber Deterrence and Policy Options for Pakistan\n\ndigital deterrence failure is silent, where cyberattacks on critical infrastructure often go unnoticed. A key example of this is the Stuxnet virus where the malware went undetected for 3 years. It was only after the malware destroyed the centrifuges did the Iranians realized the breach in security. Thirdly, states have deep familiarity with military threats which is expressed in deterrence and coercion, for which states have established engagement norms as part of their doctrine. Most physical attacks on infrastructure have clear and recognized red lines that states recognised However, in cyberspace, which is a relatively new domain, the principles of deterrence are still developing. Responses to digital attacks on infrastructure are uncertain due to their rarity and the ambiguous nature of digital red lines, leading to unclear coercive communication. Fourthly, due to the diverse nature of cyberspace, non-state actors are also important actors who may not be driven by rational objectives. Rather these actors are driven by impulsive and ideological reasons which may trigger a security crisis. These actors are motivated by the fact that the cyber domain lacks symmetry where individuals and non-state actor groups have a disproportionate influence on state critical infrastructure's security. 12\n\n## Conceptualizing Cyber Deterrence\n\nThe current literature available for nuclear deterrence mostly revolves around traditional concepts of deterrence which cover issues relating to strategic dynamics, new weapon systems, and doctrine. The cyber domain has posed a challenge to conventional principles of deterrence through punishment and deterrence through denial. Both Deterrence by punishment and denial are designed to manipulate the cost and-benefit decision-making calculus of the enemy, where the costs of aggression outweighs any gain made by the enemy. To make any deterrence successful one of the strategies must succeed in deterring enemy aggression. To analyse the impact of the cyber domain on the\n\n12 Alex Wilner, “Cyber Deterrence and Critical-Infrastructure Protection: Expectation, Application, and Limitation,” Comparative Strategy 36, no. 4 (August 8, 2017): 309–18, https://doi.org/10.1080/01495933.2017.1361202.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 6,
            "markdown": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n\ntraditional concept of deterrence, it is important to understand how the strategies of “punishment” and “denial” work in a cyberspace environment. Before analyzing the two main deterrence strategies it is important to understand the cyberspace environment. 13\n\nConstructing a meaningful model of deterrence in cyberspace necessitates an initial exploration of what exactly seeks to deter. This is where the most significant disparity between deterrence in the physical realm and cyberspace arises. Deterrence in the cyber domain differs from traditional deterrence in the physical realm due to the inherent uncertainty of attribution. Cyberattacks, including cyber espionage, cyber sabotage, and cyber control, are inherently covert, making attribution uncertain. As a result, deterrence in the cyber domain is flawed, as it may lead to 'accidental escalation,' where third parties can exploit the anonymity of cyberspace to provoke conflict between two states.14 Additionally, studies conducted by Shawn Lonergan and Erica Borghard suggest a significant propensity for states to utilise proxies to retain plausible deniability. Cyberattackers can utilise Virtual Private Networks (VPNs), proxies, or other methods to conduct attacks while concealing their identity, this makes their attacks repudiable.15\n\nThe primary difference between deterrence in the physical realm and cyberspace is highlighted in Herbert Lin's article, the direct consequences of a cyberattack may not be immediately recognisable; instead, it's the secondary or tertiary effects that achieve the desired outcome. Classical deterrence methods and customized strategies employed against terrorist groups often struggle to address the disjointed sequences of action and reaction that are prevalent in cyberspace. Furthermore, the time frame for responding to a breach can span weeks,\n\n13 Alex Wilner, “Cyber Deterrence and Critical-Infrastructure Protection.”\n14 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n15 Erica D. Borghard and Shawn W. Lonergan, “Can States Calculate the Risks of Using Cyber Proxies?,” Orbis 60, no. 3 (July 1, 2016): 395–416, https://doi.org/10.1016/j.orbis.2016.05.009.\n\n124",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 7,
            "markdown": "Conceptualising Cyber Deterrence and Policy Options for Pakistan\n\nmonths, or even years due to the complexities of discovery and attribution issues that are not typically encountered in traditional deterrence. 16\n\nScholars like John Mearsheimer have written in much detail regarding the complex layers of security that envelop deterrence and are subject to the dynamic nature of the evolution of technology.17 The constant evolution of technology has led states to explore the cyber domain to gain new vectors of attack. The evolution of non-nuclear technology has a direct impact on the nuclear deterrence. The increasing sophistication of weaponry is gradually outpacing existing arms control treaties, creating new threats that could destabilise the delicate balance of nuclear deterrence.\n\nCyber threats to nuclear systems may seem like a remote possibility, particularly in the context of modern weapon systems. However, in June 1998 a group of Indian hackers had access to the computer systems at Bhabha Atomic Research Centre (BARC)18.\n\nA more worrying example of cyberattacks was on the US nuclear forces in the state of Wyoming. It was reported in 2010 that about 50 nuclear Minuteman missiles located in underground silos lost connection for about an hour with the launching crew had no access. The launching crew did not have access to the central command and the US President who had the authority to launch Minuteman missiles. This effectively means that cyberattacks can decapitate the leadership that has the authority to issue a nuclear retaliation.19\n\nDr. Beyza Unal, head of the Science, Technology, and International Security Unit at Chatham House UK, highlighted cyber\n\n16 Derek S. Reveron and Herbert Lin, “Chapter 3 Operational Considerations in Cyberattack and Cyber Exploitation,” essay, in Cyberspace and National Security: Threats, Opportunities, and Power in a Virtual World, 1st ed., vol. 1 (Washington DC, USA: Georgetown University Press, 2012), 37–57.\n\n17 John J. Mearsheimer, “Chapter 1 Introduction,” essay, in Conventional Deterrence, 1st ed., vol. 1 (Ithaca, New York State: Cornell University Press, 1983), 13–23.\n\n18 https://www.economist.com/asia/2019/11/01/a-cyber-attack-on-an-indian-nuclear-plant-raises-worrying-questions\n\n19 Bruce G. Blair, “Why Our Nuclear Weapons Can Be Hacked,” The New York Times, March 14, 2017, https://www.nytimes.com/2017/03/14/opinion/why-our-nuclear-weapons-can-be-hacked.html.\n\n125",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 8,
            "markdown": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n\nthreats to nuclear weapon systems. She warned that hackers could do more than access launch codes; they might disrupt retaliation mechanisms or inject malicious codes during weapon procurement, compromising performance. Hackers favor malware injection over direct system penetration due to antivirus protections. Malwares often infiltrates through risky websites for example gambling, video games, and adult sites, which organisation employees may access, risking virus downloads that could affect security systems.²⁰\n\nDmitry Stefanovich discusses in his article about the nexus of Cyber and Nuclear threats and cites the example of the Russian state document called the Basic Principles on Nuclear Deterrence where he explains that it is not a war-fighting manual but rather a “broadening” of nuclear-related sections. There is an update to the nuclear weapons policy, where the threats to nuclear weapons are grounds for nuclear retaliation. Paragraph 19C of the Basic Principles document clearly states that attacks against “critical governmental or military site” and “disruption which would undermine nuclear forces” are grounds for nuclear retaliation.\n\nThis development is not limited to the Russian Federation as the international community is aware of the threat of cyberattacks on the Nuclear Command, Control and Communications (NC3). In US 2018 nuclear posture review “non-nuclear strategic attacks” on US and allied forces” are cited as a major threat to nuclear stability. Likewise, the Chinese have equated cyberattacks to nuclear bombs, UK has discussed the possibility of a cyberattack on the NC3, while France has mentioned the link between nuclear and cyber threats in the documents of the “Paris Call for Trust and Security in Cyberspace.”\n\nThe failure of cyber deterrence would create a risk for unnecessary escalation and must be avoided. Most cyberattacks are non-kinetic cyberattacks which are largely to the destruction and disruption of Information networks and computers. These types of attacks do not cause massive destruction, however kinetic cyberattacks where physical\n\n²⁰ Naseer, Dr Rizwan, and Dr Musarat Amin. \"Cyber-threats to strategic networks: Challenges for Pakistan’s security.\" *South Asian Studies* 33, no. 1 (2020).",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 9,
            "markdown": "Conceptualising Cyber Deterrence and Policy Options for Pakistan\n\ndamage is usually followed by a cyberattack can lead to escalation. In such cases, the right to self-defence, individually or collectively, can be invoked under Article 51 of the UN Charter.²¹\n\nIt is in this spirit that the G7 foreign ministers met in Sicily, Italy, which led to the G7 “Declaration on Responsible States Behaviour in Cyber Space also called the “Lucca Declaration” in May 2017. The Lucca Declaration acknowledged that cyberattacks can amount to the use of force or be considered an armed attack. The G7 had two main objectives: the first was building confidence-building measures (CBMs), which are instrumental in building trust. These measures included cyber communication lines, establishing contact points, and other such measures. Secondly, there were voluntary norms that acted as non-binding principles that would serve as a code of conduct in cyberspace. The declaration hopes that the trust established through CBMs will transform into voluntary norms that will be ratified as part of national law and eventually into an international convention that will moderate harmful cyber behaviour.²²\n\nThe Lucca Declaration has provided a framework that should be followed by other states to create a more stable cyberspace for the international community. The declaration has outlined certain essential norms that should be followed. Article 3 outlines that states should not allow their territory to be used for malicious cyber activity or crime. This article is important since it allows the international community to deal with the transnational nature of cyber-crime. Articles 7 and 8 provide legal protection for critical infrastructure (CI) by making it a legal requirement for interstate cooperation when dealing with malicious software. Critical infrastructure is often a vulnerable target for cyberattacks, as such it requires international cooperation to ensure no unnecessary escalation happens. Article 9 aims to limit the proliferation\n\n²¹ Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n\n²² Mariarosaria Taddeo, “Deterrence by Norms to Stop Interstate Cyberattacks,” Minds and Machines 27, no. 3 (September 2017): 387–92, https://doi.org/10.1007/s11023-017-9446-1.\n\n127",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 10,
            "markdown": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n\nof malware in the supply chain by creating a system that verifies the presence of malware. Article 10 encourages states to report cyber vulnerabilities and will reduce the probability of zero-day cyber exploits. Article 12 talks about intellectual rights and addresses the issue of cyber theft. $^{23}$\n\nUnfortunately, the discussion of cyber regulation has become a difficult issue to raise since China, Russia and the West suffer trust deficit towards each other. This is compounded by the fact that the issue of \"attribution\" in the cyber domain is difficult as the \"perpetrator\" often uses identical cyber tools for cyber espionage and cyber infiltration. $^{24}$\n\n## Deterrence by Denial or Punishment\n\nThe distribution of resources between denial and punishment and the effectiveness of these strategies in deterring adversaries vary significantly. Establishing deterrence by denial typically begins with the allocation of financial capital to acquire technical resources and to hire skilled personnel. These resources are essential to continually update, enhance, audit, and manage complex network infrastructures effectively. $^{25}$ Investing in network-based and host-based defences, such as intrusion detection and prevention systems, antivirus software, and other similar technologies, involve a variety of overlapping expenditures. These investments progressively increase the difficulty for adversaries to infiltrate a given network. $^{26}$\n\n$^{23}$Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, last modified May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n\n$^{24}$ Dmitry Stefanovich, “Russia’s Basic Principles and the Cyber-Nuclear Nexus,” European Leadership Network, last modified July 14, 2020, https://europeanleadershipnetwork.org/commentary/russias-basic-principles-and-the-cyber-nuclear-nexus/.\n\n$^{25}$ Cliff Riggs, Network Perimeter Security: Building Defense in-Depth, 1st ed., vol. 1 (Boca Raton, Florida: CRC Press, 2003), 54.\n\n$^{26}$ Axel Buecker, Per Andreas, and Scott Paisley, “Understanding IT Perimeter Security,” IBM, January 1, 2008, https://www.redbooks.ibm.com/redpapers/pdfs/redp4397.pdf.\n\n128",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 11,
            "markdown": "Conceptualising Cyber Deterrence and Policy Options for Pakistan\n\nIn cyberspace, expenditures on security measures are often regularized and considered part of overhead costs, yet they fundamentally serve as deterrents. Investments in tools such as intrusion detection and prevention systems, and antivirus software act as deterrents. These deterrents deter criminals or terrorists alike where the costs of mounting a successful attack are high, and the probability of success is low. Skeptics may argue that such denial mechanisms are unlikely to deter a state actor; however, this perspective is not entirely accurate. Most probing attempts by state actors do not result in successful attacks. For example, the US Department of Defense faces millions of probes each day, yet nearly 99.99% of these are unsuccessful. This high rate of defence effectiveness underlines the value of robust cyber defences in deterring both opportunistic and targeted cyber threats. 27\n\nIn traditional domains such as land, sea, air, and space, deterrence by denial relies heavily on controlling a specific geographical area. However, those responsible for establishing deterrence have limited capacity to alter the domain itself. In contrast, cyberspace offers unique opportunities where virtually every element is subject to manipulation by defenders—from the network structure to the hardware, firmware, and software used, as well as the access granted to both internal and external users. In cyberspace, defenders can shape their environment in ways that traditional domains do not allow. During every phase of an attack, an adversary attempts to operate within or against a defender’s digital space over which they have no control and limited visibility. 28\n\nErica Lonergan highlighted that scholars discuss the cyber vulnerabilities of nuclear command but do not explore the possibility of cyber signaling. With the increased reliance on digital infrastructure, the nuclear command system exposes itself to an increasing number of cyber vulnerabilities. According to the Nuclear Threat Initiative Report (NTI),\n\n27 Travis Howard and José de Arimatéia da Cruz, “The Cyber Vulnerabilities of the US Navy,” The Maritime Executive, January 31, 2017, https://maritime-executive.com/editorials/the-cyber-vulnerability-of-the-us-navy.\n\n28 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n\n129",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 12,
            "markdown": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n\n9 out of 10 nuclear states have some digital components. This makes cyber signaling a viable strategy that states make use of to exploit the cyber vulnerabilities of rival nuclear control systems.\n\n## Cumulative Deterrence\n\nDoron Almog has proposed a sophisticated and suitable approach to understanding the concept of deterrence called “Cumulative Deterrence” and it is applicable to cyber deterrence.²⁹\n\nCumulative deterrence consists of three main components that differentiate it from traditional concepts of deterrence. Firstly, strategic messaging about the “red lines” of the deterring party should be unambiguous. Repeated acts of retaliation are not sufficient to create norms which is essential to the “rules of the game” in the cyber environment. This strategic messaging can be conveyed through formal diplomatic channels and international organisations. Secondly, the response of the state against hostile cyber actors should be varied according to the severity of the situation. For example, a state may retaliate through kinetic, diplomatic, and financial responses which are respective to the severity of the situation. Thirdly, the state must show willingness to demonstrate its capabilities.³⁰\n\nThomas Rid explains how Israel has integrated cumulative deterrence into its response strategy against terrorism and state conflict. Israeli conventional deterrence against non-state actors is achieved through the simultaneous use of threats and military response which spread over an extended conflict. Cumulative deterrence involves short bursts of force to manage the scope of a conflict and delay 'the next round' of violence, which is more appropriate for cyber deterrence. Cumulative deterrence operates at two levels. At a macro level it aims to project an image of overwhelming military superiority, while at the micro level, it\n\n²⁹ Doron Almog, “Cumulative Deterrence and the War on Terrorism,” *The US Army War College Quarterly: Parameters* 34, no. 4 (November 1, 2004): 5–19, https://doi.org/10.55540/0031-1723.2222.\n\n³⁰ Uri Tor, “‘Cumulative Deterrence’ as a New Paradigm for Cyber Deterrence,” *Journal of Strategic Studies* 40, no. 1–2 (December 18, 2017): 92–117, https://doi.org/10.1080/01402390.2015.1115975.\n\n130",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 13,
            "markdown": "Conceptualising Cyber Deterrence and Policy Options for Pakistan\n\ninvolves specific military responses to particular threats or hostile acts. This concept suggests that deterrence must be 'recharged' periodically through a series of victories accumulated over time, which results in more moderate behaviour from the adversary. 31\n\nThe action of retaliation can be divided into three stages, the first stage is ante impetum which means “before the attack”. The cyberattackers gather intelligence during this phase and formulate the operational plan. The second stage is in-impetum which means “during the attack.” This phase marks the execution of the cyber operation and the actual penetration of cyber defenses. The final stage is post impetum which means “after the attack.” In this phase, hostile cyber actors exploit the gains from the cyber operation. 32\n\nFrom a cyber-deterrence perspective, it is important to note that deterrence by denial is only possible during the Ante Impetum and In Impetum stages. This is because the malware has already penetrated the cyber defenses and cyber norms have been violated, which effectively means deterrence failure. Deterrence failure happens when the security mechanisms have failed to deter the enemy from hostile aggression. In such case, cyber retaliation is necessary to establish consequences for unprovoked cyberattacks. This is done so that the threat of punishment wards off any future aggression. It is for this reason that deterrence by punishment or the threat of punishment starts from the Post Impetum stage, where the attribution for the attacks has to be accurate so the correct hostile cyber actor is punished. However, it is important to mention that,\n\n31 Thomas Rid, “Deterrence beyond the State: The Israeli Experience,” Contemporary Security Policy 33, no. 1 (April 1, 2012): 124–47, https://doi.org/10.1080/13523260.2012.659593.\n\n32 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n\n131",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 14,
            "markdown": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n\nunlike traditional retaliation, cyber retaliation is not immediate and requires extended time to fully respond to an intrusion.³³\n\n## Policy Options for Pakistan\n\nThe absence of norms and international laws, such as those outlined in the Lucca Declaration, which focuses on regulating malicious cyber behaviour is particularly concerning in the context of South Asia. As both India and Pakistan are nuclear states, an attack on their critical infrastructure and nuclear infrastructure may cause unnecessary escalation. To avoid such a situation, Pakistan and India need to agree on certain “rules of engagement” when dealing with cyber conflict. To build these cyber norms certain level of trust needs to exist between these two states which can be achieved through confidence building measures. India and Pakistan should create a cyber hotline between Islamabad and New Delhi to operate in parallel with the DGMO hotline. This will allow both state parties to communicate directly regarding issues that threaten the cyber security of both countries. The ability to communicate in times of crisis will create a “strategic space” for both actors to allow room for de-escalation. The establishment of a hotline will also mitigate the importance of non-state actors and their capacity to create unnecessary escalation. In case of any major cyber incident, both Pakistan and India can form a “Joint Probing Committee”. The committee may consist of cyber experts to investigate the incident and provide suggestions to strengthen the cyber security in South Asia. The Joint Probing Committee will allow greater transparency and will allow both nations to cooperate against shared threats. Both states should avoid cyberattacks on critical infrastructure as stated in the Non-Nuclear Aggression Treaty of 1991. This is essential as attacks on critical infrastructure can act as trigger points for both parties as such the sanctity of critical infrastructure should\n\n³³ Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in *10th International Conference on Cyber Conflict CyCon X: Maximising Effects*, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 15,
            "markdown": "Conceptualising Cyber Deterrence and Policy Options for Pakistan\n\nbe reflected in their respective cyber doctrine. 34\n\nPakistan has broadly two main policy options. The first is to adopt a deterrence by denial approach, strengthening physical cyber infrastructure and software. This approach would require strong cyber norms which are outlined in the Lucca declaration. Both India and Pakistan must establish cooperation to ensure unnecessary cyber escalation. The second approach, deterrence by punishment, involves Pakistan adopting a cumulative strategy in which any cyber aggression would be countered with sustained cyber retaliation against hostile cyber actors over an extended period. Both policies have their own merits which must be considered when forming a cyber deterrence policy.\n\nThe most ideal approach seems to be deterrence by denial, as this approach encourages cyber stability and fosters cooperation between states based on a strong normative structure. The disadvantage of this strategy is that the strengthening of cyber defenses is an elusive process. Cyber domain favors cyber offense where aggression costs less than defense. Furthermore, relations between Pakistan and India are currently hostile making cyber deterrence by denial tedious and difficult. Deterrence by punishment by comparison is simpler but unstable and dangerous. While cyberattacks such as web defacements and (Distributed Denial of Services) DDOS attacks have limited escalation capabilities, cyberattacks on critical infrastructure are dangerous as they may provoke a cross-domain response. A cross-domain response entails a retaliation where the state may respond to cyberattacks with kinetic response. According to an article by Martain C. Libicki, a US administrator on the condition of anonymity stated that if US power grid systems are attacked, the US might retaliate with a missile strike. This led to the conclusion that\n\n34 Abdul Moiz Khan, “Cyber Deterrence and Confidence Building between Pakistan and India,” South Asian Voices, March 27, 2023, https://southasianvoices.org/cyber-deterrence-and-confidence-building-between-pakistanandindia/#:~:text=Cyber%20deterrence%20aims%20to%20prevent,course%20of%20dissuading%20an%20adversary.\n\n133",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 16,
            "markdown": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n\nwhile kinetic retaliation to a cyberattack is possible it is not probable with current trends and technology. 35\n\nTo conclude cyber deterrence by denial is ideal for the Ante Impetum and post Impetum as a general approach. In case of deterrence failure Pakistan can adopt a cumulative strategy to retaliate against hostile cyber actors. However, it is important to mention that Pakistan must keep its response within the cyber domain, or else it may trigger a cross-domain escalation following a kinetic response.\n\n35 Martain C Libicki, “International Conference on Cyber Conflict,” in 12th International Conference on Cyber Conflict. 20/20 Vision: The Next Decade., 1st ed., vol. 12 (Tallinn: CCDCOE, 2020), 199–215.\n\n134",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          },
          {
            "index": 17,
            "markdown": "Reproduced with permission of copyright owner. Further reproduction prohibited without permission.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1850,
              "width": 1250
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 18,
          "doc_size_bytes": 340225
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n# Conceptualising Cyber Deterrence and Policy Options for Pakistan\nSyed Ahmed Ali* and Nasir Mehmood*\n## Abstract\nThe research paper attempts to explore and analyse how traditional deterrence concepts would operate in the cyber domain employing a comparative analysis model to compare Cyber deterrence with conventional and nuclear deterrence. Through this analysis, the research found that the cyber domain has an incognito environment with multiple actors that have low costs and high returns, incentivizing hostile cyber actions. This means that traditional concepts of deterrence such as Mutually Assured Destruction are not possible. For this reason, new approaches to cyber deterrence such as cumulative deterrence embody the “Punishment” approach. Cyber norms and cyber hardening represent deterrence through a “denial” approach. The research concludes that the denial approach, while more resource-intensive and requires international cooperation, is a more sustainable way to counter cyber threats. In the case of deterrence failure Pakistan may resort to a cumulative strategy, which may allow Pakistan to retaliate, can also lead to escalation. Pakistan needs to adopt both a denial and punishment approach, but a strong emphasis on cyber security is a priority.\nKey Words: Pakistan, Cyber Deterrence, Nuclear Deterrence, Cyber Threats, Cumulative deterrence.\n* Syed Ahmed Ali has graduated in Strategic Studies from National Defense University, Islamabad.\n* Nasir Mehmood is professor of Strategic Studies at the National Defense University, Islamabad.\n118\nConceptualising Cyber Deterrence and Policy Options for Pakistan\n# Introduction\nSouth Asia is a complex region, marked by political tensions alongside military confrontations between the nuclear-armed states of Pakistan and India. The South Asian strategic stability is realized in the form of nuclear deterrence and is reinforced by a position of mutual vulnerability which acts as a disincentive to alter the status quo through the use of coercion or military force.\nNew technologies create new ways to exercise military power and create new threat vectors that need to be addressed. The evolution of the Internet of Things (IoT) and the reliance on computers to increase the efficiency and effectiveness of modern weaponry has given birth to new cyber threats. These cyber-threats become more dangerous as the states start to adopt IoT solutions and integrate them into their military capabilities. The evolution of threats from the cyber domain has challenged the traditional concepts of deterrence, which must be investigated and understood to conceptualise new ways of deterrence in cyber domain. Hence, the study investigates the impact of cyber threats on nuclear deterrence between Pakistan and India. Additional variables such as differences in doctrine, the evolution in delivery mechanisms and nuclear capability and the role of non-state actors will not be discussed.\n# Evolution of the Deterrence Theory\nTraditionally, deterrence theory refers to the threat of use of overwhelming force (nuclear weapons) by a state to cause unacceptable damage in order to stop another state not to initiate aggression or an undesired act. This concept has seen constant change and evolution due to changes in technology and strategic thinking about these weapons. Robert Jervis has identified three main waves that mark different schools of thought which have evolved regarding the nature and use of nuclear weapons.¹\nThe initial phase of deterrence theory was heavily influenced by the advent of nuclear weapons. Bernard Brodie elaborated this idea in his\n¹ Robert Jervis, “Deterrence Theory Revisited,” *World Politics* 31, no. 2 (January 1, 1979): 289–324, https://doi.org/10.2307/2009945.\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nbook “The Absolute Weapon”, where he argued that the primary purpose of previous military establishments had been to win wars. However, with the introduction of nuclear weapons, the purpose of the military establishment shifted to preventing wars altogether.² Meanwhile, Thomas Schelling developed the game theory model which explored the rational cost and benefit involved in decision making. This model largely rested on rational decision-making in matters related to foreign policy and national security. In his models, Schelling explained that the concept of nuclear deterrence largely rests on rational decision-making and credibility.³\nWhile the first wave saw no space for warfare with the introduction of nuclear weapons, the second wave however was more flexible in this position. Lawrence Freedman summarized the stance of the second wave, stating that total war could be threatened but never fought. First-wave deterrence theorists studied how the use of nuclear weapons could be used as a threat and how such dynamics operated.⁴\nThe third wave represents the antithesis of the second wave, and criticises ideas of rational deterrence by pointing out the failure of rational decision-making. Third-generation deterrence theorists like Irving Janis in their work point out the weaknesses in rational decision-making. It was during this generation that new fields were introduced in nuclear decision making such as behavioural sciences and cognitive psychology.⁵\nThe above account explains how the theory of deterrence has evolved with time and how various strategists have thought about nuclear deterrence. While strategists may differ in how deterrence is viewed, there is consensus in the community that all deterrence strategies must discourage hostile actions. To achieve this effect strategists can use the\n² Bernard Brodie and Frederick Sherwood Dunn, *The Absolute Weapon: Atomic Power and World Order* (Freeport, New York State: Books for Libraries Press, 1972).\n³ Thomas C. Schelling, “Chapter 2: The Art of Commitment,” essay, in *Arms and Influence*, 1st ed., vol. 1 (New Haven, Connecticut: Yale University Press, 1966), 36–40.\n⁴ Freedman, Lawrence. 2004. Deterrence. Cambridge: Polity Press: 21.\n⁵ Irving Janis, *Groupthink: Psychological Studies of Policy Decisions and Fiascoes*, 1st ed., vol. 1 (Boston, Massachusetts: Houghton Mifflin Harcourt, 1982).\nConceptualising Cyber Deterrence and Policy Options for Pakistan\n\"Deterrence by Denial Approach\" or \"Deterrence by Punishment Approach\"⁶. In deterrence by punishment, the state threatens to retaliate with devastating force (nuclear weapons), which will offset the benefit of any military gain. Alexander and Richard explain that in the case of deterrence, the commitment of intent should be clear, the credibility of the threat should be well established and lastly, the threat should be communicated.⁷ In Deterrence by Denial, states try to deny the opponent achievement of its war aims. This means a state would harden itself by building stronger infrastructure and better security systems. For instance, the Strategic Defense Initiative (Star Wars), if successfully built, would have been deterrence by denial. Such measures often fail when they lack the material to deny, the Maginot line is a good example of such failure.⁸\n## Impact of Cyber Threats\nIn traditional deterrence, in case of a nuclear attack on a city, the proportional response would typically involve a counterattack on a city of the adversary. This concept relies on the fact that a city is geographically fixed and immovable, both logically and physically. However, this logic does not apply in cyberspace, where targets and their impacts are not confined to physical locations. With the introduction of the cyber domain, new technical issues have arisen which have complicated the certainty of nuclear deterrence.\nFirstly, the victim state bears the responsibility of proving the identity of the individual responsible for an action. The assessment of potential retaliation and the possibility of preemptive actions hinge on accurate attribution. Engaging in retaliation without substantial evidence\n⁶ Michael Rühle, “Deterrence: What It Can (and Cannot) Do,” NATO Review, April 20, 2015, https://www.nato.int/docu/review/articles/2015/04/20/deterrence-what-it-can-and-cannot-do/index.html.\n⁷ Alexander L. George and Richard Smoke, “Chapter 3 The Normative Use of the Abstract Deterrence Model,” essay, in Deterrence in American Foreign Policy: Theory and Practice, 1st ed., vol. 1 (New York, New York State: Columbia University Press, 1974), 63–64.\n⁸ Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n121\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nincreases the risk of misidentifying the culprit and escalating the situation unnecessarily. Secondly, a state must respond to an incident within a close time frame. If state X lacks detailed intelligence about the target it intends to retaliate against, the process of gathering intelligence and developing a cyber weapon extends the time frame for response. This extension can stretch from days to weeks, months, or even years beyond the original attack prompting retaliation. The possibility of facing consequences for an attack exists but is so temporally distant that it is disregarded as insignificant. 9 Thirdly, effective deterrence through punishment necessitates proportionality. To prevent escalation or breaches of international law, it is crucial to possess comparable assets for retaliation. However, within cyberspace, identifying such assets can be challenging as they are not always readily comparable. 10 Fourthly, a state must possess a tailored cyber weapon system designed for its specific target. If state X notifies state Y of its intention to retaliate against an asset, or if state X repeatedly employs a cyber weapon against state Y's system, the effectiveness of such actions diminishes over time due to the implementation of updated perimeter defenses. These defences may include intrusion detection and prevention systems (IDPS), antivirus programs, or various other security measures. 11\nComplications extend beyond the cyber domain and to the critical infrastructure which is a core focus of cyber security. Several limitations make the protection of critical infrastructure complicated. Firstly is the issue of denial of access which is easier in physical infrastructure than in digital infrastructure. Issues like Backdoor portals, zero-day exploits, and other cyber vulnerabilities make security difficult. Secondly, unlike physical deterrence where attacks against it are known and evident,\n9 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n10 Martin C. Libicki, Cyberspace in Peace and War, Second Edition, 2nd ed. (Annapolis, Maryland: Naval Institute Press, 2021), 262.\n11 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n122\nConceptualising Cyber Deterrence and Policy Options for Pakistan\ndigital deterrence failure is silent, where cyberattacks on critical infrastructure often go unnoticed. A key example of this is the Stuxnet virus where the malware went undetected for 3 years. It was only after the malware destroyed the centrifuges did the Iranians realized the breach in security. Thirdly, states have deep familiarity with military threats which is expressed in deterrence and coercion, for which states have established engagement norms as part of their doctrine. Most physical attacks on infrastructure have clear and recognized red lines that states recognised However, in cyberspace, which is a relatively new domain, the principles of deterrence are still developing. Responses to digital attacks on infrastructure are uncertain due to their rarity and the ambiguous nature of digital red lines, leading to unclear coercive communication. Fourthly, due to the diverse nature of cyberspace, non-state actors are also important actors who may not be driven by rational objectives. Rather these actors are driven by impulsive and ideological reasons which may trigger a security crisis. These actors are motivated by the fact that the cyber domain lacks symmetry where individuals and non-state actor groups have a disproportionate influence on state critical infrastructure's security. 12\n## Conceptualizing Cyber Deterrence\nThe current literature available for nuclear deterrence mostly revolves around traditional concepts of deterrence which cover issues relating to strategic dynamics, new weapon systems, and doctrine. The cyber domain has posed a challenge to conventional principles of deterrence through punishment and deterrence through denial. Both Deterrence by punishment and denial are designed to manipulate the cost and-benefit decision-making calculus of the enemy, where the costs of aggression outweighs any gain made by the enemy. To make any deterrence successful one of the strategies must succeed in deterring enemy aggression. To analyse the impact of the cyber domain on the\n12 Alex Wilner, “Cyber Deterrence and Critical-Infrastructure Protection: Expectation, Application, and Limitation,” Comparative Strategy 36, no. 4 (August 8, 2017): 309–18, https://doi.org/10.1080/01495933.2017.1361202.\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\ntraditional concept of deterrence, it is important to understand how the strategies of “punishment” and “denial” work in a cyberspace environment. Before analyzing the two main deterrence strategies it is important to understand the cyberspace environment. 13\nConstructing a meaningful model of deterrence in cyberspace necessitates an initial exploration of what exactly seeks to deter. This is where the most significant disparity between deterrence in the physical realm and cyberspace arises. Deterrence in the cyber domain differs from traditional deterrence in the physical realm due to the inherent uncertainty of attribution. Cyberattacks, including cyber espionage, cyber sabotage, and cyber control, are inherently covert, making attribution uncertain. As a result, deterrence in the cyber domain is flawed, as it may lead to 'accidental escalation,' where third parties can exploit the anonymity of cyberspace to provoke conflict between two states.14 Additionally, studies conducted by Shawn Lonergan and Erica Borghard suggest a significant propensity for states to utilise proxies to retain plausible deniability. Cyberattackers can utilise Virtual Private Networks (VPNs), proxies, or other methods to conduct attacks while concealing their identity, this makes their attacks repudiable.15\nThe primary difference between deterrence in the physical realm and cyberspace is highlighted in Herbert Lin's article, the direct consequences of a cyberattack may not be immediately recognisable; instead, it's the secondary or tertiary effects that achieve the desired outcome. Classical deterrence methods and customized strategies employed against terrorist groups often struggle to address the disjointed sequences of action and reaction that are prevalent in cyberspace. Furthermore, the time frame for responding to a breach can span weeks,\n13 Alex Wilner, “Cyber Deterrence and Critical-Infrastructure Protection.”\n14 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n15 Erica D. Borghard and Shawn W. Lonergan, “Can States Calculate the Risks of Using Cyber Proxies?,” Orbis 60, no. 3 (July 1, 2016): 395–416, https://doi.org/10.1016/j.orbis.2016.05.009.\n124\nConceptualising Cyber Deterrence and Policy Options for Pakistan\nmonths, or even years due to the complexities of discovery and attribution issues that are not typically encountered in traditional deterrence. 16\nScholars like John Mearsheimer have written in much detail regarding the complex layers of security that envelop deterrence and are subject to the dynamic nature of the evolution of technology.17 The constant evolution of technology has led states to explore the cyber domain to gain new vectors of attack. The evolution of non-nuclear technology has a direct impact on the nuclear deterrence. The increasing sophistication of weaponry is gradually outpacing existing arms control treaties, creating new threats that could destabilise the delicate balance of nuclear deterrence.\nCyber threats to nuclear systems may seem like a remote possibility, particularly in the context of modern weapon systems. However, in June 1998 a group of Indian hackers had access to the computer systems at Bhabha Atomic Research Centre (BARC)18.\nA more worrying example of cyberattacks was on the US nuclear forces in the state of Wyoming. It was reported in 2010 that about 50 nuclear Minuteman missiles located in underground silos lost connection for about an hour with the launching crew had no access. The launching crew did not have access to the central command and the US President who had the authority to launch Minuteman missiles. This effectively means that cyberattacks can decapitate the leadership that has the authority to issue a nuclear retaliation.19\nDr. Beyza Unal, head of the Science, Technology, and International Security Unit at Chatham House UK, highlighted cyber\n16 Derek S. Reveron and Herbert Lin, “Chapter 3 Operational Considerations in Cyberattack and Cyber Exploitation,” essay, in Cyberspace and National Security: Threats, Opportunities, and Power in a Virtual World, 1st ed., vol. 1 (Washington DC, USA: Georgetown University Press, 2012), 37–57.\n17 John J. Mearsheimer, “Chapter 1 Introduction,” essay, in Conventional Deterrence, 1st ed., vol. 1 (Ithaca, New York State: Cornell University Press, 1983), 13–23.\n18 https://www.economist.com/asia/2019/11/01/a-cyber-attack-on-an-indian-nuclear-plant-raises-worrying-questions\n19 Bruce G. Blair, “Why Our Nuclear Weapons Can Be Hacked,” The New York Times, March 14, 2017, https://www.nytimes.com/2017/03/14/opinion/why-our-nuclear-weapons-can-be-hacked.html.\n125\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nthreats to nuclear weapon systems. She warned that hackers could do more than access launch codes; they might disrupt retaliation mechanisms or inject malicious codes during weapon procurement, compromising performance. Hackers favor malware injection over direct system penetration due to antivirus protections. Malwares often infiltrates through risky websites for example gambling, video games, and adult sites, which organisation employees may access, risking virus downloads that could affect security systems.²⁰\nDmitry Stefanovich discusses in his article about the nexus of Cyber and Nuclear threats and cites the example of the Russian state document called the Basic Principles on Nuclear Deterrence where he explains that it is not a war-fighting manual but rather a “broadening” of nuclear-related sections. There is an update to the nuclear weapons policy, where the threats to nuclear weapons are grounds for nuclear retaliation. Paragraph 19C of the Basic Principles document clearly states that attacks against “critical governmental or military site” and “disruption which would undermine nuclear forces” are grounds for nuclear retaliation.\nThis development is not limited to the Russian Federation as the international community is aware of the threat of cyberattacks on the Nuclear Command, Control and Communications (NC3). In US 2018 nuclear posture review “non-nuclear strategic attacks” on US and allied forces” are cited as a major threat to nuclear stability. Likewise, the Chinese have equated cyberattacks to nuclear bombs, UK has discussed the possibility of a cyberattack on the NC3, while France has mentioned the link between nuclear and cyber threats in the documents of the “Paris Call for Trust and Security in Cyberspace.”\nThe failure of cyber deterrence would create a risk for unnecessary escalation and must be avoided. Most cyberattacks are non-kinetic cyberattacks which are largely to the destruction and disruption of Information networks and computers. These types of attacks do not cause massive destruction, however kinetic cyberattacks where physical\n²⁰ Naseer, Dr Rizwan, and Dr Musarat Amin. \"Cyber-threats to strategic networks: Challenges for Pakistan’s security.\" *South Asian Studies* 33, no. 1 (2020).\nConceptualising Cyber Deterrence and Policy Options for Pakistan\ndamage is usually followed by a cyberattack can lead to escalation. In such cases, the right to self-defence, individually or collectively, can be invoked under Article 51 of the UN Charter.²¹\nIt is in this spirit that the G7 foreign ministers met in Sicily, Italy, which led to the G7 “Declaration on Responsible States Behaviour in Cyber Space also called the “Lucca Declaration” in May 2017. The Lucca Declaration acknowledged that cyberattacks can amount to the use of force or be considered an armed attack. The G7 had two main objectives: the first was building confidence-building measures (CBMs), which are instrumental in building trust. These measures included cyber communication lines, establishing contact points, and other such measures. Secondly, there were voluntary norms that acted as non-binding principles that would serve as a code of conduct in cyberspace. The declaration hopes that the trust established through CBMs will transform into voluntary norms that will be ratified as part of national law and eventually into an international convention that will moderate harmful cyber behaviour.²²\nThe Lucca Declaration has provided a framework that should be followed by other states to create a more stable cyberspace for the international community. The declaration has outlined certain essential norms that should be followed. Article 3 outlines that states should not allow their territory to be used for malicious cyber activity or crime. This article is important since it allows the international community to deal with the transnational nature of cyber-crime. Articles 7 and 8 provide legal protection for critical infrastructure (CI) by making it a legal requirement for interstate cooperation when dealing with malicious software. Critical infrastructure is often a vulnerable target for cyberattacks, as such it requires international cooperation to ensure no unnecessary escalation happens. Article 9 aims to limit the proliferation\n²¹ Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n²² Mariarosaria Taddeo, “Deterrence by Norms to Stop Interstate Cyberattacks,” Minds and Machines 27, no. 3 (September 2017): 387–92, https://doi.org/10.1007/s11023-017-9446-1.\n127\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nof malware in the supply chain by creating a system that verifies the presence of malware. Article 10 encourages states to report cyber vulnerabilities and will reduce the probability of zero-day cyber exploits. Article 12 talks about intellectual rights and addresses the issue of cyber theft. $^{23}$\nUnfortunately, the discussion of cyber regulation has become a difficult issue to raise since China, Russia and the West suffer trust deficit towards each other. This is compounded by the fact that the issue of \"attribution\" in the cyber domain is difficult as the \"perpetrator\" often uses identical cyber tools for cyber espionage and cyber infiltration. $^{24}$\n## Deterrence by Denial or Punishment\nThe distribution of resources between denial and punishment and the effectiveness of these strategies in deterring adversaries vary significantly. Establishing deterrence by denial typically begins with the allocation of financial capital to acquire technical resources and to hire skilled personnel. These resources are essential to continually update, enhance, audit, and manage complex network infrastructures effectively. $^{25}$ Investing in network-based and host-based defences, such as intrusion detection and prevention systems, antivirus software, and other similar technologies, involve a variety of overlapping expenditures. These investments progressively increase the difficulty for adversaries to infiltrate a given network. $^{26}$\n$^{23}$Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, last modified May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n$^{24}$ Dmitry Stefanovich, “Russia’s Basic Principles and the Cyber-Nuclear Nexus,” European Leadership Network, last modified July 14, 2020, https://europeanleadershipnetwork.org/commentary/russias-basic-principles-and-the-cyber-nuclear-nexus/.\n$^{25}$ Cliff Riggs, Network Perimeter Security: Building Defense in-Depth, 1st ed., vol. 1 (Boca Raton, Florida: CRC Press, 2003), 54.\n$^{26}$ Axel Buecker, Per Andreas, and Scott Paisley, “Understanding IT Perimeter Security,” IBM, January 1, 2008, https://www.redbooks.ibm.com/redpapers/pdfs/redp4397.pdf.\n128\nConceptualising Cyber Deterrence and Policy Options for Pakistan\nIn cyberspace, expenditures on security measures are often regularized and considered part of overhead costs, yet they fundamentally serve as deterrents. Investments in tools such as intrusion detection and prevention systems, and antivirus software act as deterrents. These deterrents deter criminals or terrorists alike where the costs of mounting a successful attack are high, and the probability of success is low. Skeptics may argue that such denial mechanisms are unlikely to deter a state actor; however, this perspective is not entirely accurate. Most probing attempts by state actors do not result in successful attacks. For example, the US Department of Defense faces millions of probes each day, yet nearly 99.99% of these are unsuccessful. This high rate of defence effectiveness underlines the value of robust cyber defences in deterring both opportunistic and targeted cyber threats. 27\nIn traditional domains such as land, sea, air, and space, deterrence by denial relies heavily on controlling a specific geographical area. However, those responsible for establishing deterrence have limited capacity to alter the domain itself. In contrast, cyberspace offers unique opportunities where virtually every element is subject to manipulation by defenders—from the network structure to the hardware, firmware, and software used, as well as the access granted to both internal and external users. In cyberspace, defenders can shape their environment in ways that traditional domains do not allow. During every phase of an attack, an adversary attempts to operate within or against a defender’s digital space over which they have no control and limited visibility. 28\nErica Lonergan highlighted that scholars discuss the cyber vulnerabilities of nuclear command but do not explore the possibility of cyber signaling. With the increased reliance on digital infrastructure, the nuclear command system exposes itself to an increasing number of cyber vulnerabilities. According to the Nuclear Threat Initiative Report (NTI),\n27 Travis Howard and José de Arimatéia da Cruz, “The Cyber Vulnerabilities of the US Navy,” The Maritime Executive, January 31, 2017, https://maritime-executive.com/editorials/the-cyber-vulnerability-of-the-us-navy.\n28 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n129\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n9 out of 10 nuclear states have some digital components. This makes cyber signaling a viable strategy that states make use of to exploit the cyber vulnerabilities of rival nuclear control systems.\n## Cumulative Deterrence\nDoron Almog has proposed a sophisticated and suitable approach to understanding the concept of deterrence called “Cumulative Deterrence” and it is applicable to cyber deterrence.²⁹\nCumulative deterrence consists of three main components that differentiate it from traditional concepts of deterrence. Firstly, strategic messaging about the “red lines” of the deterring party should be unambiguous. Repeated acts of retaliation are not sufficient to create norms which is essential to the “rules of the game” in the cyber environment. This strategic messaging can be conveyed through formal diplomatic channels and international organisations. Secondly, the response of the state against hostile cyber actors should be varied according to the severity of the situation. For example, a state may retaliate through kinetic, diplomatic, and financial responses which are respective to the severity of the situation. Thirdly, the state must show willingness to demonstrate its capabilities.³⁰\nThomas Rid explains how Israel has integrated cumulative deterrence into its response strategy against terrorism and state conflict. Israeli conventional deterrence against non-state actors is achieved through the simultaneous use of threats and military response which spread over an extended conflict. Cumulative deterrence involves short bursts of force to manage the scope of a conflict and delay 'the next round' of violence, which is more appropriate for cyber deterrence. Cumulative deterrence operates at two levels. At a macro level it aims to project an image of overwhelming military superiority, while at the micro level, it\n²⁹ Doron Almog, “Cumulative Deterrence and the War on Terrorism,” *The US Army War College Quarterly: Parameters* 34, no. 4 (November 1, 2004): 5–19, https://doi.org/10.55540/0031-1723.2222.\n³⁰ Uri Tor, “‘Cumulative Deterrence’ as a New Paradigm for Cyber Deterrence,” *Journal of Strategic Studies* 40, no. 1–2 (December 18, 2017): 92–117, https://doi.org/10.1080/01402390.2015.1115975.\n130\nConceptualising Cyber Deterrence and Policy Options for Pakistan\ninvolves specific military responses to particular threats or hostile acts. This concept suggests that deterrence must be 'recharged' periodically through a series of victories accumulated over time, which results in more moderate behaviour from the adversary. 31\nThe action of retaliation can be divided into three stages, the first stage is ante impetum which means “before the attack”. The cyberattackers gather intelligence during this phase and formulate the operational plan. The second stage is in-impetum which means “during the attack.” This phase marks the execution of the cyber operation and the actual penetration of cyber defenses. The final stage is post impetum which means “after the attack.” In this phase, hostile cyber actors exploit the gains from the cyber operation. 32\nFrom a cyber-deterrence perspective, it is important to note that deterrence by denial is only possible during the Ante Impetum and In Impetum stages. This is because the malware has already penetrated the cyber defenses and cyber norms have been violated, which effectively means deterrence failure. Deterrence failure happens when the security mechanisms have failed to deter the enemy from hostile aggression. In such case, cyber retaliation is necessary to establish consequences for unprovoked cyberattacks. This is done so that the threat of punishment wards off any future aggression. It is for this reason that deterrence by punishment or the threat of punishment starts from the Post Impetum stage, where the attribution for the attacks has to be accurate so the correct hostile cyber actor is punished. However, it is important to mention that,\n31 Thomas Rid, “Deterrence beyond the State: The Israeli Experience,” Contemporary Security Policy 33, no. 1 (April 1, 2012): 124–47, https://doi.org/10.1080/13523260.2012.659593.\n32 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n131\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nunlike traditional retaliation, cyber retaliation is not immediate and requires extended time to fully respond to an intrusion.³³\n## Policy Options for Pakistan\nThe absence of norms and international laws, such as those outlined in the Lucca Declaration, which focuses on regulating malicious cyber behaviour is particularly concerning in the context of South Asia. As both India and Pakistan are nuclear states, an attack on their critical infrastructure and nuclear infrastructure may cause unnecessary escalation. To avoid such a situation, Pakistan and India need to agree on certain “rules of engagement” when dealing with cyber conflict. To build these cyber norms certain level of trust needs to exist between these two states which can be achieved through confidence building measures. India and Pakistan should create a cyber hotline between Islamabad and New Delhi to operate in parallel with the DGMO hotline. This will allow both state parties to communicate directly regarding issues that threaten the cyber security of both countries. The ability to communicate in times of crisis will create a “strategic space” for both actors to allow room for de-escalation. The establishment of a hotline will also mitigate the importance of non-state actors and their capacity to create unnecessary escalation. In case of any major cyber incident, both Pakistan and India can form a “Joint Probing Committee”. The committee may consist of cyber experts to investigate the incident and provide suggestions to strengthen the cyber security in South Asia. The Joint Probing Committee will allow greater transparency and will allow both nations to cooperate against shared threats. Both states should avoid cyberattacks on critical infrastructure as stated in the Non-Nuclear Aggression Treaty of 1991. This is essential as attacks on critical infrastructure can act as trigger points for both parties as such the sanctity of critical infrastructure should\n³³ Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in *10th International Conference on Cyber Conflict CyCon X: Maximising Effects*, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\nConceptualising Cyber Deterrence and Policy Options for Pakistan\nbe reflected in their respective cyber doctrine. 34\nPakistan has broadly two main policy options. The first is to adopt a deterrence by denial approach, strengthening physical cyber infrastructure and software. This approach would require strong cyber norms which are outlined in the Lucca declaration. Both India and Pakistan must establish cooperation to ensure unnecessary cyber escalation. The second approach, deterrence by punishment, involves Pakistan adopting a cumulative strategy in which any cyber aggression would be countered with sustained cyber retaliation against hostile cyber actors over an extended period. Both policies have their own merits which must be considered when forming a cyber deterrence policy.\nThe most ideal approach seems to be deterrence by denial, as this approach encourages cyber stability and fosters cooperation between states based on a strong normative structure. The disadvantage of this strategy is that the strengthening of cyber defenses is an elusive process. Cyber domain favors cyber offense where aggression costs less than defense. Furthermore, relations between Pakistan and India are currently hostile making cyber deterrence by denial tedious and difficult. Deterrence by punishment by comparison is simpler but unstable and dangerous. While cyberattacks such as web defacements and (Distributed Denial of Services) DDOS attacks have limited escalation capabilities, cyberattacks on critical infrastructure are dangerous as they may provoke a cross-domain response. A cross-domain response entails a retaliation where the state may respond to cyberattacks with kinetic response. According to an article by Martain C. Libicki, a US administrator on the condition of anonymity stated that if US power grid systems are attacked, the US might retaliate with a missile strike. This led to the conclusion that\n34 Abdul Moiz Khan, “Cyber Deterrence and Confidence Building between Pakistan and India,” South Asian Voices, March 27, 2023, https://southasianvoices.org/cyber-deterrence-and-confidence-building-between-pakistanandindia/#:~:text=Cyber%20deterrence%20aims%20to%20prevent,course%20of%20dissuading%20an%20adversary.\n133\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nwhile kinetic retaliation to a cyberattack is possible it is not probable with current trends and technology. 35\nTo conclude cyber deterrence by denial is ideal for the Ante Impetum and post Impetum as a general approach. In case of deterrence failure Pakistan can adopt a cumulative strategy to retaliate against hostile cyber actors. However, it is important to mention that Pakistan must keep its response within the cyber domain, or else it may trigger a cross-domain escalation following a kinetic response.\n35 Martain C Libicki, “International Conference on Cyber Conflict,” in 12th International Conference on Cyber Conflict. 20/20 Vision: The Next Decade., 1st ed., vol. 12 (Tallinn: CCDCOE, 2020), 199–215.\n134\nReproduced with permission of copyright owner. Further reproduction prohibited without permission.",
  "references": [],
  "flat_text": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n# Conceptualising Cyber Deterrence and Policy Options for Pakistan\nSyed Ahmed Ali* and Nasir Mehmood*\n## Abstract\nThe research paper attempts to explore and analyse how traditional deterrence concepts would operate in the cyber domain employing a comparative analysis model to compare Cyber deterrence with conventional and nuclear deterrence. Through this analysis, the research found that the cyber domain has an incognito environment with multiple actors that have low costs and high returns, incentivizing hostile cyber actions. This means that traditional concepts of deterrence such as Mutually Assured Destruction are not possible. For this reason, new approaches to cyber deterrence such as cumulative deterrence embody the “Punishment” approach. Cyber norms and cyber hardening represent deterrence through a “denial” approach. The research concludes that the denial approach, while more resource-intensive and requires international cooperation, is a more sustainable way to counter cyber threats. In the case of deterrence failure Pakistan may resort to a cumulative strategy, which may allow Pakistan to retaliate, can also lead to escalation. Pakistan needs to adopt both a denial and punishment approach, but a strong emphasis on cyber security is a priority.\nKey Words: Pakistan, Cyber Deterrence, Nuclear Deterrence, Cyber Threats, Cumulative deterrence.\n* Syed Ahmed Ali has graduated in Strategic Studies from National Defense University, Islamabad.\n* Nasir Mehmood is professor of Strategic Studies at the National Defense University, Islamabad.\n\n# Introduction\nSouth Asia is a complex region, marked by political tensions alongside military confrontations between the nuclear-armed states of Pakistan and India. The South Asian strategic stability is realized in the form of nuclear deterrence and is reinforced by a position of mutual vulnerability which acts as a disincentive to alter the status quo through the use of coercion or military force.\nNew technologies create new ways to exercise military power and create new threat vectors that need to be addressed. The evolution of the Internet of Things (IoT) and the reliance on computers to increase the efficiency and effectiveness of modern weaponry has given birth to new cyber threats. These cyber-threats become more dangerous as the states start to adopt IoT solutions and integrate them into their military capabilities. The evolution of threats from the cyber domain has challenged the traditional concepts of deterrence, which must be investigated and understood to conceptualise new ways of deterrence in cyber domain. Hence, the study investigates the impact of cyber threats on nuclear deterrence between Pakistan and India. Additional variables such as differences in doctrine, the evolution in delivery mechanisms and nuclear capability and the role of non-state actors will not be discussed.\n# Evolution of the Deterrence Theory\nTraditionally, deterrence theory refers to the threat of use of overwhelming force (nuclear weapons) by a state to cause unacceptable damage in order to stop another state not to initiate aggression or an undesired act. This concept has seen constant change and evolution due to changes in technology and strategic thinking about these weapons. Robert Jervis has identified three main waves that mark different schools of thought which have evolved regarding the nature and use of nuclear weapons.\nThe initial phase of deterrence theory was heavily influenced by the advent of nuclear weapons. Bernard Brodie elaborated this idea in his\n Robert Jervis, “Deterrence Theory Revisited,” *World Politics* 31, no. 2 (January 1, 1979): 289–324, https://doi.org/10.2307/2009945.\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nbook “The Absolute Weapon”, where he argued that the primary purpose of previous military establishments had been to win wars. However, with the introduction of nuclear weapons, the purpose of the military establishment shifted to preventing wars altogether. Meanwhile, Thomas Schelling developed the game theory model which explored the rational cost and benefit involved in decision making. This model largely rested on rational decision-making in matters related to foreign policy and national security. In his models, Schelling explained that the concept of nuclear deterrence largely rests on rational decision-making and credibility.\nWhile the first wave saw no space for warfare with the introduction of nuclear weapons, the second wave however was more flexible in this position. Lawrence Freedman summarized the stance of the second wave, stating that total war could be threatened but never fought. First-wave deterrence theorists studied how the use of nuclear weapons could be used as a threat and how such dynamics operated.\nThe third wave represents the antithesis of the second wave, and criticises ideas of rational deterrence by pointing out the failure of rational decision-making. Third-generation deterrence theorists like Irving Janis in their work point out the weaknesses in rational decision-making. It was during this generation that new fields were introduced in nuclear decision making such as behavioural sciences and cognitive psychology.\nThe above account explains how the theory of deterrence has evolved with time and how various strategists have thought about nuclear deterrence. While strategists may differ in how deterrence is viewed, there is consensus in the community that all deterrence strategies must discourage hostile actions. To achieve this effect strategists can use the\n Bernard Brodie and Frederick Sherwood Dunn, *The Absolute Weapon: Atomic Power and World Order* (Freeport, New York State: Books for Libraries Press, 1972).\n Thomas C. Schelling, “Chapter 2: The Art of Commitment,” essay, in *Arms and Influence*, 1st ed., vol. 1 (New Haven, Connecticut: Yale University Press, 1966), 36–40.\n Freedman, Lawrence. 2004. Deterrence. Cambridge: Polity Press: 21.\n Irving Janis, *Groupthink: Psychological Studies of Policy Decisions and Fiascoes*, 1st ed., vol. 1 (Boston, Massachusetts: Houghton Mifflin Harcourt, 1982).\nConceptualising Cyber Deterrence and Policy Options for Pakistan\n\"Deterrence by Denial Approach\" or \"Deterrence by Punishment Approach\". In deterrence by punishment, the state threatens to retaliate with devastating force (nuclear weapons), which will offset the benefit of any military gain. Alexander and Richard explain that in the case of deterrence, the commitment of intent should be clear, the credibility of the threat should be well established and lastly, the threat should be communicated. In Deterrence by Denial, states try to deny the opponent achievement of its war aims. This means a state would harden itself by building stronger infrastructure and better security systems. For instance, the Strategic Defense Initiative (Star Wars), if successfully built, would have been deterrence by denial. Such measures often fail when they lack the material to deny, the Maginot line is a good example of such failure.\n## Impact of Cyber Threats\nIn traditional deterrence, in case of a nuclear attack on a city, the proportional response would typically involve a counterattack on a city of the adversary. This concept relies on the fact that a city is geographically fixed and immovable, both logically and physically. However, this logic does not apply in cyberspace, where targets and their impacts are not confined to physical locations. With the introduction of the cyber domain, new technical issues have arisen which have complicated the certainty of nuclear deterrence.\nFirstly, the victim state bears the responsibility of proving the identity of the individual responsible for an action. The assessment of potential retaliation and the possibility of preemptive actions hinge on accurate attribution. Engaging in retaliation without substantial evidence\n Michael Rühle, “Deterrence: What It Can (and Cannot) Do,” NATO Review, April 20, 2015, https://www.nato.int/docu/review/articles/2015/04/20/deterrence-what-it-can-and-cannot-do/index.html.\n Alexander L. George and Richard Smoke, “Chapter 3 The Normative Use of the Abstract Deterrence Model,” essay, in Deterrence in American Foreign Policy: Theory and Practice, 1st ed., vol. 1 (New York, New York State: Columbia University Press, 1974), 63–64.\n Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n\nSyed Ahmed Ali and Nasir Mehmood\nincreases the risk of misidentifying the culprit and escalating the situation unnecessarily. Secondly, a state must respond to an incident within a close time frame. If state X lacks detailed intelligence about the target it intends to retaliate against, the process of gathering intelligence and developing a cyber weapon extends the time frame for response. This extension can stretch from days to weeks, months, or even years beyond the original attack prompting retaliation. The possibility of facing consequences for an attack exists but is so temporally distant that it is disregarded as insignificant. 9 Thirdly, effective deterrence through punishment necessitates proportionality. To prevent escalation or breaches of international law, it is crucial to possess comparable assets for retaliation. However, within cyberspace, identifying such assets can be challenging as they are not always readily comparable. 10 Fourthly, a state must possess a tailored cyber weapon system designed for its specific target. If state X notifies state Y of its intention to retaliate against an asset, or if state X repeatedly employs a cyber weapon against state Y's system, the effectiveness of such actions diminishes over time due to the implementation of updated perimeter defenses. These defences may include intrusion detection and prevention systems (IDPS), antivirus programs, or various other security measures. 11\nComplications extend beyond the cyber domain and to the critical infrastructure which is a core focus of cyber security. Several limitations make the protection of critical infrastructure complicated. Firstly is the issue of denial of access which is easier in physical infrastructure than in digital infrastructure. Issues like Backdoor portals, zero-day exploits, and other cyber vulnerabilities make security difficult. Secondly, unlike physical deterrence where attacks against it are known and evident,\n\ndigital deterrence failure is silent, where cyberattacks on critical infrastructure often go unnoticed. A key example of this is the Stuxnet virus where the malware went undetected for 3 years. It was only after the malware destroyed the centrifuges did the Iranians realized the breach in security. Thirdly, states have deep familiarity with military threats which is expressed in deterrence and coercion, for which states have established engagement norms as part of their doctrine. Most physical attacks on infrastructure have clear and recognized red lines that states recognised However, in cyberspace, which is a relatively new domain, the principles of deterrence are still developing. Responses to digital attacks on infrastructure are uncertain due to their rarity and the ambiguous nature of digital red lines, leading to unclear coercive communication. Fourthly, due to the diverse nature of cyberspace, non-state actors are also important actors who may not be driven by rational objectives. Rather these actors are driven by impulsive and ideological reasons which may trigger a security crisis. These actors are motivated by the fact that the cyber domain lacks symmetry where individuals and non-state actor groups have a disproportionate influence on state critical infrastructure's security. 12\n## Conceptualizing Cyber Deterrence\nThe current literature available for nuclear deterrence mostly revolves around traditional concepts of deterrence which cover issues relating to strategic dynamics, new weapon systems, and doctrine. The cyber domain has posed a challenge to conventional principles of deterrence through punishment and deterrence through denial. Both Deterrence by punishment and denial are designed to manipulate the cost and-benefit decision-making calculus of the enemy, where the costs of aggression outweighs any gain made by the enemy. To make any deterrence successful one of the strategies must succeed in deterring enemy aggression. To analyse the impact of the cyber domain on the\n\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\ntraditional concept of deterrence, it is important to understand how the strategies of “punishment” and “denial” work in a cyberspace environment. Before analyzing the two main deterrence strategies it is important to understand the cyberspace environment. 13\nConstructing a meaningful model of deterrence in cyberspace necessitates an initial exploration of what exactly seeks to deter. This is where the most significant disparity between deterrence in the physical realm and cyberspace arises. Deterrence in the cyber domain differs from traditional deterrence in the physical realm due to the inherent uncertainty of attribution. Cyberattacks, including cyber espionage, cyber sabotage, and cyber control, are inherently covert, making attribution uncertain. As a result, deterrence in the cyber domain is flawed, as it may lead to 'accidental escalation,' where third parties can exploit the anonymity of cyberspace to provoke conflict between two states.14 Additionally, studies conducted by Shawn Lonergan and Erica Borghard suggest a significant propensity for states to utilise proxies to retain plausible deniability. Cyberattackers can utilise Virtual Private Networks (VPNs), proxies, or other methods to conduct attacks while concealing their identity, this makes their attacks repudiable.15\nThe primary difference between deterrence in the physical realm and cyberspace is highlighted in Herbert Lin's article, the direct consequences of a cyberattack may not be immediately recognisable; instead, it's the secondary or tertiary effects that achieve the desired outcome. Classical deterrence methods and customized strategies employed against terrorist groups often struggle to address the disjointed sequences of action and reaction that are prevalent in cyberspace. Furthermore, the time frame for responding to a breach can span weeks,\n\nmonths, or even years due to the complexities of discovery and attribution issues that are not typically encountered in traditional deterrence. 16\nScholars like John Mearsheimer have written in much detail regarding the complex layers of security that envelop deterrence and are subject to the dynamic nature of the evolution of technology.17 The constant evolution of technology has led states to explore the cyber domain to gain new vectors of attack. The evolution of non-nuclear technology has a direct impact on the nuclear deterrence. The increasing sophistication of weaponry is gradually outpacing existing arms control treaties, creating new threats that could destabilise the delicate balance of nuclear deterrence.\nCyber threats to nuclear systems may seem like a remote possibility, particularly in the context of modern weapon systems. However, in June 1998 a group of Indian hackers had access to the computer systems at Bhabha Atomic Research Centre (BARC)18.\nA more worrying example of cyberattacks was on the US nuclear forces in the state of Wyoming. It was reported in 2010 that about 50 nuclear Minuteman missiles located in underground silos lost connection for about an hour with the launching crew had no access. The launching crew did not have access to the central command and the US President who had the authority to launch Minuteman missiles. This effectively means that cyberattacks can decapitate the leadership that has the authority to issue a nuclear retaliation.19\nDr. Beyza Unal, head of the Science, Technology, and International Security Unit at Chatham House UK, highlighted cyber\n\nSyed Ahmed Ali and Nasir Mehmood\nthreats to nuclear weapon systems. She warned that hackers could do more than access launch codes; they might disrupt retaliation mechanisms or inject malicious codes during weapon procurement, compromising performance. Hackers favor malware injection over direct system penetration due to antivirus protections. Malwares often infiltrates through risky websites for example gambling, video games, and adult sites, which organisation employees may access, risking virus downloads that could affect security systems.\nDmitry Stefanovich discusses in his article about the nexus of Cyber and Nuclear threats and cites the example of the Russian state document called the Basic Principles on Nuclear Deterrence where he explains that it is not a war-fighting manual but rather a “broadening” of nuclear-related sections. There is an update to the nuclear weapons policy, where the threats to nuclear weapons are grounds for nuclear retaliation. Paragraph 19C of the Basic Principles document clearly states that attacks against “critical governmental or military site” and “disruption which would undermine nuclear forces” are grounds for nuclear retaliation.\nThis development is not limited to the Russian Federation as the international community is aware of the threat of cyberattacks on the Nuclear Command, Control and Communications (NC3). In US 2018 nuclear posture review “non-nuclear strategic attacks” on US and allied forces” are cited as a major threat to nuclear stability. Likewise, the Chinese have equated cyberattacks to nuclear bombs, UK has discussed the possibility of a cyberattack on the NC3, while France has mentioned the link between nuclear and cyber threats in the documents of the “Paris Call for Trust and Security in Cyberspace.”\nThe failure of cyber deterrence would create a risk for unnecessary escalation and must be avoided. Most cyberattacks are non-kinetic cyberattacks which are largely to the destruction and disruption of Information networks and computers. These types of attacks do not cause massive destruction, however kinetic cyberattacks where physical\n Naseer, Dr Rizwan, and Dr Musarat Amin. \"Cyber-threats to strategic networks: Challenges for Pakistan’s security.\" *South Asian Studies* 33, no. 1 (2020).\nConceptualising Cyber Deterrence and Policy Options for Pakistan\ndamage is usually followed by a cyberattack can lead to escalation. In such cases, the right to self-defence, individually or collectively, can be invoked under Article 51 of the UN Charter.\nIt is in this spirit that the G7 foreign ministers met in Sicily, Italy, which led to the G7 “Declaration on Responsible States Behaviour in Cyber Space also called the “Lucca Declaration” in May 2017. The Lucca Declaration acknowledged that cyberattacks can amount to the use of force or be considered an armed attack. The G7 had two main objectives: the first was building confidence-building measures (CBMs), which are instrumental in building trust. These measures included cyber communication lines, establishing contact points, and other such measures. Secondly, there were voluntary norms that acted as non-binding principles that would serve as a code of conduct in cyberspace. The declaration hopes that the trust established through CBMs will transform into voluntary norms that will be ratified as part of national law and eventually into an international convention that will moderate harmful cyber behaviour.\nThe Lucca Declaration has provided a framework that should be followed by other states to create a more stable cyberspace for the international community. The declaration has outlined certain essential norms that should be followed. Article 3 outlines that states should not allow their territory to be used for malicious cyber activity or crime. This article is important since it allows the international community to deal with the transnational nature of cyber-crime. Articles 7 and 8 provide legal protection for critical infrastructure (CI) by making it a legal requirement for interstate cooperation when dealing with malicious software. Critical infrastructure is often a vulnerable target for cyberattacks, as such it requires international cooperation to ensure no unnecessary escalation happens. Article 9 aims to limit the proliferation\n Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n Mariarosaria Taddeo, “Deterrence by Norms to Stop Interstate Cyberattacks,” Minds and Machines 27, no. 3 (September 2017): 387–92, https://doi.org/10.1007/s11023-017-9446-1.\n\nSyed Ahmed Ali and Nasir Mehmood\nof malware in the supply chain by creating a system that verifies the presence of malware. Article 10 encourages states to report cyber vulnerabilities and will reduce the probability of zero-day cyber exploits. Article 12 talks about intellectual rights and addresses the issue of cyber theft. $^{23}$\nUnfortunately, the discussion of cyber regulation has become a difficult issue to raise since China, Russia and the West suffer trust deficit towards each other. This is compounded by the fact that the issue of \"attribution\" in the cyber domain is difficult as the \"perpetrator\" often uses identical cyber tools for cyber espionage and cyber infiltration. $^{24}$\n## Deterrence by Denial or Punishment\nThe distribution of resources between denial and punishment and the effectiveness of these strategies in deterring adversaries vary significantly. Establishing deterrence by denial typically begins with the allocation of financial capital to acquire technical resources and to hire skilled personnel. These resources are essential to continually update, enhance, audit, and manage complex network infrastructures effectively. $^{25}$ Investing in network-based and host-based defences, such as intrusion detection and prevention systems, antivirus software, and other similar technologies, involve a variety of overlapping expenditures. These investments progressively increase the difficulty for adversaries to infiltrate a given network. $^{26}$\n$^{23}$Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, last modified May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n$^{24}$ Dmitry Stefanovich, “Russia’s Basic Principles and the Cyber-Nuclear Nexus,” European Leadership Network, last modified July 14, 2020, https://europeanleadershipnetwork.org/commentary/russias-basic-principles-and-the-cyber-nuclear-nexus/.\n$^{25}$ Cliff Riggs, Network Perimeter Security: Building Defense in-Depth, 1st ed., vol. 1 (Boca Raton, Florida: CRC Press, 2003), 54.\n$^{26}$ Axel Buecker, Per Andreas, and Scott Paisley, “Understanding IT Perimeter Security,” IBM, January 1, 2008, https://www.redbooks.ibm.com/redpapers/pdfs/redp4397.pdf.\n\nIn cyberspace, expenditures on security measures are often regularized and considered part of overhead costs, yet they fundamentally serve as deterrents. Investments in tools such as intrusion detection and prevention systems, and antivirus software act as deterrents. These deterrents deter criminals or terrorists alike where the costs of mounting a successful attack are high, and the probability of success is low. Skeptics may argue that such denial mechanisms are unlikely to deter a state actor; however, this perspective is not entirely accurate. Most probing attempts by state actors do not result in successful attacks. For example, the US Department of Defense faces millions of probes each day, yet nearly 99.99% of these are unsuccessful. This high rate of defence effectiveness underlines the value of robust cyber defences in deterring both opportunistic and targeted cyber threats. 27\nIn traditional domains such as land, sea, air, and space, deterrence by denial relies heavily on controlling a specific geographical area. However, those responsible for establishing deterrence have limited capacity to alter the domain itself. In contrast, cyberspace offers unique opportunities where virtually every element is subject to manipulation by defenders—from the network structure to the hardware, firmware, and software used, as well as the access granted to both internal and external users. In cyberspace, defenders can shape their environment in ways that traditional domains do not allow. During every phase of an attack, an adversary attempts to operate within or against a defender’s digital space over which they have no control and limited visibility. 28\nErica Lonergan highlighted that scholars discuss the cyber vulnerabilities of nuclear command but do not explore the possibility of cyber signaling. With the increased reliance on digital infrastructure, the nuclear command system exposes itself to an increasing number of cyber vulnerabilities. According to the Nuclear Threat Initiative Report (NTI),\n\nSyed Ahmed Ali and Nasir Mehmood\n\n## Cumulative Deterrence\nDoron Almog has proposed a sophisticated and suitable approach to understanding the concept of deterrence called “Cumulative Deterrence” and it is applicable to cyber deterrence.\nCumulative deterrence consists of three main components that differentiate it from traditional concepts of deterrence. Firstly, strategic messaging about the “red lines” of the deterring party should be unambiguous. Repeated acts of retaliation are not sufficient to create norms which is essential to the “rules of the game” in the cyber environment. This strategic messaging can be conveyed through formal diplomatic channels and international organisations. Secondly, the response of the state against hostile cyber actors should be varied according to the severity of the situation. For example, a state may retaliate through kinetic, diplomatic, and financial responses which are respective to the severity of the situation. Thirdly, the state must show willingness to demonstrate its capabilities.\nThomas Rid explains how Israel has integrated cumulative deterrence into its response strategy against terrorism and state conflict. Israeli conventional deterrence against non-state actors is achieved through the simultaneous use of threats and military response which spread over an extended conflict. Cumulative deterrence involves short bursts of force to manage the scope of a conflict and delay 'the next round' of violence, which is more appropriate for cyber deterrence. Cumulative deterrence operates at two levels. At a macro level it aims to project an image of overwhelming military superiority, while at the micro level, it\n Doron Almog, “Cumulative Deterrence and the War on Terrorism,” *The US Army War College Quarterly: Parameters* 34, no. 4 (November 1, 2004): 5–19, https://doi.org/10.55540/0031-1723.2222.\n Uri Tor, “‘Cumulative Deterrence’ as a New Paradigm for Cyber Deterrence,” *Journal of Strategic Studies* 40, no. 1–2 (December 18, 2017): 92–117, https://doi.org/10.1080/01402390.2015.1115975.\n\ninvolves specific military responses to particular threats or hostile acts. This concept suggests that deterrence must be 'recharged' periodically through a series of victories accumulated over time, which results in more moderate behaviour from the adversary. 31\nThe action of retaliation can be divided into three stages, the first stage is ante impetum which means “before the attack”. The cyberattackers gather intelligence during this phase and formulate the operational plan. The second stage is in-impetum which means “during the attack.” This phase marks the execution of the cyber operation and the actual penetration of cyber defenses. The final stage is post impetum which means “after the attack.” In this phase, hostile cyber actors exploit the gains from the cyber operation. 32\nFrom a cyber-deterrence perspective, it is important to note that deterrence by denial is only possible during the Ante Impetum and In Impetum stages. This is because the malware has already penetrated the cyber defenses and cyber norms have been violated, which effectively means deterrence failure. Deterrence failure happens when the security mechanisms have failed to deter the enemy from hostile aggression. In such case, cyber retaliation is necessary to establish consequences for unprovoked cyberattacks. This is done so that the threat of punishment wards off any future aggression. It is for this reason that deterrence by punishment or the threat of punishment starts from the Post Impetum stage, where the attribution for the attacks has to be accurate so the correct hostile cyber actor is punished. However, it is important to mention that,\n\nSyed Ahmed Ali and Nasir Mehmood\nunlike traditional retaliation, cyber retaliation is not immediate and requires extended time to fully respond to an intrusion.\n## Policy Options for Pakistan\nThe absence of norms and international laws, such as those outlined in the Lucca Declaration, which focuses on regulating malicious cyber behaviour is particularly concerning in the context of South Asia. As both India and Pakistan are nuclear states, an attack on their critical infrastructure and nuclear infrastructure may cause unnecessary escalation. To avoid such a situation, Pakistan and India need to agree on certain “rules of engagement” when dealing with cyber conflict. To build these cyber norms certain level of trust needs to exist between these two states which can be achieved through confidence building measures. India and Pakistan should create a cyber hotline between Islamabad and New Delhi to operate in parallel with the DGMO hotline. This will allow both state parties to communicate directly regarding issues that threaten the cyber security of both countries. The ability to communicate in times of crisis will create a “strategic space” for both actors to allow room for de-escalation. The establishment of a hotline will also mitigate the importance of non-state actors and their capacity to create unnecessary escalation. In case of any major cyber incident, both Pakistan and India can form a “Joint Probing Committee”. The committee may consist of cyber experts to investigate the incident and provide suggestions to strengthen the cyber security in South Asia. The Joint Probing Committee will allow greater transparency and will allow both nations to cooperate against shared threats. Both states should avoid cyberattacks on critical infrastructure as stated in the Non-Nuclear Aggression Treaty of 1991. This is essential as attacks on critical infrastructure can act as trigger points for both parties as such the sanctity of critical infrastructure should\n Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in *10th International Conference on Cyber Conflict CyCon X: Maximising Effects*, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\nConceptualising Cyber Deterrence and Policy Options for Pakistan\nbe reflected in their respective cyber doctrine. 34\nPakistan has broadly two main policy options. The first is to adopt a deterrence by denial approach, strengthening physical cyber infrastructure and software. This approach would require strong cyber norms which are outlined in the Lucca declaration. Both India and Pakistan must establish cooperation to ensure unnecessary cyber escalation. The second approach, deterrence by punishment, involves Pakistan adopting a cumulative strategy in which any cyber aggression would be countered with sustained cyber retaliation against hostile cyber actors over an extended period. Both policies have their own merits which must be considered when forming a cyber deterrence policy.\nThe most ideal approach seems to be deterrence by denial, as this approach encourages cyber stability and fosters cooperation between states based on a strong normative structure. The disadvantage of this strategy is that the strengthening of cyber defenses is an elusive process. Cyber domain favors cyber offense where aggression costs less than defense. Furthermore, relations between Pakistan and India are currently hostile making cyber deterrence by denial tedious and difficult. Deterrence by punishment by comparison is simpler but unstable and dangerous. While cyberattacks such as web defacements and (Distributed Denial of Services) DDOS attacks have limited escalation capabilities, cyberattacks on critical infrastructure are dangerous as they may provoke a cross-domain response. A cross-domain response entails a retaliation where the state may respond to cyberattacks with kinetic response. According to an article by Martain C. Libicki, a US administrator on the condition of anonymity stated that if US power grid systems are attacked, the US might retaliate with a missile strike. This led to the conclusion that\n\nSyed Ahmed Ali and Nasir Mehmood\nwhile kinetic retaliation to a cyberattack is possible it is not probable with current trends and technology. 35\nTo conclude cyber deterrence by denial is ideal for the Ante Impetum and post Impetum as a general approach. In case of deterrence failure Pakistan can adopt a cumulative strategy to retaliate against hostile cyber actors. However, it is important to mention that Pakistan must keep its response within the cyber domain, or else it may trigger a cross-domain escalation following a kinetic response.",
  "citations": {
    "style": "superscript",
    "flat_text": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n# Conceptualising Cyber Deterrence and Policy Options for Pakistan\nSyed Ahmed Ali* and Nasir Mehmood*\n## Abstract\nThe research paper attempts to explore and analyse how traditional deterrence concepts would operate in the cyber domain employing a comparative analysis model to compare Cyber deterrence with conventional and nuclear deterrence. Through this analysis, the research found that the cyber domain has an incognito environment with multiple actors that have low costs and high returns, incentivizing hostile cyber actions. This means that traditional concepts of deterrence such as Mutually Assured Destruction are not possible. For this reason, new approaches to cyber deterrence such as cumulative deterrence embody the “Punishment” approach. Cyber norms and cyber hardening represent deterrence through a “denial” approach. The research concludes that the denial approach, while more resource-intensive and requires international cooperation, is a more sustainable way to counter cyber threats. In the case of deterrence failure Pakistan may resort to a cumulative strategy, which may allow Pakistan to retaliate, can also lead to escalation. Pakistan needs to adopt both a denial and punishment approach, but a strong emphasis on cyber security is a priority.\nKey Words: Pakistan, Cyber Deterrence, Nuclear Deterrence, Cyber Threats, Cumulative deterrence.\n* Syed Ahmed Ali has graduated in Strategic Studies from National Defense University, Islamabad.\n* Nasir Mehmood is professor of Strategic Studies at the National Defense University, Islamabad.\n\n# Introduction\nSouth Asia is a complex region, marked by political tensions alongside military confrontations between the nuclear-armed states of Pakistan and India. The South Asian strategic stability is realized in the form of nuclear deterrence and is reinforced by a position of mutual vulnerability which acts as a disincentive to alter the status quo through the use of coercion or military force.\nNew technologies create new ways to exercise military power and create new threat vectors that need to be addressed. The evolution of the Internet of Things (IoT) and the reliance on computers to increase the efficiency and effectiveness of modern weaponry has given birth to new cyber threats. These cyber-threats become more dangerous as the states start to adopt IoT solutions and integrate them into their military capabilities. The evolution of threats from the cyber domain has challenged the traditional concepts of deterrence, which must be investigated and understood to conceptualise new ways of deterrence in cyber domain. Hence, the study investigates the impact of cyber threats on nuclear deterrence between Pakistan and India. Additional variables such as differences in doctrine, the evolution in delivery mechanisms and nuclear capability and the role of non-state actors will not be discussed.\n# Evolution of the Deterrence Theory\nTraditionally, deterrence theory refers to the threat of use of overwhelming force (nuclear weapons) by a state to cause unacceptable damage in order to stop another state not to initiate aggression or an undesired act. This concept has seen constant change and evolution due to changes in technology and strategic thinking about these weapons. Robert Jervis has identified three main waves that mark different schools of thought which have evolved regarding the nature and use of nuclear weapons.\nThe initial phase of deterrence theory was heavily influenced by the advent of nuclear weapons. Bernard Brodie elaborated this idea in his\n Robert Jervis, “Deterrence Theory Revisited,” *World Politics* 31, no. 2 (January 1, 1979): 289–324, https://doi.org/10.2307/2009945.\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nbook “The Absolute Weapon”, where he argued that the primary purpose of previous military establishments had been to win wars. However, with the introduction of nuclear weapons, the purpose of the military establishment shifted to preventing wars altogether. Meanwhile, Thomas Schelling developed the game theory model which explored the rational cost and benefit involved in decision making. This model largely rested on rational decision-making in matters related to foreign policy and national security. In his models, Schelling explained that the concept of nuclear deterrence largely rests on rational decision-making and credibility.\nWhile the first wave saw no space for warfare with the introduction of nuclear weapons, the second wave however was more flexible in this position. Lawrence Freedman summarized the stance of the second wave, stating that total war could be threatened but never fought. First-wave deterrence theorists studied how the use of nuclear weapons could be used as a threat and how such dynamics operated.\nThe third wave represents the antithesis of the second wave, and criticises ideas of rational deterrence by pointing out the failure of rational decision-making. Third-generation deterrence theorists like Irving Janis in their work point out the weaknesses in rational decision-making. It was during this generation that new fields were introduced in nuclear decision making such as behavioural sciences and cognitive psychology.\nThe above account explains how the theory of deterrence has evolved with time and how various strategists have thought about nuclear deterrence. While strategists may differ in how deterrence is viewed, there is consensus in the community that all deterrence strategies must discourage hostile actions. To achieve this effect strategists can use the\n Bernard Brodie and Frederick Sherwood Dunn, *The Absolute Weapon: Atomic Power and World Order* (Freeport, New York State: Books for Libraries Press, 1972).\n Thomas C. Schelling, “Chapter 2: The Art of Commitment,” essay, in *Arms and Influence*, 1st ed., vol. 1 (New Haven, Connecticut: Yale University Press, 1966), 36–40.\n Freedman, Lawrence. 2004. Deterrence. Cambridge: Polity Press: 21.\n Irving Janis, *Groupthink: Psychological Studies of Policy Decisions and Fiascoes*, 1st ed., vol. 1 (Boston, Massachusetts: Houghton Mifflin Harcourt, 1982).\nConceptualising Cyber Deterrence and Policy Options for Pakistan\n\"Deterrence by Denial Approach\" or \"Deterrence by Punishment Approach\". In deterrence by punishment, the state threatens to retaliate with devastating force (nuclear weapons), which will offset the benefit of any military gain. Alexander and Richard explain that in the case of deterrence, the commitment of intent should be clear, the credibility of the threat should be well established and lastly, the threat should be communicated. In Deterrence by Denial, states try to deny the opponent achievement of its war aims. This means a state would harden itself by building stronger infrastructure and better security systems. For instance, the Strategic Defense Initiative (Star Wars), if successfully built, would have been deterrence by denial. Such measures often fail when they lack the material to deny, the Maginot line is a good example of such failure.\n## Impact of Cyber Threats\nIn traditional deterrence, in case of a nuclear attack on a city, the proportional response would typically involve a counterattack on a city of the adversary. This concept relies on the fact that a city is geographically fixed and immovable, both logically and physically. However, this logic does not apply in cyberspace, where targets and their impacts are not confined to physical locations. With the introduction of the cyber domain, new technical issues have arisen which have complicated the certainty of nuclear deterrence.\nFirstly, the victim state bears the responsibility of proving the identity of the individual responsible for an action. The assessment of potential retaliation and the possibility of preemptive actions hinge on accurate attribution. Engaging in retaliation without substantial evidence\n Michael Rühle, “Deterrence: What It Can (and Cannot) Do,” NATO Review, April 20, 2015, https://www.nato.int/docu/review/articles/2015/04/20/deterrence-what-it-can-and-cannot-do/index.html.\n Alexander L. George and Richard Smoke, “Chapter 3 The Normative Use of the Abstract Deterrence Model,” essay, in Deterrence in American Foreign Policy: Theory and Practice, 1st ed., vol. 1 (New York, New York State: Columbia University Press, 1974), 63–64.\n Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n\nSyed Ahmed Ali and Nasir Mehmood\nincreases the risk of misidentifying the culprit and escalating the situation unnecessarily. Secondly, a state must respond to an incident within a close time frame. If state X lacks detailed intelligence about the target it intends to retaliate against, the process of gathering intelligence and developing a cyber weapon extends the time frame for response. This extension can stretch from days to weeks, months, or even years beyond the original attack prompting retaliation. The possibility of facing consequences for an attack exists but is so temporally distant that it is disregarded as insignificant. 9 Thirdly, effective deterrence through punishment necessitates proportionality. To prevent escalation or breaches of international law, it is crucial to possess comparable assets for retaliation. However, within cyberspace, identifying such assets can be challenging as they are not always readily comparable. 10 Fourthly, a state must possess a tailored cyber weapon system designed for its specific target. If state X notifies state Y of its intention to retaliate against an asset, or if state X repeatedly employs a cyber weapon against state Y's system, the effectiveness of such actions diminishes over time due to the implementation of updated perimeter defenses. These defences may include intrusion detection and prevention systems (IDPS), antivirus programs, or various other security measures. 11\nComplications extend beyond the cyber domain and to the critical infrastructure which is a core focus of cyber security. Several limitations make the protection of critical infrastructure complicated. Firstly is the issue of denial of access which is easier in physical infrastructure than in digital infrastructure. Issues like Backdoor portals, zero-day exploits, and other cyber vulnerabilities make security difficult. Secondly, unlike physical deterrence where attacks against it are known and evident,\n\ndigital deterrence failure is silent, where cyberattacks on critical infrastructure often go unnoticed. A key example of this is the Stuxnet virus where the malware went undetected for 3 years. It was only after the malware destroyed the centrifuges did the Iranians realized the breach in security. Thirdly, states have deep familiarity with military threats which is expressed in deterrence and coercion, for which states have established engagement norms as part of their doctrine. Most physical attacks on infrastructure have clear and recognized red lines that states recognised However, in cyberspace, which is a relatively new domain, the principles of deterrence are still developing. Responses to digital attacks on infrastructure are uncertain due to their rarity and the ambiguous nature of digital red lines, leading to unclear coercive communication. Fourthly, due to the diverse nature of cyberspace, non-state actors are also important actors who may not be driven by rational objectives. Rather these actors are driven by impulsive and ideological reasons which may trigger a security crisis. These actors are motivated by the fact that the cyber domain lacks symmetry where individuals and non-state actor groups have a disproportionate influence on state critical infrastructure's security. 12\n## Conceptualizing Cyber Deterrence\nThe current literature available for nuclear deterrence mostly revolves around traditional concepts of deterrence which cover issues relating to strategic dynamics, new weapon systems, and doctrine. The cyber domain has posed a challenge to conventional principles of deterrence through punishment and deterrence through denial. Both Deterrence by punishment and denial are designed to manipulate the cost and-benefit decision-making calculus of the enemy, where the costs of aggression outweighs any gain made by the enemy. To make any deterrence successful one of the strategies must succeed in deterring enemy aggression. To analyse the impact of the cyber domain on the\n\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\ntraditional concept of deterrence, it is important to understand how the strategies of “punishment” and “denial” work in a cyberspace environment. Before analyzing the two main deterrence strategies it is important to understand the cyberspace environment. 13\nConstructing a meaningful model of deterrence in cyberspace necessitates an initial exploration of what exactly seeks to deter. This is where the most significant disparity between deterrence in the physical realm and cyberspace arises. Deterrence in the cyber domain differs from traditional deterrence in the physical realm due to the inherent uncertainty of attribution. Cyberattacks, including cyber espionage, cyber sabotage, and cyber control, are inherently covert, making attribution uncertain. As a result, deterrence in the cyber domain is flawed, as it may lead to 'accidental escalation,' where third parties can exploit the anonymity of cyberspace to provoke conflict between two states.14 Additionally, studies conducted by Shawn Lonergan and Erica Borghard suggest a significant propensity for states to utilise proxies to retain plausible deniability. Cyberattackers can utilise Virtual Private Networks (VPNs), proxies, or other methods to conduct attacks while concealing their identity, this makes their attacks repudiable.15\nThe primary difference between deterrence in the physical realm and cyberspace is highlighted in Herbert Lin's article, the direct consequences of a cyberattack may not be immediately recognisable; instead, it's the secondary or tertiary effects that achieve the desired outcome. Classical deterrence methods and customized strategies employed against terrorist groups often struggle to address the disjointed sequences of action and reaction that are prevalent in cyberspace. Furthermore, the time frame for responding to a breach can span weeks,\n\nmonths, or even years due to the complexities of discovery and attribution issues that are not typically encountered in traditional deterrence. 16\nScholars like John Mearsheimer have written in much detail regarding the complex layers of security that envelop deterrence and are subject to the dynamic nature of the evolution of technology.17 The constant evolution of technology has led states to explore the cyber domain to gain new vectors of attack. The evolution of non-nuclear technology has a direct impact on the nuclear deterrence. The increasing sophistication of weaponry is gradually outpacing existing arms control treaties, creating new threats that could destabilise the delicate balance of nuclear deterrence.\nCyber threats to nuclear systems may seem like a remote possibility, particularly in the context of modern weapon systems. However, in June 1998 a group of Indian hackers had access to the computer systems at Bhabha Atomic Research Centre (BARC)18.\nA more worrying example of cyberattacks was on the US nuclear forces in the state of Wyoming. It was reported in 2010 that about 50 nuclear Minuteman missiles located in underground silos lost connection for about an hour with the launching crew had no access. The launching crew did not have access to the central command and the US President who had the authority to launch Minuteman missiles. This effectively means that cyberattacks can decapitate the leadership that has the authority to issue a nuclear retaliation.19\nDr. Beyza Unal, head of the Science, Technology, and International Security Unit at Chatham House UK, highlighted cyber\n\nSyed Ahmed Ali and Nasir Mehmood\nthreats to nuclear weapon systems. She warned that hackers could do more than access launch codes; they might disrupt retaliation mechanisms or inject malicious codes during weapon procurement, compromising performance. Hackers favor malware injection over direct system penetration due to antivirus protections. Malwares often infiltrates through risky websites for example gambling, video games, and adult sites, which organisation employees may access, risking virus downloads that could affect security systems.\nDmitry Stefanovich discusses in his article about the nexus of Cyber and Nuclear threats and cites the example of the Russian state document called the Basic Principles on Nuclear Deterrence where he explains that it is not a war-fighting manual but rather a “broadening” of nuclear-related sections. There is an update to the nuclear weapons policy, where the threats to nuclear weapons are grounds for nuclear retaliation. Paragraph 19C of the Basic Principles document clearly states that attacks against “critical governmental or military site” and “disruption which would undermine nuclear forces” are grounds for nuclear retaliation.\nThis development is not limited to the Russian Federation as the international community is aware of the threat of cyberattacks on the Nuclear Command, Control and Communications (NC3). In US 2018 nuclear posture review “non-nuclear strategic attacks” on US and allied forces” are cited as a major threat to nuclear stability. Likewise, the Chinese have equated cyberattacks to nuclear bombs, UK has discussed the possibility of a cyberattack on the NC3, while France has mentioned the link between nuclear and cyber threats in the documents of the “Paris Call for Trust and Security in Cyberspace.”\nThe failure of cyber deterrence would create a risk for unnecessary escalation and must be avoided. Most cyberattacks are non-kinetic cyberattacks which are largely to the destruction and disruption of Information networks and computers. These types of attacks do not cause massive destruction, however kinetic cyberattacks where physical\n Naseer, Dr Rizwan, and Dr Musarat Amin. \"Cyber-threats to strategic networks: Challenges for Pakistan’s security.\" *South Asian Studies* 33, no. 1 (2020).\nConceptualising Cyber Deterrence and Policy Options for Pakistan\ndamage is usually followed by a cyberattack can lead to escalation. In such cases, the right to self-defence, individually or collectively, can be invoked under Article 51 of the UN Charter.\nIt is in this spirit that the G7 foreign ministers met in Sicily, Italy, which led to the G7 “Declaration on Responsible States Behaviour in Cyber Space also called the “Lucca Declaration” in May 2017. The Lucca Declaration acknowledged that cyberattacks can amount to the use of force or be considered an armed attack. The G7 had two main objectives: the first was building confidence-building measures (CBMs), which are instrumental in building trust. These measures included cyber communication lines, establishing contact points, and other such measures. Secondly, there were voluntary norms that acted as non-binding principles that would serve as a code of conduct in cyberspace. The declaration hopes that the trust established through CBMs will transform into voluntary norms that will be ratified as part of national law and eventually into an international convention that will moderate harmful cyber behaviour.\nThe Lucca Declaration has provided a framework that should be followed by other states to create a more stable cyberspace for the international community. The declaration has outlined certain essential norms that should be followed. Article 3 outlines that states should not allow their territory to be used for malicious cyber activity or crime. This article is important since it allows the international community to deal with the transnational nature of cyber-crime. Articles 7 and 8 provide legal protection for critical infrastructure (CI) by making it a legal requirement for interstate cooperation when dealing with malicious software. Critical infrastructure is often a vulnerable target for cyberattacks, as such it requires international cooperation to ensure no unnecessary escalation happens. Article 9 aims to limit the proliferation\n Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n Mariarosaria Taddeo, “Deterrence by Norms to Stop Interstate Cyberattacks,” Minds and Machines 27, no. 3 (September 2017): 387–92, https://doi.org/10.1007/s11023-017-9446-1.\n\nSyed Ahmed Ali and Nasir Mehmood\nof malware in the supply chain by creating a system that verifies the presence of malware. Article 10 encourages states to report cyber vulnerabilities and will reduce the probability of zero-day cyber exploits. Article 12 talks about intellectual rights and addresses the issue of cyber theft. $^{23}$\nUnfortunately, the discussion of cyber regulation has become a difficult issue to raise since China, Russia and the West suffer trust deficit towards each other. This is compounded by the fact that the issue of \"attribution\" in the cyber domain is difficult as the \"perpetrator\" often uses identical cyber tools for cyber espionage and cyber infiltration. $^{24}$\n## Deterrence by Denial or Punishment\nThe distribution of resources between denial and punishment and the effectiveness of these strategies in deterring adversaries vary significantly. Establishing deterrence by denial typically begins with the allocation of financial capital to acquire technical resources and to hire skilled personnel. These resources are essential to continually update, enhance, audit, and manage complex network infrastructures effectively. $^{25}$ Investing in network-based and host-based defences, such as intrusion detection and prevention systems, antivirus software, and other similar technologies, involve a variety of overlapping expenditures. These investments progressively increase the difficulty for adversaries to infiltrate a given network. $^{26}$\n$^{23}$Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, last modified May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n$^{24}$ Dmitry Stefanovich, “Russia’s Basic Principles and the Cyber-Nuclear Nexus,” European Leadership Network, last modified July 14, 2020, https://europeanleadershipnetwork.org/commentary/russias-basic-principles-and-the-cyber-nuclear-nexus/.\n$^{25}$ Cliff Riggs, Network Perimeter Security: Building Defense in-Depth, 1st ed., vol. 1 (Boca Raton, Florida: CRC Press, 2003), 54.\n$^{26}$ Axel Buecker, Per Andreas, and Scott Paisley, “Understanding IT Perimeter Security,” IBM, January 1, 2008, https://www.redbooks.ibm.com/redpapers/pdfs/redp4397.pdf.\n\nIn cyberspace, expenditures on security measures are often regularized and considered part of overhead costs, yet they fundamentally serve as deterrents. Investments in tools such as intrusion detection and prevention systems, and antivirus software act as deterrents. These deterrents deter criminals or terrorists alike where the costs of mounting a successful attack are high, and the probability of success is low. Skeptics may argue that such denial mechanisms are unlikely to deter a state actor; however, this perspective is not entirely accurate. Most probing attempts by state actors do not result in successful attacks. For example, the US Department of Defense faces millions of probes each day, yet nearly 99.99% of these are unsuccessful. This high rate of defence effectiveness underlines the value of robust cyber defences in deterring both opportunistic and targeted cyber threats. 27\nIn traditional domains such as land, sea, air, and space, deterrence by denial relies heavily on controlling a specific geographical area. However, those responsible for establishing deterrence have limited capacity to alter the domain itself. In contrast, cyberspace offers unique opportunities where virtually every element is subject to manipulation by defenders—from the network structure to the hardware, firmware, and software used, as well as the access granted to both internal and external users. In cyberspace, defenders can shape their environment in ways that traditional domains do not allow. During every phase of an attack, an adversary attempts to operate within or against a defender’s digital space over which they have no control and limited visibility. 28\nErica Lonergan highlighted that scholars discuss the cyber vulnerabilities of nuclear command but do not explore the possibility of cyber signaling. With the increased reliance on digital infrastructure, the nuclear command system exposes itself to an increasing number of cyber vulnerabilities. According to the Nuclear Threat Initiative Report (NTI),\n\nSyed Ahmed Ali and Nasir Mehmood\n\n## Cumulative Deterrence\nDoron Almog has proposed a sophisticated and suitable approach to understanding the concept of deterrence called “Cumulative Deterrence” and it is applicable to cyber deterrence.\nCumulative deterrence consists of three main components that differentiate it from traditional concepts of deterrence. Firstly, strategic messaging about the “red lines” of the deterring party should be unambiguous. Repeated acts of retaliation are not sufficient to create norms which is essential to the “rules of the game” in the cyber environment. This strategic messaging can be conveyed through formal diplomatic channels and international organisations. Secondly, the response of the state against hostile cyber actors should be varied according to the severity of the situation. For example, a state may retaliate through kinetic, diplomatic, and financial responses which are respective to the severity of the situation. Thirdly, the state must show willingness to demonstrate its capabilities.\nThomas Rid explains how Israel has integrated cumulative deterrence into its response strategy against terrorism and state conflict. Israeli conventional deterrence against non-state actors is achieved through the simultaneous use of threats and military response which spread over an extended conflict. Cumulative deterrence involves short bursts of force to manage the scope of a conflict and delay 'the next round' of violence, which is more appropriate for cyber deterrence. Cumulative deterrence operates at two levels. At a macro level it aims to project an image of overwhelming military superiority, while at the micro level, it\n Doron Almog, “Cumulative Deterrence and the War on Terrorism,” *The US Army War College Quarterly: Parameters* 34, no. 4 (November 1, 2004): 5–19, https://doi.org/10.55540/0031-1723.2222.\n Uri Tor, “‘Cumulative Deterrence’ as a New Paradigm for Cyber Deterrence,” *Journal of Strategic Studies* 40, no. 1–2 (December 18, 2017): 92–117, https://doi.org/10.1080/01402390.2015.1115975.\n\ninvolves specific military responses to particular threats or hostile acts. This concept suggests that deterrence must be 'recharged' periodically through a series of victories accumulated over time, which results in more moderate behaviour from the adversary. 31\nThe action of retaliation can be divided into three stages, the first stage is ante impetum which means “before the attack”. The cyberattackers gather intelligence during this phase and formulate the operational plan. The second stage is in-impetum which means “during the attack.” This phase marks the execution of the cyber operation and the actual penetration of cyber defenses. The final stage is post impetum which means “after the attack.” In this phase, hostile cyber actors exploit the gains from the cyber operation. 32\nFrom a cyber-deterrence perspective, it is important to note that deterrence by denial is only possible during the Ante Impetum and In Impetum stages. This is because the malware has already penetrated the cyber defenses and cyber norms have been violated, which effectively means deterrence failure. Deterrence failure happens when the security mechanisms have failed to deter the enemy from hostile aggression. In such case, cyber retaliation is necessary to establish consequences for unprovoked cyberattacks. This is done so that the threat of punishment wards off any future aggression. It is for this reason that deterrence by punishment or the threat of punishment starts from the Post Impetum stage, where the attribution for the attacks has to be accurate so the correct hostile cyber actor is punished. However, it is important to mention that,\n\nSyed Ahmed Ali and Nasir Mehmood\nunlike traditional retaliation, cyber retaliation is not immediate and requires extended time to fully respond to an intrusion.\n## Policy Options for Pakistan\nThe absence of norms and international laws, such as those outlined in the Lucca Declaration, which focuses on regulating malicious cyber behaviour is particularly concerning in the context of South Asia. As both India and Pakistan are nuclear states, an attack on their critical infrastructure and nuclear infrastructure may cause unnecessary escalation. To avoid such a situation, Pakistan and India need to agree on certain “rules of engagement” when dealing with cyber conflict. To build these cyber norms certain level of trust needs to exist between these two states which can be achieved through confidence building measures. India and Pakistan should create a cyber hotline between Islamabad and New Delhi to operate in parallel with the DGMO hotline. This will allow both state parties to communicate directly regarding issues that threaten the cyber security of both countries. The ability to communicate in times of crisis will create a “strategic space” for both actors to allow room for de-escalation. The establishment of a hotline will also mitigate the importance of non-state actors and their capacity to create unnecessary escalation. In case of any major cyber incident, both Pakistan and India can form a “Joint Probing Committee”. The committee may consist of cyber experts to investigate the incident and provide suggestions to strengthen the cyber security in South Asia. The Joint Probing Committee will allow greater transparency and will allow both nations to cooperate against shared threats. Both states should avoid cyberattacks on critical infrastructure as stated in the Non-Nuclear Aggression Treaty of 1991. This is essential as attacks on critical infrastructure can act as trigger points for both parties as such the sanctity of critical infrastructure should\n Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in *10th International Conference on Cyber Conflict CyCon X: Maximising Effects*, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\nConceptualising Cyber Deterrence and Policy Options for Pakistan\nbe reflected in their respective cyber doctrine. 34\nPakistan has broadly two main policy options. The first is to adopt a deterrence by denial approach, strengthening physical cyber infrastructure and software. This approach would require strong cyber norms which are outlined in the Lucca declaration. Both India and Pakistan must establish cooperation to ensure unnecessary cyber escalation. The second approach, deterrence by punishment, involves Pakistan adopting a cumulative strategy in which any cyber aggression would be countered with sustained cyber retaliation against hostile cyber actors over an extended period. Both policies have their own merits which must be considered when forming a cyber deterrence policy.\nThe most ideal approach seems to be deterrence by denial, as this approach encourages cyber stability and fosters cooperation between states based on a strong normative structure. The disadvantage of this strategy is that the strengthening of cyber defenses is an elusive process. Cyber domain favors cyber offense where aggression costs less than defense. Furthermore, relations between Pakistan and India are currently hostile making cyber deterrence by denial tedious and difficult. Deterrence by punishment by comparison is simpler but unstable and dangerous. While cyberattacks such as web defacements and (Distributed Denial of Services) DDOS attacks have limited escalation capabilities, cyberattacks on critical infrastructure are dangerous as they may provoke a cross-domain response. A cross-domain response entails a retaliation where the state may respond to cyberattacks with kinetic response. According to an article by Martain C. Libicki, a US administrator on the condition of anonymity stated that if US power grid systems are attacked, the US might retaliate with a missile strike. This led to the conclusion that\n\nSyed Ahmed Ali and Nasir Mehmood\nwhile kinetic retaliation to a cyberattack is possible it is not probable with current trends and technology. 35\nTo conclude cyber deterrence by denial is ideal for the Ante Impetum and post Impetum as a general approach. In case of deterrence failure Pakistan can adopt a cumulative strategy to retaliate against hostile cyber actors. However, it is important to mention that Pakistan must keep its response within the cyber domain, or else it may trigger a cross-domain escalation following a kinetic response.",
    "footnotes": {
      "items": {},
      "intext": [
        {
          "index": "23",
          "intext_citation": "$^{23}$",
          "preceding_text": "",
          "footnote": null
        },
        {
          "index": "24",
          "intext_citation": "$^{24}$",
          "preceding_text": "",
          "footnote": null
        },
        {
          "index": "25",
          "intext_citation": "$^{25}$",
          "preceding_text": "",
          "footnote": null
        },
        {
          "index": "26",
          "intext_citation": "$^{26}$",
          "preceding_text": "",
          "footnote": null
        },
        {
          "index": "23",
          "intext_citation": "$^{23}$",
          "preceding_text": "$^{26}$",
          "footnote": null
        },
        {
          "index": "24",
          "intext_citation": "$^{24}$",
          "preceding_text": "",
          "footnote": null
        },
        {
          "index": "25",
          "intext_citation": "$^{25}$",
          "preceding_text": "",
          "footnote": null
        },
        {
          "index": "26",
          "intext_citation": "$^{26}$",
          "preceding_text": "",
          "footnote": null
        }
      ],
      "stats": {
        "intext_total": 8,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 22,
        "missing_intext_indices": [
          1,
          2,
          3,
          4,
          5,
          6,
          7,
          8,
          9,
          10,
          11,
          12,
          13,
          14,
          15,
          16,
          17,
          18,
          19,
          20,
          21,
          22
        ],
        "highest_intext_index": 26,
        "missing_footnotes_for_seen_total": 4,
        "missing_footnotes_for_seen_intext": [
          23,
          24,
          25,
          26
        ],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 28,
        "success_occurrences": 28,
        "success_unique": 14,
        "bib_unique_total": 43,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.32558139534883723,
        "success_percentage": 100.0,
        "style": "superscript"
      },
      "results": [
        {
          "index": 1,
          "intext_citation": "¹",
          "preceding_text": "",
          "footnote": "Robert Jervis, “Deterrence Theory Revisited,” *World Politics* 31, no. 2 (January 1, 1979): 289–324, https://doi.org/10.2307/2009945.",
          "position": 3536
        },
        {
          "index": 1,
          "intext_citation": "¹",
          "preceding_text": "e elaborated this idea in his\n",
          "footnote": "Robert Jervis, “Deterrence Theory Revisited,” *World Politics* 31, no. 2 (January 1, 1979): 289–324, https://doi.org/10.2307/2009945.",
          "position": 3677
        },
        {
          "index": 2,
          "intext_citation": "²",
          "preceding_text": "",
          "footnote": "Bernard Brodie and Frederick Sherwood Dunn, *The Absolute Weapon: Atomic Power and World Order* (Freeport, New York State: Books for Libraries Press, 1972).",
          "position": 4123
        },
        {
          "index": 3,
          "intext_citation": "³",
          "preceding_text": "",
          "footnote": "Thomas C. Schelling, “Chapter 2: The Art of Commitment,” essay, in *Arms and Influence*, 1st ed., vol. 1 (New Haven, Connecticut: Yale University Press, 1966), 36–40.",
          "position": 4505
        },
        {
          "index": 4,
          "intext_citation": "⁴",
          "preceding_text": "",
          "footnote": "Freedman, Lawrence. 2004. Deterrence. Cambridge: Polity Press: 21.",
          "position": 4904
        },
        {
          "index": 5,
          "intext_citation": "⁵",
          "preceding_text": "",
          "footnote": "Irving Janis, *Groupthink: Psychological Studies of Policy Decisions and Fiascoes*, 1st ed., vol. 1 (Boston, Massachusetts: Houghton Mifflin Harcourt, 1982).",
          "position": 5335
        },
        {
          "index": 2,
          "intext_citation": "²",
          "preceding_text": "ffect strategists can use the\n",
          "footnote": "Bernard Brodie and Frederick Sherwood Dunn, *The Absolute Weapon: Atomic Power and World Order* (Freeport, New York State: Books for Libraries Press, 1972).",
          "position": 5687
        },
        {
          "index": 3,
          "intext_citation": "³",
          "preceding_text": "",
          "footnote": "Thomas C. Schelling, “Chapter 2: The Art of Commitment,” essay, in *Arms and Influence*, 1st ed., vol. 1 (New Haven, Connecticut: Yale University Press, 1966), 36–40.",
          "position": 5846
        },
        {
          "index": 4,
          "intext_citation": "⁴",
          "preceding_text": "",
          "footnote": "Freedman, Lawrence. 2004. Deterrence. Cambridge: Polity Press: 21.",
          "position": 6015
        },
        {
          "index": 5,
          "intext_citation": "⁵",
          "preceding_text": "",
          "footnote": "Irving Janis, *Groupthink: Psychological Studies of Policy Decisions and Fiascoes*, 1st ed., vol. 1 (Boston, Massachusetts: Houghton Mifflin Harcourt, 1982).",
          "position": 6084
        },
        {
          "index": 6,
          "intext_citation": "⁶",
          "preceding_text": "rrence by Punishment Approach\"",
          "footnote": "Michael Rühle, “Deterrence: What It Can (and Cannot) Do,” NATO Review, April 20, 2015, https://www.nato.int/docu/review/articles/2015/04/20/deterrence-what-it-can-and-cannot-do/index.html.",
          "position": 6379
        },
        {
          "index": 7,
          "intext_citation": "⁷",
          "preceding_text": "",
          "footnote": "Alexander L. George and Richard Smoke, “Chapter 3 The Normative Use of the Abstract Deterrence Model,” essay, in Deterrence in American Foreign Policy: Theory and Practice, 1st ed., vol. 1 (New York, New York State: Columbia University Press, 1974), 63–64.",
          "position": 6745
        },
        {
          "index": 8,
          "intext_citation": "⁸",
          "preceding_text": "",
          "footnote": "Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.",
          "position": 7171
        },
        {
          "index": 6,
          "intext_citation": "⁶",
          "preceding_text": " without substantial evidence\n",
          "footnote": "Michael Rühle, “Deterrence: What It Can (and Cannot) Do,” NATO Review, April 20, 2015, https://www.nato.int/docu/review/articles/2015/04/20/deterrence-what-it-can-and-cannot-do/index.html.",
          "position": 8018
        },
        {
          "index": 7,
          "intext_citation": "⁷",
          "preceding_text": "",
          "footnote": "Alexander L. George and Richard Smoke, “Chapter 3 The Normative Use of the Abstract Deterrence Model,” essay, in Deterrence in American Foreign Policy: Theory and Practice, 1st ed., vol. 1 (New York, New York State: Columbia University Press, 1974), 63–64.",
          "position": 8209
        },
        {
          "index": 8,
          "intext_citation": "⁸",
          "preceding_text": "",
          "footnote": "Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.",
          "position": 8468
        },
        {
          "index": 20,
          "intext_citation": "²⁰",
          "preceding_text": "",
          "footnote": "Naseer, Dr Rizwan, and Dr Musarat Amin. \"Cyber-threats to strategic networks: Challenges for Pakistan’s security.\" *South Asian Studies* 33, no. 1 (2020).",
          "position": 18842
        },
        {
          "index": 20,
          "intext_citation": "²⁰",
          "preceding_text": "c cyberattacks where physical\n",
          "footnote": "Naseer, Dr Rizwan, and Dr Musarat Amin. \"Cyber-threats to strategic networks: Challenges for Pakistan’s security.\" *South Asian Studies* 33, no. 1 (2020).",
          "position": 20424
        },
        {
          "index": 21,
          "intext_citation": "²¹",
          "preceding_text": "",
          "footnote": "Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.",
          "position": 20837
        },
        {
          "index": 22,
          "intext_citation": "²²",
          "preceding_text": "",
          "footnote": "Mariarosaria Taddeo, “Deterrence by Norms to Stop Interstate Cyberattacks,” Minds and Machines 27, no. 3 (September 2017): 387–92, https://doi.org/10.1007/s11023-017-9446-1.",
          "position": 21761
        },
        {
          "index": 21,
          "intext_citation": "²¹",
          "preceding_text": "ms to limit the proliferation\n",
          "footnote": "Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.",
          "position": 22612
        },
        {
          "index": 22,
          "intext_citation": "²²",
          "preceding_text": "",
          "footnote": "Mariarosaria Taddeo, “Deterrence by Norms to Stop Interstate Cyberattacks,” Minds and Machines 27, no. 3 (September 2017): 387–92, https://doi.org/10.1007/s11023-017-9446-1.",
          "position": 22823
        },
        {
          "index": 29,
          "intext_citation": "²⁹",
          "preceding_text": "",
          "footnote": "Doron Almog, “Cumulative Deterrence and the War on Terrorism,” *The US Army War College Quarterly: Parameters* 34, no. 4 (November 1, 2004): 5–19, https://doi.org/10.55540/0031-1723.2222.",
          "position": 28257
        },
        {
          "index": 30,
          "intext_citation": "³⁰",
          "preceding_text": "",
          "footnote": "Uri Tor, “‘Cumulative Deterrence’ as a New Paradigm for Cyber Deterrence,” *Journal of Strategic Studies* 40, no. 1–2 (December 18, 2017): 92–117, https://doi.org/10.1080/01402390.2015.1115975.",
          "position": 29063
        },
        {
          "index": 29,
          "intext_citation": "²⁹",
          "preceding_text": " while at the micro level, it\n",
          "footnote": "Doron Almog, “Cumulative Deterrence and the War on Terrorism,” *The US Army War College Quarterly: Parameters* 34, no. 4 (November 1, 2004): 5–19, https://doi.org/10.55540/0031-1723.2222.",
          "position": 29703
        },
        {
          "index": 30,
          "intext_citation": "³⁰",
          "preceding_text": "",
          "footnote": "Uri Tor, “‘Cumulative Deterrence’ as a New Paradigm for Cyber Deterrence,” *Journal of Strategic Studies* 40, no. 1–2 (December 18, 2017): 92–117, https://doi.org/10.1080/01402390.2015.1115975.",
          "position": 29894
        },
        {
          "index": 33,
          "intext_citation": "³³",
          "preceding_text": "",
          "footnote": "Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in *10th International Conference on Cyber Conflict CyCon X: Maximising Effects*, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.",
          "position": 32363
        },
        {
          "index": 33,
          "intext_citation": "³³",
          "preceding_text": "ritical infrastructure should\n",
          "footnote": "Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in *10th International Conference on Cyber Conflict CyCon X: Maximising Effects*, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.",
          "position": 34192
        }
      ],
      "flat_text": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n# Conceptualising Cyber Deterrence and Policy Options for Pakistan\nSyed Ahmed Ali* and Nasir Mehmood*\n## Abstract\nThe research paper attempts to explore and analyse how traditional deterrence concepts would operate in the cyber domain employing a comparative analysis model to compare Cyber deterrence with conventional and nuclear deterrence. Through this analysis, the research found that the cyber domain has an incognito environment with multiple actors that have low costs and high returns, incentivizing hostile cyber actions. This means that traditional concepts of deterrence such as Mutually Assured Destruction are not possible. For this reason, new approaches to cyber deterrence such as cumulative deterrence embody the “Punishment” approach. Cyber norms and cyber hardening represent deterrence through a “denial” approach. The research concludes that the denial approach, while more resource-intensive and requires international cooperation, is a more sustainable way to counter cyber threats. In the case of deterrence failure Pakistan may resort to a cumulative strategy, which may allow Pakistan to retaliate, can also lead to escalation. Pakistan needs to adopt both a denial and punishment approach, but a strong emphasis on cyber security is a priority.\nKey Words: Pakistan, Cyber Deterrence, Nuclear Deterrence, Cyber Threats, Cumulative deterrence.\n* Syed Ahmed Ali has graduated in Strategic Studies from National Defense University, Islamabad.\n* Nasir Mehmood is professor of Strategic Studies at the National Defense University, Islamabad.\n\n# Introduction\nSouth Asia is a complex region, marked by political tensions alongside military confrontations between the nuclear-armed states of Pakistan and India. The South Asian strategic stability is realized in the form of nuclear deterrence and is reinforced by a position of mutual vulnerability which acts as a disincentive to alter the status quo through the use of coercion or military force.\nNew technologies create new ways to exercise military power and create new threat vectors that need to be addressed. The evolution of the Internet of Things (IoT) and the reliance on computers to increase the efficiency and effectiveness of modern weaponry has given birth to new cyber threats. These cyber-threats become more dangerous as the states start to adopt IoT solutions and integrate them into their military capabilities. The evolution of threats from the cyber domain has challenged the traditional concepts of deterrence, which must be investigated and understood to conceptualise new ways of deterrence in cyber domain. Hence, the study investigates the impact of cyber threats on nuclear deterrence between Pakistan and India. Additional variables such as differences in doctrine, the evolution in delivery mechanisms and nuclear capability and the role of non-state actors will not be discussed.\n# Evolution of the Deterrence Theory\nTraditionally, deterrence theory refers to the threat of use of overwhelming force (nuclear weapons) by a state to cause unacceptable damage in order to stop another state not to initiate aggression or an undesired act. This concept has seen constant change and evolution due to changes in technology and strategic thinking about these weapons. Robert Jervis has identified three main waves that mark different schools of thought which have evolved regarding the nature and use of nuclear weapons.\nThe initial phase of deterrence theory was heavily influenced by the advent of nuclear weapons. Bernard Brodie elaborated this idea in his\n Robert Jervis, “Deterrence Theory Revisited,” *World Politics* 31, no. 2 (January 1, 1979): 289–324, https://doi.org/10.2307/2009945.\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nbook “The Absolute Weapon”, where he argued that the primary purpose of previous military establishments had been to win wars. However, with the introduction of nuclear weapons, the purpose of the military establishment shifted to preventing wars altogether. Meanwhile, Thomas Schelling developed the game theory model which explored the rational cost and benefit involved in decision making. This model largely rested on rational decision-making in matters related to foreign policy and national security. In his models, Schelling explained that the concept of nuclear deterrence largely rests on rational decision-making and credibility.\nWhile the first wave saw no space for warfare with the introduction of nuclear weapons, the second wave however was more flexible in this position. Lawrence Freedman summarized the stance of the second wave, stating that total war could be threatened but never fought. First-wave deterrence theorists studied how the use of nuclear weapons could be used as a threat and how such dynamics operated.\nThe third wave represents the antithesis of the second wave, and criticises ideas of rational deterrence by pointing out the failure of rational decision-making. Third-generation deterrence theorists like Irving Janis in their work point out the weaknesses in rational decision-making. It was during this generation that new fields were introduced in nuclear decision making such as behavioural sciences and cognitive psychology.\nThe above account explains how the theory of deterrence has evolved with time and how various strategists have thought about nuclear deterrence. While strategists may differ in how deterrence is viewed, there is consensus in the community that all deterrence strategies must discourage hostile actions. To achieve this effect strategists can use the\n Bernard Brodie and Frederick Sherwood Dunn, *The Absolute Weapon: Atomic Power and World Order* (Freeport, New York State: Books for Libraries Press, 1972).\n Thomas C. Schelling, “Chapter 2: The Art of Commitment,” essay, in *Arms and Influence*, 1st ed., vol. 1 (New Haven, Connecticut: Yale University Press, 1966), 36–40.\n Freedman, Lawrence. 2004. Deterrence. Cambridge: Polity Press: 21.\n Irving Janis, *Groupthink: Psychological Studies of Policy Decisions and Fiascoes*, 1st ed., vol. 1 (Boston, Massachusetts: Houghton Mifflin Harcourt, 1982).\nConceptualising Cyber Deterrence and Policy Options for Pakistan\n\"Deterrence by Denial Approach\" or \"Deterrence by Punishment Approach\". In deterrence by punishment, the state threatens to retaliate with devastating force (nuclear weapons), which will offset the benefit of any military gain. Alexander and Richard explain that in the case of deterrence, the commitment of intent should be clear, the credibility of the threat should be well established and lastly, the threat should be communicated. In Deterrence by Denial, states try to deny the opponent achievement of its war aims. This means a state would harden itself by building stronger infrastructure and better security systems. For instance, the Strategic Defense Initiative (Star Wars), if successfully built, would have been deterrence by denial. Such measures often fail when they lack the material to deny, the Maginot line is a good example of such failure.\n## Impact of Cyber Threats\nIn traditional deterrence, in case of a nuclear attack on a city, the proportional response would typically involve a counterattack on a city of the adversary. This concept relies on the fact that a city is geographically fixed and immovable, both logically and physically. However, this logic does not apply in cyberspace, where targets and their impacts are not confined to physical locations. With the introduction of the cyber domain, new technical issues have arisen which have complicated the certainty of nuclear deterrence.\nFirstly, the victim state bears the responsibility of proving the identity of the individual responsible for an action. The assessment of potential retaliation and the possibility of preemptive actions hinge on accurate attribution. Engaging in retaliation without substantial evidence\n Michael Rühle, “Deterrence: What It Can (and Cannot) Do,” NATO Review, April 20, 2015, https://www.nato.int/docu/review/articles/2015/04/20/deterrence-what-it-can-and-cannot-do/index.html.\n Alexander L. George and Richard Smoke, “Chapter 3 The Normative Use of the Abstract Deterrence Model,” essay, in Deterrence in American Foreign Policy: Theory and Practice, 1st ed., vol. 1 (New York, New York State: Columbia University Press, 1974), 63–64.\n Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n\nSyed Ahmed Ali and Nasir Mehmood\nincreases the risk of misidentifying the culprit and escalating the situation unnecessarily. Secondly, a state must respond to an incident within a close time frame. If state X lacks detailed intelligence about the target it intends to retaliate against, the process of gathering intelligence and developing a cyber weapon extends the time frame for response. This extension can stretch from days to weeks, months, or even years beyond the original attack prompting retaliation. The possibility of facing consequences for an attack exists but is so temporally distant that it is disregarded as insignificant. 9 Thirdly, effective deterrence through punishment necessitates proportionality. To prevent escalation or breaches of international law, it is crucial to possess comparable assets for retaliation. However, within cyberspace, identifying such assets can be challenging as they are not always readily comparable. 10 Fourthly, a state must possess a tailored cyber weapon system designed for its specific target. If state X notifies state Y of its intention to retaliate against an asset, or if state X repeatedly employs a cyber weapon against state Y's system, the effectiveness of such actions diminishes over time due to the implementation of updated perimeter defenses. These defences may include intrusion detection and prevention systems (IDPS), antivirus programs, or various other security measures. 11\nComplications extend beyond the cyber domain and to the critical infrastructure which is a core focus of cyber security. Several limitations make the protection of critical infrastructure complicated. Firstly is the issue of denial of access which is easier in physical infrastructure than in digital infrastructure. Issues like Backdoor portals, zero-day exploits, and other cyber vulnerabilities make security difficult. Secondly, unlike physical deterrence where attacks against it are known and evident,\n\ndigital deterrence failure is silent, where cyberattacks on critical infrastructure often go unnoticed. A key example of this is the Stuxnet virus where the malware went undetected for 3 years. It was only after the malware destroyed the centrifuges did the Iranians realized the breach in security. Thirdly, states have deep familiarity with military threats which is expressed in deterrence and coercion, for which states have established engagement norms as part of their doctrine. Most physical attacks on infrastructure have clear and recognized red lines that states recognised However, in cyberspace, which is a relatively new domain, the principles of deterrence are still developing. Responses to digital attacks on infrastructure are uncertain due to their rarity and the ambiguous nature of digital red lines, leading to unclear coercive communication. Fourthly, due to the diverse nature of cyberspace, non-state actors are also important actors who may not be driven by rational objectives. Rather these actors are driven by impulsive and ideological reasons which may trigger a security crisis. These actors are motivated by the fact that the cyber domain lacks symmetry where individuals and non-state actor groups have a disproportionate influence on state critical infrastructure's security. 12\n## Conceptualizing Cyber Deterrence\nThe current literature available for nuclear deterrence mostly revolves around traditional concepts of deterrence which cover issues relating to strategic dynamics, new weapon systems, and doctrine. The cyber domain has posed a challenge to conventional principles of deterrence through punishment and deterrence through denial. Both Deterrence by punishment and denial are designed to manipulate the cost and-benefit decision-making calculus of the enemy, where the costs of aggression outweighs any gain made by the enemy. To make any deterrence successful one of the strategies must succeed in deterring enemy aggression. To analyse the impact of the cyber domain on the\n\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\ntraditional concept of deterrence, it is important to understand how the strategies of “punishment” and “denial” work in a cyberspace environment. Before analyzing the two main deterrence strategies it is important to understand the cyberspace environment. 13\nConstructing a meaningful model of deterrence in cyberspace necessitates an initial exploration of what exactly seeks to deter. This is where the most significant disparity between deterrence in the physical realm and cyberspace arises. Deterrence in the cyber domain differs from traditional deterrence in the physical realm due to the inherent uncertainty of attribution. Cyberattacks, including cyber espionage, cyber sabotage, and cyber control, are inherently covert, making attribution uncertain. As a result, deterrence in the cyber domain is flawed, as it may lead to 'accidental escalation,' where third parties can exploit the anonymity of cyberspace to provoke conflict between two states.14 Additionally, studies conducted by Shawn Lonergan and Erica Borghard suggest a significant propensity for states to utilise proxies to retain plausible deniability. Cyberattackers can utilise Virtual Private Networks (VPNs), proxies, or other methods to conduct attacks while concealing their identity, this makes their attacks repudiable.15\nThe primary difference between deterrence in the physical realm and cyberspace is highlighted in Herbert Lin's article, the direct consequences of a cyberattack may not be immediately recognisable; instead, it's the secondary or tertiary effects that achieve the desired outcome. Classical deterrence methods and customized strategies employed against terrorist groups often struggle to address the disjointed sequences of action and reaction that are prevalent in cyberspace. Furthermore, the time frame for responding to a breach can span weeks,\n\nmonths, or even years due to the complexities of discovery and attribution issues that are not typically encountered in traditional deterrence. 16\nScholars like John Mearsheimer have written in much detail regarding the complex layers of security that envelop deterrence and are subject to the dynamic nature of the evolution of technology.17 The constant evolution of technology has led states to explore the cyber domain to gain new vectors of attack. The evolution of non-nuclear technology has a direct impact on the nuclear deterrence. The increasing sophistication of weaponry is gradually outpacing existing arms control treaties, creating new threats that could destabilise the delicate balance of nuclear deterrence.\nCyber threats to nuclear systems may seem like a remote possibility, particularly in the context of modern weapon systems. However, in June 1998 a group of Indian hackers had access to the computer systems at Bhabha Atomic Research Centre (BARC)18.\nA more worrying example of cyberattacks was on the US nuclear forces in the state of Wyoming. It was reported in 2010 that about 50 nuclear Minuteman missiles located in underground silos lost connection for about an hour with the launching crew had no access. The launching crew did not have access to the central command and the US President who had the authority to launch Minuteman missiles. This effectively means that cyberattacks can decapitate the leadership that has the authority to issue a nuclear retaliation.19\nDr. Beyza Unal, head of the Science, Technology, and International Security Unit at Chatham House UK, highlighted cyber\n\nSyed Ahmed Ali and Nasir Mehmood\nthreats to nuclear weapon systems. She warned that hackers could do more than access launch codes; they might disrupt retaliation mechanisms or inject malicious codes during weapon procurement, compromising performance. Hackers favor malware injection over direct system penetration due to antivirus protections. Malwares often infiltrates through risky websites for example gambling, video games, and adult sites, which organisation employees may access, risking virus downloads that could affect security systems.\nDmitry Stefanovich discusses in his article about the nexus of Cyber and Nuclear threats and cites the example of the Russian state document called the Basic Principles on Nuclear Deterrence where he explains that it is not a war-fighting manual but rather a “broadening” of nuclear-related sections. There is an update to the nuclear weapons policy, where the threats to nuclear weapons are grounds for nuclear retaliation. Paragraph 19C of the Basic Principles document clearly states that attacks against “critical governmental or military site” and “disruption which would undermine nuclear forces” are grounds for nuclear retaliation.\nThis development is not limited to the Russian Federation as the international community is aware of the threat of cyberattacks on the Nuclear Command, Control and Communications (NC3). In US 2018 nuclear posture review “non-nuclear strategic attacks” on US and allied forces” are cited as a major threat to nuclear stability. Likewise, the Chinese have equated cyberattacks to nuclear bombs, UK has discussed the possibility of a cyberattack on the NC3, while France has mentioned the link between nuclear and cyber threats in the documents of the “Paris Call for Trust and Security in Cyberspace.”\nThe failure of cyber deterrence would create a risk for unnecessary escalation and must be avoided. Most cyberattacks are non-kinetic cyberattacks which are largely to the destruction and disruption of Information networks and computers. These types of attacks do not cause massive destruction, however kinetic cyberattacks where physical\n Naseer, Dr Rizwan, and Dr Musarat Amin. \"Cyber-threats to strategic networks: Challenges for Pakistan’s security.\" *South Asian Studies* 33, no. 1 (2020).\nConceptualising Cyber Deterrence and Policy Options for Pakistan\ndamage is usually followed by a cyberattack can lead to escalation. In such cases, the right to self-defence, individually or collectively, can be invoked under Article 51 of the UN Charter.\nIt is in this spirit that the G7 foreign ministers met in Sicily, Italy, which led to the G7 “Declaration on Responsible States Behaviour in Cyber Space also called the “Lucca Declaration” in May 2017. The Lucca Declaration acknowledged that cyberattacks can amount to the use of force or be considered an armed attack. The G7 had two main objectives: the first was building confidence-building measures (CBMs), which are instrumental in building trust. These measures included cyber communication lines, establishing contact points, and other such measures. Secondly, there were voluntary norms that acted as non-binding principles that would serve as a code of conduct in cyberspace. The declaration hopes that the trust established through CBMs will transform into voluntary norms that will be ratified as part of national law and eventually into an international convention that will moderate harmful cyber behaviour.\nThe Lucca Declaration has provided a framework that should be followed by other states to create a more stable cyberspace for the international community. The declaration has outlined certain essential norms that should be followed. Article 3 outlines that states should not allow their territory to be used for malicious cyber activity or crime. This article is important since it allows the international community to deal with the transnational nature of cyber-crime. Articles 7 and 8 provide legal protection for critical infrastructure (CI) by making it a legal requirement for interstate cooperation when dealing with malicious software. Critical infrastructure is often a vulnerable target for cyberattacks, as such it requires international cooperation to ensure no unnecessary escalation happens. Article 9 aims to limit the proliferation\n Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n Mariarosaria Taddeo, “Deterrence by Norms to Stop Interstate Cyberattacks,” Minds and Machines 27, no. 3 (September 2017): 387–92, https://doi.org/10.1007/s11023-017-9446-1.\n\nSyed Ahmed Ali and Nasir Mehmood\nof malware in the supply chain by creating a system that verifies the presence of malware. Article 10 encourages states to report cyber vulnerabilities and will reduce the probability of zero-day cyber exploits. Article 12 talks about intellectual rights and addresses the issue of cyber theft. $^{23}$\nUnfortunately, the discussion of cyber regulation has become a difficult issue to raise since China, Russia and the West suffer trust deficit towards each other. This is compounded by the fact that the issue of \"attribution\" in the cyber domain is difficult as the \"perpetrator\" often uses identical cyber tools for cyber espionage and cyber infiltration. $^{24}$\n## Deterrence by Denial or Punishment\nThe distribution of resources between denial and punishment and the effectiveness of these strategies in deterring adversaries vary significantly. Establishing deterrence by denial typically begins with the allocation of financial capital to acquire technical resources and to hire skilled personnel. These resources are essential to continually update, enhance, audit, and manage complex network infrastructures effectively. $^{25}$ Investing in network-based and host-based defences, such as intrusion detection and prevention systems, antivirus software, and other similar technologies, involve a variety of overlapping expenditures. These investments progressively increase the difficulty for adversaries to infiltrate a given network. $^{26}$\n$^{23}$Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, last modified May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n$^{24}$ Dmitry Stefanovich, “Russia’s Basic Principles and the Cyber-Nuclear Nexus,” European Leadership Network, last modified July 14, 2020, https://europeanleadershipnetwork.org/commentary/russias-basic-principles-and-the-cyber-nuclear-nexus/.\n$^{25}$ Cliff Riggs, Network Perimeter Security: Building Defense in-Depth, 1st ed., vol. 1 (Boca Raton, Florida: CRC Press, 2003), 54.\n$^{26}$ Axel Buecker, Per Andreas, and Scott Paisley, “Understanding IT Perimeter Security,” IBM, January 1, 2008, https://www.redbooks.ibm.com/redpapers/pdfs/redp4397.pdf.\n\nIn cyberspace, expenditures on security measures are often regularized and considered part of overhead costs, yet they fundamentally serve as deterrents. Investments in tools such as intrusion detection and prevention systems, and antivirus software act as deterrents. These deterrents deter criminals or terrorists alike where the costs of mounting a successful attack are high, and the probability of success is low. Skeptics may argue that such denial mechanisms are unlikely to deter a state actor; however, this perspective is not entirely accurate. Most probing attempts by state actors do not result in successful attacks. For example, the US Department of Defense faces millions of probes each day, yet nearly 99.99% of these are unsuccessful. This high rate of defence effectiveness underlines the value of robust cyber defences in deterring both opportunistic and targeted cyber threats. 27\nIn traditional domains such as land, sea, air, and space, deterrence by denial relies heavily on controlling a specific geographical area. However, those responsible for establishing deterrence have limited capacity to alter the domain itself. In contrast, cyberspace offers unique opportunities where virtually every element is subject to manipulation by defenders—from the network structure to the hardware, firmware, and software used, as well as the access granted to both internal and external users. In cyberspace, defenders can shape their environment in ways that traditional domains do not allow. During every phase of an attack, an adversary attempts to operate within or against a defender’s digital space over which they have no control and limited visibility. 28\nErica Lonergan highlighted that scholars discuss the cyber vulnerabilities of nuclear command but do not explore the possibility of cyber signaling. With the increased reliance on digital infrastructure, the nuclear command system exposes itself to an increasing number of cyber vulnerabilities. According to the Nuclear Threat Initiative Report (NTI),\n\nSyed Ahmed Ali and Nasir Mehmood\n\n## Cumulative Deterrence\nDoron Almog has proposed a sophisticated and suitable approach to understanding the concept of deterrence called “Cumulative Deterrence” and it is applicable to cyber deterrence.\nCumulative deterrence consists of three main components that differentiate it from traditional concepts of deterrence. Firstly, strategic messaging about the “red lines” of the deterring party should be unambiguous. Repeated acts of retaliation are not sufficient to create norms which is essential to the “rules of the game” in the cyber environment. This strategic messaging can be conveyed through formal diplomatic channels and international organisations. Secondly, the response of the state against hostile cyber actors should be varied according to the severity of the situation. For example, a state may retaliate through kinetic, diplomatic, and financial responses which are respective to the severity of the situation. Thirdly, the state must show willingness to demonstrate its capabilities.\nThomas Rid explains how Israel has integrated cumulative deterrence into its response strategy against terrorism and state conflict. Israeli conventional deterrence against non-state actors is achieved through the simultaneous use of threats and military response which spread over an extended conflict. Cumulative deterrence involves short bursts of force to manage the scope of a conflict and delay 'the next round' of violence, which is more appropriate for cyber deterrence. Cumulative deterrence operates at two levels. At a macro level it aims to project an image of overwhelming military superiority, while at the micro level, it\n Doron Almog, “Cumulative Deterrence and the War on Terrorism,” *The US Army War College Quarterly: Parameters* 34, no. 4 (November 1, 2004): 5–19, https://doi.org/10.55540/0031-1723.2222.\n Uri Tor, “‘Cumulative Deterrence’ as a New Paradigm for Cyber Deterrence,” *Journal of Strategic Studies* 40, no. 1–2 (December 18, 2017): 92–117, https://doi.org/10.1080/01402390.2015.1115975.\n\ninvolves specific military responses to particular threats or hostile acts. This concept suggests that deterrence must be 'recharged' periodically through a series of victories accumulated over time, which results in more moderate behaviour from the adversary. 31\nThe action of retaliation can be divided into three stages, the first stage is ante impetum which means “before the attack”. The cyberattackers gather intelligence during this phase and formulate the operational plan. The second stage is in-impetum which means “during the attack.” This phase marks the execution of the cyber operation and the actual penetration of cyber defenses. The final stage is post impetum which means “after the attack.” In this phase, hostile cyber actors exploit the gains from the cyber operation. 32\nFrom a cyber-deterrence perspective, it is important to note that deterrence by denial is only possible during the Ante Impetum and In Impetum stages. This is because the malware has already penetrated the cyber defenses and cyber norms have been violated, which effectively means deterrence failure. Deterrence failure happens when the security mechanisms have failed to deter the enemy from hostile aggression. In such case, cyber retaliation is necessary to establish consequences for unprovoked cyberattacks. This is done so that the threat of punishment wards off any future aggression. It is for this reason that deterrence by punishment or the threat of punishment starts from the Post Impetum stage, where the attribution for the attacks has to be accurate so the correct hostile cyber actor is punished. However, it is important to mention that,\n\nSyed Ahmed Ali and Nasir Mehmood\nunlike traditional retaliation, cyber retaliation is not immediate and requires extended time to fully respond to an intrusion.\n## Policy Options for Pakistan\nThe absence of norms and international laws, such as those outlined in the Lucca Declaration, which focuses on regulating malicious cyber behaviour is particularly concerning in the context of South Asia. As both India and Pakistan are nuclear states, an attack on their critical infrastructure and nuclear infrastructure may cause unnecessary escalation. To avoid such a situation, Pakistan and India need to agree on certain “rules of engagement” when dealing with cyber conflict. To build these cyber norms certain level of trust needs to exist between these two states which can be achieved through confidence building measures. India and Pakistan should create a cyber hotline between Islamabad and New Delhi to operate in parallel with the DGMO hotline. This will allow both state parties to communicate directly regarding issues that threaten the cyber security of both countries. The ability to communicate in times of crisis will create a “strategic space” for both actors to allow room for de-escalation. The establishment of a hotline will also mitigate the importance of non-state actors and their capacity to create unnecessary escalation. In case of any major cyber incident, both Pakistan and India can form a “Joint Probing Committee”. The committee may consist of cyber experts to investigate the incident and provide suggestions to strengthen the cyber security in South Asia. The Joint Probing Committee will allow greater transparency and will allow both nations to cooperate against shared threats. Both states should avoid cyberattacks on critical infrastructure as stated in the Non-Nuclear Aggression Treaty of 1991. This is essential as attacks on critical infrastructure can act as trigger points for both parties as such the sanctity of critical infrastructure should\n Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in *10th International Conference on Cyber Conflict CyCon X: Maximising Effects*, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\nConceptualising Cyber Deterrence and Policy Options for Pakistan\nbe reflected in their respective cyber doctrine. 34\nPakistan has broadly two main policy options. The first is to adopt a deterrence by denial approach, strengthening physical cyber infrastructure and software. This approach would require strong cyber norms which are outlined in the Lucca declaration. Both India and Pakistan must establish cooperation to ensure unnecessary cyber escalation. The second approach, deterrence by punishment, involves Pakistan adopting a cumulative strategy in which any cyber aggression would be countered with sustained cyber retaliation against hostile cyber actors over an extended period. Both policies have their own merits which must be considered when forming a cyber deterrence policy.\nThe most ideal approach seems to be deterrence by denial, as this approach encourages cyber stability and fosters cooperation between states based on a strong normative structure. The disadvantage of this strategy is that the strengthening of cyber defenses is an elusive process. Cyber domain favors cyber offense where aggression costs less than defense. Furthermore, relations between Pakistan and India are currently hostile making cyber deterrence by denial tedious and difficult. Deterrence by punishment by comparison is simpler but unstable and dangerous. While cyberattacks such as web defacements and (Distributed Denial of Services) DDOS attacks have limited escalation capabilities, cyberattacks on critical infrastructure are dangerous as they may provoke a cross-domain response. A cross-domain response entails a retaliation where the state may respond to cyberattacks with kinetic response. According to an article by Martain C. Libicki, a US administrator on the condition of anonymity stated that if US power grid systems are attacked, the US might retaliate with a missile strike. This led to the conclusion that\n\nSyed Ahmed Ali and Nasir Mehmood\nwhile kinetic retaliation to a cyberattack is possible it is not probable with current trends and technology. 35\nTo conclude cyber deterrence by denial is ideal for the Ante Impetum and post Impetum as a general approach. In case of deterrence failure Pakistan can adopt a cumulative strategy to retaliate against hostile cyber actors. However, it is important to mention that Pakistan must keep its response within the cyber domain, or else it may trigger a cross-domain escalation following a kinetic response."
    },
    "numeric": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "JSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n# Conceptualising Cyber Deterrence and Policy Options for Pakistan\nSyed Ahmed Ali* and Nasir Mehmood*\n## Abstract\nThe research paper attempts to explore and analyse how traditional deterrence concepts would operate in the cyber domain employing a comparative analysis model to compare Cyber deterrence with conventional and nuclear deterrence. Through this analysis, the research found that the cyber domain has an incognito environment with multiple actors that have low costs and high returns, incentivizing hostile cyber actions. This means that traditional concepts of deterrence such as Mutually Assured Destruction are not possible. For this reason, new approaches to cyber deterrence such as cumulative deterrence embody the “Punishment” approach. Cyber norms and cyber hardening represent deterrence through a “denial” approach. The research concludes that the denial approach, while more resource-intensive and requires international cooperation, is a more sustainable way to counter cyber threats. In the case of deterrence failure Pakistan may resort to a cumulative strategy, which may allow Pakistan to retaliate, can also lead to escalation. Pakistan needs to adopt both a denial and punishment approach, but a strong emphasis on cyber security is a priority.\nKey Words: Pakistan, Cyber Deterrence, Nuclear Deterrence, Cyber Threats, Cumulative deterrence.\n* Syed Ahmed Ali has graduated in Strategic Studies from National Defense University, Islamabad.\n* Nasir Mehmood is professor of Strategic Studies at the National Defense University, Islamabad.\n118\nConceptualising Cyber Deterrence and Policy Options for Pakistan\n# Introduction\nSouth Asia is a complex region, marked by political tensions alongside military confrontations between the nuclear-armed states of Pakistan and India. The South Asian strategic stability is realized in the form of nuclear deterrence and is reinforced by a position of mutual vulnerability which acts as a disincentive to alter the status quo through the use of coercion or military force.\nNew technologies create new ways to exercise military power and create new threat vectors that need to be addressed. The evolution of the Internet of Things (IoT) and the reliance on computers to increase the efficiency and effectiveness of modern weaponry has given birth to new cyber threats. These cyber-threats become more dangerous as the states start to adopt IoT solutions and integrate them into their military capabilities. The evolution of threats from the cyber domain has challenged the traditional concepts of deterrence, which must be investigated and understood to conceptualise new ways of deterrence in cyber domain. Hence, the study investigates the impact of cyber threats on nuclear deterrence between Pakistan and India. Additional variables such as differences in doctrine, the evolution in delivery mechanisms and nuclear capability and the role of non-state actors will not be discussed.\n# Evolution of the Deterrence Theory\nTraditionally, deterrence theory refers to the threat of use of overwhelming force (nuclear weapons) by a state to cause unacceptable damage in order to stop another state not to initiate aggression or an undesired act. This concept has seen constant change and evolution due to changes in technology and strategic thinking about these weapons. Robert Jervis has identified three main waves that mark different schools of thought which have evolved regarding the nature and use of nuclear weapons.¹\nThe initial phase of deterrence theory was heavily influenced by the advent of nuclear weapons. Bernard Brodie elaborated this idea in his\n¹ Robert Jervis, “Deterrence Theory Revisited,” *World Politics* 31, no. 2 (January 1, 1979): 289–324, https://doi.org/10.2307/2009945.\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nbook “The Absolute Weapon”, where he argued that the primary purpose of previous military establishments had been to win wars. However, with the introduction of nuclear weapons, the purpose of the military establishment shifted to preventing wars altogether.² Meanwhile, Thomas Schelling developed the game theory model which explored the rational cost and benefit involved in decision making. This model largely rested on rational decision-making in matters related to foreign policy and national security. In his models, Schelling explained that the concept of nuclear deterrence largely rests on rational decision-making and credibility.³\nWhile the first wave saw no space for warfare with the introduction of nuclear weapons, the second wave however was more flexible in this position. Lawrence Freedman summarized the stance of the second wave, stating that total war could be threatened but never fought. First-wave deterrence theorists studied how the use of nuclear weapons could be used as a threat and how such dynamics operated.⁴\nThe third wave represents the antithesis of the second wave, and criticises ideas of rational deterrence by pointing out the failure of rational decision-making. Third-generation deterrence theorists like Irving Janis in their work point out the weaknesses in rational decision-making. It was during this generation that new fields were introduced in nuclear decision making such as behavioural sciences and cognitive psychology.⁵\nThe above account explains how the theory of deterrence has evolved with time and how various strategists have thought about nuclear deterrence. While strategists may differ in how deterrence is viewed, there is consensus in the community that all deterrence strategies must discourage hostile actions. To achieve this effect strategists can use the\n² Bernard Brodie and Frederick Sherwood Dunn, *The Absolute Weapon: Atomic Power and World Order* (Freeport, New York State: Books for Libraries Press, 1972).\n³ Thomas C. Schelling, “Chapter 2: The Art of Commitment,” essay, in *Arms and Influence*, 1st ed., vol. 1 (New Haven, Connecticut: Yale University Press, 1966), 36–40.\n⁴ Freedman, Lawrence. 2004. Deterrence. Cambridge: Polity Press: 21.\n⁵ Irving Janis, *Groupthink: Psychological Studies of Policy Decisions and Fiascoes*, 1st ed., vol. 1 (Boston, Massachusetts: Houghton Mifflin Harcourt, 1982).\nConceptualising Cyber Deterrence and Policy Options for Pakistan\n\"Deterrence by Denial Approach\" or \"Deterrence by Punishment Approach\"⁶. In deterrence by punishment, the state threatens to retaliate with devastating force (nuclear weapons), which will offset the benefit of any military gain. Alexander and Richard explain that in the case of deterrence, the commitment of intent should be clear, the credibility of the threat should be well established and lastly, the threat should be communicated.⁷ In Deterrence by Denial, states try to deny the opponent achievement of its war aims. This means a state would harden itself by building stronger infrastructure and better security systems. For instance, the Strategic Defense Initiative (Star Wars), if successfully built, would have been deterrence by denial. Such measures often fail when they lack the material to deny, the Maginot line is a good example of such failure.⁸\n## Impact of Cyber Threats\nIn traditional deterrence, in case of a nuclear attack on a city, the proportional response would typically involve a counterattack on a city of the adversary. This concept relies on the fact that a city is geographically fixed and immovable, both logically and physically. However, this logic does not apply in cyberspace, where targets and their impacts are not confined to physical locations. With the introduction of the cyber domain, new technical issues have arisen which have complicated the certainty of nuclear deterrence.\nFirstly, the victim state bears the responsibility of proving the identity of the individual responsible for an action. The assessment of potential retaliation and the possibility of preemptive actions hinge on accurate attribution. Engaging in retaliation without substantial evidence\n⁶ Michael Rühle, “Deterrence: What It Can (and Cannot) Do,” NATO Review, April 20, 2015, https://www.nato.int/docu/review/articles/2015/04/20/deterrence-what-it-can-and-cannot-do/index.html.\n⁷ Alexander L. George and Richard Smoke, “Chapter 3 The Normative Use of the Abstract Deterrence Model,” essay, in Deterrence in American Foreign Policy: Theory and Practice, 1st ed., vol. 1 (New York, New York State: Columbia University Press, 1974), 63–64.\n⁸ Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n121\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nincreases the risk of misidentifying the culprit and escalating the situation unnecessarily. Secondly, a state must respond to an incident within a close time frame. If state X lacks detailed intelligence about the target it intends to retaliate against, the process of gathering intelligence and developing a cyber weapon extends the time frame for response. This extension can stretch from days to weeks, months, or even years beyond the original attack prompting retaliation. The possibility of facing consequences for an attack exists but is so temporally distant that it is disregarded as insignificant. 9 Thirdly, effective deterrence through punishment necessitates proportionality. To prevent escalation or breaches of international law, it is crucial to possess comparable assets for retaliation. However, within cyberspace, identifying such assets can be challenging as they are not always readily comparable. 10 Fourthly, a state must possess a tailored cyber weapon system designed for its specific target. If state X notifies state Y of its intention to retaliate against an asset, or if state X repeatedly employs a cyber weapon against state Y's system, the effectiveness of such actions diminishes over time due to the implementation of updated perimeter defenses. These defences may include intrusion detection and prevention systems (IDPS), antivirus programs, or various other security measures. 11\nComplications extend beyond the cyber domain and to the critical infrastructure which is a core focus of cyber security. Several limitations make the protection of critical infrastructure complicated. Firstly is the issue of denial of access which is easier in physical infrastructure than in digital infrastructure. Issues like Backdoor portals, zero-day exploits, and other cyber vulnerabilities make security difficult. Secondly, unlike physical deterrence where attacks against it are known and evident,\n9 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n10 Martin C. Libicki, Cyberspace in Peace and War, Second Edition, 2nd ed. (Annapolis, Maryland: Naval Institute Press, 2021), 262.\n11 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n122\nConceptualising Cyber Deterrence and Policy Options for Pakistan\ndigital deterrence failure is silent, where cyberattacks on critical infrastructure often go unnoticed. A key example of this is the Stuxnet virus where the malware went undetected for 3 years. It was only after the malware destroyed the centrifuges did the Iranians realized the breach in security. Thirdly, states have deep familiarity with military threats which is expressed in deterrence and coercion, for which states have established engagement norms as part of their doctrine. Most physical attacks on infrastructure have clear and recognized red lines that states recognised However, in cyberspace, which is a relatively new domain, the principles of deterrence are still developing. Responses to digital attacks on infrastructure are uncertain due to their rarity and the ambiguous nature of digital red lines, leading to unclear coercive communication. Fourthly, due to the diverse nature of cyberspace, non-state actors are also important actors who may not be driven by rational objectives. Rather these actors are driven by impulsive and ideological reasons which may trigger a security crisis. These actors are motivated by the fact that the cyber domain lacks symmetry where individuals and non-state actor groups have a disproportionate influence on state critical infrastructure's security. 12\n## Conceptualizing Cyber Deterrence\nThe current literature available for nuclear deterrence mostly revolves around traditional concepts of deterrence which cover issues relating to strategic dynamics, new weapon systems, and doctrine. The cyber domain has posed a challenge to conventional principles of deterrence through punishment and deterrence through denial. Both Deterrence by punishment and denial are designed to manipulate the cost and-benefit decision-making calculus of the enemy, where the costs of aggression outweighs any gain made by the enemy. To make any deterrence successful one of the strategies must succeed in deterring enemy aggression. To analyse the impact of the cyber domain on the\n12 Alex Wilner, “Cyber Deterrence and Critical-Infrastructure Protection: Expectation, Application, and Limitation,” Comparative Strategy 36, no. 4 (August 8, 2017): 309–18, https://doi.org/10.1080/01495933.2017.1361202.\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\ntraditional concept of deterrence, it is important to understand how the strategies of “punishment” and “denial” work in a cyberspace environment. Before analyzing the two main deterrence strategies it is important to understand the cyberspace environment. 13\nConstructing a meaningful model of deterrence in cyberspace necessitates an initial exploration of what exactly seeks to deter. This is where the most significant disparity between deterrence in the physical realm and cyberspace arises. Deterrence in the cyber domain differs from traditional deterrence in the physical realm due to the inherent uncertainty of attribution. Cyberattacks, including cyber espionage, cyber sabotage, and cyber control, are inherently covert, making attribution uncertain. As a result, deterrence in the cyber domain is flawed, as it may lead to 'accidental escalation,' where third parties can exploit the anonymity of cyberspace to provoke conflict between two states.14 Additionally, studies conducted by Shawn Lonergan and Erica Borghard suggest a significant propensity for states to utilise proxies to retain plausible deniability. Cyberattackers can utilise Virtual Private Networks (VPNs), proxies, or other methods to conduct attacks while concealing their identity, this makes their attacks repudiable.15\nThe primary difference between deterrence in the physical realm and cyberspace is highlighted in Herbert Lin's article, the direct consequences of a cyberattack may not be immediately recognisable; instead, it's the secondary or tertiary effects that achieve the desired outcome. Classical deterrence methods and customized strategies employed against terrorist groups often struggle to address the disjointed sequences of action and reaction that are prevalent in cyberspace. Furthermore, the time frame for responding to a breach can span weeks,\n13 Alex Wilner, “Cyber Deterrence and Critical-Infrastructure Protection.”\n14 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n15 Erica D. Borghard and Shawn W. Lonergan, “Can States Calculate the Risks of Using Cyber Proxies?,” Orbis 60, no. 3 (July 1, 2016): 395–416, https://doi.org/10.1016/j.orbis.2016.05.009.\n124\nConceptualising Cyber Deterrence and Policy Options for Pakistan\nmonths, or even years due to the complexities of discovery and attribution issues that are not typically encountered in traditional deterrence. 16\nScholars like John Mearsheimer have written in much detail regarding the complex layers of security that envelop deterrence and are subject to the dynamic nature of the evolution of technology.17 The constant evolution of technology has led states to explore the cyber domain to gain new vectors of attack. The evolution of non-nuclear technology has a direct impact on the nuclear deterrence. The increasing sophistication of weaponry is gradually outpacing existing arms control treaties, creating new threats that could destabilise the delicate balance of nuclear deterrence.\nCyber threats to nuclear systems may seem like a remote possibility, particularly in the context of modern weapon systems. However, in June 1998 a group of Indian hackers had access to the computer systems at Bhabha Atomic Research Centre (BARC)18.\nA more worrying example of cyberattacks was on the US nuclear forces in the state of Wyoming. It was reported in 2010 that about 50 nuclear Minuteman missiles located in underground silos lost connection for about an hour with the launching crew had no access. The launching crew did not have access to the central command and the US President who had the authority to launch Minuteman missiles. This effectively means that cyberattacks can decapitate the leadership that has the authority to issue a nuclear retaliation.19\nDr. Beyza Unal, head of the Science, Technology, and International Security Unit at Chatham House UK, highlighted cyber\n16 Derek S. Reveron and Herbert Lin, “Chapter 3 Operational Considerations in Cyberattack and Cyber Exploitation,” essay, in Cyberspace and National Security: Threats, Opportunities, and Power in a Virtual World, 1st ed., vol. 1 (Washington DC, USA: Georgetown University Press, 2012), 37–57.\n17 John J. Mearsheimer, “Chapter 1 Introduction,” essay, in Conventional Deterrence, 1st ed., vol. 1 (Ithaca, New York State: Cornell University Press, 1983), 13–23.\n18 https://www.economist.com/asia/2019/11/01/a-cyber-attack-on-an-indian-nuclear-plant-raises-worrying-questions\n19 Bruce G. Blair, “Why Our Nuclear Weapons Can Be Hacked,” The New York Times, March 14, 2017, https://www.nytimes.com/2017/03/14/opinion/why-our-nuclear-weapons-can-be-hacked.html.\n125\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nthreats to nuclear weapon systems. She warned that hackers could do more than access launch codes; they might disrupt retaliation mechanisms or inject malicious codes during weapon procurement, compromising performance. Hackers favor malware injection over direct system penetration due to antivirus protections. Malwares often infiltrates through risky websites for example gambling, video games, and adult sites, which organisation employees may access, risking virus downloads that could affect security systems.²⁰\nDmitry Stefanovich discusses in his article about the nexus of Cyber and Nuclear threats and cites the example of the Russian state document called the Basic Principles on Nuclear Deterrence where he explains that it is not a war-fighting manual but rather a “broadening” of nuclear-related sections. There is an update to the nuclear weapons policy, where the threats to nuclear weapons are grounds for nuclear retaliation. Paragraph 19C of the Basic Principles document clearly states that attacks against “critical governmental or military site” and “disruption which would undermine nuclear forces” are grounds for nuclear retaliation.\nThis development is not limited to the Russian Federation as the international community is aware of the threat of cyberattacks on the Nuclear Command, Control and Communications (NC3). In US 2018 nuclear posture review “non-nuclear strategic attacks” on US and allied forces” are cited as a major threat to nuclear stability. Likewise, the Chinese have equated cyberattacks to nuclear bombs, UK has discussed the possibility of a cyberattack on the NC3, while France has mentioned the link between nuclear and cyber threats in the documents of the “Paris Call for Trust and Security in Cyberspace.”\nThe failure of cyber deterrence would create a risk for unnecessary escalation and must be avoided. Most cyberattacks are non-kinetic cyberattacks which are largely to the destruction and disruption of Information networks and computers. These types of attacks do not cause massive destruction, however kinetic cyberattacks where physical\n²⁰ Naseer, Dr Rizwan, and Dr Musarat Amin. \"Cyber-threats to strategic networks: Challenges for Pakistan’s security.\" *South Asian Studies* 33, no. 1 (2020).\nConceptualising Cyber Deterrence and Policy Options for Pakistan\ndamage is usually followed by a cyberattack can lead to escalation. In such cases, the right to self-defence, individually or collectively, can be invoked under Article 51 of the UN Charter.²¹\nIt is in this spirit that the G7 foreign ministers met in Sicily, Italy, which led to the G7 “Declaration on Responsible States Behaviour in Cyber Space also called the “Lucca Declaration” in May 2017. The Lucca Declaration acknowledged that cyberattacks can amount to the use of force or be considered an armed attack. The G7 had two main objectives: the first was building confidence-building measures (CBMs), which are instrumental in building trust. These measures included cyber communication lines, establishing contact points, and other such measures. Secondly, there were voluntary norms that acted as non-binding principles that would serve as a code of conduct in cyberspace. The declaration hopes that the trust established through CBMs will transform into voluntary norms that will be ratified as part of national law and eventually into an international convention that will moderate harmful cyber behaviour.²²\nThe Lucca Declaration has provided a framework that should be followed by other states to create a more stable cyberspace for the international community. The declaration has outlined certain essential norms that should be followed. Article 3 outlines that states should not allow their territory to be used for malicious cyber activity or crime. This article is important since it allows the international community to deal with the transnational nature of cyber-crime. Articles 7 and 8 provide legal protection for critical infrastructure (CI) by making it a legal requirement for interstate cooperation when dealing with malicious software. Critical infrastructure is often a vulnerable target for cyberattacks, as such it requires international cooperation to ensure no unnecessary escalation happens. Article 9 aims to limit the proliferation\n²¹ Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n²² Mariarosaria Taddeo, “Deterrence by Norms to Stop Interstate Cyberattacks,” Minds and Machines 27, no. 3 (September 2017): 387–92, https://doi.org/10.1007/s11023-017-9446-1.\n127\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nof malware in the supply chain by creating a system that verifies the presence of malware. Article 10 encourages states to report cyber vulnerabilities and will reduce the probability of zero-day cyber exploits. Article 12 talks about intellectual rights and addresses the issue of cyber theft. $^{23}$\nUnfortunately, the discussion of cyber regulation has become a difficult issue to raise since China, Russia and the West suffer trust deficit towards each other. This is compounded by the fact that the issue of \"attribution\" in the cyber domain is difficult as the \"perpetrator\" often uses identical cyber tools for cyber espionage and cyber infiltration. $^{24}$\n## Deterrence by Denial or Punishment\nThe distribution of resources between denial and punishment and the effectiveness of these strategies in deterring adversaries vary significantly. Establishing deterrence by denial typically begins with the allocation of financial capital to acquire technical resources and to hire skilled personnel. These resources are essential to continually update, enhance, audit, and manage complex network infrastructures effectively. $^{25}$ Investing in network-based and host-based defences, such as intrusion detection and prevention systems, antivirus software, and other similar technologies, involve a variety of overlapping expenditures. These investments progressively increase the difficulty for adversaries to infiltrate a given network. $^{26}$\n$^{23}$Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, last modified May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n$^{24}$ Dmitry Stefanovich, “Russia’s Basic Principles and the Cyber-Nuclear Nexus,” European Leadership Network, last modified July 14, 2020, https://europeanleadershipnetwork.org/commentary/russias-basic-principles-and-the-cyber-nuclear-nexus/.\n$^{25}$ Cliff Riggs, Network Perimeter Security: Building Defense in-Depth, 1st ed., vol. 1 (Boca Raton, Florida: CRC Press, 2003), 54.\n$^{26}$ Axel Buecker, Per Andreas, and Scott Paisley, “Understanding IT Perimeter Security,” IBM, January 1, 2008, https://www.redbooks.ibm.com/redpapers/pdfs/redp4397.pdf.\n128\nConceptualising Cyber Deterrence and Policy Options for Pakistan\nIn cyberspace, expenditures on security measures are often regularized and considered part of overhead costs, yet they fundamentally serve as deterrents. Investments in tools such as intrusion detection and prevention systems, and antivirus software act as deterrents. These deterrents deter criminals or terrorists alike where the costs of mounting a successful attack are high, and the probability of success is low. Skeptics may argue that such denial mechanisms are unlikely to deter a state actor; however, this perspective is not entirely accurate. Most probing attempts by state actors do not result in successful attacks. For example, the US Department of Defense faces millions of probes each day, yet nearly 99.99% of these are unsuccessful. This high rate of defence effectiveness underlines the value of robust cyber defences in deterring both opportunistic and targeted cyber threats. 27\nIn traditional domains such as land, sea, air, and space, deterrence by denial relies heavily on controlling a specific geographical area. However, those responsible for establishing deterrence have limited capacity to alter the domain itself. In contrast, cyberspace offers unique opportunities where virtually every element is subject to manipulation by defenders—from the network structure to the hardware, firmware, and software used, as well as the access granted to both internal and external users. In cyberspace, defenders can shape their environment in ways that traditional domains do not allow. During every phase of an attack, an adversary attempts to operate within or against a defender’s digital space over which they have no control and limited visibility. 28\nErica Lonergan highlighted that scholars discuss the cyber vulnerabilities of nuclear command but do not explore the possibility of cyber signaling. With the increased reliance on digital infrastructure, the nuclear command system exposes itself to an increasing number of cyber vulnerabilities. According to the Nuclear Threat Initiative Report (NTI),\n27 Travis Howard and José de Arimatéia da Cruz, “The Cyber Vulnerabilities of the US Navy,” The Maritime Executive, January 31, 2017, https://maritime-executive.com/editorials/the-cyber-vulnerability-of-the-us-navy.\n28 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n129\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\n9 out of 10 nuclear states have some digital components. This makes cyber signaling a viable strategy that states make use of to exploit the cyber vulnerabilities of rival nuclear control systems.\n## Cumulative Deterrence\nDoron Almog has proposed a sophisticated and suitable approach to understanding the concept of deterrence called “Cumulative Deterrence” and it is applicable to cyber deterrence.²⁹\nCumulative deterrence consists of three main components that differentiate it from traditional concepts of deterrence. Firstly, strategic messaging about the “red lines” of the deterring party should be unambiguous. Repeated acts of retaliation are not sufficient to create norms which is essential to the “rules of the game” in the cyber environment. This strategic messaging can be conveyed through formal diplomatic channels and international organisations. Secondly, the response of the state against hostile cyber actors should be varied according to the severity of the situation. For example, a state may retaliate through kinetic, diplomatic, and financial responses which are respective to the severity of the situation. Thirdly, the state must show willingness to demonstrate its capabilities.³⁰\nThomas Rid explains how Israel has integrated cumulative deterrence into its response strategy against terrorism and state conflict. Israeli conventional deterrence against non-state actors is achieved through the simultaneous use of threats and military response which spread over an extended conflict. Cumulative deterrence involves short bursts of force to manage the scope of a conflict and delay 'the next round' of violence, which is more appropriate for cyber deterrence. Cumulative deterrence operates at two levels. At a macro level it aims to project an image of overwhelming military superiority, while at the micro level, it\n²⁹ Doron Almog, “Cumulative Deterrence and the War on Terrorism,” *The US Army War College Quarterly: Parameters* 34, no. 4 (November 1, 2004): 5–19, https://doi.org/10.55540/0031-1723.2222.\n³⁰ Uri Tor, “‘Cumulative Deterrence’ as a New Paradigm for Cyber Deterrence,” *Journal of Strategic Studies* 40, no. 1–2 (December 18, 2017): 92–117, https://doi.org/10.1080/01402390.2015.1115975.\n130\nConceptualising Cyber Deterrence and Policy Options for Pakistan\ninvolves specific military responses to particular threats or hostile acts. This concept suggests that deterrence must be 'recharged' periodically through a series of victories accumulated over time, which results in more moderate behaviour from the adversary. 31\nThe action of retaliation can be divided into three stages, the first stage is ante impetum which means “before the attack”. The cyberattackers gather intelligence during this phase and formulate the operational plan. The second stage is in-impetum which means “during the attack.” This phase marks the execution of the cyber operation and the actual penetration of cyber defenses. The final stage is post impetum which means “after the attack.” In this phase, hostile cyber actors exploit the gains from the cyber operation. 32\nFrom a cyber-deterrence perspective, it is important to note that deterrence by denial is only possible during the Ante Impetum and In Impetum stages. This is because the malware has already penetrated the cyber defenses and cyber norms have been violated, which effectively means deterrence failure. Deterrence failure happens when the security mechanisms have failed to deter the enemy from hostile aggression. In such case, cyber retaliation is necessary to establish consequences for unprovoked cyberattacks. This is done so that the threat of punishment wards off any future aggression. It is for this reason that deterrence by punishment or the threat of punishment starts from the Post Impetum stage, where the attribution for the attacks has to be accurate so the correct hostile cyber actor is punished. However, it is important to mention that,\n31 Thomas Rid, “Deterrence beyond the State: The Israeli Experience,” Contemporary Security Policy 33, no. 1 (April 1, 2012): 124–47, https://doi.org/10.1080/13523260.2012.659593.\n32 Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n131\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nunlike traditional retaliation, cyber retaliation is not immediate and requires extended time to fully respond to an intrusion.³³\n## Policy Options for Pakistan\nThe absence of norms and international laws, such as those outlined in the Lucca Declaration, which focuses on regulating malicious cyber behaviour is particularly concerning in the context of South Asia. As both India and Pakistan are nuclear states, an attack on their critical infrastructure and nuclear infrastructure may cause unnecessary escalation. To avoid such a situation, Pakistan and India need to agree on certain “rules of engagement” when dealing with cyber conflict. To build these cyber norms certain level of trust needs to exist between these two states which can be achieved through confidence building measures. India and Pakistan should create a cyber hotline between Islamabad and New Delhi to operate in parallel with the DGMO hotline. This will allow both state parties to communicate directly regarding issues that threaten the cyber security of both countries. The ability to communicate in times of crisis will create a “strategic space” for both actors to allow room for de-escalation. The establishment of a hotline will also mitigate the importance of non-state actors and their capacity to create unnecessary escalation. In case of any major cyber incident, both Pakistan and India can form a “Joint Probing Committee”. The committee may consist of cyber experts to investigate the incident and provide suggestions to strengthen the cyber security in South Asia. The Joint Probing Committee will allow greater transparency and will allow both nations to cooperate against shared threats. Both states should avoid cyberattacks on critical infrastructure as stated in the Non-Nuclear Aggression Treaty of 1991. This is essential as attacks on critical infrastructure can act as trigger points for both parties as such the sanctity of critical infrastructure should\n³³ Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in *10th International Conference on Cyber Conflict CyCon X: Maximising Effects*, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\nConceptualising Cyber Deterrence and Policy Options for Pakistan\nbe reflected in their respective cyber doctrine. 34\nPakistan has broadly two main policy options. The first is to adopt a deterrence by denial approach, strengthening physical cyber infrastructure and software. This approach would require strong cyber norms which are outlined in the Lucca declaration. Both India and Pakistan must establish cooperation to ensure unnecessary cyber escalation. The second approach, deterrence by punishment, involves Pakistan adopting a cumulative strategy in which any cyber aggression would be countered with sustained cyber retaliation against hostile cyber actors over an extended period. Both policies have their own merits which must be considered when forming a cyber deterrence policy.\nThe most ideal approach seems to be deterrence by denial, as this approach encourages cyber stability and fosters cooperation between states based on a strong normative structure. The disadvantage of this strategy is that the strengthening of cyber defenses is an elusive process. Cyber domain favors cyber offense where aggression costs less than defense. Furthermore, relations between Pakistan and India are currently hostile making cyber deterrence by denial tedious and difficult. Deterrence by punishment by comparison is simpler but unstable and dangerous. While cyberattacks such as web defacements and (Distributed Denial of Services) DDOS attacks have limited escalation capabilities, cyberattacks on critical infrastructure are dangerous as they may provoke a cross-domain response. A cross-domain response entails a retaliation where the state may respond to cyberattacks with kinetic response. According to an article by Martain C. Libicki, a US administrator on the condition of anonymity stated that if US power grid systems are attacked, the US might retaliate with a missile strike. This led to the conclusion that\n34 Abdul Moiz Khan, “Cyber Deterrence and Confidence Building between Pakistan and India,” South Asian Voices, March 27, 2023, https://southasianvoices.org/cyber-deterrence-and-confidence-building-between-pakistanandindia/#:~:text=Cyber%20deterrence%20aims%20to%20prevent,course%20of%20dissuading%20an%20adversary.\n133\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nwhile kinetic retaliation to a cyberattack is possible it is not probable with current trends and technology. 35\nTo conclude cyber deterrence by denial is ideal for the Ante Impetum and post Impetum as a general approach. In case of deterrence failure Pakistan can adopt a cumulative strategy to retaliate against hostile cyber actors. However, it is important to mention that Pakistan must keep its response within the cyber domain, or else it may trigger a cross-domain escalation following a kinetic response.\n35 Martain C Libicki, “International Conference on Cyber Conflict,” in 12th International Conference on Cyber Conflict. 20/20 Vision: The Next Decade., 1st ed., vol. 12 (Tallinn: CCDCOE, 2020), 199–215.\n134\nReproduced with permission of copyright owner. Further reproduction prohibited without permission."
    },
    "author_year": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "author_year"
      },
      "results": [],
      "flat_text": "JSSA Vol. X, No. 2 Syed Ahmed Ali and Nasir Mehmood # Conceptualising Cyber Deterrence and Policy Options for Pakistan Syed Ahmed Ali* and Nasir Mehmood* ## Abstract The research paper attempts to explore and analyse how traditional deterrence concepts would operate in the cyber domain employing a comparative analysis model to compare Cyber deterrence with conventional and nuclear deterrence. Through this analysis, the research found that the cyber domain has an incognito environment with multiple actors that have low costs and high returns, incentivizing hostile cyber actions. This means that traditional concepts of deterrence such as Mutually Assured Destruction are not possible. For this reason, new approaches to cyber deterrence such as cumulative deterrence embody the “Punishment” approach. Cyber norms and cyber hardening represent deterrence through a “denial” approach. The research concludes that the denial approach, while more resource-intensive and requires international cooperation, is a more sustainable way to counter cyber threats. In the case of deterrence failure Pakistan may resort to a cumulative strategy, which may allow Pakistan to retaliate, can also lead to escalation. Pakistan needs to adopt both a denial and punishment approach, but a strong emphasis on cyber security is a priority.\nKey Words: Pakistan, Cyber Deterrence, Nuclear Deterrence, Cyber Threats, Cumulative deterrence.\n* Syed Ahmed Ali has graduated in Strategic Studies from National Defense University, Islamabad.\n* Nasir Mehmood is professor of Strategic Studies at the National Defense University, Islamabad.\n\n# Introduction\nSouth Asia is a complex region, marked by political tensions alongside military confrontations between the nuclear-armed states of Pakistan and India. The South Asian strategic stability is realized in the form of nuclear deterrence and is reinforced by a position of mutual vulnerability which acts as a disincentive to alter the status quo through the use of coercion or military force.\nNew technologies create new ways to exercise military power and create new threat vectors that need to be addressed. The evolution of the Internet of Things (IoT) and the reliance on computers to increase the efficiency and effectiveness of modern weaponry has given birth to new cyber threats. These cyber-threats become more dangerous as the states start to adopt IoT solutions and integrate them into their military capabilities. The evolution of threats from the cyber domain has challenged the traditional concepts of deterrence, which must be investigated and understood to conceptualise new ways of deterrence in cyber domain. Hence, the study investigates the impact of cyber threats on nuclear deterrence between Pakistan and India. Additional variables such as differences in doctrine, the evolution in delivery mechanisms and nuclear capability and the role of non-state actors will not be discussed.\n# Evolution of the Deterrence Theory\nTraditionally, deterrence theory refers to the threat of use of overwhelming force (nuclear weapons) by a state to cause unacceptable damage in order to stop another state not to initiate aggression or an undesired act. This concept has seen constant change and evolution due to changes in technology and strategic thinking about these weapons. Robert Jervis has identified three main waves that mark different schools of thought which have evolved regarding the nature and use of nuclear weapons.¹\nThe initial phase of deterrence theory was heavily influenced by the advent of nuclear weapons. Bernard Brodie elaborated this idea in his\n¹ Robert Jervis, “Deterrence Theory Revisited,” *World Politics* 31, no. 2 (January 1, 1979): 289–324, https://doi.org/10.2307/2009945.\nJSSA Vol. X, No. 2\nSyed Ahmed Ali and Nasir Mehmood\nbook “The Absolute Weapon”, where he argued that the primary purpose of previous military establishments had been to win wars. However, with the introduction of nuclear weapons, the purpose of the military establishment shifted to preventing wars altogether.² Meanwhile, Thomas Schelling developed the game theory model which explored the rational cost and benefit involved in decision making. This model largely rested on rational decision-making in matters related to foreign policy and national security. In his models, Schelling explained that the concept of nuclear deterrence largely rests on rational decision-making and credibility.³\nWhile the first wave saw no space for warfare with the introduction of nuclear weapons, the second wave however was more flexible in this position. Lawrence Freedman summarized the stance of the second wave, stating that total war could be threatened but never fought. First-wave deterrence theorists studied how the use of nuclear weapons could be used as a threat and how such dynamics operated.⁴\nThe third wave represents the antithesis of the second wave, and criticises ideas of rational deterrence by pointing out the failure of rational decision-making. Third-generation deterrence theorists like Irving Janis in their work point out the weaknesses in rational decision-making. It was during this generation that new fields were introduced in nuclear decision making such as behavioural sciences and cognitive psychology.⁵\nThe above account explains how the theory of deterrence has evolved with time and how various strategists have thought about nuclear deterrence. While strategists may differ in how deterrence is viewed, there is consensus in the community that all deterrence strategies must discourage hostile actions. To achieve this effect strategists can use the\n² Bernard Brodie and Frederick Sherwood Dunn, *The Absolute Weapon: Atomic Power and World Order* (Freeport, New York State: Books for Libraries Press, 1972).\n³ Thomas C. Schelling, “Chapter 2: The Art of Commitment,” essay, in *Arms and Influence*, 1st ed., vol. 1 (New Haven, Connecticut: Yale University Press, 1966), 36–40.\n⁴ Freedman, Lawrence. 2004. Deterrence. Cambridge: Polity Press: 21.\n⁵ Irving Janis, *Groupthink: Psychological Studies of Policy Decisions and Fiascoes*, 1st ed., vol. 1 (Boston, Massachusetts: Houghton Mifflin Harcourt, 1982).\nConceptualising Cyber Deterrence and Policy Options for Pakistan\n\"Deterrence by Denial Approach\" or \"Deterrence by Punishment Approach\"⁶. In deterrence by punishment, the state threatens to retaliate with devastating force (nuclear weapons), which will offset the benefit of any military gain. Alexander and Richard explain that in the case of deterrence, the commitment of intent should be clear, the credibility of the threat should be well established and lastly, the threat should be communicated.⁷ In Deterrence by Denial, states try to deny the opponent achievement of its war aims. This means a state would harden itself by building stronger infrastructure and better security systems. For instance, the Strategic Defense Initiative (Star Wars), if successfully built, would have been deterrence by denial. Such measures often fail when they lack the material to deny, the Maginot line is a good example of such failure.⁸\n## Impact of Cyber Threats\nIn traditional deterrence, in case of a nuclear attack on a city, the proportional response would typically involve a counterattack on a city of the adversary. This concept relies on the fact that a city is geographically fixed and immovable, both logically and physically. However, this logic does not apply in cyberspace, where targets and their impacts are not confined to physical locations. With the introduction of the cyber domain, new technical issues have arisen which have complicated the certainty of nuclear deterrence.\nFirstly, the victim state bears the responsibility of proving the identity of the individual responsible for an action. The assessment of potential retaliation and the possibility of preemptive actions hinge on accurate attribution. Engaging in retaliation without substantial evidence\n⁶ Michael Rühle, “Deterrence: What It Can (and Cannot) Do,” NATO Review, April 20, 2015, https://www.nato.int/docu/review/articles/2015/04/20/deterrence-what-it-can-and-cannot-do/index.html.\n⁷ Alexander L. George and Richard Smoke, “Chapter 3 The Normative Use of the Abstract Deterrence Model,” essay, in Deterrence in American Foreign Policy: Theory and Practice, 1st ed., vol. 1 (New York, New York State: Columbia University Press, 1974), 63–64.\n⁸ Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in 10th International Conference on Cyber Conflict CyCon X: Maximising Effects, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\n\nSyed Ahmed Ali and Nasir Mehmood increases the risk of misidentifying the culprit and escalating the situation unnecessarily. Secondly, a state must respond to an incident within a close time frame. If state X lacks detailed intelligence about the target it intends to retaliate against, the process of gathering intelligence and developing a cyber weapon extends the time frame for response. This extension can stretch from days to weeks, months, or even years beyond the original attack prompting retaliation. The possibility of facing consequences for an attack exists but is so temporally distant that it is disregarded as insignificant. 9 Thirdly, effective deterrence through punishment necessitates proportionality. To prevent escalation or breaches of international law, it is crucial to possess comparable assets for retaliation. However, within cyberspace, identifying such assets can be challenging as they are not always readily comparable. 10 Fourthly, a state must possess a tailored cyber weapon system designed for its specific target. If state X notifies state Y of its intention to retaliate against an asset, or if state X repeatedly employs a cyber weapon against state Y's system, the effectiveness of such actions diminishes over time due to the implementation of updated perimeter defenses. These defences may include intrusion detection and prevention systems (IDPS), antivirus programs, or various other security measures. 11 Complications extend beyond the cyber domain and to the critical infrastructure which is a core focus of cyber security. Several limitations make the protection of critical infrastructure complicated. Firstly is the issue of denial of access which is easier in physical infrastructure than in digital infrastructure. Issues like Backdoor portals, zero-day exploits, and other cyber vulnerabilities make security difficult. Secondly, unlike physical deterrence where attacks against it are known and evident, digital deterrence failure is silent, where cyberattacks on critical infrastructure often go unnoticed. A key example of this is the Stuxnet virus where the malware went undetected for 3 years. It was only after the malware destroyed the centrifuges did the Iranians realized the breach in security. Thirdly, states have deep familiarity with military threats which is expressed in deterrence and coercion, for which states have established engagement norms as part of their doctrine. Most physical attacks on infrastructure have clear and recognized red lines that states recognised However, in cyberspace, which is a relatively new domain, the principles of deterrence are still developing. Responses to digital attacks on infrastructure are uncertain due to their rarity and the ambiguous nature of digital red lines, leading to unclear coercive communication. Fourthly, due to the diverse nature of cyberspace, non-state actors are also important actors who may not be driven by rational objectives. Rather these actors are driven by impulsive and ideological reasons which may trigger a security crisis. These actors are motivated by the fact that the cyber domain lacks symmetry where individuals and non-state actor groups have a disproportionate influence on state critical infrastructure's security. 12 ## Conceptualizing Cyber Deterrence The current literature available for nuclear deterrence mostly revolves around traditional concepts of deterrence which cover issues relating to strategic dynamics, new weapon systems, and doctrine. The cyber domain has posed a challenge to conventional principles of deterrence through punishment and deterrence through denial. Both Deterrence by punishment and denial are designed to manipulate the cost and-benefit decision-making calculus of the enemy, where the costs of aggression outweighs any gain made by the enemy. To make any deterrence successful one of the strategies must succeed in deterring enemy aggression. To analyse the impact of the cyber domain on the JSSA Vol. X, No. 2 Syed Ahmed Ali and Nasir Mehmood traditional concept of deterrence, it is important to understand how the strategies of “punishment” and “denial” work in a cyberspace environment. Before analyzing the two main deterrence strategies it is important to understand the cyberspace environment. 13 Constructing a meaningful model of deterrence in cyberspace necessitates an initial exploration of what exactly seeks to deter. This is where the most significant disparity between deterrence in the physical realm and cyberspace arises. Deterrence in the cyber domain differs from traditional deterrence in the physical realm due to the inherent uncertainty of attribution. Cyberattacks, including cyber espionage, cyber sabotage, and cyber control, are inherently covert, making attribution uncertain. As a result, deterrence in the cyber domain is flawed, as it may lead to 'accidental escalation,' where third parties can exploit the anonymity of cyberspace to provoke conflict between two states.14 Additionally, studies conducted by Shawn Lonergan and Erica Borghard suggest a significant propensity for states to utilise proxies to retain plausible deniability. Cyberattackers can utilise Virtual Private Networks (VPNs), proxies, or other methods to conduct attacks while concealing their identity, this makes their attacks repudiable.15 The primary difference between deterrence in the physical realm and cyberspace is highlighted in Herbert Lin's article, the direct consequences of a cyberattack may not be immediately recognisable; instead, it's the secondary or tertiary effects that achieve the desired outcome. Classical deterrence methods and customized strategies employed against terrorist groups often struggle to address the disjointed sequences of action and reaction that are prevalent in cyberspace. Furthermore, the time frame for responding to a breach can span weeks, months, or even years due to the complexities of discovery and attribution issues that are not typically encountered in traditional deterrence. 16 Scholars like John Mearsheimer have written in much detail regarding the complex layers of security that envelop deterrence and are subject to the dynamic nature of the evolution of technology.17 The constant evolution of technology has led states to explore the cyber domain to gain new vectors of attack. The evolution of non-nuclear technology has a direct impact on the nuclear deterrence. The increasing sophistication of weaponry is gradually outpacing existing arms control treaties, creating new threats that could destabilise the delicate balance of nuclear deterrence.\nCyber threats to nuclear systems may seem like a remote possibility, particularly in the context of modern weapon systems. However, in June 1998 a group of Indian hackers had access to the computer systems at Bhabha Atomic Research Centre (BARC)18.\nA more worrying example of cyberattacks was on the US nuclear forces in the state of Wyoming. It was reported in 2010 that about 50 nuclear Minuteman missiles located in underground silos lost connection for about an hour with the launching crew had no access. The launching crew did not have access to the central command and the US President who had the authority to launch Minuteman missiles. This effectively means that cyberattacks can decapitate the leadership that has the authority to issue a nuclear retaliation.19 Dr. Beyza Unal, head of the Science, Technology, and International Security Unit at Chatham House UK, highlighted cyber Syed Ahmed Ali and Nasir Mehmood threats to nuclear weapon systems. She warned that hackers could do more than access launch codes; they might disrupt retaliation mechanisms or inject malicious codes during weapon procurement, compromising performance. Hackers favor malware injection over direct system penetration due to antivirus protections. Malwares often infiltrates through risky websites for example gambling, video games, and adult sites, which organisation employees may access, risking virus downloads that could affect security systems.²⁰ Dmitry Stefanovich discusses in his article about the nexus of Cyber and Nuclear threats and cites the example of the Russian state document called the Basic Principles on Nuclear Deterrence where he explains that it is not a war-fighting manual but rather a “broadening” of nuclear-related sections. There is an update to the nuclear weapons policy, where the threats to nuclear weapons are grounds for nuclear retaliation. Paragraph 19C of the Basic Principles document clearly states that attacks against “critical governmental or military site” and “disruption which would undermine nuclear forces” are grounds for nuclear retaliation.\nThis development is not limited to the Russian Federation as the international community is aware of the threat of cyberattacks on the Nuclear Command, Control and Communications (NC3). In US 2018 nuclear posture review “non-nuclear strategic attacks” on US and allied forces” are cited as a major threat to nuclear stability. Likewise, the Chinese have equated cyberattacks to nuclear bombs, UK has discussed the possibility of a cyberattack on the NC3, while France has mentioned the link between nuclear and cyber threats in the documents of the “Paris Call for Trust and Security in Cyberspace.”\nThe failure of cyber deterrence would create a risk for unnecessary escalation and must be avoided. Most cyberattacks are non-kinetic cyberattacks which are largely to the destruction and disruption of Information networks and computers. These types of attacks do not cause massive destruction, however kinetic cyberattacks where physical ²⁰ Naseer, Dr Rizwan, and Dr Musarat Amin.\"Cyber-threats to strategic networks: Challenges for Pakistan’s security.\"*South Asian Studies* 33, no. 1 (2020).\nConceptualising Cyber Deterrence and Policy Options for Pakistan damage is usually followed by a cyberattack can lead to escalation. In such cases, the right to self-defence, individually or collectively, can be invoked under Article 51 of the UN Charter.²¹ It is in this spirit that the G7 foreign ministers met in Sicily, Italy, which led to the G7 “Declaration on Responsible States Behaviour in Cyber Space also called the “Lucca Declaration” in May 2017. The Lucca Declaration acknowledged that cyberattacks can amount to the use of force or be considered an armed attack. The G7 had two main objectives: the first was building confidence-building measures (CBMs), which are instrumental in building trust. These measures included cyber communication lines, establishing contact points, and other such measures. Secondly, there were voluntary norms that acted as non-binding principles that would serve as a code of conduct in cyberspace. The declaration hopes that the trust established through CBMs will transform into voluntary norms that will be ratified as part of national law and eventually into an international convention that will moderate harmful cyber behaviour.²² The Lucca Declaration has provided a framework that should be followed by other states to create a more stable cyberspace for the international community. The declaration has outlined certain essential norms that should be followed. Article 3 outlines that states should not allow their territory to be used for malicious cyber activity or crime. This article is important since it allows the international community to deal with the transnational nature of cyber-crime. Articles 7 and 8 provide legal protection for critical infrastructure (CI) by making it a legal requirement for interstate cooperation when dealing with malicious software. Critical infrastructure is often a vulnerable target for cyberattacks, as such it requires international cooperation to ensure no unnecessary escalation happens. Article 9 aims to limit the proliferation ²¹ Torsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n²² Mariarosaria Taddeo, “Deterrence by Norms to Stop Interstate Cyberattacks,” Minds and Machines 27, no. 3: 387–92, https://doi.org/10.1007/s11023-017-9446-1.\n\nSyed Ahmed Ali and Nasir Mehmood of malware in the supply chain by creating a system that verifies the presence of malware. Article 10 encourages states to report cyber vulnerabilities and will reduce the probability of zero-day cyber exploits. Article 12 talks about intellectual rights and addresses the issue of cyber theft. \nUnfortunately, the discussion of cyber regulation has become a difficult issue to raise since China, Russia and the West suffer trust deficit towards each other. This is compounded by the fact that the issue of\"attribution\"in the cyber domain is difficult as the\"perpetrator\"often uses identical cyber tools for cyber espionage and cyber infiltration. \n## Deterrence by Denial or Punishment The distribution of resources between denial and punishment and the effectiveness of these strategies in deterring adversaries vary significantly. Establishing deterrence by denial typically begins with the allocation of financial capital to acquire technical resources and to hire skilled personnel. These resources are essential to continually update, enhance, audit, and manage complex network infrastructures effectively. Investing in network-based and host-based defences, such as intrusion detection and prevention systems, antivirus software, and other similar technologies, involve a variety of overlapping expenditures. These investments progressively increase the difficulty for adversaries to infiltrate a given network. \nTorsten Coral, “G7 Recognises Emerging Challenges of Responsible State Behaviour,” CCDCOE, last modified May 27, 2017, https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour/.\n Dmitry Stefanovich, “Russia’s Basic Principles and the Cyber-Nuclear Nexus,” European Leadership Network, last modified July 14, 2020, https://europeanleadershipnetwork.org/commentary/russias-basic-principles-and-the-cyber-nuclear-nexus/.\n Cliff Riggs, Network Perimeter Security: Building Defense in-Depth, 1st ed., vol. 1 (Boca Raton, Florida: CRC Press, 2003), 54.\n Axel Buecker, Per Andreas, and Scott Paisley, “Understanding IT Perimeter Security,” IBM, January 1, 2008, https://www.redbooks.ibm.com/redpapers/pdfs/redp4397.pdf.\n\nIn cyberspace, expenditures on security measures are often regularized and considered part of overhead costs, yet they fundamentally serve as deterrents. Investments in tools such as intrusion detection and prevention systems, and antivirus software act as deterrents. These deterrents deter criminals or terrorists alike where the costs of mounting a successful attack are high, and the probability of success is low. Skeptics may argue that such denial mechanisms are unlikely to deter a state actor; however, this perspective is not entirely accurate. Most probing attempts by state actors do not result in successful attacks. For example, the US Department of Defense faces millions of probes each day, yet nearly 99.99% of these are unsuccessful. This high rate of defence effectiveness underlines the value of robust cyber defences in deterring both opportunistic and targeted cyber threats. 27 In traditional domains such as land, sea, air, and space, deterrence by denial relies heavily on controlling a specific geographical area. However, those responsible for establishing deterrence have limited capacity to alter the domain itself. In contrast, cyberspace offers unique opportunities where virtually every element is subject to manipulation by defenders—from the network structure to the hardware, firmware, and software used, as well as the access granted to both internal and external users. In cyberspace, defenders can shape their environment in ways that traditional domains do not allow. During every phase of an attack, an adversary attempts to operate within or against a defender’s digital space over which they have no control and limited visibility. 28 Erica Lonergan highlighted that scholars discuss the cyber vulnerabilities of nuclear command but do not explore the possibility of cyber signaling. With the increased reliance on digital infrastructure, the nuclear command system exposes itself to an increasing number of cyber vulnerabilities. According to the Nuclear Threat Initiative Report (NTI),\n\nSyed Ahmed Ali and Nasir Mehmood\n\n## Cumulative Deterrence\nDoron Almog has proposed a sophisticated and suitable approach to understanding the concept of deterrence called “Cumulative Deterrence” and it is applicable to cyber deterrence.²⁹\nCumulative deterrence consists of three main components that differentiate it from traditional concepts of deterrence. Firstly, strategic messaging about the “red lines” of the deterring party should be unambiguous. Repeated acts of retaliation are not sufficient to create norms which is essential to the “rules of the game” in the cyber environment. This strategic messaging can be conveyed through formal diplomatic channels and international organisations. Secondly, the response of the state against hostile cyber actors should be varied according to the severity of the situation. For example, a state may retaliate through kinetic, diplomatic, and financial responses which are respective to the severity of the situation. Thirdly, the state must show willingness to demonstrate its capabilities.³⁰\nThomas Rid explains how Israel has integrated cumulative deterrence into its response strategy against terrorism and state conflict. Israeli conventional deterrence against non-state actors is achieved through the simultaneous use of threats and military response which spread over an extended conflict. Cumulative deterrence involves short bursts of force to manage the scope of a conflict and delay 'the next round' of violence, which is more appropriate for cyber deterrence. Cumulative deterrence operates at two levels. At a macro level it aims to project an image of overwhelming military superiority, while at the micro level, it\n²⁹ Doron Almog, “Cumulative Deterrence and the War on Terrorism,” *The US Army War College Quarterly: Parameters* 34, no. 4 (November 1, 2004): 5–19, https://doi.org/10.55540/0031-1723.2222.\n³⁰ Uri Tor, “‘Cumulative Deterrence’ as a New Paradigm for Cyber Deterrence,” *Journal of Strategic Studies* 40, no. 1–2 (December 18, 2017): 92–117, https://doi.org/10.1080/01402390.2015.1115975.\n\ninvolves specific military responses to particular threats or hostile acts. This concept suggests that deterrence must be 'recharged' periodically through a series of victories accumulated over time, which results in more moderate behaviour from the adversary. 31 The action of retaliation can be divided into three stages, the first stage is ante impetum which means “before the attack”. The cyberattackers gather intelligence during this phase and formulate the operational plan. The second stage is in-impetum which means “during the attack.” This phase marks the execution of the cyber operation and the actual penetration of cyber defenses. The final stage is post impetum which means “after the attack.” In this phase, hostile cyber actors exploit the gains from the cyber operation. 32 From a cyber-deterrence perspective, it is important to note that deterrence by denial is only possible during the Ante Impetum and In Impetum stages. This is because the malware has already penetrated the cyber defenses and cyber norms have been violated, which effectively means deterrence failure. Deterrence failure happens when the security mechanisms have failed to deter the enemy from hostile aggression. In such case, cyber retaliation is necessary to establish consequences for unprovoked cyberattacks. This is done so that the threat of punishment wards off any future aggression. It is for this reason that deterrence by punishment or the threat of punishment starts from the Post Impetum stage, where the attribution for the attacks has to be accurate so the correct hostile cyber actor is punished. However, it is important to mention that, Syed Ahmed Ali and Nasir Mehmood unlike traditional retaliation, cyber retaliation is not immediate and requires extended time to fully respond to an intrusion.³³ ## Policy Options for Pakistan The absence of norms and international laws, such as those outlined in the Lucca Declaration, which focuses on regulating malicious cyber behaviour is particularly concerning in the context of South Asia. As both India and Pakistan are nuclear states, an attack on their critical infrastructure and nuclear infrastructure may cause unnecessary escalation. To avoid such a situation, Pakistan and India need to agree on certain “rules of engagement” when dealing with cyber conflict. To build these cyber norms certain level of trust needs to exist between these two states which can be achieved through confidence building measures. India and Pakistan should create a cyber hotline between Islamabad and New Delhi to operate in parallel with the DGMO hotline. This will allow both state parties to communicate directly regarding issues that threaten the cyber security of both countries. The ability to communicate in times of crisis will create a “strategic space” for both actors to allow room for de-escalation. The establishment of a hotline will also mitigate the importance of non-state actors and their capacity to create unnecessary escalation. In case of any major cyber incident, both Pakistan and India can form a “Joint Probing Committee”. The committee may consist of cyber experts to investigate the incident and provide suggestions to strengthen the cyber security in South Asia. The Joint Probing Committee will allow greater transparency and will allow both nations to cooperate against shared threats. Both states should avoid cyberattacks on critical infrastructure as stated in the Non-Nuclear Aggression Treaty of 1991. This is essential as attacks on critical infrastructure can act as trigger points for both parties as such the sanctity of critical infrastructure should ³³ Aaron F Bently, “International Conference on Cyber Conflict (CyCon),” in *10th International Conference on Cyber Conflict CyCon X: Maximising Effects*, vol. 1 (Tallinn: CCDCOE, 2018), 31–55.\nConceptualising Cyber Deterrence and Policy Options for Pakistan be reflected in their respective cyber doctrine. 34 Pakistan has broadly two main policy options. The first is to adopt a deterrence by denial approach, strengthening physical cyber infrastructure and software. This approach would require strong cyber norms which are outlined in the Lucca declaration. Both India and Pakistan must establish cooperation to ensure unnecessary cyber escalation. The second approach, deterrence by punishment, involves Pakistan adopting a cumulative strategy in which any cyber aggression would be countered with sustained cyber retaliation against hostile cyber actors over an extended period. Both policies have their own merits which must be considered when forming a cyber deterrence policy.\nThe most ideal approach seems to be deterrence by denial, as this approach encourages cyber stability and fosters cooperation between states based on a strong normative structure. The disadvantage of this strategy is that the strengthening of cyber defenses is an elusive process. Cyber domain favors cyber offense where aggression costs less than defense. Furthermore, relations between Pakistan and India are currently hostile making cyber deterrence by denial tedious and difficult. Deterrence by punishment by comparison is simpler but unstable and dangerous. While cyberattacks such as web defacements and (Distributed Denial of Services) DDOS attacks have limited escalation capabilities, cyberattacks on critical infrastructure are dangerous as they may provoke a cross-domain response. A cross-domain response entails a retaliation where the state may respond to cyberattacks with kinetic response. According to an article by Martain C. Libicki, a US administrator on the condition of anonymity stated that if US power grid systems are attacked, the US might retaliate with a missile strike. This led to the conclusion that Syed Ahmed Ali and Nasir Mehmood while kinetic retaliation to a cyberattack is possible it is not probable with current trends and technology. 35 To conclude cyber deterrence by denial is ideal for the Ante Impetum and post Impetum as a general approach. In case of deterrence failure Pakistan can adopt a cumulative strategy to retaliate against hostile cyber actors. However, it is important to mention that Pakistan must keep its response within the cyber domain, or else it may trigger a cross-domain escalation following a kinetic response."
    }
  },
  "citation_summary": {
    "style": "superscript",
    "dominant_bucket": "tex",
    "dominant": {
      "intext_total": 28.0,
      "success_occurrences": 28.0,
      "success_unique": 14.0,
      "bib_unique_total": 43.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 0.32558139534883723,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "superscript"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 8.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 22.0,
        "highest_intext_index": 26.0,
        "missing_footnotes_for_seen_total": 4.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 28.0,
        "success_occurrences": 28.0,
        "success_unique": 14.0,
        "bib_unique_total": 43.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.32558139534883723,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "superscript"
      },
      "numeric": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "Conceptualising Cyber Deterrence and Policy Options for Pakistan",
    "subtitle": "",
    "document_type": "unknown",
    "venue": "",
    "publication_year": null,
    "authors": [
      "Syed Ahmed Ali",
      "Nasir Mehmood"
    ],
    "affiliations": [],
    "emails": [],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "The research paper attempts to explore and analyse how traditional deterrence concepts would operate in the cyber domain employing a comparative analysis model to compare Cyber deterrence with conventional and nuclear deterrence. Through this analysis, the research found that the cyber domain has an incognito environment with multiple actors that have low costs and high returns, incentivizing hostile cyber actions. This means that traditional concepts of deterrence such as Mutually Assured Destruction are not possible. For this reason, new approaches to cyber deterrence such as cumulative deterrence embody the “Punishment” approach. Cyber norms and cyber hardening represent deterrence through a “denial” approach. The research concludes that the denial approach, while more resource-intensive and requires international cooperation, is a more sustainable way to counter cyber threats. In the case of deterrence failure Pakistan may resort to a cumulative strategy, which may allow Pakistan to retaliate, can also lead to escalation. Pakistan needs to adopt both a denial and punishment approach, but a strong emphasis on cyber security is a priority. Key Words: Pakistan, Cyber Deterrence, Nuclear Deterrence, Cyber Threats, Cumulative deterrence. Syed Ahmed Ali has graduated in Strategic Studies from National Defense University, Islamabad. Nasir Mehmood is professor of Strategic Studies at the National Defense University, Islamabad. 118 Conceptualising Cyber Deterrence and Policy Options for Pakistan",
    "keywords": [
      "Pakistan",
      "Cyber Deterrence",
      "Nuclear Deterrence",
      "Cyber Threats",
      "Cumulative deterrence"
    ],
    "publication_dates": {},
    "identifiers": {
      "doi": [
        "10.2307/2009945",
        "10.1080/01495933.2017.1361202",
        "10.1016/j.orbis.2016.05.009",
        "10.1007/s11023-017-9446-1",
        "10.55540/0031-1723.2222",
        "10.1080/01402390.2015.1115975",
        "10.1080/13523260.2012.659593"
      ],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "https://doi.org/10.2307/2009945",
        "https://www.nato.int/docu/review/articles/2015/04/20/deterrence-what-it-can-and-cannot-do/index.html",
        "https://doi.org/10.1080/01495933.2017.1361202",
        "https://doi.org/10.1016/j.orbis.2016.05.009",
        "https://www.economist.com/asia/2019/11/01/a-cyber-attack-on-an-indian-nuclear-plant-raises-worrying-questions",
        "https://www.nytimes.com/2017/03/14/opinion/why-our-nuclear-weapons-can-be-hacked.html",
        "https://ccdcoe.org/incyder-articles/g7-recognises-emerging-challenges-of-responsible-state-behaviour",
        "https://doi.org/10.1007/s11023-017-9446-1",
        "https://europeanleadershipnetwork.org/commentary/russias-basic-principles-and-the-cyber-nuclear-nexus",
        "https://www.redbooks.ibm.com/redpapers/pdfs/redp4397.pdf",
        "https://maritime-executive.com/editorials/the-cyber-vulnerability-of-the-us-navy",
        "https://doi.org/10.55540/0031-1723.2222"
      ]
    },
    "references_block_count": 0,
    "references_entries_estimated": 0,
    "heading_count": 9,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 28,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 0.2857142857142857,
      "footnote_coverage": 1.0,
      "unique_index_count": 14
    },
    "footnotes_quality": {
      "intext_total": 8,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 0.125,
      "footnote_coverage": 0.0,
      "unique_index_count": 4,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "superscript",
      "recommended_style": "superscript",
      "aligned": true,
      "signals": {
        "superscript_hits": 28,
        "superscript_definition_lines": 14,
        "numeric_bracket_hits": 0,
        "numeric_endnote_lines": 0,
        "author_year_hits": 0
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 43.0,
      "dominant_bib_coverage_rate": 0.32558139534883723,
      "dominant_link_target": "footnotes",
      "dominant_unresolved_flag": "unresolved_footnote_links"
    },
    "heading_validation": {
      "heading_count": 9,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": false,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": false,
        "emails": false,
        "orcids": false,
        "abstract": true,
        "keywords": true,
        "venue": false,
        "persistent_identifier": true,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 2,
        "affiliations": 0,
        "emails": 0,
        "orcids": 0,
        "keywords": 5,
        "doi": 7,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 12
      },
      "coverage": {
        "core_coverage": 0.8333333333333334,
        "email_author_link_rate": 0.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [],
        "toc_dot_lines": 0
      },
      "flags": []
    },
    "flags": [
      "missing_preceding_text",
      "low_bib_coverage",
      "footnotes_bucket_unresolved",
      "missing_reference_heading"
    ]
  },
  "updated_at_utc": "2026-02-14T08:26:49.180549+00:00"
}