{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\9XQCHID6\\Hoem and Kristiansen - 2022 - Small players in a limitless domain cyber deterrence as small state strategy.pdf",
  "custom_id": "140",
  "response": {
    "id": "batch-b6235e9e-141-f7b5fde2-1083-4cfe-8764-f1b719507db4",
    "custom_id": "140",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "COMPARATIVE STRATEGY\nAN INTERNATIONAL PROGRAM\nCOMPARATIVE STRATEGY\nINFORMATION\n\nComparative Strategy\n\nRoutledge Taylor &amp; Francis Group\n\nISSN: 0149-5933 (Print) 1521-0448 (Online) Journal homepage: www.tandfonline.com/journals/ucst20\n\n# Small players in a limitless domain: Cyber deterrence as small state strategy\n\nMarius Kristiansen &amp; Njaal Hoem\n\nTo cite this article: Marius Kristiansen &amp; Njaal Hoem (2022) Small players in a limitless domain: Cyber deterrence as small state strategy, Comparative Strategy, 41:1, 19-31, DOI: 10.1080/01495933.2021.2017740\n\nTo link to this article: https://doi.org/10.1080/01495933.2021.2017740\n\nPublished online: 02 Feb 2022.\n\nSubmit your article to this journal\n\nArticle views: 708\n\nView related articles\n\nView Crossmark data\n\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=ucst20",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2314,
              "width": 1762
            }
          },
          {
            "index": 1,
            "markdown": "# Small players in a limitless domain: Cyber deterrence as small state strategy\n\nMarius Kristiansen, Njaal Hoem\n\n## Abstract\n\nThis article explores deterrence as an element in cybersecurity strategy from a small state perspective. The cyber domain presents novel challenges for strategy makers, and applying deterrence in the cyber domain requires an organized and multinational approach -- since few states can leverage deterrence in this all-encompassing domain on their own. Deterrence has been an important factor in shaping global security for half a century, but when applied to the cyber domain there are certain inherent mechanisms that must be understood in order to generate the desired effects. Key issues discussed are the volume of agents capable of operating and creating effects in the domain, and the availability of tools and techniques. These issues concerning actors and vectors makes it difficult to survey threats and create targeted deterrence. Furthermore, the cyber milieu makes it difficult to connect action to motives, thereby further complicating any attempt to analyze the actual importance of observable effects. From a strategist's point of view, these general characteristics are exacerbated by the fact that the international community does not have a common language or shared platform to uniformly approach these issues. Absent clarity on some fundamentals the core issues of attribution and proportionality becomes a hindrance to effective deterrence.\n\n## Introduction: A new domain -- for better and for worse\n\nGlobal connectivity is ever increasing,1 and our personal and social lives have become dependent on- and intertwined with the technological progress.2 Similarly, on the societal and nation-state level, we have far surpassed the point where electronic communication services (ECS) shifted from ancillary to pivotal. In Norway, ECS is on the top of the list of “critical public focus areas” -- deemed necessary to ensure the sustainment of “critical societal functions.”3 Access to the Internet, and by extension “the web” or “cyberspace”, undoubtedly offers historically unprecedented possibilities but also creates dependencies, and widespread dependence on the cyber domain at all levels of society and the state expose new challenges and vulnerabilities.4 And the flip side is grim.\n\nThe military and strategic community has already defined a “cyber domain,”5 and thus acknowledged that this is an arena also for strategic competition and for war.6",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 2,
            "markdown": "This is a globally recognized “truth”, and the cyber domain is increasingly becoming militarized. But the cyber domain is something “different.” While it is the fastest growing dimension of modern warfare, it is also the most obscure.\n\nWhen Norway signed the NATO “Cyber Defence Pledge” it was one of many markers for the increasing political and military acknowledgement that the cyber domain may represent one of the biggest gaps in existing security theory and strategy.\n\nThe domain is practically unregulated and unpoliced, and therefore highly unpredictable. The UN Secretary General has called out for the need to regulate warfare in the cyber domain, and the UN has on several occasions underlined the pressing need for common guidelines. Despite the fact that the global community, since the turn of the millennium, slowly but steadily has moved toward an acceptance of the applicability of international law (and the Charter of the United Nations) for states' actions in the cyber domain, we are still far from a consensus on what should be regulated and how.\n\nKeeping pace with the development in this “lawless” domain requires dedication, but also immense resources invested -- making the full utilization of cyber as a state-tool only obtainable by major powers. This logic has motivated some to argue that the current state of cyber is at “... the same stage of intellectual development as we were in the 1950s in relation to possible nuclear war.” The extension of the same logic has led several authors to argue that deterrence might be a navigable path toward strategic success in the cyber domain. In a global security perspective nuclear deterrence has undoubtedly played a pivotal role in shaping states' behavior on the international arena since 1945. If the same conceptions can be used to shape behavior in the digital space, it would have great global impact. Identifying how this can be done, and generally how the cyber domain can and should be regulated, is a task that affects us all. But, for high-tech small states where technology sets the agenda for all parts of state and society, it is critical.\n\nThe intention with this article is to outline some of the more prominent possibilities and challenges tied to cyber deterrence as part of a cybersecurity strategy. The authors argue that the ability to generate real cyber-deterrence depends on the establishment and accountability of a multinational and multi-departmental/sectorial cyberorganization. As will become evident in the following, both classical and extended deterrence theory are predicated on certain criteria, which do not easily translate to the cyber domain. The authors argue that these challenges make it more difficult, but perhaps even more important to identify how to generate deterrence in the cyber domain -- especially for high-tech small states, like Norway.\n\nCoping with this in an effective way presupposes that one looks at the width of deterrence theory over time, and small states must acknowledge their weaknesses and play to their strengths. The recommendations proposed are opening moves to do just that, and at the same time prepare to exploit complimentary effects of different dimensions of cyber-deterrence in the long run.\n\n## Deterrence: The concept\n\nConceptually, deterrence can be described as using “...the threat of punishment, or increasing expected costs of an activity, to prevent an actor from taking an action",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 3,
            "markdown": "they might otherwise take.” A traditional perception of deterrence as part of security strategy is that it involves influencing one or more actors' intentions. Three preconditions must be present for effective deterrence. Firstly, there must exist a real capability -- the ability to effectuate actions toward an adversary. Second, the threat must be credible -- the will to effectuate actions must not be questionable. And lastly, one must be able to communicate effectively -- ensuring that the message is clearly communicated to all relevant parties.\n\nWhen operationalized, there are four types of deterrence strategy. The two first are oftentimes referred to as “classical deterrence”, while the latter two are part of what has been dubbed “broad deterrence.” The first strategy has is deterrence by punishment. The second is deterrence by denial. Det third is deterrence by entanglement. The fourth is deterrence by norms. The desired deterrent effect is achieved when one has established the perception in a cost-benefit calculation that there is a real risk of disproportional consequences for actions that violates normative and/or stated premises. Security strategy based upon deterrence therefore depends on maintaining a perception of the ability and will to effectuate such consequences at all times.\n\nDeterrence is typically a superpower/major power strategical behavior. It is not excluded for small states, but within “classical deterrence” it is close to impossible for small states to unilaterally generate the necessary capability and credibility. States like Norway depend on security cooperation to achieve this. Small states are more likely to generate a degree of deterrence within the framework of “broad deterrence”, but this often depends on the existence of a universal normative baseline -- widely known and communicated. With perhaps the exception of deterrence by entanglement, small states are thus largely dependent on other actors to achieve any relevant deterrent effect.\n\nThere are in principle three main reasons why deterrence strategies fail. The first is that communicated consequences are not real. The second is when it is possible to avoid/circumvent the consequences because an actor exploits earlier unidentified loopholes. The third is when it is challenging, or impossible, to clearly communicate the message to the relevant actors. These factors might seem simple, but credible deterrence has proven difficult enough even with “only” four dimensions of warfare and security strategy. To generate credible deterrence in the fifth dimension -- cyber -- can prove difficult, for a multitude of reasons.\n\n## Cyber-deterrence challenges\n\nCyber-deterrence can be defined as:\n\n> [...] a strategy by which a defending state seeks to maintain the status quo by signaling its intentions to deter hostile cyber activity by targeting and influencing an adversary's decision making apparatus to avoid engaging in destructive cyber activity for fear of a greater reprisal by the initial aggressor.\n\nLogically, all classes of deterrence theory should be domain-independent, and dependent on the three same criteria. However, an important difference between traditional deterrence and cyber-deterrence is that the latter seems to require a more coherent effort from both state and society. Cyber-threats are not only directed toward the state proper, but also other actors whose security nonetheless is pivotal to the security of",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 4,
            "markdown": "society at large. The nature of the cyber domain also creates very specific challenges that also makes it difficult to meet all the criteria across the width of the different strategies.\n\n### Actors and vectors\n\nIn contrast to other domains, there is an almost infinite number of actors that can influence the security situation in the cyber domain -- both directly and indirectly. This is largely due to the share number and accessibility of “vectors” in the digital space. In simple terms, a “vector” can be defined as: “... a specific method or technique to access equipment, computers, or systems to deliver hostile payload for a malicious outcome.”\n\nThe number of vectors, the complexity they represent, and the level of refinement increases daily. What seems like an almost exponential increase in this area permits a number of actions that are (1) challenging to detect and protect against, and (2) of a character that makes them difficult to define from a security perspective. The effects of the vectors span wide; from service-denial to manipulation and/or even destruction of data. The accessibility and design of vectors makes it possible for almost “anyone” with access to the Internet to influence the security situation in the cyber-domain. Actors ranging from nation states to organized groups and individuals acting alone can all create undesired effects.\n\nThe combination of the overwhelming number of vectors and possible actors makes it particularly demanding to generate deterrence in the digital space. This is primarily due to the large range of potential security-threats making it difficult to map up what to protect against and how, and it becomes increasingly difficult to respond to each individual infringement. Techniques and procedures to handle individual challenges are short-lived, and the security landscape is dynamic. Further, the credibility of traditional deterrence is undermined by the capability to address a large number of actors with different modus operandi. The number of actors is not necessarily a challenge for “broad deterrence” per se, but there are no recognized international norms in place, and the width of potential actors makes it difficult to charter where, how and to what extent mutual dependence caters to deterrence by entanglement.\n\n### Multitudes of motives\n\nThe motivation for different actors' actions is also muddying the water. The motives span from large state actors' strategic objectives of global or regional character, to organized groups or individuals' actions for short-term financial gains or prestige. This means that the threat from the cyber-domain has an impact on all sides and levels of society. At the same time, the different motives and threat-actors are not always as independent as they can seem -- isolated “random” and “non-critical” actions can be part of a more deliberate and intricate cyber-operation. Even though individual effects are possible to identify and quantify, it is extremely difficult to identify the motivation behind each action, and whether multiple actions must be seen in relation. Thus, it also becomes difficult to assess how each (or all) incidents should be handled.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 5,
            "markdown": "Due to how these different (or indeed connected) motives are expressed in actions, inefficient cooperation and conflicts of interest will most likely arise between relevant actors -- whose cooperation and comprehensive efforts are crucial to cope with the conglomerate of threats in the cyber domain. Inter-state this might be due to the inability to see the correlated patterns of isolated incidents, because actors are unwilling to share information due to national security concerns -- or simply because one does not know what information to share. But even intra-state one is highly likely to experience conflicts of interest that undermine the comprehensive approach, which effective cyber deterrence requires. Commercial actors may be unwilling to share relevant data with state agencies in fear of lost confidentiality and customer trust, which in turn may affect revenue. The state itself may not want to share their data, methods and techniques with commercial actors, as this may reveal capabilities and vulnerabilities. The sum of these mechanisms means that it becomes incredibly difficult to attain a good situational awareness and understanding of the problem-complex, and therefore a comprehensive approach almost unattainable.\n\nWhen one combines the challenges of multitudes of motives with the dynamic of vectors and actors, it is quite obvious that the cyber-domain represents an incredibly complex and dynamic security-challenge. Effective handling of incidents requires an understanding of the context, to ensure that efforts and resources are prioritized where relevant effects can be achieved. This requires cooperation. A minimum to ensure credibility of cyber deterrence is a level of transparency -- as basis for collective efforts -- between actors that can be reasonably defined as part of the same target-complex.\n\n### Attribution and proportionality\n\nA basic premise for deterrence is the ability to identify who has committed the actions one is seeking to deter. As of now, there are no common and widely recognized method to ensure a definitive attribution of actions in the cyber domain. This is largely due to the multitude of actors and the difficulty of discerning the difference between who are the “tools” and who are the “brains”, but the most important factor is that many vectors have technical properties that prevent attribution. This means that clever actors can operate with very little risk; “...the technical properties of cyber-attack vectors that prevent attribution allow actors with near anonymity and impunity.”\n\nThe challenge of attribution can be divided in two categories: technical attribution and human attribution. To put it simply, technical attribution is a question of analyzing and identifying the vector and the node used. Human attribution often leans on technical attribution and collates this with other available information to identify who committed the action (the “tool”), and who sponsored or motivated the actions (the “brains”).\n\nFrom the side of the defending part, and especially small states, the question of attribution is extremely important. As a minimum, accurate attribution is a necessity to identify against who and what to protect in the future. Attribution is even more important when assessing whether and how to respond. This is equally important for all actors, but especially if one hopes to trigger a response from international organizations intended to manage global or regional security -- who are often the only real",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 6,
            "markdown": "security-guarantors for small states. The U.S. have vindicated that they will respond toward threats in the cyber domain like they would in any other domain, and in 2016 the NATO Secretary General declared that major cyberattacks could activate a reaction from the Alliance. Still, it must be presumed that the target of the attack (and its allies) bears the burden of evidence if such provisions shall be activated.\n\nIn the cases where accurate attribution is possible, the next challenge is a proportional response. Again, there are no universally recognized international guidelines on how the principle of proportionality is to be managed in cyber space. At the most basic level it is a question of whether the response should take place in the same domain as the initial action. Defining where the threshold for response should be is equally important. These are questions NATO has already acknowledged, but there are significant differences of opinion within the Alliance -- as evidenced after the cyberattacks against Estonia in 2007. Estonian decision-makers interpreted the situation as a clear-cut cause to invoke NATO Article V, while the NATO leadership was not of the same opinion.\n\nThe challenges associated with attribution and proportionality obviously undermines the credibility of any deterrence-strategy, and at the same time the targeted state's credibility in more absolute terms. A response that is not seen as proportional or directed toward the wrong actor can have genuine consequences. The worst outcome is perhaps that it can cause an unintended escalation of a conflict that may not have been real or as grave as it was perceived. In some instances, reactions can be provoked by cyber-manipulation from an actor whose interests are served by creating/increasing tensions between the two parties. This is what one may call strategic exploitation of the challenges tied to attribution. Since the credibility of a state's overarching security policy is dependent on its ability to meet any and all cyberattacks with a proportional response, one is faced with a security policy-paradox; even though the state feels obliged to respond in order to maintain own credibility -- any response toward the wrong actor, or retaliations outside what is normatively seen as proportional, will have the opposite effect.\n\nFrom the perspective of a small state the question of attribution and proportionality therefore becomes especially important -- as their security is dependent on international support. These questions hamper the abilities to create coherent national security strategies, which presupposes clarity in what allied support can be expected when. This, in turn, has an explicit consequence for communicating effectively that deterrence relies on. As long as there is ambiguity tied to these questions, it creates and enormous room for maneuver for a potential attacker.\n\n### Lack of a shared conceptual foundation\n\nDespite all the challenges above, the most basic issue with the cyber-domain is the lack of a shared conceptual foundation to address the problems in question. Absent a shared terminology, procedures, and international judicial precedence it is difficult to establish effective deterrence. There are still major disputes between the large actors on simple issues such as terminology, and the meaning of concepts and terms. While the U.S. utilizes the term “cyber-security”, China and Russia have decided on “information-security.” This is more than a semantic discussion, as it directly influences the prerequisites for effective and clear communication:",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 7,
            "markdown": "Without a common lexicon in place, communication between the two sides is fated to remain in disagreement [...]. [W]hen addressing hostile activities in cyberspace where the actors are foreign to each other, the inability to communicate further impedes the ability to send clear messages and deescalate tensions.”\n\nA complete agreement on terminology is perhaps utopian, but a minimum is necessary to address the most prevalent challenges. There have been many attempts to achieve this. The European initiative -- The 2001 Council of Europe's Convention on Cybercrime -- gives a short but precise description of the most important terminology needed in the cyber-domain. However, there are only about forty states that have actually ratified the convention, with Russia and China being the biggest actors who have chosen to refrain.\n\nAnother initiative was the establishment of NATO Cooperative Cyber Defence Center of Excellence in 2008, which aimed to handle principle questions regarding the defense of the alliance in the digital space. In the period between 2013-2017, the organization produced two editions of a manual intended to describe how NATO should deal with issues such as judicial questions in an international context. The manual also addresses whether and how actions in the cyber-dimension can be characterized as armed attack, although this definition deviates from the description given in NATO's Policy on cyber Defense. This dissonance only serves to underline the difficulties of establishing a shared conceptual framework -- even within the Alliance.\n\nRunning in parallel with the internal NATO processes, NATO has also been a promoter for establishing global norms and regulations. As mentioned in the introduction, this has been on the international agenda for a long time. Yet, there is still international disagreement on whether (and if so -- how) for instances international humanitarian law should apply in a cyber-conflict. Simple, but crucial, questions such as what can be seen as aggression in accordance with the UN Charter for cyber space has not been resolved either. With such questions it also seems apparent that some actors find it in their interest that the ambiguity remains: “Since the domain allows room to operate offensively below the threshold of what is seen as an armed attack, such operations can influence the power balance through stealing other states' intellectual property, or threaten infrastructure in a relevant state in peacetime”\n\nLacking regulation in the cyber-domain hampers the ability to define what constitutes breach of norms, what is the threshold for legitimate response, and what a legitimate response is -- thereby making it excessively difficult to communicate effectively and clearly to potential attackers. The lack of clarity in this regard also opens up for already identified actors to attempt cyber-brinkmanship -- pushing it as far as they can while at the same time circumvent or avoid retribution because the legality and legitimacy of the response from any “victim” might be questioned. This undermines cyber-deterrence in general, but especially strategies based on deterrence by norms.\n\n## Cyber-deterrence strategy\n\n“The emergence of cyber as a separate domain of warfighting does not necessarily offer magic solutions and miraculous short-cuts to achieve strategic goals.”",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 8,
            "markdown": "terrence as an overarching strategy is nothing new. Nuclear-deterrence was a response to a significant upheaval in the reality of global security policy -- not unlike (some would argue) the cyber-driven upheaval we are experiencing today. Therefore it is not unnatural that one attempts to draw parallels between known and tested strategies for nuclear-deterrence and cyber-deterrence. At the same time, it is important to be cognizant of the differences, and some have even gone as far as claiming that “...despite some crossover, there are too many inconsistencies that prevent an even partial adoption of the nuclear deterrence model.”\n\nThe four “problem areas” described above makes it difficult for any state with ambitions of deterrence in the cyber domain to satisfy the necessary preconditions for effective deterrence. Generally speaking, to get closer to creating real deterrence in the cyber-domain requires clarifications in several areas where there are currently too many unexplored variables and underdeveloped concept that undermines efficiency. This becomes most evident for the classical forms of deterrence, and especially deterrence by punishment, which requires absolute clarity in many of the above issues to be implemented. It might be relatively easier to establish the necessary preconditions for deterrence by denial, deterrence by entanglement, and deterrence by norms in a shorter time span.\n\nDeterrence by entanglement is an approach that might actually exploit what is normally seen as the main challenges in the cyber domain. The increasingly interconnectedness of actors (states, organizations, individuals) creates more potential vulnerabilities, but it can also make it more difficult to conduct offensive cyberoperations without causing collateral damage. By strengthening the emergence of virtual globalization, one can theoretically reduce the risk propensity of a would-be aggressor: “By more thoroughly entangling both friend and fore the aggregate benefits for maintaining and enhancing good behavior within the cyberspace increase and reinforce risk averse behaviors.” For small states, this might be the more attractive path, because it does not require parity in offensive and defensive cyber capabilities to have an effect. By creating stronger mutual dependence with partners and allies in the cyber domain, one can also effectively generate a situation where common defensive cyber capabilities are in everyone's interest, and thereby also corroborate a shared (Allied) deterrence by denial.\n\nHowever, for small states even situations of “entanglement” will often be highly asymmetrical, and unlikely to be a sufficient measure for efficient deterrence. Small states usually have a relatively weak position in the international system, but nonetheless have an opportunity to influence the norms for what is considered acceptable interaction between states -- and through this, to some degree, even out the imbalance of “hard power.” This acknowledgement is one of the reasons small states' security-strategies tend to focus on “idealistic and norm-oriented policy” with the aim of strengthening international institutions, norms and laws. To some extent, major powers will always operate according to the principle “might is right”, also outside established frameworks, but still risks being held accountable in accordance with these frameworks. The implications for states seen “in breach”, may be loss of legitimacy and support -- or sometimes more tangible reactions of e.g. economic nature. By working toward establishing and strengthening a normative framework for behavior",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 9,
            "markdown": "in the cyber domain, one might be capable of generating real deterrence by norms. Such a framework would also constitute a viable “objective” basis to legitimize deterrence by punishment.\n\nTo establish effective frameworks for deterrence in the cyber-domain requires a collective effort, and the current staring point is not the best. But it is the only one we have. A smart first step might be to concretize the efforts through establishing a structure or organization whose purpose is to regulate cyber-behavior -- which in turn might enable cyber-deterrence to a larger degree, and in a more systematic manner. Such an organization should ideally find its basis in existing security cooperation and alliances but should not exclude a wider community of interest. Although we might think of a grander scale when it comes to cyber, the logic of the British Fighter Command gives an idea of how this could be structured. Without going into further details of how such an organization should/could be set up, it seems pertinent to comment that a “unified command” would form a better basis for any form of deterrence strategy. By tying the major powers to such an amalgamation of stake holders, it would also be possible to generate the capability necessary for all deterrence strategies -- something that would be impossible for small states outside such an organization.\n\nParticipation in the organization would also balance small states' norm-focused policies with what might be seen as an strengthening of alliances that to a larger degree also can serve as guarantors for concrete national interest in the short term. A balance between the apparently idealistic and very real alliances is an approach already well-known form Norwegian policy, strategy and doctrines. Such a divided focus might seem as contradictory, but is a quite rational choice. Empiricism tells us that that international laws and norms have limited value when conflict erupts between small and major states. Alliances and international normative frameworks thus become complimentary tools; where the former ensures that actors (through the threat of force) can be held accountable to the latter.\n\nA modern Fighter Command -- or Unified Cyber Command -- must also be granted authority to make decisions that commits participating states, and there-through regulates behavior both between members internally -- and between the organization and the international society at large. The organization would play a major role in establishing the premises for international cyber behavior and thereby by an important actor in the forming of norms. As such, the establishment of a Unified Cyber Command would serve both the need for short term security and the wish for a better regulated cyber-domain in the long term. This would also be complimentary and mutually reinforcing efforts, where a Unified Cyber Command can strengthen the establishment of normative frameworks -- which in turn forms a stronger basis for how the Unified Cyber Command acts in the domain. Put differently; a Unified Cyber Command might form a viable basis for classical deterrence, while it may also be an important agent in forming the framework needed for deterrence by norms.\n\n## Conclusion: Implications for small states\n\nBased on the challenges and possibilities that exist in the cyber-domain, and the options deterrence-theory offers, what should small states like Norway do? Firstly, one",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 10,
            "markdown": "must acknowledge the inherent limitations of small states -- also in the cyber-domain. Cyber-security is a demanding task, and it is reasonable to assume that the highest effects can be achieved together with others. Secondly, we see it as well substantiated that deterrence has a place in cyber-security strategy, if one does not see the different deterrence strategies as mutually exclusive but complimentary. Norway may very well entertain several lines of operations to achieve more robust deterrence. Thirdly, it is important to start immediately to explore how one can establish a coherent strategy for realizing true deterrence in the cyber-domain -- both in the short and the long term. Whether ideas like a modern Unified Cyber Command are realistic or practical are difficult to discern before one starts to explore the array of opportunities.\n\nAs the situation now stands, cyberattacks of varying sorts represents an extension of the classical kinetic conflict, but with attractive qualities such as plausible deniability. Our assessment is that it is important to start a grander initiative before the isolationist urge behind proverbial firewalls and security-measures, the search for profit, or the fear of being tricked increases the threshold even higher. For small states, like Norway, it is significant to realize what major powers like the US has already recognized as a necessity; establishing an internationally recognized, cross-sectorial cross-departmental organization, that also includes private actors -- with the responsibility of regulating the cyber-domain for the common good. Without such an initiative, the world will soon find itself at the edge of a cliff (if we are not already there), with an excellent view over a anarchistic cyber-landscape eating away on the solid foundation we now stand on -- as the cyber-domain becomes ever more dominant in all aspects of our interactions. A landscape paved with good intentions, where individual actors have done their best to create order from chaos, but thereby paradoxically contributing to its character of contradictory policies, rules and expectations. This landscape allows regional or even global conflicts to be instigated by the mere pushing of a few buttons. It should not be necessary with a cyber-equivalent of Operation Centerboard before we step up to the task.\n\n## ORCID\n\nMarius Kristiansen http://orcid.org/0000-0002-6966-3553\n\nNjaal Hoem http://orcid.org/0000-0001-6468-0111\n\n## Notes\n\nDavid Kilcullen, Out of the Mountains (New York: Oxford University Press, 2013), 107.Tor Olav Grøtan, “SAMRISK-II: New Strains of Society—Hidden, Dynamic and Emergent Vulnerabilities,” LUFTLED - Luftmakttidsskrift 2 (2018): 26--30.Directorate for Civilian Security and Readiness, Rapport: Sikkerhet i kritisk infrastruktur og kritiske samfunnsfunksjoner—modell for overordnet risikostyring [Report: Security within critical infrastructure and critical functions for the society—Model for overall risk management] (Tønsberg: DSB, 2012), 24.National Intelligence Service, Fokus 2018: Etterretningstjenestens vurdering av aktuelle sikkerhetsutfordringer [Focus 2018: The National Intelligence Service annual assessment of relevant security challenges] (Oslo: ETJ, 2018), 31.Norwegian Department of Defense, Forsvarsdepartementets retningslinjer for informasjonssikkerhet og cyberoperasjoner i forsvarssektoren [Norwegian DOD's guidelines for information",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 11,
            "markdown": "security and cyberoperations within the defense sector] (Oslo: Forsvarsdepartementet, 2014), 4.\n6. James Jay Carafano, “America's Joint Force and the Domains of Warfare, 2018 Index of U.S. Military Strength,” 2017, https://www.heritage.org/sites/default/files/2017-09/2018_IndexOfUSMilitaryStrength_CARAFANO.pdf.\n7. NATO, “Cyber Defence,” 2018, https://www.nato.int/cps/en/natohq/topics_78170.htm.\n8. Norwegian Joint Staff, Forsvarets fellesoperative doktrine [The Norwegian Armed Forces Joint Doctrine] (Oslo: Forsvarsstaben, 2014), pkt 05077.\n9. NATO, “NATO Cyber Defence Pledge,” 2016, https://www.nato.int/cps/en/natohq/official_texts_133177.htm.\n10. Owen Bowcott, “Dispute Along Cold War Lines Led to Collapse of UN Cyberwarfare Talks,” Guardian, August 23, 2017, https://www.theguardian.com/world/2017/aug/23/un-cyberwarfare-negotiations-collapsed-in-june-it-emerges;Michael Beaver, “The United Nations and Cyberwarfare,” in Cybersecurity, 2016.\n11. Andrei Kalip, “UN Chief Urges Global Rules for Cyber Warfare,” Reuters, February 19, 2018, https://www.reuters.com/article/us-un-guterres-cyber/u-n-chief-urges-global-rules-for-cyber-warfare-idUSKCN1G31Q4.\n12. United Nations, UN Doc.57/239. Creation of a Global Culture of Cybersecurity, 2003, https://digitallibrary.un.org/record/482184?ln=en; United Nations, UN Doc. A/RES/58/199. Creation of a Global Culture of Cybersecurity and the Protection of Critical Information Infrastructures, 2004, https://digitallibrary.un.org/record/509571?ln=en; United Nations, UN Doc. A/RES/64/211. Creation of a Global Culture of Cybersecurity and Taking Stock of National Efforts to Protect Critical Information Infrastructure, 2010, https://digitallibrary.un.org/record/672141?ln=en; United Nations, UN Doc. A/RES/70/174. Thirteenth United Nations Congress on Crime Prevention and Criminal Justice, 2016, https://digitallibrary.un.org/record/816763?ln=en ; United Nations, UN Doc. A/RES/71/28. Developments in the Field of Information and Telecommunications in the Context of International Security, 2016, https://undocs.org/A/RES/71/28.\n13. Bowcott, “Dispute Along Cold War Lines.”\n14. Simon Tisdall, “Cyber-Warfare Is Growing Threat,” Guardian, February 3, 2010, https://www.theguardian.com/technology/2010/feb/03/cyber-warfare-growing-threat.\n15. Joseph S. Nye, Jr. “Deterrence and Dissuasion in Cyberspace,” International Security 41, no. 3 (2016/17): 44--71.\n16. Leo Blanken, “Deterrence” in Deterrence in Gangs and Guerrillas: Ideas From Counterinsurgency and Counterterrorism, ed. Michael Freeman and Hy Rothstein (Monterey, Calif.: Naval Postgraduate School, 2011).\n17. T. C. Schelling, Arms and Influence: With a New Preface and Afterword (New Haven, Conn.: Yale University Press, 2008), 35.\n18. Scott Jasper, “Deterring Malicious Behavior in Cyberspace,” Strategic Studies Quarterly (2015): 65, http://www.au.af.mil/au/ssq/digital/pdf/Spring_2015/jasper.pdf.\n19. Jasper, 65.\n20. Nye, “Deterrence and Dissuasion.”\n21. J. J. Mearsheimer, Conventional Deterrence (Ithaca, N.Y.: Cornell University Press, 1983), 14--15, https://books.google.no/books?id=lNwZDgAAQBAJ&printsec=frontcover&dq=conventional+deterrence&hl=no&sa=X&ved=0ahUKEwjI_K-fr9jZAhWGDuwKHYzmD8cQ6AEIKDAA#v=onepage&q=conventionaldeterrence&f=false.\n22. Mearsheimer, 14--15.\n23. Robert O. Keohane and Joseph S. Nye, Jr. Power and Interdependence: World Politics in Transition (Boston: Little, Brown, 1977).\n24. Nye, “Deterrence and Dissuasion.”\n25. Schelling, Arms and Influence, 35--49.\n26. NATO has traditionally used four dimensions for warfare (air, land, sea, and space), but has incorporated cyberspace as the fifth dimension. See, for example, Pierluigi Paganini,",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 12,
            "markdown": "M. KRISTIANSEN AND N. HOEM\n\nNATO Officially Recognizes Cyberspace as a Warfare Domain, 2016, https://www.securityaffairs.co/wordpress/48484/cyber-warfare-2/nato-cyberspace-warfare-domain.html.\n\n27. Emilio Iasiello, “Is Cyber Deterrence an Illusory Course of Action?” Journal of Strategic Security 7, no. 1 (2014): 54, 55.\n\n28. Directorate for Civilian Security and Readiness, Rapport, 24.\n\n29. Jasper, 61.\n\n30. Jasper, 62.\n\n31. Jasper, 78.\n\n32. Iasiello, 54, 55.\n\n33. Larry Clinton, “Cyber Security Social Contract,” in Conflict and Cooperation in the Global Commons: A Comprehensive Approach for International Security, ed. Scott Jasper (Washington, D.C.: Georgetown University Press, 2012), 185–98.\n\n34. Emilio Iasiello, “Identifying Cyber-Attackers to Require High-Tech Sleuthing Skills,” National Defense Magazine (December 2012), https://www.nationaldefensemagazine.org/articles/2012/12/1/2012december-identifying-cyberattackers-to-require-hightech-sleuthing-skills.\n\n35. Jasper, 62.\n\n36. Earl W. Boebert, “A Survey of Challenges in Attribution, NRC Proceedings” in Proceedings of a Workshop on Deterring Cyberattacks: Informing Strategies and Developing Options for U.S. Policy, 2010, https://www.nap.edu/read/12997/chapter/5#43.\n\n37. Reuters, “Massive Cyber Attack Could Trigger NATO Response: Stoltenberg,” June 15, 2016, https://www.reuters.com/article/us-cyber-nato/massive-cyber-attack-could-trigger-nato-response-stoltenberg-idUSKCN0Z12NE.\n\n38. NATO, “Cyber Defence.”\n\n39. Sverre Diesen, FFI rapport 18/00080: Lavinitensitet hybridangrep på Norge i en fremtidig konflikt [Low-intensity hybrid-attacks in Norway in future conflicts] (Oslo/Kjeller: FFI, 2018), 25.\n\n40. Iasiello, “Is Cyber Deterrence an Illusory Course of Action?” 54, 57.\n\n41. Iasiello, 54, 57.\n\n42. Iasiello, 54, 57.\n\n43. NATO Cooperative Cyber Defence Centre of Excellence, “History,” 2018, https://ccdcoe.org/history.html.\n\n44. NATO Cooperative Cyber Defence Centre of Excellence, “Tallinn Manual 2.0 on the International Law Applicable to Cyber Operations,” 2017, https://ccdcoe.org/sites/default/files/documents/CCDCOE_Tallinn_Manual_Onepager_web.pdf.\n\n45. Jasper, 68.\n\n46. Jasper, 68.\n\n47. NATO, “Cyber Defence.”\n\n48. Jeffrey Carr, Inside Cyber Warfare: Mapping the Cyber Underworld (Boston: O’Reilly Media, 2011), 31.\n\n49. Authors’ own translation from Norwegian in Stig Tore Aannø, Strategisk avskrekking i det digitale rom—Finnes det rasjonelle strategier for små stater? [Strategic deterrence in the digital space—Do rational strategies exist for small states?] (Oslo: Forsvarets høgskole, 2011), 62.\n\n50. Sven Sakkov, “Foreword” in Cyber War in Perspective: Russian Aggression Against Ukraine, ed. Kenneth Geers (Tallinn: NATO Cooperative Cyber Defence Centre of Excellence, 2015). 9.\n\n51. George H. Quester, Deterrence Before Hiroshima: The Airpower Background of Modern Strategy (New York: Wiley, 1966).\n\n52. Iasiello, 54, 61.\n\n53. Iasiello, 54, 55.\n\n54. Nye, “Deterrence and Dissuasion.”",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 13,
            "markdown": "COMPARATIVE STRATEGY\n\n55. Aaron Brantly, “Conceptualizing Cyber Deterrence by Entanglement,” 2018, http://www.ou.edu/cis/sponsored_programs/cyber-governance-and-policy-center/blog/conceptualizing-cyber-deterrence-by-entanglement.\n56. Anders Kjølberg, Foredrag ved Krigsskolen [In seminar at the Norwegian Military Academy] (Linderud/Oslo: Krigsskolen, 2016).\n57. Klaus Larres, \"Superpowers and International Governance: A 'Might is Right' Story?\" Caucasus International 5 (2015): 2, http://cijournal.az/storage/posts/101/files/Larres.pdf.\n58. John Arquilla, “Deterrence after Stuxnet,” Blog@ACM, 2015, http://cacm.acm.org/blogs/blog-cacm/190371-deterrence-after-stuxnet/fulltext.\n59. Tom Long, \"Small States, Great Power? Gaining Influence Through Intrinsic, Derivative, and Collective Power,\" International Studies Review 19, no. 2 (2016): 1-21.\n60. Norwegian Department of Defense, Prop. 151 S (2015-2016) Proposisjon til Stortinget (forslag til stortingsvedtak): Kampkraft og baerekraft—Langtidsplan for forsvarssektoren [Proposition 151S (2015-2016) Proposition to the Norwegian Parliament (proposal for Parliament decision): Combat capabilities and sustainability—The long term plan for the Norwegian defense sector]. (Oslo: FD, 2015), https://www.regjeringen.no/contentassets/a712fb-233b2542af8df07e2628b3386d/no/pdfs/prp201520160151000dddpdfs.pdf; Norwegian Joint Staff, Forsvarets fellesoperative doktrine.\n61. Roy Allison, \"The Russian Case for Military Intervention in Georgia: International Law, Norms, and Political Calculation,\" European Security 18, no. 2 (2009): 173-200.\n62. Department of Defense, Quadrennial Defense Review (Washington, D.C.: DOD, 2014), 15.\n63. Department of Defense, 15.\n64. Don A. Farrell, *Tinian and the Bomb: Project Alberta and Operation Centerboard* (Pohnpei, Micronesia: Micronesian Productions, 2018).\n\n## Notes on contributors\n\nMarius Kristiansen (markristianse@mil.no) is an active duty Norwegian Army Officer. He has been a member of the Norwegian Armed Forces since 2001, and he has served both in the Norwegian Navy and the Norwegian Army. He holds a BA in Military Leadership and Land Warfare from the Norwegian Military Academy, an Advanced Certificate in Terrorism Studies from the University of St. Andrews in the UK, and an MS in Defense Analysis from Naval Postgraduate School in Monterey, California.\n\nNjaal Hoem (nhoem@mil.no) is an active duty Norwegian Army Officer. He joined the Norwegian Armed Forces in 2003, and has served in the Norwegian Army since. He holds a BA in Military Leadership and Land Warfare from the Norwegian Military Academy, has studied Leadership and Organizational Psychology at BI Norwegian Business School, and holds an MLitt in War Studies from University of Glasgow.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 14,
          "doc_size_bytes": 1160041
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "COMPARATIVE STRATEGY\nAN INTERNATIONAL PROGRAM\nCOMPARATIVE STRATEGY\nINFORMATION\nComparative Strategy\nRoutledge Taylor &amp; Francis Group\nISSN: 0149-5933 (Print) 1521-0448 (Online) Journal homepage: www.tandfonline.com/journals/ucst20\n# Small players in a limitless domain: Cyber deterrence as small state strategy\nMarius Kristiansen &amp; Njaal Hoem\nTo cite this article: Marius Kristiansen &amp; Njaal Hoem (2022) Small players in a limitless domain: Cyber deterrence as small state strategy, Comparative Strategy, 41:1, 19-31, DOI: 10.1080/01495933.2021.2017740\nTo link to this article: https://doi.org/10.1080/01495933.2021.2017740\nPublished online: 02 Feb 2022.\nSubmit your article to this journal\nArticle views: 708\nView related articles\nView Crossmark data\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=ucst20\n# Small players in a limitless domain: Cyber deterrence as small state strategy\nMarius Kristiansen, Njaal Hoem\n## Abstract\nThis article explores deterrence as an element in cybersecurity strategy from a small state perspective. The cyber domain presents novel challenges for strategy makers, and applying deterrence in the cyber domain requires an organized and multinational approach -- since few states can leverage deterrence in this all-encompassing domain on their own. Deterrence has been an important factor in shaping global security for half a century, but when applied to the cyber domain there are certain inherent mechanisms that must be understood in order to generate the desired effects. Key issues discussed are the volume of agents capable of operating and creating effects in the domain, and the availability of tools and techniques. These issues concerning actors and vectors makes it difficult to survey threats and create targeted deterrence. Furthermore, the cyber milieu makes it difficult to connect action to motives, thereby further complicating any attempt to analyze the actual importance of observable effects. From a strategist's point of view, these general characteristics are exacerbated by the fact that the international community does not have a common language or shared platform to uniformly approach these issues. Absent clarity on some fundamentals the core issues of attribution and proportionality becomes a hindrance to effective deterrence.\n## Introduction: A new domain -- for better and for worse\nGlobal connectivity is ever increasing,1 and our personal and social lives have become dependent on- and intertwined with the technological progress.2 Similarly, on the societal and nation-state level, we have far surpassed the point where electronic communication services (ECS) shifted from ancillary to pivotal. In Norway, ECS is on the top of the list of “critical public focus areas” -- deemed necessary to ensure the sustainment of “critical societal functions.”3 Access to the Internet, and by extension “the web” or “cyberspace”, undoubtedly offers historically unprecedented possibilities but also creates dependencies, and widespread dependence on the cyber domain at all levels of society and the state expose new challenges and vulnerabilities.4 And the flip side is grim.\nThe military and strategic community has already defined a “cyber domain,”5 and thus acknowledged that this is an arena also for strategic competition and for war.6\nThis is a globally recognized “truth”, and the cyber domain is increasingly becoming militarized. But the cyber domain is something “different.” While it is the fastest growing dimension of modern warfare, it is also the most obscure.\nWhen Norway signed the NATO “Cyber Defence Pledge” it was one of many markers for the increasing political and military acknowledgement that the cyber domain may represent one of the biggest gaps in existing security theory and strategy.\nThe domain is practically unregulated and unpoliced, and therefore highly unpredictable. The UN Secretary General has called out for the need to regulate warfare in the cyber domain, and the UN has on several occasions underlined the pressing need for common guidelines. Despite the fact that the global community, since the turn of the millennium, slowly but steadily has moved toward an acceptance of the applicability of international law (and the Charter of the United Nations) for states' actions in the cyber domain, we are still far from a consensus on what should be regulated and how.\nKeeping pace with the development in this “lawless” domain requires dedication, but also immense resources invested -- making the full utilization of cyber as a state-tool only obtainable by major powers. This logic has motivated some to argue that the current state of cyber is at “... the same stage of intellectual development as we were in the 1950s in relation to possible nuclear war.” The extension of the same logic has led several authors to argue that deterrence might be a navigable path toward strategic success in the cyber domain. In a global security perspective nuclear deterrence has undoubtedly played a pivotal role in shaping states' behavior on the international arena since 1945. If the same conceptions can be used to shape behavior in the digital space, it would have great global impact. Identifying how this can be done, and generally how the cyber domain can and should be regulated, is a task that affects us all. But, for high-tech small states where technology sets the agenda for all parts of state and society, it is critical.\nThe intention with this article is to outline some of the more prominent possibilities and challenges tied to cyber deterrence as part of a cybersecurity strategy. The authors argue that the ability to generate real cyber-deterrence depends on the establishment and accountability of a multinational and multi-departmental/sectorial cyberorganization. As will become evident in the following, both classical and extended deterrence theory are predicated on certain criteria, which do not easily translate to the cyber domain. The authors argue that these challenges make it more difficult, but perhaps even more important to identify how to generate deterrence in the cyber domain -- especially for high-tech small states, like Norway.\nCoping with this in an effective way presupposes that one looks at the width of deterrence theory over time, and small states must acknowledge their weaknesses and play to their strengths. The recommendations proposed are opening moves to do just that, and at the same time prepare to exploit complimentary effects of different dimensions of cyber-deterrence in the long run.\n## Deterrence: The concept\nConceptually, deterrence can be described as using “...the threat of punishment, or increasing expected costs of an activity, to prevent an actor from taking an action\nthey might otherwise take.” A traditional perception of deterrence as part of security strategy is that it involves influencing one or more actors' intentions. Three preconditions must be present for effective deterrence. Firstly, there must exist a real capability -- the ability to effectuate actions toward an adversary. Second, the threat must be credible -- the will to effectuate actions must not be questionable. And lastly, one must be able to communicate effectively -- ensuring that the message is clearly communicated to all relevant parties.\nWhen operationalized, there are four types of deterrence strategy. The two first are oftentimes referred to as “classical deterrence”, while the latter two are part of what has been dubbed “broad deterrence.” The first strategy has is deterrence by punishment. The second is deterrence by denial. Det third is deterrence by entanglement. The fourth is deterrence by norms. The desired deterrent effect is achieved when one has established the perception in a cost-benefit calculation that there is a real risk of disproportional consequences for actions that violates normative and/or stated premises. Security strategy based upon deterrence therefore depends on maintaining a perception of the ability and will to effectuate such consequences at all times.\nDeterrence is typically a superpower/major power strategical behavior. It is not excluded for small states, but within “classical deterrence” it is close to impossible for small states to unilaterally generate the necessary capability and credibility. States like Norway depend on security cooperation to achieve this. Small states are more likely to generate a degree of deterrence within the framework of “broad deterrence”, but this often depends on the existence of a universal normative baseline -- widely known and communicated. With perhaps the exception of deterrence by entanglement, small states are thus largely dependent on other actors to achieve any relevant deterrent effect.\nThere are in principle three main reasons why deterrence strategies fail. The first is that communicated consequences are not real. The second is when it is possible to avoid/circumvent the consequences because an actor exploits earlier unidentified loopholes. The third is when it is challenging, or impossible, to clearly communicate the message to the relevant actors. These factors might seem simple, but credible deterrence has proven difficult enough even with “only” four dimensions of warfare and security strategy. To generate credible deterrence in the fifth dimension -- cyber -- can prove difficult, for a multitude of reasons.\n## Cyber-deterrence challenges\nCyber-deterrence can be defined as:\n> [...] a strategy by which a defending state seeks to maintain the status quo by signaling its intentions to deter hostile cyber activity by targeting and influencing an adversary's decision making apparatus to avoid engaging in destructive cyber activity for fear of a greater reprisal by the initial aggressor.\nLogically, all classes of deterrence theory should be domain-independent, and dependent on the three same criteria. However, an important difference between traditional deterrence and cyber-deterrence is that the latter seems to require a more coherent effort from both state and society. Cyber-threats are not only directed toward the state proper, but also other actors whose security nonetheless is pivotal to the security of\nsociety at large. The nature of the cyber domain also creates very specific challenges that also makes it difficult to meet all the criteria across the width of the different strategies.\n### Actors and vectors\nIn contrast to other domains, there is an almost infinite number of actors that can influence the security situation in the cyber domain -- both directly and indirectly. This is largely due to the share number and accessibility of “vectors” in the digital space. In simple terms, a “vector” can be defined as: “... a specific method or technique to access equipment, computers, or systems to deliver hostile payload for a malicious outcome.”\nThe number of vectors, the complexity they represent, and the level of refinement increases daily. What seems like an almost exponential increase in this area permits a number of actions that are (1) challenging to detect and protect against, and (2) of a character that makes them difficult to define from a security perspective. The effects of the vectors span wide; from service-denial to manipulation and/or even destruction of data. The accessibility and design of vectors makes it possible for almost “anyone” with access to the Internet to influence the security situation in the cyber-domain. Actors ranging from nation states to organized groups and individuals acting alone can all create undesired effects.\nThe combination of the overwhelming number of vectors and possible actors makes it particularly demanding to generate deterrence in the digital space. This is primarily due to the large range of potential security-threats making it difficult to map up what to protect against and how, and it becomes increasingly difficult to respond to each individual infringement. Techniques and procedures to handle individual challenges are short-lived, and the security landscape is dynamic. Further, the credibility of traditional deterrence is undermined by the capability to address a large number of actors with different modus operandi. The number of actors is not necessarily a challenge for “broad deterrence” per se, but there are no recognized international norms in place, and the width of potential actors makes it difficult to charter where, how and to what extent mutual dependence caters to deterrence by entanglement.\n### Multitudes of motives\nThe motivation for different actors' actions is also muddying the water. The motives span from large state actors' strategic objectives of global or regional character, to organized groups or individuals' actions for short-term financial gains or prestige. This means that the threat from the cyber-domain has an impact on all sides and levels of society. At the same time, the different motives and threat-actors are not always as independent as they can seem -- isolated “random” and “non-critical” actions can be part of a more deliberate and intricate cyber-operation. Even though individual effects are possible to identify and quantify, it is extremely difficult to identify the motivation behind each action, and whether multiple actions must be seen in relation. Thus, it also becomes difficult to assess how each (or all) incidents should be handled.\nDue to how these different (or indeed connected) motives are expressed in actions, inefficient cooperation and conflicts of interest will most likely arise between relevant actors -- whose cooperation and comprehensive efforts are crucial to cope with the conglomerate of threats in the cyber domain. Inter-state this might be due to the inability to see the correlated patterns of isolated incidents, because actors are unwilling to share information due to national security concerns -- or simply because one does not know what information to share. But even intra-state one is highly likely to experience conflicts of interest that undermine the comprehensive approach, which effective cyber deterrence requires. Commercial actors may be unwilling to share relevant data with state agencies in fear of lost confidentiality and customer trust, which in turn may affect revenue. The state itself may not want to share their data, methods and techniques with commercial actors, as this may reveal capabilities and vulnerabilities. The sum of these mechanisms means that it becomes incredibly difficult to attain a good situational awareness and understanding of the problem-complex, and therefore a comprehensive approach almost unattainable.\nWhen one combines the challenges of multitudes of motives with the dynamic of vectors and actors, it is quite obvious that the cyber-domain represents an incredibly complex and dynamic security-challenge. Effective handling of incidents requires an understanding of the context, to ensure that efforts and resources are prioritized where relevant effects can be achieved. This requires cooperation. A minimum to ensure credibility of cyber deterrence is a level of transparency -- as basis for collective efforts -- between actors that can be reasonably defined as part of the same target-complex.\n### Attribution and proportionality\nA basic premise for deterrence is the ability to identify who has committed the actions one is seeking to deter. As of now, there are no common and widely recognized method to ensure a definitive attribution of actions in the cyber domain. This is largely due to the multitude of actors and the difficulty of discerning the difference between who are the “tools” and who are the “brains”, but the most important factor is that many vectors have technical properties that prevent attribution. This means that clever actors can operate with very little risk; “...the technical properties of cyber-attack vectors that prevent attribution allow actors with near anonymity and impunity.”\nThe challenge of attribution can be divided in two categories: technical attribution and human attribution. To put it simply, technical attribution is a question of analyzing and identifying the vector and the node used. Human attribution often leans on technical attribution and collates this with other available information to identify who committed the action (the “tool”), and who sponsored or motivated the actions (the “brains”).\nFrom the side of the defending part, and especially small states, the question of attribution is extremely important. As a minimum, accurate attribution is a necessity to identify against who and what to protect in the future. Attribution is even more important when assessing whether and how to respond. This is equally important for all actors, but especially if one hopes to trigger a response from international organizations intended to manage global or regional security -- who are often the only real\nsecurity-guarantors for small states. The U.S. have vindicated that they will respond toward threats in the cyber domain like they would in any other domain, and in 2016 the NATO Secretary General declared that major cyberattacks could activate a reaction from the Alliance. Still, it must be presumed that the target of the attack (and its allies) bears the burden of evidence if such provisions shall be activated.\nIn the cases where accurate attribution is possible, the next challenge is a proportional response. Again, there are no universally recognized international guidelines on how the principle of proportionality is to be managed in cyber space. At the most basic level it is a question of whether the response should take place in the same domain as the initial action. Defining where the threshold for response should be is equally important. These are questions NATO has already acknowledged, but there are significant differences of opinion within the Alliance -- as evidenced after the cyberattacks against Estonia in 2007. Estonian decision-makers interpreted the situation as a clear-cut cause to invoke NATO Article V, while the NATO leadership was not of the same opinion.\nThe challenges associated with attribution and proportionality obviously undermines the credibility of any deterrence-strategy, and at the same time the targeted state's credibility in more absolute terms. A response that is not seen as proportional or directed toward the wrong actor can have genuine consequences. The worst outcome is perhaps that it can cause an unintended escalation of a conflict that may not have been real or as grave as it was perceived. In some instances, reactions can be provoked by cyber-manipulation from an actor whose interests are served by creating/increasing tensions between the two parties. This is what one may call strategic exploitation of the challenges tied to attribution. Since the credibility of a state's overarching security policy is dependent on its ability to meet any and all cyberattacks with a proportional response, one is faced with a security policy-paradox; even though the state feels obliged to respond in order to maintain own credibility -- any response toward the wrong actor, or retaliations outside what is normatively seen as proportional, will have the opposite effect.\nFrom the perspective of a small state the question of attribution and proportionality therefore becomes especially important -- as their security is dependent on international support. These questions hamper the abilities to create coherent national security strategies, which presupposes clarity in what allied support can be expected when. This, in turn, has an explicit consequence for communicating effectively that deterrence relies on. As long as there is ambiguity tied to these questions, it creates and enormous room for maneuver for a potential attacker.\n### Lack of a shared conceptual foundation\nDespite all the challenges above, the most basic issue with the cyber-domain is the lack of a shared conceptual foundation to address the problems in question. Absent a shared terminology, procedures, and international judicial precedence it is difficult to establish effective deterrence. There are still major disputes between the large actors on simple issues such as terminology, and the meaning of concepts and terms. While the U.S. utilizes the term “cyber-security”, China and Russia have decided on “information-security.” This is more than a semantic discussion, as it directly influences the prerequisites for effective and clear communication:\nWithout a common lexicon in place, communication between the two sides is fated to remain in disagreement [...]. [W]hen addressing hostile activities in cyberspace where the actors are foreign to each other, the inability to communicate further impedes the ability to send clear messages and deescalate tensions.”\nA complete agreement on terminology is perhaps utopian, but a minimum is necessary to address the most prevalent challenges. There have been many attempts to achieve this. The European initiative -- The 2001 Council of Europe's Convention on Cybercrime -- gives a short but precise description of the most important terminology needed in the cyber-domain. However, there are only about forty states that have actually ratified the convention, with Russia and China being the biggest actors who have chosen to refrain.\nAnother initiative was the establishment of NATO Cooperative Cyber Defence Center of Excellence in 2008, which aimed to handle principle questions regarding the defense of the alliance in the digital space. In the period between 2013-2017, the organization produced two editions of a manual intended to describe how NATO should deal with issues such as judicial questions in an international context. The manual also addresses whether and how actions in the cyber-dimension can be characterized as armed attack, although this definition deviates from the description given in NATO's Policy on cyber Defense. This dissonance only serves to underline the difficulties of establishing a shared conceptual framework -- even within the Alliance.\nRunning in parallel with the internal NATO processes, NATO has also been a promoter for establishing global norms and regulations. As mentioned in the introduction, this has been on the international agenda for a long time. Yet, there is still international disagreement on whether (and if so -- how) for instances international humanitarian law should apply in a cyber-conflict. Simple, but crucial, questions such as what can be seen as aggression in accordance with the UN Charter for cyber space has not been resolved either. With such questions it also seems apparent that some actors find it in their interest that the ambiguity remains: “Since the domain allows room to operate offensively below the threshold of what is seen as an armed attack, such operations can influence the power balance through stealing other states' intellectual property, or threaten infrastructure in a relevant state in peacetime”\nLacking regulation in the cyber-domain hampers the ability to define what constitutes breach of norms, what is the threshold for legitimate response, and what a legitimate response is -- thereby making it excessively difficult to communicate effectively and clearly to potential attackers. The lack of clarity in this regard also opens up for already identified actors to attempt cyber-brinkmanship -- pushing it as far as they can while at the same time circumvent or avoid retribution because the legality and legitimacy of the response from any “victim” might be questioned. This undermines cyber-deterrence in general, but especially strategies based on deterrence by norms.\n## Cyber-deterrence strategy\n“The emergence of cyber as a separate domain of warfighting does not necessarily offer magic solutions and miraculous short-cuts to achieve strategic goals.”\nterrence as an overarching strategy is nothing new. Nuclear-deterrence was a response to a significant upheaval in the reality of global security policy -- not unlike (some would argue) the cyber-driven upheaval we are experiencing today. Therefore it is not unnatural that one attempts to draw parallels between known and tested strategies for nuclear-deterrence and cyber-deterrence. At the same time, it is important to be cognizant of the differences, and some have even gone as far as claiming that “...despite some crossover, there are too many inconsistencies that prevent an even partial adoption of the nuclear deterrence model.”\nThe four “problem areas” described above makes it difficult for any state with ambitions of deterrence in the cyber domain to satisfy the necessary preconditions for effective deterrence. Generally speaking, to get closer to creating real deterrence in the cyber-domain requires clarifications in several areas where there are currently too many unexplored variables and underdeveloped concept that undermines efficiency. This becomes most evident for the classical forms of deterrence, and especially deterrence by punishment, which requires absolute clarity in many of the above issues to be implemented. It might be relatively easier to establish the necessary preconditions for deterrence by denial, deterrence by entanglement, and deterrence by norms in a shorter time span.\nDeterrence by entanglement is an approach that might actually exploit what is normally seen as the main challenges in the cyber domain. The increasingly interconnectedness of actors (states, organizations, individuals) creates more potential vulnerabilities, but it can also make it more difficult to conduct offensive cyberoperations without causing collateral damage. By strengthening the emergence of virtual globalization, one can theoretically reduce the risk propensity of a would-be aggressor: “By more thoroughly entangling both friend and fore the aggregate benefits for maintaining and enhancing good behavior within the cyberspace increase and reinforce risk averse behaviors.” For small states, this might be the more attractive path, because it does not require parity in offensive and defensive cyber capabilities to have an effect. By creating stronger mutual dependence with partners and allies in the cyber domain, one can also effectively generate a situation where common defensive cyber capabilities are in everyone's interest, and thereby also corroborate a shared (Allied) deterrence by denial.\nHowever, for small states even situations of “entanglement” will often be highly asymmetrical, and unlikely to be a sufficient measure for efficient deterrence. Small states usually have a relatively weak position in the international system, but nonetheless have an opportunity to influence the norms for what is considered acceptable interaction between states -- and through this, to some degree, even out the imbalance of “hard power.” This acknowledgement is one of the reasons small states' security-strategies tend to focus on “idealistic and norm-oriented policy” with the aim of strengthening international institutions, norms and laws. To some extent, major powers will always operate according to the principle “might is right”, also outside established frameworks, but still risks being held accountable in accordance with these frameworks. The implications for states seen “in breach”, may be loss of legitimacy and support -- or sometimes more tangible reactions of e.g. economic nature. By working toward establishing and strengthening a normative framework for behavior\nin the cyber domain, one might be capable of generating real deterrence by norms. Such a framework would also constitute a viable “objective” basis to legitimize deterrence by punishment.\nTo establish effective frameworks for deterrence in the cyber-domain requires a collective effort, and the current staring point is not the best. But it is the only one we have. A smart first step might be to concretize the efforts through establishing a structure or organization whose purpose is to regulate cyber-behavior -- which in turn might enable cyber-deterrence to a larger degree, and in a more systematic manner. Such an organization should ideally find its basis in existing security cooperation and alliances but should not exclude a wider community of interest. Although we might think of a grander scale when it comes to cyber, the logic of the British Fighter Command gives an idea of how this could be structured. Without going into further details of how such an organization should/could be set up, it seems pertinent to comment that a “unified command” would form a better basis for any form of deterrence strategy. By tying the major powers to such an amalgamation of stake holders, it would also be possible to generate the capability necessary for all deterrence strategies -- something that would be impossible for small states outside such an organization.\nParticipation in the organization would also balance small states' norm-focused policies with what might be seen as an strengthening of alliances that to a larger degree also can serve as guarantors for concrete national interest in the short term. A balance between the apparently idealistic and very real alliances is an approach already well-known form Norwegian policy, strategy and doctrines. Such a divided focus might seem as contradictory, but is a quite rational choice. Empiricism tells us that that international laws and norms have limited value when conflict erupts between small and major states. Alliances and international normative frameworks thus become complimentary tools; where the former ensures that actors (through the threat of force) can be held accountable to the latter.\nA modern Fighter Command -- or Unified Cyber Command -- must also be granted authority to make decisions that commits participating states, and there-through regulates behavior both between members internally -- and between the organization and the international society at large. The organization would play a major role in establishing the premises for international cyber behavior and thereby by an important actor in the forming of norms. As such, the establishment of a Unified Cyber Command would serve both the need for short term security and the wish for a better regulated cyber-domain in the long term. This would also be complimentary and mutually reinforcing efforts, where a Unified Cyber Command can strengthen the establishment of normative frameworks -- which in turn forms a stronger basis for how the Unified Cyber Command acts in the domain. Put differently; a Unified Cyber Command might form a viable basis for classical deterrence, while it may also be an important agent in forming the framework needed for deterrence by norms.\n## Conclusion: Implications for small states\nBased on the challenges and possibilities that exist in the cyber-domain, and the options deterrence-theory offers, what should small states like Norway do? Firstly, one\nmust acknowledge the inherent limitations of small states -- also in the cyber-domain. Cyber-security is a demanding task, and it is reasonable to assume that the highest effects can be achieved together with others. Secondly, we see it as well substantiated that deterrence has a place in cyber-security strategy, if one does not see the different deterrence strategies as mutually exclusive but complimentary. Norway may very well entertain several lines of operations to achieve more robust deterrence. Thirdly, it is important to start immediately to explore how one can establish a coherent strategy for realizing true deterrence in the cyber-domain -- both in the short and the long term. Whether ideas like a modern Unified Cyber Command are realistic or practical are difficult to discern before one starts to explore the array of opportunities.\nAs the situation now stands, cyberattacks of varying sorts represents an extension of the classical kinetic conflict, but with attractive qualities such as plausible deniability. Our assessment is that it is important to start a grander initiative before the isolationist urge behind proverbial firewalls and security-measures, the search for profit, or the fear of being tricked increases the threshold even higher. For small states, like Norway, it is significant to realize what major powers like the US has already recognized as a necessity; establishing an internationally recognized, cross-sectorial cross-departmental organization, that also includes private actors -- with the responsibility of regulating the cyber-domain for the common good. Without such an initiative, the world will soon find itself at the edge of a cliff (if we are not already there), with an excellent view over a anarchistic cyber-landscape eating away on the solid foundation we now stand on -- as the cyber-domain becomes ever more dominant in all aspects of our interactions. A landscape paved with good intentions, where individual actors have done their best to create order from chaos, but thereby paradoxically contributing to its character of contradictory policies, rules and expectations. This landscape allows regional or even global conflicts to be instigated by the mere pushing of a few buttons. It should not be necessary with a cyber-equivalent of Operation Centerboard before we step up to the task.\n## ORCID\nMarius Kristiansen http://orcid.org/0000-0002-6966-3553\nNjaal Hoem http://orcid.org/0000-0001-6468-0111",
  "references": [
    "## Notes\nDavid Kilcullen, Out of the Mountains (New York: Oxford University Press, 2013), 107.Tor Olav Grøtan, “SAMRISK-II: New Strains of Society—Hidden, Dynamic and Emergent Vulnerabilities,” LUFTLED - Luftmakttidsskrift 2 (2018): 26--30.Directorate for Civilian Security and Readiness, Rapport: Sikkerhet i kritisk infrastruktur og kritiske samfunnsfunksjoner—modell for overordnet risikostyring [Report: Security within critical infrastructure and critical functions for the society—Model for overall risk management] (Tønsberg: DSB, 2012), 24.National Intelligence Service, Fokus 2018: Etterretningstjenestens vurdering av aktuelle sikkerhetsutfordringer [Focus 2018: The National Intelligence Service annual assessment of relevant security challenges] (Oslo: ETJ, 2018), 31.Norwegian Department of Defense, Forsvarsdepartementets retningslinjer for informasjonssikkerhet og cyberoperasjoner i forsvarssektoren [Norwegian DOD's guidelines for information\nsecurity and cyberoperations within the defense sector] (Oslo: Forsvarsdepartementet, 2014), 4.\n6. James Jay Carafano, “America's Joint Force and the Domains of Warfare, 2018 Index of U.S. Military Strength,” 2017, https://www.heritage.org/sites/default/files/2017-09/2018_IndexOfUSMilitaryStrength_CARAFANO.pdf.\n7. NATO, “Cyber Defence,” 2018, https://www.nato.int/cps/en/natohq/topics_78170.htm.\n8. Norwegian Joint Staff, Forsvarets fellesoperative doktrine [The Norwegian Armed Forces Joint Doctrine] (Oslo: Forsvarsstaben, 2014), pkt 05077.\n9. NATO, “NATO Cyber Defence Pledge,” 2016, https://www.nato.int/cps/en/natohq/official_texts_133177.htm.\n10. Owen Bowcott, “Dispute Along Cold War Lines Led to Collapse of UN Cyberwarfare Talks,” Guardian, August 23, 2017, https://www.theguardian.com/world/2017/aug/23/un-cyberwarfare-negotiations-collapsed-in-june-it-emerges;Michael Beaver, “The United Nations and Cyberwarfare,” in Cybersecurity, 2016.\n11. Andrei Kalip, “UN Chief Urges Global Rules for Cyber Warfare,” Reuters, February 19, 2018, https://www.reuters.com/article/us-un-guterres-cyber/u-n-chief-urges-global-rules-for-cyber-warfare-idUSKCN1G31Q4.\n12. United Nations, UN Doc.57/239. Creation of a Global Culture of Cybersecurity, 2003, https://digitallibrary.un.org/record/482184?ln=en; United Nations, UN Doc. A/RES/58/199. Creation of a Global Culture of Cybersecurity and the Protection of Critical Information Infrastructures, 2004, https://digitallibrary.un.org/record/509571?ln=en; United Nations, UN Doc. A/RES/64/211. Creation of a Global Culture of Cybersecurity and Taking Stock of National Efforts to Protect Critical Information Infrastructure, 2010, https://digitallibrary.un.org/record/672141?ln=en; United Nations, UN Doc. A/RES/70/174. Thirteenth United Nations Congress on Crime Prevention and Criminal Justice, 2016, https://digitallibrary.un.org/record/816763?ln=en ; United Nations, UN Doc. A/RES/71/28. Developments in the Field of Information and Telecommunications in the Context of International Security, 2016, https://undocs.org/A/RES/71/28.\n13. Bowcott, “Dispute Along Cold War Lines.”\n14. Simon Tisdall, “Cyber-Warfare Is Growing Threat,” Guardian, February 3, 2010, https://www.theguardian.com/technology/2010/feb/03/cyber-warfare-growing-threat.\n15. Joseph S. Nye, Jr. “Deterrence and Dissuasion in Cyberspace,” International Security 41, no. 3 (2016/17): 44--71.\n16. Leo Blanken, “Deterrence” in Deterrence in Gangs and Guerrillas: Ideas From Counterinsurgency and Counterterrorism, ed. Michael Freeman and Hy Rothstein (Monterey, Calif.: Naval Postgraduate School, 2011).\n17. T. C. Schelling, Arms and Influence: With a New Preface and Afterword (New Haven, Conn.: Yale University Press, 2008), 35.\n18. Scott Jasper, “Deterring Malicious Behavior in Cyberspace,” Strategic Studies Quarterly (2015): 65, http://www.au.af.mil/au/ssq/digital/pdf/Spring_2015/jasper.pdf.\n19. Jasper, 65.\n20. Nye, “Deterrence and Dissuasion.”\n21. J. J. Mearsheimer, Conventional Deterrence (Ithaca, N.Y.: Cornell University Press, 1983), 14--15, https://books.google.no/books?id=lNwZDgAAQBAJ&printsec=frontcover&dq=conventional+deterrence&hl=no&sa=X&ved=0ahUKEwjI_K-fr9jZAhWGDuwKHYzmD8cQ6AEIKDAA#v=onepage&q=conventionaldeterrence&f=false.\n22. Mearsheimer, 14--15.\n23. Robert O. Keohane and Joseph S. Nye, Jr. Power and Interdependence: World Politics in Transition (Boston: Little, Brown, 1977).\n24. Nye, “Deterrence and Dissuasion.”\n25. Schelling, Arms and Influence, 35--49.\n26. NATO has traditionally used four dimensions for warfare (air, land, sea, and space), but has incorporated cyberspace as the fifth dimension. See, for example, Pierluigi Paganini,\nM. KRISTIANSEN AND N. HOEM\nNATO Officially Recognizes Cyberspace as a Warfare Domain, 2016, https://www.securityaffairs.co/wordpress/48484/cyber-warfare-2/nato-cyberspace-warfare-domain.html.\n27. Emilio Iasiello, “Is Cyber Deterrence an Illusory Course of Action?” Journal of Strategic Security 7, no. 1 (2014): 54, 55.\n28. Directorate for Civilian Security and Readiness, Rapport, 24.\n29. Jasper, 61.\n30. Jasper, 62.\n31. Jasper, 78.\n32. Iasiello, 54, 55.\n33. Larry Clinton, “Cyber Security Social Contract,” in Conflict and Cooperation in the Global Commons: A Comprehensive Approach for International Security, ed. Scott Jasper (Washington, D.C.: Georgetown University Press, 2012), 185–98.\n34. Emilio Iasiello, “Identifying Cyber-Attackers to Require High-Tech Sleuthing Skills,” National Defense Magazine (December 2012), https://www.nationaldefensemagazine.org/articles/2012/12/1/2012december-identifying-cyberattackers-to-require-hightech-sleuthing-skills.\n35. Jasper, 62.\n36. Earl W. Boebert, “A Survey of Challenges in Attribution, NRC Proceedings” in Proceedings of a Workshop on Deterring Cyberattacks: Informing Strategies and Developing Options for U.S. Policy, 2010, https://www.nap.edu/read/12997/chapter/5#43.\n37. Reuters, “Massive Cyber Attack Could Trigger NATO Response: Stoltenberg,” June 15, 2016, https://www.reuters.com/article/us-cyber-nato/massive-cyber-attack-could-trigger-nato-response-stoltenberg-idUSKCN0Z12NE.\n38. NATO, “Cyber Defence.”\n39. Sverre Diesen, FFI rapport 18/00080: Lavinitensitet hybridangrep på Norge i en fremtidig konflikt [Low-intensity hybrid-attacks in Norway in future conflicts] (Oslo/Kjeller: FFI, 2018), 25.\n40. Iasiello, “Is Cyber Deterrence an Illusory Course of Action?” 54, 57.\n41. Iasiello, 54, 57.\n42. Iasiello, 54, 57.\n43. NATO Cooperative Cyber Defence Centre of Excellence, “History,” 2018, https://ccdcoe.org/history.html.\n44. NATO Cooperative Cyber Defence Centre of Excellence, “Tallinn Manual 2.0 on the International Law Applicable to Cyber Operations,” 2017, https://ccdcoe.org/sites/default/files/documents/CCDCOE_Tallinn_Manual_Onepager_web.pdf.\n45. Jasper, 68.\n46. Jasper, 68.\n47. NATO, “Cyber Defence.”\n48. Jeffrey Carr, Inside Cyber Warfare: Mapping the Cyber Underworld (Boston: O’Reilly Media, 2011), 31.\n49. Authors’ own translation from Norwegian in Stig Tore Aannø, Strategisk avskrekking i det digitale rom—Finnes det rasjonelle strategier for små stater? [Strategic deterrence in the digital space—Do rational strategies exist for small states?] (Oslo: Forsvarets høgskole, 2011), 62.\n50. Sven Sakkov, “Foreword” in Cyber War in Perspective: Russian Aggression Against Ukraine, ed. Kenneth Geers (Tallinn: NATO Cooperative Cyber Defence Centre of Excellence, 2015). 9.\n51. George H. Quester, Deterrence Before Hiroshima: The Airpower Background of Modern Strategy (New York: Wiley, 1966).\n52. Iasiello, 54, 61.\n53. Iasiello, 54, 55.\n54. Nye, “Deterrence and Dissuasion.”\nCOMPARATIVE STRATEGY\n55. Aaron Brantly, “Conceptualizing Cyber Deterrence by Entanglement,” 2018, http://www.ou.edu/cis/sponsored_programs/cyber-governance-and-policy-center/blog/conceptualizing-cyber-deterrence-by-entanglement.\n56. Anders Kjølberg, Foredrag ved Krigsskolen [In seminar at the Norwegian Military Academy] (Linderud/Oslo: Krigsskolen, 2016).\n57. Klaus Larres, \"Superpowers and International Governance: A 'Might is Right' Story?\" Caucasus International 5 (2015): 2, http://cijournal.az/storage/posts/101/files/Larres.pdf.\n58. John Arquilla, “Deterrence after Stuxnet,” Blog@ACM, 2015, http://cacm.acm.org/blogs/blog-cacm/190371-deterrence-after-stuxnet/fulltext.\n59. Tom Long, \"Small States, Great Power? Gaining Influence Through Intrinsic, Derivative, and Collective Power,\" International Studies Review 19, no. 2 (2016): 1-21.\n60. Norwegian Department of Defense, Prop. 151 S (2015-2016) Proposisjon til Stortinget (forslag til stortingsvedtak): Kampkraft og baerekraft—Langtidsplan for forsvarssektoren [Proposition 151S (2015-2016) Proposition to the Norwegian Parliament (proposal for Parliament decision): Combat capabilities and sustainability—The long term plan for the Norwegian defense sector]. (Oslo: FD, 2015), https://www.regjeringen.no/contentassets/a712fb-233b2542af8df07e2628b3386d/no/pdfs/prp201520160151000dddpdfs.pdf; Norwegian Joint Staff, Forsvarets fellesoperative doktrine.\n61. Roy Allison, \"The Russian Case for Military Intervention in Georgia: International Law, Norms, and Political Calculation,\" European Security 18, no. 2 (2009): 173-200.\n62. Department of Defense, Quadrennial Defense Review (Washington, D.C.: DOD, 2014), 15.\n63. Department of Defense, 15.\n64. Don A. Farrell, *Tinian and the Bomb: Project Alberta and Operation Centerboard* (Pohnpei, Micronesia: Micronesian Productions, 2018).\n## Notes on contributors\nMarius Kristiansen (markristianse@mil.no) is an active duty Norwegian Army Officer. He has been a member of the Norwegian Armed Forces since 2001, and he has served both in the Norwegian Navy and the Norwegian Army. He holds a BA in Military Leadership and Land Warfare from the Norwegian Military Academy, an Advanced Certificate in Terrorism Studies from the University of St. Andrews in the UK, and an MS in Defense Analysis from Naval Postgraduate School in Monterey, California.\nNjaal Hoem (nhoem@mil.no) is an active duty Norwegian Army Officer. He joined the Norwegian Armed Forces in 2003, and has served in the Norwegian Army since. He holds a BA in Military Leadership and Land Warfare from the Norwegian Military Academy, has studied Leadership and Organizational Psychology at BI Norwegian Business School, and holds an MLitt in War Studies from University of Glasgow."
  ],
  "flat_text": "COMPARATIVE STRATEGY AN INTERNATIONAL PROGRAM COMPARATIVE STRATEGY INFORMATION Comparative Strategy Routledge Taylor &amp; Francis Group ISSN: 0149-5933 (Print) 1521-0448 (Online) Journal homepage: www.tandfonline.com/journals/ucst20 # Small players in a limitless domain: Cyber deterrence as small state strategy Marius Kristiansen &amp; Njaal Hoem To cite this article: Marius Kristiansen &amp; Njaal Hoem (2022) Small players in a limitless domain: Cyber deterrence as small state strategy, Comparative Strategy, 41:1, 19-31, DOI: 10.1080/01495933.2021.2017740 To link to this article: https://doi.org/10.1080/01495933.2021.2017740 Published online: 02 Feb 2022.\nSubmit your article to this journal Article views: 708 View related articles View Crossmark data Full Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=ucst20 # Small players in a limitless domain: Cyber deterrence as small state strategy Marius Kristiansen, Njaal Hoem ## Abstract This article explores deterrence as an element in cybersecurity strategy from a small state perspective. The cyber domain presents novel challenges for strategy makers, and applying deterrence in the cyber domain requires an organized and multinational approach -- since few states can leverage deterrence in this all-encompassing domain on their own. Deterrence has been an important factor in shaping global security for half a century, but when applied to the cyber domain there are certain inherent mechanisms that must be understood in order to generate the desired effects. Key issues discussed are the volume of agents capable of operating and creating effects in the domain, and the availability of tools and techniques. These issues concerning actors and vectors makes it difficult to survey threats and create targeted deterrence. Furthermore, the cyber milieu makes it difficult to connect action to motives, thereby further complicating any attempt to analyze the actual importance of observable effects. From a strategist's point of view, these general characteristics are exacerbated by the fact that the international community does not have a common language or shared platform to uniformly approach these issues. Absent clarity on some fundamentals the core issues of attribution and proportionality becomes a hindrance to effective deterrence.\n## Introduction: A new domain -- for better and for worse Global connectivity is ever increasing,1 and our personal and social lives have become dependent on- and intertwined with the technological progress.2 Similarly, on the societal and nation-state level, we have far surpassed the point where electronic communication services (ECS) shifted from ancillary to pivotal. In Norway, ECS is on the top of the list of “critical public focus areas” -- deemed necessary to ensure the sustainment of “critical societal functions.”3 Access to the Internet, and by extension “the web” or “cyberspace”, undoubtedly offers historically unprecedented possibilities but also creates dependencies, and widespread dependence on the cyber domain at all levels of society and the state expose new challenges and vulnerabilities.4 And the flip side is grim.\nThe military and strategic community has already defined a “cyber domain,”5 and thus acknowledged that this is an arena also for strategic competition and for war.6 This is a globally recognized “truth”, and the cyber domain is increasingly becoming militarized. But the cyber domain is something “different.” While it is the fastest growing dimension of modern warfare, it is also the most obscure.\nWhen Norway signed the NATO “Cyber Defence Pledge” it was one of many markers for the increasing political and military acknowledgement that the cyber domain may represent one of the biggest gaps in existing security theory and strategy.\nThe domain is practically unregulated and unpoliced, and therefore highly unpredictable. The UN Secretary General has called out for the need to regulate warfare in the cyber domain, and the UN has on several occasions underlined the pressing need for common guidelines. Despite the fact that the global community, since the turn of the millennium, slowly but steadily has moved toward an acceptance of the applicability of international law (and the Charter of the United Nations) for states' actions in the cyber domain, we are still far from a consensus on what should be regulated and how.\nKeeping pace with the development in this “lawless” domain requires dedication, but also immense resources invested -- making the full utilization of cyber as a state-tool only obtainable by major powers. This logic has motivated some to argue that the current state of cyber is at “... the same stage of intellectual development as we were in the 1950s in relation to possible nuclear war.” The extension of the same logic has led several authors to argue that deterrence might be a navigable path toward strategic success in the cyber domain. In a global security perspective nuclear deterrence has undoubtedly played a pivotal role in shaping states' behavior on the international arena since 1945. If the same conceptions can be used to shape behavior in the digital space, it would have great global impact. Identifying how this can be done, and generally how the cyber domain can and should be regulated, is a task that affects us all. But, for high-tech small states where technology sets the agenda for all parts of state and society, it is critical.\nThe intention with this article is to outline some of the more prominent possibilities and challenges tied to cyber deterrence as part of a cybersecurity strategy. The authors argue that the ability to generate real cyber-deterrence depends on the establishment and accountability of a multinational and multi-departmental/sectorial cyberorganization. As will become evident in the following, both classical and extended deterrence theory are predicated on certain criteria, which do not easily translate to the cyber domain. The authors argue that these challenges make it more difficult, but perhaps even more important to identify how to generate deterrence in the cyber domain -- especially for high-tech small states, like Norway.\nCoping with this in an effective way presupposes that one looks at the width of deterrence theory over time, and small states must acknowledge their weaknesses and play to their strengths. The recommendations proposed are opening moves to do just that, and at the same time prepare to exploit complimentary effects of different dimensions of cyber-deterrence in the long run.\n## Deterrence: The concept Conceptually, deterrence can be described as using “...the threat of punishment, or increasing expected costs of an activity, to prevent an actor from taking an action they might otherwise take.” A traditional perception of deterrence as part of security strategy is that it involves influencing one or more actors' intentions. Three preconditions must be present for effective deterrence. Firstly, there must exist a real capability -- the ability to effectuate actions toward an adversary. Second, the threat must be credible -- the will to effectuate actions must not be questionable. And lastly, one must be able to communicate effectively -- ensuring that the message is clearly communicated to all relevant parties.\nWhen operationalized, there are four types of deterrence strategy. The two first are oftentimes referred to as “classical deterrence”, while the latter two are part of what has been dubbed “broad deterrence.” The first strategy has is deterrence by punishment. The second is deterrence by denial. Det third is deterrence by entanglement. The fourth is deterrence by norms. The desired deterrent effect is achieved when one has established the perception in a cost-benefit calculation that there is a real risk of disproportional consequences for actions that violates normative and/or stated premises. Security strategy based upon deterrence therefore depends on maintaining a perception of the ability and will to effectuate such consequences at all times.\nDeterrence is typically a superpower/major power strategical behavior. It is not excluded for small states, but within “classical deterrence” it is close to impossible for small states to unilaterally generate the necessary capability and credibility. States like Norway depend on security cooperation to achieve this. Small states are more likely to generate a degree of deterrence within the framework of “broad deterrence”, but this often depends on the existence of a universal normative baseline -- widely known and communicated. With perhaps the exception of deterrence by entanglement, small states are thus largely dependent on other actors to achieve any relevant deterrent effect.\nThere are in principle three main reasons why deterrence strategies fail. The first is that communicated consequences are not real. The second is when it is possible to avoid/circumvent the consequences because an actor exploits earlier unidentified loopholes. The third is when it is challenging, or impossible, to clearly communicate the message to the relevant actors. These factors might seem simple, but credible deterrence has proven difficult enough even with “only” four dimensions of warfare and security strategy. To generate credible deterrence in the fifth dimension -- cyber -- can prove difficult, for a multitude of reasons.\n## Cyber-deterrence challenges Cyber-deterrence can be defined as: > [...] a strategy by which a defending state seeks to maintain the status quo by signaling its intentions to deter hostile cyber activity by targeting and influencing an adversary's decision making apparatus to avoid engaging in destructive cyber activity for fear of a greater reprisal by the initial aggressor.\nLogically, all classes of deterrence theory should be domain-independent, and dependent on the three same criteria. However, an important difference between traditional deterrence and cyber-deterrence is that the latter seems to require a more coherent effort from both state and society. Cyber-threats are not only directed toward the state proper, but also other actors whose security nonetheless is pivotal to the security of society at large. The nature of the cyber domain also creates very specific challenges that also makes it difficult to meet all the criteria across the width of the different strategies.\n### Actors and vectors In contrast to other domains, there is an almost infinite number of actors that can influence the security situation in the cyber domain -- both directly and indirectly. This is largely due to the share number and accessibility of “vectors” in the digital space. In simple terms, a “vector” can be defined as: “... a specific method or technique to access equipment, computers, or systems to deliver hostile payload for a malicious outcome.”\nThe number of vectors, the complexity they represent, and the level of refinement increases daily. What seems like an almost exponential increase in this area permits a number of actions that are (1) challenging to detect and protect against, and (2) of a character that makes them difficult to define from a security perspective. The effects of the vectors span wide; from service-denial to manipulation and/or even destruction of data. The accessibility and design of vectors makes it possible for almost “anyone” with access to the Internet to influence the security situation in the cyber-domain. Actors ranging from nation states to organized groups and individuals acting alone can all create undesired effects.\nThe combination of the overwhelming number of vectors and possible actors makes it particularly demanding to generate deterrence in the digital space. This is primarily due to the large range of potential security-threats making it difficult to map up what to protect against and how, and it becomes increasingly difficult to respond to each individual infringement. Techniques and procedures to handle individual challenges are short-lived, and the security landscape is dynamic. Further, the credibility of traditional deterrence is undermined by the capability to address a large number of actors with different modus operandi. The number of actors is not necessarily a challenge for “broad deterrence” per se, but there are no recognized international norms in place, and the width of potential actors makes it difficult to charter where, how and to what extent mutual dependence caters to deterrence by entanglement.\n### Multitudes of motives The motivation for different actors' actions is also muddying the water. The motives span from large state actors' strategic objectives of global or regional character, to organized groups or individuals' actions for short-term financial gains or prestige. This means that the threat from the cyber-domain has an impact on all sides and levels of society. At the same time, the different motives and threat-actors are not always as independent as they can seem -- isolated “random” and “non-critical” actions can be part of a more deliberate and intricate cyber-operation. Even though individual effects are possible to identify and quantify, it is extremely difficult to identify the motivation behind each action, and whether multiple actions must be seen in relation. Thus, it also becomes difficult to assess how each (or all) incidents should be handled.\nDue to how these different (or indeed connected) motives are expressed in actions, inefficient cooperation and conflicts of interest will most likely arise between relevant actors -- whose cooperation and comprehensive efforts are crucial to cope with the conglomerate of threats in the cyber domain. Inter-state this might be due to the inability to see the correlated patterns of isolated incidents, because actors are unwilling to share information due to national security concerns -- or simply because one does not know what information to share. But even intra-state one is highly likely to experience conflicts of interest that undermine the comprehensive approach, which effective cyber deterrence requires. Commercial actors may be unwilling to share relevant data with state agencies in fear of lost confidentiality and customer trust, which in turn may affect revenue. The state itself may not want to share their data, methods and techniques with commercial actors, as this may reveal capabilities and vulnerabilities. The sum of these mechanisms means that it becomes incredibly difficult to attain a good situational awareness and understanding of the problem-complex, and therefore a comprehensive approach almost unattainable.\nWhen one combines the challenges of multitudes of motives with the dynamic of vectors and actors, it is quite obvious that the cyber-domain represents an incredibly complex and dynamic security-challenge. Effective handling of incidents requires an understanding of the context, to ensure that efforts and resources are prioritized where relevant effects can be achieved. This requires cooperation. A minimum to ensure credibility of cyber deterrence is a level of transparency -- as basis for collective efforts -- between actors that can be reasonably defined as part of the same target-complex.\n### Attribution and proportionality A basic premise for deterrence is the ability to identify who has committed the actions one is seeking to deter. As of now, there are no common and widely recognized method to ensure a definitive attribution of actions in the cyber domain. This is largely due to the multitude of actors and the difficulty of discerning the difference between who are the “tools” and who are the “brains”, but the most important factor is that many vectors have technical properties that prevent attribution. This means that clever actors can operate with very little risk; “...the technical properties of cyber-attack vectors that prevent attribution allow actors with near anonymity and impunity.”\nThe challenge of attribution can be divided in two categories: technical attribution and human attribution. To put it simply, technical attribution is a question of analyzing and identifying the vector and the node used. Human attribution often leans on technical attribution and collates this with other available information to identify who committed the action (the “tool”), and who sponsored or motivated the actions (the “brains”).\nFrom the side of the defending part, and especially small states, the question of attribution is extremely important. As a minimum, accurate attribution is a necessity to identify against who and what to protect in the future. Attribution is even more important when assessing whether and how to respond. This is equally important for all actors, but especially if one hopes to trigger a response from international organizations intended to manage global or regional security -- who are often the only real security-guarantors for small states. The U.S. have vindicated that they will respond toward threats in the cyber domain like they would in any other domain, and in 2016 the NATO Secretary General declared that major cyberattacks could activate a reaction from the Alliance. Still, it must be presumed that the target of the attack (and its allies) bears the burden of evidence if such provisions shall be activated.\nIn the cases where accurate attribution is possible, the next challenge is a proportional response. Again, there are no universally recognized international guidelines on how the principle of proportionality is to be managed in cyber space. At the most basic level it is a question of whether the response should take place in the same domain as the initial action. Defining where the threshold for response should be is equally important. These are questions NATO has already acknowledged, but there are significant differences of opinion within the Alliance -- as evidenced after the cyberattacks against Estonia in 2007. Estonian decision-makers interpreted the situation as a clear-cut cause to invoke NATO Article V, while the NATO leadership was not of the same opinion.\nThe challenges associated with attribution and proportionality obviously undermines the credibility of any deterrence-strategy, and at the same time the targeted state's credibility in more absolute terms. A response that is not seen as proportional or directed toward the wrong actor can have genuine consequences. The worst outcome is perhaps that it can cause an unintended escalation of a conflict that may not have been real or as grave as it was perceived. In some instances, reactions can be provoked by cyber-manipulation from an actor whose interests are served by creating/increasing tensions between the two parties. This is what one may call strategic exploitation of the challenges tied to attribution. Since the credibility of a state's overarching security policy is dependent on its ability to meet any and all cyberattacks with a proportional response, one is faced with a security policy-paradox; even though the state feels obliged to respond in order to maintain own credibility -- any response toward the wrong actor, or retaliations outside what is normatively seen as proportional, will have the opposite effect.\nFrom the perspective of a small state the question of attribution and proportionality therefore becomes especially important -- as their security is dependent on international support. These questions hamper the abilities to create coherent national security strategies, which presupposes clarity in what allied support can be expected when. This, in turn, has an explicit consequence for communicating effectively that deterrence relies on. As long as there is ambiguity tied to these questions, it creates and enormous room for maneuver for a potential attacker.\n### Lack of a shared conceptual foundation Despite all the challenges above, the most basic issue with the cyber-domain is the lack of a shared conceptual foundation to address the problems in question. Absent a shared terminology, procedures, and international judicial precedence it is difficult to establish effective deterrence. There are still major disputes between the large actors on simple issues such as terminology, and the meaning of concepts and terms. While the U.S. utilizes the term “cyber-security”, China and Russia have decided on “information-security.” This is more than a semantic discussion, as it directly influences the prerequisites for effective and clear communication: Without a common lexicon in place, communication between the two sides is fated to remain in disagreement [...]. [W]hen addressing hostile activities in cyberspace where the actors are foreign to each other, the inability to communicate further impedes the ability to send clear messages and deescalate tensions.”\nA complete agreement on terminology is perhaps utopian, but a minimum is necessary to address the most prevalent challenges. There have been many attempts to achieve this. The European initiative -- The 2001 Council of Europe's Convention on Cybercrime -- gives a short but precise description of the most important terminology needed in the cyber-domain. However, there are only about forty states that have actually ratified the convention, with Russia and China being the biggest actors who have chosen to refrain.\nAnother initiative was the establishment of NATO Cooperative Cyber Defence Center of Excellence in 2008, which aimed to handle principle questions regarding the defense of the alliance in the digital space. In the period between 2013-2017, the organization produced two editions of a manual intended to describe how NATO should deal with issues such as judicial questions in an international context. The manual also addresses whether and how actions in the cyber-dimension can be characterized as armed attack, although this definition deviates from the description given in NATO's Policy on cyber Defense. This dissonance only serves to underline the difficulties of establishing a shared conceptual framework -- even within the Alliance.\nRunning in parallel with the internal NATO processes, NATO has also been a promoter for establishing global norms and regulations. As mentioned in the introduction, this has been on the international agenda for a long time. Yet, there is still international disagreement on whether (and if so -- how) for instances international humanitarian law should apply in a cyber-conflict. Simple, but crucial, questions such as what can be seen as aggression in accordance with the UN Charter for cyber space has not been resolved either. With such questions it also seems apparent that some actors find it in their interest that the ambiguity remains: “Since the domain allows room to operate offensively below the threshold of what is seen as an armed attack, such operations can influence the power balance through stealing other states' intellectual property, or threaten infrastructure in a relevant state in peacetime” Lacking regulation in the cyber-domain hampers the ability to define what constitutes breach of norms, what is the threshold for legitimate response, and what a legitimate response is -- thereby making it excessively difficult to communicate effectively and clearly to potential attackers. The lack of clarity in this regard also opens up for already identified actors to attempt cyber-brinkmanship -- pushing it as far as they can while at the same time circumvent or avoid retribution because the legality and legitimacy of the response from any “victim” might be questioned. This undermines cyber-deterrence in general, but especially strategies based on deterrence by norms.\n## Cyber-deterrence strategy “The emergence of cyber as a separate domain of warfighting does not necessarily offer magic solutions and miraculous short-cuts to achieve strategic goals.”\nterrence as an overarching strategy is nothing new. Nuclear-deterrence was a response to a significant upheaval in the reality of global security policy -- not unlike (some would argue) the cyber-driven upheaval we are experiencing today. Therefore it is not unnatural that one attempts to draw parallels between known and tested strategies for nuclear-deterrence and cyber-deterrence. At the same time, it is important to be cognizant of the differences, and some have even gone as far as claiming that “...despite some crossover, there are too many inconsistencies that prevent an even partial adoption of the nuclear deterrence model.”\nThe four “problem areas” described above makes it difficult for any state with ambitions of deterrence in the cyber domain to satisfy the necessary preconditions for effective deterrence. Generally speaking, to get closer to creating real deterrence in the cyber-domain requires clarifications in several areas where there are currently too many unexplored variables and underdeveloped concept that undermines efficiency. This becomes most evident for the classical forms of deterrence, and especially deterrence by punishment, which requires absolute clarity in many of the above issues to be implemented. It might be relatively easier to establish the necessary preconditions for deterrence by denial, deterrence by entanglement, and deterrence by norms in a shorter time span.\nDeterrence by entanglement is an approach that might actually exploit what is normally seen as the main challenges in the cyber domain. The increasingly interconnectedness of actors (states, organizations, individuals) creates more potential vulnerabilities, but it can also make it more difficult to conduct offensive cyberoperations without causing collateral damage. By strengthening the emergence of virtual globalization, one can theoretically reduce the risk propensity of a would-be aggressor: “By more thoroughly entangling both friend and fore the aggregate benefits for maintaining and enhancing good behavior within the cyberspace increase and reinforce risk averse behaviors.” For small states, this might be the more attractive path, because it does not require parity in offensive and defensive cyber capabilities to have an effect. By creating stronger mutual dependence with partners and allies in the cyber domain, one can also effectively generate a situation where common defensive cyber capabilities are in everyone's interest, and thereby also corroborate a shared (Allied) deterrence by denial.\nHowever, for small states even situations of “entanglement” will often be highly asymmetrical, and unlikely to be a sufficient measure for efficient deterrence. Small states usually have a relatively weak position in the international system, but nonetheless have an opportunity to influence the norms for what is considered acceptable interaction between states -- and through this, to some degree, even out the imbalance of “hard power.” This acknowledgement is one of the reasons small states' security-strategies tend to focus on “idealistic and norm-oriented policy” with the aim of strengthening international institutions, norms and laws. To some extent, major powers will always operate according to the principle “might is right”, also outside established frameworks, but still risks being held accountable in accordance with these frameworks. The implications for states seen “in breach”, may be loss of legitimacy and support -- or sometimes more tangible reactions of e.g. economic nature. By working toward establishing and strengthening a normative framework for behavior in the cyber domain, one might be capable of generating real deterrence by norms. Such a framework would also constitute a viable “objective” basis to legitimize deterrence by punishment.\nTo establish effective frameworks for deterrence in the cyber-domain requires a collective effort, and the current staring point is not the best. But it is the only one we have. A smart first step might be to concretize the efforts through establishing a structure or organization whose purpose is to regulate cyber-behavior -- which in turn might enable cyber-deterrence to a larger degree, and in a more systematic manner. Such an organization should ideally find its basis in existing security cooperation and alliances but should not exclude a wider community of interest. Although we might think of a grander scale when it comes to cyber, the logic of the British Fighter Command gives an idea of how this could be structured. Without going into further details of how such an organization should/could be set up, it seems pertinent to comment that a “unified command” would form a better basis for any form of deterrence strategy. By tying the major powers to such an amalgamation of stake holders, it would also be possible to generate the capability necessary for all deterrence strategies -- something that would be impossible for small states outside such an organization.\nParticipation in the organization would also balance small states' norm-focused policies with what might be seen as an strengthening of alliances that to a larger degree also can serve as guarantors for concrete national interest in the short term. A balance between the apparently idealistic and very real alliances is an approach already well-known form Norwegian policy, strategy and doctrines. Such a divided focus might seem as contradictory, but is a quite rational choice. Empiricism tells us that that international laws and norms have limited value when conflict erupts between small and major states. Alliances and international normative frameworks thus become complimentary tools; where the former ensures that actors (through the threat of force) can be held accountable to the latter.\nA modern Fighter Command -- or Unified Cyber Command -- must also be granted authority to make decisions that commits participating states, and there-through regulates behavior both between members internally -- and between the organization and the international society at large. The organization would play a major role in establishing the premises for international cyber behavior and thereby by an important actor in the forming of norms. As such, the establishment of a Unified Cyber Command would serve both the need for short term security and the wish for a better regulated cyber-domain in the long term. This would also be complimentary and mutually reinforcing efforts, where a Unified Cyber Command can strengthen the establishment of normative frameworks -- which in turn forms a stronger basis for how the Unified Cyber Command acts in the domain. Put differently; a Unified Cyber Command might form a viable basis for classical deterrence, while it may also be an important agent in forming the framework needed for deterrence by norms.\n## Conclusion: Implications for small states Based on the challenges and possibilities that exist in the cyber-domain, and the options deterrence-theory offers, what should small states like Norway do? Firstly, one must acknowledge the inherent limitations of small states -- also in the cyber-domain. Cyber-security is a demanding task, and it is reasonable to assume that the highest effects can be achieved together with others. Secondly, we see it as well substantiated that deterrence has a place in cyber-security strategy, if one does not see the different deterrence strategies as mutually exclusive but complimentary. Norway may very well entertain several lines of operations to achieve more robust deterrence. Thirdly, it is important to start immediately to explore how one can establish a coherent strategy for realizing true deterrence in the cyber-domain -- both in the short and the long term. Whether ideas like a modern Unified Cyber Command are realistic or practical are difficult to discern before one starts to explore the array of opportunities.\nAs the situation now stands, cyberattacks of varying sorts represents an extension of the classical kinetic conflict, but with attractive qualities such as plausible deniability. Our assessment is that it is important to start a grander initiative before the isolationist urge behind proverbial firewalls and security-measures, the search for profit, or the fear of being tricked increases the threshold even higher. For small states, like Norway, it is significant to realize what major powers like the US has already recognized as a necessity; establishing an internationally recognized, cross-sectorial cross-departmental organization, that also includes private actors -- with the responsibility of regulating the cyber-domain for the common good. Without such an initiative, the world will soon find itself at the edge of a cliff (if we are not already there), with an excellent view over a anarchistic cyber-landscape eating away on the solid foundation we now stand on -- as the cyber-domain becomes ever more dominant in all aspects of our interactions. A landscape paved with good intentions, where individual actors have done their best to create order from chaos, but thereby paradoxically contributing to its character of contradictory policies, rules and expectations. This landscape allows regional or even global conflicts to be instigated by the mere pushing of a few buttons. It should not be necessary with a cyber-equivalent of Operation Centerboard before we step up to the task.\n## ORCID Marius Kristiansen http://orcid.org/0000-0002-6966-3553 Njaal Hoem http://orcid.org/0000-0001-6468-0111",
  "citations": {
    "style": "author_year",
    "flat_text": "COMPARATIVE STRATEGY AN INTERNATIONAL PROGRAM COMPARATIVE STRATEGY INFORMATION Comparative Strategy Routledge Taylor &amp; Francis Group ISSN: 0149-5933 (Print) 1521-0448 (Online) Journal homepage: www.tandfonline.com/journals/ucst20 # Small players in a limitless domain: Cyber deterrence as small state strategy Marius Kristiansen &amp; Njaal Hoem To cite this article: Marius Kristiansen &amp; Njaal Hoem (2022) Small players in a limitless domain: Cyber deterrence as small state strategy, Comparative Strategy, 41:1, 19-31, DOI: 10.1080/01495933.2021.2017740 To link to this article: https://doi.org/10.1080/01495933.2021.2017740 Published online: 02 Feb 2022.\nSubmit your article to this journal Article views: 708 View related articles View Crossmark data Full Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=ucst20 # Small players in a limitless domain: Cyber deterrence as small state strategy Marius Kristiansen, Njaal Hoem ## Abstract This article explores deterrence as an element in cybersecurity strategy from a small state perspective. The cyber domain presents novel challenges for strategy makers, and applying deterrence in the cyber domain requires an organized and multinational approach -- since few states can leverage deterrence in this all-encompassing domain on their own. Deterrence has been an important factor in shaping global security for half a century, but when applied to the cyber domain there are certain inherent mechanisms that must be understood in order to generate the desired effects. Key issues discussed are the volume of agents capable of operating and creating effects in the domain, and the availability of tools and techniques. These issues concerning actors and vectors makes it difficult to survey threats and create targeted deterrence. Furthermore, the cyber milieu makes it difficult to connect action to motives, thereby further complicating any attempt to analyze the actual importance of observable effects. From a strategist's point of view, these general characteristics are exacerbated by the fact that the international community does not have a common language or shared platform to uniformly approach these issues. Absent clarity on some fundamentals the core issues of attribution and proportionality becomes a hindrance to effective deterrence.\n## Introduction: A new domain -- for better and for worse Global connectivity is ever increasing,1 and our personal and social lives have become dependent on- and intertwined with the technological progress.2 Similarly, on the societal and nation-state level, we have far surpassed the point where electronic communication services (ECS) shifted from ancillary to pivotal. In Norway, ECS is on the top of the list of “critical public focus areas” -- deemed necessary to ensure the sustainment of “critical societal functions.”3 Access to the Internet, and by extension “the web” or “cyberspace”, undoubtedly offers historically unprecedented possibilities but also creates dependencies, and widespread dependence on the cyber domain at all levels of society and the state expose new challenges and vulnerabilities.4 And the flip side is grim.\nThe military and strategic community has already defined a “cyber domain,”5 and thus acknowledged that this is an arena also for strategic competition and for war.6 This is a globally recognized “truth”, and the cyber domain is increasingly becoming militarized. But the cyber domain is something “different.” While it is the fastest growing dimension of modern warfare, it is also the most obscure.\nWhen Norway signed the NATO “Cyber Defence Pledge” it was one of many markers for the increasing political and military acknowledgement that the cyber domain may represent one of the biggest gaps in existing security theory and strategy.\nThe domain is practically unregulated and unpoliced, and therefore highly unpredictable. The UN Secretary General has called out for the need to regulate warfare in the cyber domain, and the UN has on several occasions underlined the pressing need for common guidelines. Despite the fact that the global community, since the turn of the millennium, slowly but steadily has moved toward an acceptance of the applicability of international law (and the Charter of the United Nations) for states' actions in the cyber domain, we are still far from a consensus on what should be regulated and how.\nKeeping pace with the development in this “lawless” domain requires dedication, but also immense resources invested -- making the full utilization of cyber as a state-tool only obtainable by major powers. This logic has motivated some to argue that the current state of cyber is at “... the same stage of intellectual development as we were in the 1950s in relation to possible nuclear war.” The extension of the same logic has led several authors to argue that deterrence might be a navigable path toward strategic success in the cyber domain. In a global security perspective nuclear deterrence has undoubtedly played a pivotal role in shaping states' behavior on the international arena since 1945. If the same conceptions can be used to shape behavior in the digital space, it would have great global impact. Identifying how this can be done, and generally how the cyber domain can and should be regulated, is a task that affects us all. But, for high-tech small states where technology sets the agenda for all parts of state and society, it is critical.\nThe intention with this article is to outline some of the more prominent possibilities and challenges tied to cyber deterrence as part of a cybersecurity strategy. The authors argue that the ability to generate real cyber-deterrence depends on the establishment and accountability of a multinational and multi-departmental/sectorial cyberorganization. As will become evident in the following, both classical and extended deterrence theory are predicated on certain criteria, which do not easily translate to the cyber domain. The authors argue that these challenges make it more difficult, but perhaps even more important to identify how to generate deterrence in the cyber domain -- especially for high-tech small states, like Norway.\nCoping with this in an effective way presupposes that one looks at the width of deterrence theory over time, and small states must acknowledge their weaknesses and play to their strengths. The recommendations proposed are opening moves to do just that, and at the same time prepare to exploit complimentary effects of different dimensions of cyber-deterrence in the long run.\n## Deterrence: The concept Conceptually, deterrence can be described as using “...the threat of punishment, or increasing expected costs of an activity, to prevent an actor from taking an action they might otherwise take.” A traditional perception of deterrence as part of security strategy is that it involves influencing one or more actors' intentions. Three preconditions must be present for effective deterrence. Firstly, there must exist a real capability -- the ability to effectuate actions toward an adversary. Second, the threat must be credible -- the will to effectuate actions must not be questionable. And lastly, one must be able to communicate effectively -- ensuring that the message is clearly communicated to all relevant parties.\nWhen operationalized, there are four types of deterrence strategy. The two first are oftentimes referred to as “classical deterrence”, while the latter two are part of what has been dubbed “broad deterrence.” The first strategy has is deterrence by punishment. The second is deterrence by denial. Det third is deterrence by entanglement. The fourth is deterrence by norms. The desired deterrent effect is achieved when one has established the perception in a cost-benefit calculation that there is a real risk of disproportional consequences for actions that violates normative and/or stated premises. Security strategy based upon deterrence therefore depends on maintaining a perception of the ability and will to effectuate such consequences at all times.\nDeterrence is typically a superpower/major power strategical behavior. It is not excluded for small states, but within “classical deterrence” it is close to impossible for small states to unilaterally generate the necessary capability and credibility. States like Norway depend on security cooperation to achieve this. Small states are more likely to generate a degree of deterrence within the framework of “broad deterrence”, but this often depends on the existence of a universal normative baseline -- widely known and communicated. With perhaps the exception of deterrence by entanglement, small states are thus largely dependent on other actors to achieve any relevant deterrent effect.\nThere are in principle three main reasons why deterrence strategies fail. The first is that communicated consequences are not real. The second is when it is possible to avoid/circumvent the consequences because an actor exploits earlier unidentified loopholes. The third is when it is challenging, or impossible, to clearly communicate the message to the relevant actors. These factors might seem simple, but credible deterrence has proven difficult enough even with “only” four dimensions of warfare and security strategy. To generate credible deterrence in the fifth dimension -- cyber -- can prove difficult, for a multitude of reasons.\n## Cyber-deterrence challenges Cyber-deterrence can be defined as: > [...] a strategy by which a defending state seeks to maintain the status quo by signaling its intentions to deter hostile cyber activity by targeting and influencing an adversary's decision making apparatus to avoid engaging in destructive cyber activity for fear of a greater reprisal by the initial aggressor.\nLogically, all classes of deterrence theory should be domain-independent, and dependent on the three same criteria. However, an important difference between traditional deterrence and cyber-deterrence is that the latter seems to require a more coherent effort from both state and society. Cyber-threats are not only directed toward the state proper, but also other actors whose security nonetheless is pivotal to the security of society at large. The nature of the cyber domain also creates very specific challenges that also makes it difficult to meet all the criteria across the width of the different strategies.\n### Actors and vectors In contrast to other domains, there is an almost infinite number of actors that can influence the security situation in the cyber domain -- both directly and indirectly. This is largely due to the share number and accessibility of “vectors” in the digital space. In simple terms, a “vector” can be defined as: “... a specific method or technique to access equipment, computers, or systems to deliver hostile payload for a malicious outcome.”\nThe number of vectors, the complexity they represent, and the level of refinement increases daily. What seems like an almost exponential increase in this area permits a number of actions that are (1) challenging to detect and protect against, and (2) of a character that makes them difficult to define from a security perspective. The effects of the vectors span wide; from service-denial to manipulation and/or even destruction of data. The accessibility and design of vectors makes it possible for almost “anyone” with access to the Internet to influence the security situation in the cyber-domain. Actors ranging from nation states to organized groups and individuals acting alone can all create undesired effects.\nThe combination of the overwhelming number of vectors and possible actors makes it particularly demanding to generate deterrence in the digital space. This is primarily due to the large range of potential security-threats making it difficult to map up what to protect against and how, and it becomes increasingly difficult to respond to each individual infringement. Techniques and procedures to handle individual challenges are short-lived, and the security landscape is dynamic. Further, the credibility of traditional deterrence is undermined by the capability to address a large number of actors with different modus operandi. The number of actors is not necessarily a challenge for “broad deterrence” per se, but there are no recognized international norms in place, and the width of potential actors makes it difficult to charter where, how and to what extent mutual dependence caters to deterrence by entanglement.\n### Multitudes of motives The motivation for different actors' actions is also muddying the water. The motives span from large state actors' strategic objectives of global or regional character, to organized groups or individuals' actions for short-term financial gains or prestige. This means that the threat from the cyber-domain has an impact on all sides and levels of society. At the same time, the different motives and threat-actors are not always as independent as they can seem -- isolated “random” and “non-critical” actions can be part of a more deliberate and intricate cyber-operation. Even though individual effects are possible to identify and quantify, it is extremely difficult to identify the motivation behind each action, and whether multiple actions must be seen in relation. Thus, it also becomes difficult to assess how each (or all) incidents should be handled.\nDue to how these different (or indeed connected) motives are expressed in actions, inefficient cooperation and conflicts of interest will most likely arise between relevant actors -- whose cooperation and comprehensive efforts are crucial to cope with the conglomerate of threats in the cyber domain. Inter-state this might be due to the inability to see the correlated patterns of isolated incidents, because actors are unwilling to share information due to national security concerns -- or simply because one does not know what information to share. But even intra-state one is highly likely to experience conflicts of interest that undermine the comprehensive approach, which effective cyber deterrence requires. Commercial actors may be unwilling to share relevant data with state agencies in fear of lost confidentiality and customer trust, which in turn may affect revenue. The state itself may not want to share their data, methods and techniques with commercial actors, as this may reveal capabilities and vulnerabilities. The sum of these mechanisms means that it becomes incredibly difficult to attain a good situational awareness and understanding of the problem-complex, and therefore a comprehensive approach almost unattainable.\nWhen one combines the challenges of multitudes of motives with the dynamic of vectors and actors, it is quite obvious that the cyber-domain represents an incredibly complex and dynamic security-challenge. Effective handling of incidents requires an understanding of the context, to ensure that efforts and resources are prioritized where relevant effects can be achieved. This requires cooperation. A minimum to ensure credibility of cyber deterrence is a level of transparency -- as basis for collective efforts -- between actors that can be reasonably defined as part of the same target-complex.\n### Attribution and proportionality A basic premise for deterrence is the ability to identify who has committed the actions one is seeking to deter. As of now, there are no common and widely recognized method to ensure a definitive attribution of actions in the cyber domain. This is largely due to the multitude of actors and the difficulty of discerning the difference between who are the “tools” and who are the “brains”, but the most important factor is that many vectors have technical properties that prevent attribution. This means that clever actors can operate with very little risk; “...the technical properties of cyber-attack vectors that prevent attribution allow actors with near anonymity and impunity.”\nThe challenge of attribution can be divided in two categories: technical attribution and human attribution. To put it simply, technical attribution is a question of analyzing and identifying the vector and the node used. Human attribution often leans on technical attribution and collates this with other available information to identify who committed the action (the “tool”), and who sponsored or motivated the actions (the “brains”).\nFrom the side of the defending part, and especially small states, the question of attribution is extremely important. As a minimum, accurate attribution is a necessity to identify against who and what to protect in the future. Attribution is even more important when assessing whether and how to respond. This is equally important for all actors, but especially if one hopes to trigger a response from international organizations intended to manage global or regional security -- who are often the only real security-guarantors for small states. The U.S. have vindicated that they will respond toward threats in the cyber domain like they would in any other domain, and in 2016 the NATO Secretary General declared that major cyberattacks could activate a reaction from the Alliance. Still, it must be presumed that the target of the attack (and its allies) bears the burden of evidence if such provisions shall be activated.\nIn the cases where accurate attribution is possible, the next challenge is a proportional response. Again, there are no universally recognized international guidelines on how the principle of proportionality is to be managed in cyber space. At the most basic level it is a question of whether the response should take place in the same domain as the initial action. Defining where the threshold for response should be is equally important. These are questions NATO has already acknowledged, but there are significant differences of opinion within the Alliance -- as evidenced after the cyberattacks against Estonia in 2007. Estonian decision-makers interpreted the situation as a clear-cut cause to invoke NATO Article V, while the NATO leadership was not of the same opinion.\nThe challenges associated with attribution and proportionality obviously undermines the credibility of any deterrence-strategy, and at the same time the targeted state's credibility in more absolute terms. A response that is not seen as proportional or directed toward the wrong actor can have genuine consequences. The worst outcome is perhaps that it can cause an unintended escalation of a conflict that may not have been real or as grave as it was perceived. In some instances, reactions can be provoked by cyber-manipulation from an actor whose interests are served by creating/increasing tensions between the two parties. This is what one may call strategic exploitation of the challenges tied to attribution. Since the credibility of a state's overarching security policy is dependent on its ability to meet any and all cyberattacks with a proportional response, one is faced with a security policy-paradox; even though the state feels obliged to respond in order to maintain own credibility -- any response toward the wrong actor, or retaliations outside what is normatively seen as proportional, will have the opposite effect.\nFrom the perspective of a small state the question of attribution and proportionality therefore becomes especially important -- as their security is dependent on international support. These questions hamper the abilities to create coherent national security strategies, which presupposes clarity in what allied support can be expected when. This, in turn, has an explicit consequence for communicating effectively that deterrence relies on. As long as there is ambiguity tied to these questions, it creates and enormous room for maneuver for a potential attacker.\n### Lack of a shared conceptual foundation Despite all the challenges above, the most basic issue with the cyber-domain is the lack of a shared conceptual foundation to address the problems in question. Absent a shared terminology, procedures, and international judicial precedence it is difficult to establish effective deterrence. There are still major disputes between the large actors on simple issues such as terminology, and the meaning of concepts and terms. While the U.S. utilizes the term “cyber-security”, China and Russia have decided on “information-security.” This is more than a semantic discussion, as it directly influences the prerequisites for effective and clear communication: Without a common lexicon in place, communication between the two sides is fated to remain in disagreement [...]. [W]hen addressing hostile activities in cyberspace where the actors are foreign to each other, the inability to communicate further impedes the ability to send clear messages and deescalate tensions.”\nA complete agreement on terminology is perhaps utopian, but a minimum is necessary to address the most prevalent challenges. There have been many attempts to achieve this. The European initiative -- The 2001 Council of Europe's Convention on Cybercrime -- gives a short but precise description of the most important terminology needed in the cyber-domain. However, there are only about forty states that have actually ratified the convention, with Russia and China being the biggest actors who have chosen to refrain.\nAnother initiative was the establishment of NATO Cooperative Cyber Defence Center of Excellence in 2008, which aimed to handle principle questions regarding the defense of the alliance in the digital space. In the period between 2013-2017, the organization produced two editions of a manual intended to describe how NATO should deal with issues such as judicial questions in an international context. The manual also addresses whether and how actions in the cyber-dimension can be characterized as armed attack, although this definition deviates from the description given in NATO's Policy on cyber Defense. This dissonance only serves to underline the difficulties of establishing a shared conceptual framework -- even within the Alliance.\nRunning in parallel with the internal NATO processes, NATO has also been a promoter for establishing global norms and regulations. As mentioned in the introduction, this has been on the international agenda for a long time. Yet, there is still international disagreement on whether (and if so -- how) for instances international humanitarian law should apply in a cyber-conflict. Simple, but crucial, questions such as what can be seen as aggression in accordance with the UN Charter for cyber space has not been resolved either. With such questions it also seems apparent that some actors find it in their interest that the ambiguity remains: “Since the domain allows room to operate offensively below the threshold of what is seen as an armed attack, such operations can influence the power balance through stealing other states' intellectual property, or threaten infrastructure in a relevant state in peacetime” Lacking regulation in the cyber-domain hampers the ability to define what constitutes breach of norms, what is the threshold for legitimate response, and what a legitimate response is -- thereby making it excessively difficult to communicate effectively and clearly to potential attackers. The lack of clarity in this regard also opens up for already identified actors to attempt cyber-brinkmanship -- pushing it as far as they can while at the same time circumvent or avoid retribution because the legality and legitimacy of the response from any “victim” might be questioned. This undermines cyber-deterrence in general, but especially strategies based on deterrence by norms.\n## Cyber-deterrence strategy “The emergence of cyber as a separate domain of warfighting does not necessarily offer magic solutions and miraculous short-cuts to achieve strategic goals.”\nterrence as an overarching strategy is nothing new. Nuclear-deterrence was a response to a significant upheaval in the reality of global security policy -- not unlike (some would argue) the cyber-driven upheaval we are experiencing today. Therefore it is not unnatural that one attempts to draw parallels between known and tested strategies for nuclear-deterrence and cyber-deterrence. At the same time, it is important to be cognizant of the differences, and some have even gone as far as claiming that “...despite some crossover, there are too many inconsistencies that prevent an even partial adoption of the nuclear deterrence model.”\nThe four “problem areas” described above makes it difficult for any state with ambitions of deterrence in the cyber domain to satisfy the necessary preconditions for effective deterrence. Generally speaking, to get closer to creating real deterrence in the cyber-domain requires clarifications in several areas where there are currently too many unexplored variables and underdeveloped concept that undermines efficiency. This becomes most evident for the classical forms of deterrence, and especially deterrence by punishment, which requires absolute clarity in many of the above issues to be implemented. It might be relatively easier to establish the necessary preconditions for deterrence by denial, deterrence by entanglement, and deterrence by norms in a shorter time span.\nDeterrence by entanglement is an approach that might actually exploit what is normally seen as the main challenges in the cyber domain. The increasingly interconnectedness of actors (states, organizations, individuals) creates more potential vulnerabilities, but it can also make it more difficult to conduct offensive cyberoperations without causing collateral damage. By strengthening the emergence of virtual globalization, one can theoretically reduce the risk propensity of a would-be aggressor: “By more thoroughly entangling both friend and fore the aggregate benefits for maintaining and enhancing good behavior within the cyberspace increase and reinforce risk averse behaviors.” For small states, this might be the more attractive path, because it does not require parity in offensive and defensive cyber capabilities to have an effect. By creating stronger mutual dependence with partners and allies in the cyber domain, one can also effectively generate a situation where common defensive cyber capabilities are in everyone's interest, and thereby also corroborate a shared (Allied) deterrence by denial.\nHowever, for small states even situations of “entanglement” will often be highly asymmetrical, and unlikely to be a sufficient measure for efficient deterrence. Small states usually have a relatively weak position in the international system, but nonetheless have an opportunity to influence the norms for what is considered acceptable interaction between states -- and through this, to some degree, even out the imbalance of “hard power.” This acknowledgement is one of the reasons small states' security-strategies tend to focus on “idealistic and norm-oriented policy” with the aim of strengthening international institutions, norms and laws. To some extent, major powers will always operate according to the principle “might is right”, also outside established frameworks, but still risks being held accountable in accordance with these frameworks. The implications for states seen “in breach”, may be loss of legitimacy and support -- or sometimes more tangible reactions of e.g. economic nature. By working toward establishing and strengthening a normative framework for behavior in the cyber domain, one might be capable of generating real deterrence by norms. Such a framework would also constitute a viable “objective” basis to legitimize deterrence by punishment.\nTo establish effective frameworks for deterrence in the cyber-domain requires a collective effort, and the current staring point is not the best. But it is the only one we have. A smart first step might be to concretize the efforts through establishing a structure or organization whose purpose is to regulate cyber-behavior -- which in turn might enable cyber-deterrence to a larger degree, and in a more systematic manner. Such an organization should ideally find its basis in existing security cooperation and alliances but should not exclude a wider community of interest. Although we might think of a grander scale when it comes to cyber, the logic of the British Fighter Command gives an idea of how this could be structured. Without going into further details of how such an organization should/could be set up, it seems pertinent to comment that a “unified command” would form a better basis for any form of deterrence strategy. By tying the major powers to such an amalgamation of stake holders, it would also be possible to generate the capability necessary for all deterrence strategies -- something that would be impossible for small states outside such an organization.\nParticipation in the organization would also balance small states' norm-focused policies with what might be seen as an strengthening of alliances that to a larger degree also can serve as guarantors for concrete national interest in the short term. A balance between the apparently idealistic and very real alliances is an approach already well-known form Norwegian policy, strategy and doctrines. Such a divided focus might seem as contradictory, but is a quite rational choice. Empiricism tells us that that international laws and norms have limited value when conflict erupts between small and major states. Alliances and international normative frameworks thus become complimentary tools; where the former ensures that actors (through the threat of force) can be held accountable to the latter.\nA modern Fighter Command -- or Unified Cyber Command -- must also be granted authority to make decisions that commits participating states, and there-through regulates behavior both between members internally -- and between the organization and the international society at large. The organization would play a major role in establishing the premises for international cyber behavior and thereby by an important actor in the forming of norms. As such, the establishment of a Unified Cyber Command would serve both the need for short term security and the wish for a better regulated cyber-domain in the long term. This would also be complimentary and mutually reinforcing efforts, where a Unified Cyber Command can strengthen the establishment of normative frameworks -- which in turn forms a stronger basis for how the Unified Cyber Command acts in the domain. Put differently; a Unified Cyber Command might form a viable basis for classical deterrence, while it may also be an important agent in forming the framework needed for deterrence by norms.\n## Conclusion: Implications for small states Based on the challenges and possibilities that exist in the cyber-domain, and the options deterrence-theory offers, what should small states like Norway do? Firstly, one must acknowledge the inherent limitations of small states -- also in the cyber-domain. Cyber-security is a demanding task, and it is reasonable to assume that the highest effects can be achieved together with others. Secondly, we see it as well substantiated that deterrence has a place in cyber-security strategy, if one does not see the different deterrence strategies as mutually exclusive but complimentary. Norway may very well entertain several lines of operations to achieve more robust deterrence. Thirdly, it is important to start immediately to explore how one can establish a coherent strategy for realizing true deterrence in the cyber-domain -- both in the short and the long term. Whether ideas like a modern Unified Cyber Command are realistic or practical are difficult to discern before one starts to explore the array of opportunities.\nAs the situation now stands, cyberattacks of varying sorts represents an extension of the classical kinetic conflict, but with attractive qualities such as plausible deniability. Our assessment is that it is important to start a grander initiative before the isolationist urge behind proverbial firewalls and security-measures, the search for profit, or the fear of being tricked increases the threshold even higher. For small states, like Norway, it is significant to realize what major powers like the US has already recognized as a necessity; establishing an internationally recognized, cross-sectorial cross-departmental organization, that also includes private actors -- with the responsibility of regulating the cyber-domain for the common good. Without such an initiative, the world will soon find itself at the edge of a cliff (if we are not already there), with an excellent view over a anarchistic cyber-landscape eating away on the solid foundation we now stand on -- as the cyber-domain becomes ever more dominant in all aspects of our interactions. A landscape paved with good intentions, where individual actors have done their best to create order from chaos, but thereby paradoxically contributing to its character of contradictory policies, rules and expectations. This landscape allows regional or even global conflicts to be instigated by the mere pushing of a few buttons. It should not be necessary with a cyber-equivalent of Operation Centerboard before we step up to the task.\n## ORCID Marius Kristiansen http://orcid.org/0000-0002-6966-3553 Njaal Hoem http://orcid.org/0000-0001-6468-0111",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 59,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "COMPARATIVE STRATEGY\nAN INTERNATIONAL PROGRAM\nCOMPARATIVE STRATEGY\nINFORMATION\nComparative Strategy\nRoutledge Taylor &amp; Francis Group\nISSN: 0149-5933 (Print) 1521-0448 (Online) Journal homepage: www.tandfonline.com/journals/ucst20\n# Small players in a limitless domain: Cyber deterrence as small state strategy\nMarius Kristiansen &amp; Njaal Hoem\nTo cite this article: Marius Kristiansen &amp; Njaal Hoem (2022) Small players in a limitless domain: Cyber deterrence as small state strategy, Comparative Strategy, 41:1, 19-31, DOI: 10.1080/01495933.2021.2017740\nTo link to this article: https://doi.org/10.1080/01495933.2021.2017740\nPublished online: 02 Feb 2022.\nSubmit your article to this journal\nArticle views: 708\nView related articles\nView Crossmark data\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=ucst20\n# Small players in a limitless domain: Cyber deterrence as small state strategy\nMarius Kristiansen, Njaal Hoem\n## Abstract\nThis article explores deterrence as an element in cybersecurity strategy from a small state perspective. The cyber domain presents novel challenges for strategy makers, and applying deterrence in the cyber domain requires an organized and multinational approach -- since few states can leverage deterrence in this all-encompassing domain on their own. Deterrence has been an important factor in shaping global security for half a century, but when applied to the cyber domain there are certain inherent mechanisms that must be understood in order to generate the desired effects. Key issues discussed are the volume of agents capable of operating and creating effects in the domain, and the availability of tools and techniques. These issues concerning actors and vectors makes it difficult to survey threats and create targeted deterrence. Furthermore, the cyber milieu makes it difficult to connect action to motives, thereby further complicating any attempt to analyze the actual importance of observable effects. From a strategist's point of view, these general characteristics are exacerbated by the fact that the international community does not have a common language or shared platform to uniformly approach these issues. Absent clarity on some fundamentals the core issues of attribution and proportionality becomes a hindrance to effective deterrence.\n## Introduction: A new domain -- for better and for worse\nGlobal connectivity is ever increasing,1 and our personal and social lives have become dependent on- and intertwined with the technological progress.2 Similarly, on the societal and nation-state level, we have far surpassed the point where electronic communication services (ECS) shifted from ancillary to pivotal. In Norway, ECS is on the top of the list of “critical public focus areas” -- deemed necessary to ensure the sustainment of “critical societal functions.”3 Access to the Internet, and by extension “the web” or “cyberspace”, undoubtedly offers historically unprecedented possibilities but also creates dependencies, and widespread dependence on the cyber domain at all levels of society and the state expose new challenges and vulnerabilities.4 And the flip side is grim.\nThe military and strategic community has already defined a “cyber domain,”5 and thus acknowledged that this is an arena also for strategic competition and for war.6\nThis is a globally recognized “truth”, and the cyber domain is increasingly becoming militarized. But the cyber domain is something “different.” While it is the fastest growing dimension of modern warfare, it is also the most obscure.\nWhen Norway signed the NATO “Cyber Defence Pledge” it was one of many markers for the increasing political and military acknowledgement that the cyber domain may represent one of the biggest gaps in existing security theory and strategy.\nThe domain is practically unregulated and unpoliced, and therefore highly unpredictable. The UN Secretary General has called out for the need to regulate warfare in the cyber domain, and the UN has on several occasions underlined the pressing need for common guidelines. Despite the fact that the global community, since the turn of the millennium, slowly but steadily has moved toward an acceptance of the applicability of international law (and the Charter of the United Nations) for states' actions in the cyber domain, we are still far from a consensus on what should be regulated and how.\nKeeping pace with the development in this “lawless” domain requires dedication, but also immense resources invested -- making the full utilization of cyber as a state-tool only obtainable by major powers. This logic has motivated some to argue that the current state of cyber is at “... the same stage of intellectual development as we were in the 1950s in relation to possible nuclear war.” The extension of the same logic has led several authors to argue that deterrence might be a navigable path toward strategic success in the cyber domain. In a global security perspective nuclear deterrence has undoubtedly played a pivotal role in shaping states' behavior on the international arena since 1945. If the same conceptions can be used to shape behavior in the digital space, it would have great global impact. Identifying how this can be done, and generally how the cyber domain can and should be regulated, is a task that affects us all. But, for high-tech small states where technology sets the agenda for all parts of state and society, it is critical.\nThe intention with this article is to outline some of the more prominent possibilities and challenges tied to cyber deterrence as part of a cybersecurity strategy. The authors argue that the ability to generate real cyber-deterrence depends on the establishment and accountability of a multinational and multi-departmental/sectorial cyberorganization. As will become evident in the following, both classical and extended deterrence theory are predicated on certain criteria, which do not easily translate to the cyber domain. The authors argue that these challenges make it more difficult, but perhaps even more important to identify how to generate deterrence in the cyber domain -- especially for high-tech small states, like Norway.\nCoping with this in an effective way presupposes that one looks at the width of deterrence theory over time, and small states must acknowledge their weaknesses and play to their strengths. The recommendations proposed are opening moves to do just that, and at the same time prepare to exploit complimentary effects of different dimensions of cyber-deterrence in the long run.\n## Deterrence: The concept\nConceptually, deterrence can be described as using “...the threat of punishment, or increasing expected costs of an activity, to prevent an actor from taking an action\nthey might otherwise take.” A traditional perception of deterrence as part of security strategy is that it involves influencing one or more actors' intentions. Three preconditions must be present for effective deterrence. Firstly, there must exist a real capability -- the ability to effectuate actions toward an adversary. Second, the threat must be credible -- the will to effectuate actions must not be questionable. And lastly, one must be able to communicate effectively -- ensuring that the message is clearly communicated to all relevant parties.\nWhen operationalized, there are four types of deterrence strategy. The two first are oftentimes referred to as “classical deterrence”, while the latter two are part of what has been dubbed “broad deterrence.” The first strategy has is deterrence by punishment. The second is deterrence by denial. Det third is deterrence by entanglement. The fourth is deterrence by norms. The desired deterrent effect is achieved when one has established the perception in a cost-benefit calculation that there is a real risk of disproportional consequences for actions that violates normative and/or stated premises. Security strategy based upon deterrence therefore depends on maintaining a perception of the ability and will to effectuate such consequences at all times.\nDeterrence is typically a superpower/major power strategical behavior. It is not excluded for small states, but within “classical deterrence” it is close to impossible for small states to unilaterally generate the necessary capability and credibility. States like Norway depend on security cooperation to achieve this. Small states are more likely to generate a degree of deterrence within the framework of “broad deterrence”, but this often depends on the existence of a universal normative baseline -- widely known and communicated. With perhaps the exception of deterrence by entanglement, small states are thus largely dependent on other actors to achieve any relevant deterrent effect.\nThere are in principle three main reasons why deterrence strategies fail. The first is that communicated consequences are not real. The second is when it is possible to avoid/circumvent the consequences because an actor exploits earlier unidentified loopholes. The third is when it is challenging, or impossible, to clearly communicate the message to the relevant actors. These factors might seem simple, but credible deterrence has proven difficult enough even with “only” four dimensions of warfare and security strategy. To generate credible deterrence in the fifth dimension -- cyber -- can prove difficult, for a multitude of reasons.\n## Cyber-deterrence challenges\nCyber-deterrence can be defined as:\n> [...] a strategy by which a defending state seeks to maintain the status quo by signaling its intentions to deter hostile cyber activity by targeting and influencing an adversary's decision making apparatus to avoid engaging in destructive cyber activity for fear of a greater reprisal by the initial aggressor.\nLogically, all classes of deterrence theory should be domain-independent, and dependent on the three same criteria. However, an important difference between traditional deterrence and cyber-deterrence is that the latter seems to require a more coherent effort from both state and society. Cyber-threats are not only directed toward the state proper, but also other actors whose security nonetheless is pivotal to the security of\nsociety at large. The nature of the cyber domain also creates very specific challenges that also makes it difficult to meet all the criteria across the width of the different strategies.\n### Actors and vectors\nIn contrast to other domains, there is an almost infinite number of actors that can influence the security situation in the cyber domain -- both directly and indirectly. This is largely due to the share number and accessibility of “vectors” in the digital space. In simple terms, a “vector” can be defined as: “... a specific method or technique to access equipment, computers, or systems to deliver hostile payload for a malicious outcome.”\nThe number of vectors, the complexity they represent, and the level of refinement increases daily. What seems like an almost exponential increase in this area permits a number of actions that are (1) challenging to detect and protect against, and (2) of a character that makes them difficult to define from a security perspective. The effects of the vectors span wide; from service-denial to manipulation and/or even destruction of data. The accessibility and design of vectors makes it possible for almost “anyone” with access to the Internet to influence the security situation in the cyber-domain. Actors ranging from nation states to organized groups and individuals acting alone can all create undesired effects.\nThe combination of the overwhelming number of vectors and possible actors makes it particularly demanding to generate deterrence in the digital space. This is primarily due to the large range of potential security-threats making it difficult to map up what to protect against and how, and it becomes increasingly difficult to respond to each individual infringement. Techniques and procedures to handle individual challenges are short-lived, and the security landscape is dynamic. Further, the credibility of traditional deterrence is undermined by the capability to address a large number of actors with different modus operandi. The number of actors is not necessarily a challenge for “broad deterrence” per se, but there are no recognized international norms in place, and the width of potential actors makes it difficult to charter where, how and to what extent mutual dependence caters to deterrence by entanglement.\n### Multitudes of motives\nThe motivation for different actors' actions is also muddying the water. The motives span from large state actors' strategic objectives of global or regional character, to organized groups or individuals' actions for short-term financial gains or prestige. This means that the threat from the cyber-domain has an impact on all sides and levels of society. At the same time, the different motives and threat-actors are not always as independent as they can seem -- isolated “random” and “non-critical” actions can be part of a more deliberate and intricate cyber-operation. Even though individual effects are possible to identify and quantify, it is extremely difficult to identify the motivation behind each action, and whether multiple actions must be seen in relation. Thus, it also becomes difficult to assess how each (or all) incidents should be handled.\nDue to how these different (or indeed connected) motives are expressed in actions, inefficient cooperation and conflicts of interest will most likely arise between relevant actors -- whose cooperation and comprehensive efforts are crucial to cope with the conglomerate of threats in the cyber domain. Inter-state this might be due to the inability to see the correlated patterns of isolated incidents, because actors are unwilling to share information due to national security concerns -- or simply because one does not know what information to share. But even intra-state one is highly likely to experience conflicts of interest that undermine the comprehensive approach, which effective cyber deterrence requires. Commercial actors may be unwilling to share relevant data with state agencies in fear of lost confidentiality and customer trust, which in turn may affect revenue. The state itself may not want to share their data, methods and techniques with commercial actors, as this may reveal capabilities and vulnerabilities. The sum of these mechanisms means that it becomes incredibly difficult to attain a good situational awareness and understanding of the problem-complex, and therefore a comprehensive approach almost unattainable.\nWhen one combines the challenges of multitudes of motives with the dynamic of vectors and actors, it is quite obvious that the cyber-domain represents an incredibly complex and dynamic security-challenge. Effective handling of incidents requires an understanding of the context, to ensure that efforts and resources are prioritized where relevant effects can be achieved. This requires cooperation. A minimum to ensure credibility of cyber deterrence is a level of transparency -- as basis for collective efforts -- between actors that can be reasonably defined as part of the same target-complex.\n### Attribution and proportionality\nA basic premise for deterrence is the ability to identify who has committed the actions one is seeking to deter. As of now, there are no common and widely recognized method to ensure a definitive attribution of actions in the cyber domain. This is largely due to the multitude of actors and the difficulty of discerning the difference between who are the “tools” and who are the “brains”, but the most important factor is that many vectors have technical properties that prevent attribution. This means that clever actors can operate with very little risk; “...the technical properties of cyber-attack vectors that prevent attribution allow actors with near anonymity and impunity.”\nThe challenge of attribution can be divided in two categories: technical attribution and human attribution. To put it simply, technical attribution is a question of analyzing and identifying the vector and the node used. Human attribution often leans on technical attribution and collates this with other available information to identify who committed the action (the “tool”), and who sponsored or motivated the actions (the “brains”).\nFrom the side of the defending part, and especially small states, the question of attribution is extremely important. As a minimum, accurate attribution is a necessity to identify against who and what to protect in the future. Attribution is even more important when assessing whether and how to respond. This is equally important for all actors, but especially if one hopes to trigger a response from international organizations intended to manage global or regional security -- who are often the only real\nsecurity-guarantors for small states. The U.S. have vindicated that they will respond toward threats in the cyber domain like they would in any other domain, and in 2016 the NATO Secretary General declared that major cyberattacks could activate a reaction from the Alliance. Still, it must be presumed that the target of the attack (and its allies) bears the burden of evidence if such provisions shall be activated.\nIn the cases where accurate attribution is possible, the next challenge is a proportional response. Again, there are no universally recognized international guidelines on how the principle of proportionality is to be managed in cyber space. At the most basic level it is a question of whether the response should take place in the same domain as the initial action. Defining where the threshold for response should be is equally important. These are questions NATO has already acknowledged, but there are significant differences of opinion within the Alliance -- as evidenced after the cyberattacks against Estonia in 2007. Estonian decision-makers interpreted the situation as a clear-cut cause to invoke NATO Article V, while the NATO leadership was not of the same opinion.\nThe challenges associated with attribution and proportionality obviously undermines the credibility of any deterrence-strategy, and at the same time the targeted state's credibility in more absolute terms. A response that is not seen as proportional or directed toward the wrong actor can have genuine consequences. The worst outcome is perhaps that it can cause an unintended escalation of a conflict that may not have been real or as grave as it was perceived. In some instances, reactions can be provoked by cyber-manipulation from an actor whose interests are served by creating/increasing tensions between the two parties. This is what one may call strategic exploitation of the challenges tied to attribution. Since the credibility of a state's overarching security policy is dependent on its ability to meet any and all cyberattacks with a proportional response, one is faced with a security policy-paradox; even though the state feels obliged to respond in order to maintain own credibility -- any response toward the wrong actor, or retaliations outside what is normatively seen as proportional, will have the opposite effect.\nFrom the perspective of a small state the question of attribution and proportionality therefore becomes especially important -- as their security is dependent on international support. These questions hamper the abilities to create coherent national security strategies, which presupposes clarity in what allied support can be expected when. This, in turn, has an explicit consequence for communicating effectively that deterrence relies on. As long as there is ambiguity tied to these questions, it creates and enormous room for maneuver for a potential attacker.\n### Lack of a shared conceptual foundation\nDespite all the challenges above, the most basic issue with the cyber-domain is the lack of a shared conceptual foundation to address the problems in question. Absent a shared terminology, procedures, and international judicial precedence it is difficult to establish effective deterrence. There are still major disputes between the large actors on simple issues such as terminology, and the meaning of concepts and terms. While the U.S. utilizes the term “cyber-security”, China and Russia have decided on “information-security.” This is more than a semantic discussion, as it directly influences the prerequisites for effective and clear communication:\nWithout a common lexicon in place, communication between the two sides is fated to remain in disagreement [...]. [W]hen addressing hostile activities in cyberspace where the actors are foreign to each other, the inability to communicate further impedes the ability to send clear messages and deescalate tensions.”\nA complete agreement on terminology is perhaps utopian, but a minimum is necessary to address the most prevalent challenges. There have been many attempts to achieve this. The European initiative -- The 2001 Council of Europe's Convention on Cybercrime -- gives a short but precise description of the most important terminology needed in the cyber-domain. However, there are only about forty states that have actually ratified the convention, with Russia and China being the biggest actors who have chosen to refrain.\nAnother initiative was the establishment of NATO Cooperative Cyber Defence Center of Excellence in 2008, which aimed to handle principle questions regarding the defense of the alliance in the digital space. In the period between 2013-2017, the organization produced two editions of a manual intended to describe how NATO should deal with issues such as judicial questions in an international context. The manual also addresses whether and how actions in the cyber-dimension can be characterized as armed attack, although this definition deviates from the description given in NATO's Policy on cyber Defense. This dissonance only serves to underline the difficulties of establishing a shared conceptual framework -- even within the Alliance.\nRunning in parallel with the internal NATO processes, NATO has also been a promoter for establishing global norms and regulations. As mentioned in the introduction, this has been on the international agenda for a long time. Yet, there is still international disagreement on whether (and if so -- how) for instances international humanitarian law should apply in a cyber-conflict. Simple, but crucial, questions such as what can be seen as aggression in accordance with the UN Charter for cyber space has not been resolved either. With such questions it also seems apparent that some actors find it in their interest that the ambiguity remains: “Since the domain allows room to operate offensively below the threshold of what is seen as an armed attack, such operations can influence the power balance through stealing other states' intellectual property, or threaten infrastructure in a relevant state in peacetime”\nLacking regulation in the cyber-domain hampers the ability to define what constitutes breach of norms, what is the threshold for legitimate response, and what a legitimate response is -- thereby making it excessively difficult to communicate effectively and clearly to potential attackers. The lack of clarity in this regard also opens up for already identified actors to attempt cyber-brinkmanship -- pushing it as far as they can while at the same time circumvent or avoid retribution because the legality and legitimacy of the response from any “victim” might be questioned. This undermines cyber-deterrence in general, but especially strategies based on deterrence by norms.\n## Cyber-deterrence strategy\n“The emergence of cyber as a separate domain of warfighting does not necessarily offer magic solutions and miraculous short-cuts to achieve strategic goals.”\nterrence as an overarching strategy is nothing new. Nuclear-deterrence was a response to a significant upheaval in the reality of global security policy -- not unlike (some would argue) the cyber-driven upheaval we are experiencing today. Therefore it is not unnatural that one attempts to draw parallels between known and tested strategies for nuclear-deterrence and cyber-deterrence. At the same time, it is important to be cognizant of the differences, and some have even gone as far as claiming that “...despite some crossover, there are too many inconsistencies that prevent an even partial adoption of the nuclear deterrence model.”\nThe four “problem areas” described above makes it difficult for any state with ambitions of deterrence in the cyber domain to satisfy the necessary preconditions for effective deterrence. Generally speaking, to get closer to creating real deterrence in the cyber-domain requires clarifications in several areas where there are currently too many unexplored variables and underdeveloped concept that undermines efficiency. This becomes most evident for the classical forms of deterrence, and especially deterrence by punishment, which requires absolute clarity in many of the above issues to be implemented. It might be relatively easier to establish the necessary preconditions for deterrence by denial, deterrence by entanglement, and deterrence by norms in a shorter time span.\nDeterrence by entanglement is an approach that might actually exploit what is normally seen as the main challenges in the cyber domain. The increasingly interconnectedness of actors (states, organizations, individuals) creates more potential vulnerabilities, but it can also make it more difficult to conduct offensive cyberoperations without causing collateral damage. By strengthening the emergence of virtual globalization, one can theoretically reduce the risk propensity of a would-be aggressor: “By more thoroughly entangling both friend and fore the aggregate benefits for maintaining and enhancing good behavior within the cyberspace increase and reinforce risk averse behaviors.” For small states, this might be the more attractive path, because it does not require parity in offensive and defensive cyber capabilities to have an effect. By creating stronger mutual dependence with partners and allies in the cyber domain, one can also effectively generate a situation where common defensive cyber capabilities are in everyone's interest, and thereby also corroborate a shared (Allied) deterrence by denial.\nHowever, for small states even situations of “entanglement” will often be highly asymmetrical, and unlikely to be a sufficient measure for efficient deterrence. Small states usually have a relatively weak position in the international system, but nonetheless have an opportunity to influence the norms for what is considered acceptable interaction between states -- and through this, to some degree, even out the imbalance of “hard power.” This acknowledgement is one of the reasons small states' security-strategies tend to focus on “idealistic and norm-oriented policy” with the aim of strengthening international institutions, norms and laws. To some extent, major powers will always operate according to the principle “might is right”, also outside established frameworks, but still risks being held accountable in accordance with these frameworks. The implications for states seen “in breach”, may be loss of legitimacy and support -- or sometimes more tangible reactions of e.g. economic nature. By working toward establishing and strengthening a normative framework for behavior\nin the cyber domain, one might be capable of generating real deterrence by norms. Such a framework would also constitute a viable “objective” basis to legitimize deterrence by punishment.\nTo establish effective frameworks for deterrence in the cyber-domain requires a collective effort, and the current staring point is not the best. But it is the only one we have. A smart first step might be to concretize the efforts through establishing a structure or organization whose purpose is to regulate cyber-behavior -- which in turn might enable cyber-deterrence to a larger degree, and in a more systematic manner. Such an organization should ideally find its basis in existing security cooperation and alliances but should not exclude a wider community of interest. Although we might think of a grander scale when it comes to cyber, the logic of the British Fighter Command gives an idea of how this could be structured. Without going into further details of how such an organization should/could be set up, it seems pertinent to comment that a “unified command” would form a better basis for any form of deterrence strategy. By tying the major powers to such an amalgamation of stake holders, it would also be possible to generate the capability necessary for all deterrence strategies -- something that would be impossible for small states outside such an organization.\nParticipation in the organization would also balance small states' norm-focused policies with what might be seen as an strengthening of alliances that to a larger degree also can serve as guarantors for concrete national interest in the short term. A balance between the apparently idealistic and very real alliances is an approach already well-known form Norwegian policy, strategy and doctrines. Such a divided focus might seem as contradictory, but is a quite rational choice. Empiricism tells us that that international laws and norms have limited value when conflict erupts between small and major states. Alliances and international normative frameworks thus become complimentary tools; where the former ensures that actors (through the threat of force) can be held accountable to the latter.\nA modern Fighter Command -- or Unified Cyber Command -- must also be granted authority to make decisions that commits participating states, and there-through regulates behavior both between members internally -- and between the organization and the international society at large. The organization would play a major role in establishing the premises for international cyber behavior and thereby by an important actor in the forming of norms. As such, the establishment of a Unified Cyber Command would serve both the need for short term security and the wish for a better regulated cyber-domain in the long term. This would also be complimentary and mutually reinforcing efforts, where a Unified Cyber Command can strengthen the establishment of normative frameworks -- which in turn forms a stronger basis for how the Unified Cyber Command acts in the domain. Put differently; a Unified Cyber Command might form a viable basis for classical deterrence, while it may also be an important agent in forming the framework needed for deterrence by norms.\n## Conclusion: Implications for small states\nBased on the challenges and possibilities that exist in the cyber-domain, and the options deterrence-theory offers, what should small states like Norway do? Firstly, one\nmust acknowledge the inherent limitations of small states -- also in the cyber-domain. Cyber-security is a demanding task, and it is reasonable to assume that the highest effects can be achieved together with others. Secondly, we see it as well substantiated that deterrence has a place in cyber-security strategy, if one does not see the different deterrence strategies as mutually exclusive but complimentary. Norway may very well entertain several lines of operations to achieve more robust deterrence. Thirdly, it is important to start immediately to explore how one can establish a coherent strategy for realizing true deterrence in the cyber-domain -- both in the short and the long term. Whether ideas like a modern Unified Cyber Command are realistic or practical are difficult to discern before one starts to explore the array of opportunities.\nAs the situation now stands, cyberattacks of varying sorts represents an extension of the classical kinetic conflict, but with attractive qualities such as plausible deniability. Our assessment is that it is important to start a grander initiative before the isolationist urge behind proverbial firewalls and security-measures, the search for profit, or the fear of being tricked increases the threshold even higher. For small states, like Norway, it is significant to realize what major powers like the US has already recognized as a necessity; establishing an internationally recognized, cross-sectorial cross-departmental organization, that also includes private actors -- with the responsibility of regulating the cyber-domain for the common good. Without such an initiative, the world will soon find itself at the edge of a cliff (if we are not already there), with an excellent view over a anarchistic cyber-landscape eating away on the solid foundation we now stand on -- as the cyber-domain becomes ever more dominant in all aspects of our interactions. A landscape paved with good intentions, where individual actors have done their best to create order from chaos, but thereby paradoxically contributing to its character of contradictory policies, rules and expectations. This landscape allows regional or even global conflicts to be instigated by the mere pushing of a few buttons. It should not be necessary with a cyber-equivalent of Operation Centerboard before we step up to the task.\n## ORCID\nMarius Kristiansen http://orcid.org/0000-0002-6966-3553\nNjaal Hoem http://orcid.org/0000-0001-6468-0111"
    },
    "numeric": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 59,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "COMPARATIVE STRATEGY\nAN INTERNATIONAL PROGRAM\nCOMPARATIVE STRATEGY\nINFORMATION\nComparative Strategy\nRoutledge Taylor &amp; Francis Group\nISSN: 0149-5933 (Print) 1521-0448 (Online) Journal homepage: www.tandfonline.com/journals/ucst20\n# Small players in a limitless domain: Cyber deterrence as small state strategy\nMarius Kristiansen &amp; Njaal Hoem\nTo cite this article: Marius Kristiansen &amp; Njaal Hoem (2022) Small players in a limitless domain: Cyber deterrence as small state strategy, Comparative Strategy, 41:1, 19-31, DOI: 10.1080/01495933.2021.2017740\nTo link to this article: https://doi.org/10.1080/01495933.2021.2017740\nPublished online: 02 Feb 2022.\nSubmit your article to this journal\nArticle views: 708\nView related articles\nView Crossmark data\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=ucst20\n# Small players in a limitless domain: Cyber deterrence as small state strategy\nMarius Kristiansen, Njaal Hoem\n## Abstract\nThis article explores deterrence as an element in cybersecurity strategy from a small state perspective. The cyber domain presents novel challenges for strategy makers, and applying deterrence in the cyber domain requires an organized and multinational approach -- since few states can leverage deterrence in this all-encompassing domain on their own. Deterrence has been an important factor in shaping global security for half a century, but when applied to the cyber domain there are certain inherent mechanisms that must be understood in order to generate the desired effects. Key issues discussed are the volume of agents capable of operating and creating effects in the domain, and the availability of tools and techniques. These issues concerning actors and vectors makes it difficult to survey threats and create targeted deterrence. Furthermore, the cyber milieu makes it difficult to connect action to motives, thereby further complicating any attempt to analyze the actual importance of observable effects. From a strategist's point of view, these general characteristics are exacerbated by the fact that the international community does not have a common language or shared platform to uniformly approach these issues. Absent clarity on some fundamentals the core issues of attribution and proportionality becomes a hindrance to effective deterrence.\n## Introduction: A new domain -- for better and for worse\nGlobal connectivity is ever increasing,1 and our personal and social lives have become dependent on- and intertwined with the technological progress.2 Similarly, on the societal and nation-state level, we have far surpassed the point where electronic communication services (ECS) shifted from ancillary to pivotal. In Norway, ECS is on the top of the list of “critical public focus areas” -- deemed necessary to ensure the sustainment of “critical societal functions.”3 Access to the Internet, and by extension “the web” or “cyberspace”, undoubtedly offers historically unprecedented possibilities but also creates dependencies, and widespread dependence on the cyber domain at all levels of society and the state expose new challenges and vulnerabilities.4 And the flip side is grim.\nThe military and strategic community has already defined a “cyber domain,”5 and thus acknowledged that this is an arena also for strategic competition and for war.6\nThis is a globally recognized “truth”, and the cyber domain is increasingly becoming militarized. But the cyber domain is something “different.” While it is the fastest growing dimension of modern warfare, it is also the most obscure.\nWhen Norway signed the NATO “Cyber Defence Pledge” it was one of many markers for the increasing political and military acknowledgement that the cyber domain may represent one of the biggest gaps in existing security theory and strategy.\nThe domain is practically unregulated and unpoliced, and therefore highly unpredictable. The UN Secretary General has called out for the need to regulate warfare in the cyber domain, and the UN has on several occasions underlined the pressing need for common guidelines. Despite the fact that the global community, since the turn of the millennium, slowly but steadily has moved toward an acceptance of the applicability of international law (and the Charter of the United Nations) for states' actions in the cyber domain, we are still far from a consensus on what should be regulated and how.\nKeeping pace with the development in this “lawless” domain requires dedication, but also immense resources invested -- making the full utilization of cyber as a state-tool only obtainable by major powers. This logic has motivated some to argue that the current state of cyber is at “... the same stage of intellectual development as we were in the 1950s in relation to possible nuclear war.” The extension of the same logic has led several authors to argue that deterrence might be a navigable path toward strategic success in the cyber domain. In a global security perspective nuclear deterrence has undoubtedly played a pivotal role in shaping states' behavior on the international arena since 1945. If the same conceptions can be used to shape behavior in the digital space, it would have great global impact. Identifying how this can be done, and generally how the cyber domain can and should be regulated, is a task that affects us all. But, for high-tech small states where technology sets the agenda for all parts of state and society, it is critical.\nThe intention with this article is to outline some of the more prominent possibilities and challenges tied to cyber deterrence as part of a cybersecurity strategy. The authors argue that the ability to generate real cyber-deterrence depends on the establishment and accountability of a multinational and multi-departmental/sectorial cyberorganization. As will become evident in the following, both classical and extended deterrence theory are predicated on certain criteria, which do not easily translate to the cyber domain. The authors argue that these challenges make it more difficult, but perhaps even more important to identify how to generate deterrence in the cyber domain -- especially for high-tech small states, like Norway.\nCoping with this in an effective way presupposes that one looks at the width of deterrence theory over time, and small states must acknowledge their weaknesses and play to their strengths. The recommendations proposed are opening moves to do just that, and at the same time prepare to exploit complimentary effects of different dimensions of cyber-deterrence in the long run.\n## Deterrence: The concept\nConceptually, deterrence can be described as using “...the threat of punishment, or increasing expected costs of an activity, to prevent an actor from taking an action\nthey might otherwise take.” A traditional perception of deterrence as part of security strategy is that it involves influencing one or more actors' intentions. Three preconditions must be present for effective deterrence. Firstly, there must exist a real capability -- the ability to effectuate actions toward an adversary. Second, the threat must be credible -- the will to effectuate actions must not be questionable. And lastly, one must be able to communicate effectively -- ensuring that the message is clearly communicated to all relevant parties.\nWhen operationalized, there are four types of deterrence strategy. The two first are oftentimes referred to as “classical deterrence”, while the latter two are part of what has been dubbed “broad deterrence.” The first strategy has is deterrence by punishment. The second is deterrence by denial. Det third is deterrence by entanglement. The fourth is deterrence by norms. The desired deterrent effect is achieved when one has established the perception in a cost-benefit calculation that there is a real risk of disproportional consequences for actions that violates normative and/or stated premises. Security strategy based upon deterrence therefore depends on maintaining a perception of the ability and will to effectuate such consequences at all times.\nDeterrence is typically a superpower/major power strategical behavior. It is not excluded for small states, but within “classical deterrence” it is close to impossible for small states to unilaterally generate the necessary capability and credibility. States like Norway depend on security cooperation to achieve this. Small states are more likely to generate a degree of deterrence within the framework of “broad deterrence”, but this often depends on the existence of a universal normative baseline -- widely known and communicated. With perhaps the exception of deterrence by entanglement, small states are thus largely dependent on other actors to achieve any relevant deterrent effect.\nThere are in principle three main reasons why deterrence strategies fail. The first is that communicated consequences are not real. The second is when it is possible to avoid/circumvent the consequences because an actor exploits earlier unidentified loopholes. The third is when it is challenging, or impossible, to clearly communicate the message to the relevant actors. These factors might seem simple, but credible deterrence has proven difficult enough even with “only” four dimensions of warfare and security strategy. To generate credible deterrence in the fifth dimension -- cyber -- can prove difficult, for a multitude of reasons.\n## Cyber-deterrence challenges\nCyber-deterrence can be defined as:\n> [...] a strategy by which a defending state seeks to maintain the status quo by signaling its intentions to deter hostile cyber activity by targeting and influencing an adversary's decision making apparatus to avoid engaging in destructive cyber activity for fear of a greater reprisal by the initial aggressor.\nLogically, all classes of deterrence theory should be domain-independent, and dependent on the three same criteria. However, an important difference between traditional deterrence and cyber-deterrence is that the latter seems to require a more coherent effort from both state and society. Cyber-threats are not only directed toward the state proper, but also other actors whose security nonetheless is pivotal to the security of\nsociety at large. The nature of the cyber domain also creates very specific challenges that also makes it difficult to meet all the criteria across the width of the different strategies.\n### Actors and vectors\nIn contrast to other domains, there is an almost infinite number of actors that can influence the security situation in the cyber domain -- both directly and indirectly. This is largely due to the share number and accessibility of “vectors” in the digital space. In simple terms, a “vector” can be defined as: “... a specific method or technique to access equipment, computers, or systems to deliver hostile payload for a malicious outcome.”\nThe number of vectors, the complexity they represent, and the level of refinement increases daily. What seems like an almost exponential increase in this area permits a number of actions that are (1) challenging to detect and protect against, and (2) of a character that makes them difficult to define from a security perspective. The effects of the vectors span wide; from service-denial to manipulation and/or even destruction of data. The accessibility and design of vectors makes it possible for almost “anyone” with access to the Internet to influence the security situation in the cyber-domain. Actors ranging from nation states to organized groups and individuals acting alone can all create undesired effects.\nThe combination of the overwhelming number of vectors and possible actors makes it particularly demanding to generate deterrence in the digital space. This is primarily due to the large range of potential security-threats making it difficult to map up what to protect against and how, and it becomes increasingly difficult to respond to each individual infringement. Techniques and procedures to handle individual challenges are short-lived, and the security landscape is dynamic. Further, the credibility of traditional deterrence is undermined by the capability to address a large number of actors with different modus operandi. The number of actors is not necessarily a challenge for “broad deterrence” per se, but there are no recognized international norms in place, and the width of potential actors makes it difficult to charter where, how and to what extent mutual dependence caters to deterrence by entanglement.\n### Multitudes of motives\nThe motivation for different actors' actions is also muddying the water. The motives span from large state actors' strategic objectives of global or regional character, to organized groups or individuals' actions for short-term financial gains or prestige. This means that the threat from the cyber-domain has an impact on all sides and levels of society. At the same time, the different motives and threat-actors are not always as independent as they can seem -- isolated “random” and “non-critical” actions can be part of a more deliberate and intricate cyber-operation. Even though individual effects are possible to identify and quantify, it is extremely difficult to identify the motivation behind each action, and whether multiple actions must be seen in relation. Thus, it also becomes difficult to assess how each (or all) incidents should be handled.\nDue to how these different (or indeed connected) motives are expressed in actions, inefficient cooperation and conflicts of interest will most likely arise between relevant actors -- whose cooperation and comprehensive efforts are crucial to cope with the conglomerate of threats in the cyber domain. Inter-state this might be due to the inability to see the correlated patterns of isolated incidents, because actors are unwilling to share information due to national security concerns -- or simply because one does not know what information to share. But even intra-state one is highly likely to experience conflicts of interest that undermine the comprehensive approach, which effective cyber deterrence requires. Commercial actors may be unwilling to share relevant data with state agencies in fear of lost confidentiality and customer trust, which in turn may affect revenue. The state itself may not want to share their data, methods and techniques with commercial actors, as this may reveal capabilities and vulnerabilities. The sum of these mechanisms means that it becomes incredibly difficult to attain a good situational awareness and understanding of the problem-complex, and therefore a comprehensive approach almost unattainable.\nWhen one combines the challenges of multitudes of motives with the dynamic of vectors and actors, it is quite obvious that the cyber-domain represents an incredibly complex and dynamic security-challenge. Effective handling of incidents requires an understanding of the context, to ensure that efforts and resources are prioritized where relevant effects can be achieved. This requires cooperation. A minimum to ensure credibility of cyber deterrence is a level of transparency -- as basis for collective efforts -- between actors that can be reasonably defined as part of the same target-complex.\n### Attribution and proportionality\nA basic premise for deterrence is the ability to identify who has committed the actions one is seeking to deter. As of now, there are no common and widely recognized method to ensure a definitive attribution of actions in the cyber domain. This is largely due to the multitude of actors and the difficulty of discerning the difference between who are the “tools” and who are the “brains”, but the most important factor is that many vectors have technical properties that prevent attribution. This means that clever actors can operate with very little risk; “...the technical properties of cyber-attack vectors that prevent attribution allow actors with near anonymity and impunity.”\nThe challenge of attribution can be divided in two categories: technical attribution and human attribution. To put it simply, technical attribution is a question of analyzing and identifying the vector and the node used. Human attribution often leans on technical attribution and collates this with other available information to identify who committed the action (the “tool”), and who sponsored or motivated the actions (the “brains”).\nFrom the side of the defending part, and especially small states, the question of attribution is extremely important. As a minimum, accurate attribution is a necessity to identify against who and what to protect in the future. Attribution is even more important when assessing whether and how to respond. This is equally important for all actors, but especially if one hopes to trigger a response from international organizations intended to manage global or regional security -- who are often the only real\nsecurity-guarantors for small states. The U.S. have vindicated that they will respond toward threats in the cyber domain like they would in any other domain, and in 2016 the NATO Secretary General declared that major cyberattacks could activate a reaction from the Alliance. Still, it must be presumed that the target of the attack (and its allies) bears the burden of evidence if such provisions shall be activated.\nIn the cases where accurate attribution is possible, the next challenge is a proportional response. Again, there are no universally recognized international guidelines on how the principle of proportionality is to be managed in cyber space. At the most basic level it is a question of whether the response should take place in the same domain as the initial action. Defining where the threshold for response should be is equally important. These are questions NATO has already acknowledged, but there are significant differences of opinion within the Alliance -- as evidenced after the cyberattacks against Estonia in 2007. Estonian decision-makers interpreted the situation as a clear-cut cause to invoke NATO Article V, while the NATO leadership was not of the same opinion.\nThe challenges associated with attribution and proportionality obviously undermines the credibility of any deterrence-strategy, and at the same time the targeted state's credibility in more absolute terms. A response that is not seen as proportional or directed toward the wrong actor can have genuine consequences. The worst outcome is perhaps that it can cause an unintended escalation of a conflict that may not have been real or as grave as it was perceived. In some instances, reactions can be provoked by cyber-manipulation from an actor whose interests are served by creating/increasing tensions between the two parties. This is what one may call strategic exploitation of the challenges tied to attribution. Since the credibility of a state's overarching security policy is dependent on its ability to meet any and all cyberattacks with a proportional response, one is faced with a security policy-paradox; even though the state feels obliged to respond in order to maintain own credibility -- any response toward the wrong actor, or retaliations outside what is normatively seen as proportional, will have the opposite effect.\nFrom the perspective of a small state the question of attribution and proportionality therefore becomes especially important -- as their security is dependent on international support. These questions hamper the abilities to create coherent national security strategies, which presupposes clarity in what allied support can be expected when. This, in turn, has an explicit consequence for communicating effectively that deterrence relies on. As long as there is ambiguity tied to these questions, it creates and enormous room for maneuver for a potential attacker.\n### Lack of a shared conceptual foundation\nDespite all the challenges above, the most basic issue with the cyber-domain is the lack of a shared conceptual foundation to address the problems in question. Absent a shared terminology, procedures, and international judicial precedence it is difficult to establish effective deterrence. There are still major disputes between the large actors on simple issues such as terminology, and the meaning of concepts and terms. While the U.S. utilizes the term “cyber-security”, China and Russia have decided on “information-security.” This is more than a semantic discussion, as it directly influences the prerequisites for effective and clear communication:\nWithout a common lexicon in place, communication between the two sides is fated to remain in disagreement [...]. [W]hen addressing hostile activities in cyberspace where the actors are foreign to each other, the inability to communicate further impedes the ability to send clear messages and deescalate tensions.”\nA complete agreement on terminology is perhaps utopian, but a minimum is necessary to address the most prevalent challenges. There have been many attempts to achieve this. The European initiative -- The 2001 Council of Europe's Convention on Cybercrime -- gives a short but precise description of the most important terminology needed in the cyber-domain. However, there are only about forty states that have actually ratified the convention, with Russia and China being the biggest actors who have chosen to refrain.\nAnother initiative was the establishment of NATO Cooperative Cyber Defence Center of Excellence in 2008, which aimed to handle principle questions regarding the defense of the alliance in the digital space. In the period between 2013-2017, the organization produced two editions of a manual intended to describe how NATO should deal with issues such as judicial questions in an international context. The manual also addresses whether and how actions in the cyber-dimension can be characterized as armed attack, although this definition deviates from the description given in NATO's Policy on cyber Defense. This dissonance only serves to underline the difficulties of establishing a shared conceptual framework -- even within the Alliance.\nRunning in parallel with the internal NATO processes, NATO has also been a promoter for establishing global norms and regulations. As mentioned in the introduction, this has been on the international agenda for a long time. Yet, there is still international disagreement on whether (and if so -- how) for instances international humanitarian law should apply in a cyber-conflict. Simple, but crucial, questions such as what can be seen as aggression in accordance with the UN Charter for cyber space has not been resolved either. With such questions it also seems apparent that some actors find it in their interest that the ambiguity remains: “Since the domain allows room to operate offensively below the threshold of what is seen as an armed attack, such operations can influence the power balance through stealing other states' intellectual property, or threaten infrastructure in a relevant state in peacetime”\nLacking regulation in the cyber-domain hampers the ability to define what constitutes breach of norms, what is the threshold for legitimate response, and what a legitimate response is -- thereby making it excessively difficult to communicate effectively and clearly to potential attackers. The lack of clarity in this regard also opens up for already identified actors to attempt cyber-brinkmanship -- pushing it as far as they can while at the same time circumvent or avoid retribution because the legality and legitimacy of the response from any “victim” might be questioned. This undermines cyber-deterrence in general, but especially strategies based on deterrence by norms.\n## Cyber-deterrence strategy\n“The emergence of cyber as a separate domain of warfighting does not necessarily offer magic solutions and miraculous short-cuts to achieve strategic goals.”\nterrence as an overarching strategy is nothing new. Nuclear-deterrence was a response to a significant upheaval in the reality of global security policy -- not unlike (some would argue) the cyber-driven upheaval we are experiencing today. Therefore it is not unnatural that one attempts to draw parallels between known and tested strategies for nuclear-deterrence and cyber-deterrence. At the same time, it is important to be cognizant of the differences, and some have even gone as far as claiming that “...despite some crossover, there are too many inconsistencies that prevent an even partial adoption of the nuclear deterrence model.”\nThe four “problem areas” described above makes it difficult for any state with ambitions of deterrence in the cyber domain to satisfy the necessary preconditions for effective deterrence. Generally speaking, to get closer to creating real deterrence in the cyber-domain requires clarifications in several areas where there are currently too many unexplored variables and underdeveloped concept that undermines efficiency. This becomes most evident for the classical forms of deterrence, and especially deterrence by punishment, which requires absolute clarity in many of the above issues to be implemented. It might be relatively easier to establish the necessary preconditions for deterrence by denial, deterrence by entanglement, and deterrence by norms in a shorter time span.\nDeterrence by entanglement is an approach that might actually exploit what is normally seen as the main challenges in the cyber domain. The increasingly interconnectedness of actors (states, organizations, individuals) creates more potential vulnerabilities, but it can also make it more difficult to conduct offensive cyberoperations without causing collateral damage. By strengthening the emergence of virtual globalization, one can theoretically reduce the risk propensity of a would-be aggressor: “By more thoroughly entangling both friend and fore the aggregate benefits for maintaining and enhancing good behavior within the cyberspace increase and reinforce risk averse behaviors.” For small states, this might be the more attractive path, because it does not require parity in offensive and defensive cyber capabilities to have an effect. By creating stronger mutual dependence with partners and allies in the cyber domain, one can also effectively generate a situation where common defensive cyber capabilities are in everyone's interest, and thereby also corroborate a shared (Allied) deterrence by denial.\nHowever, for small states even situations of “entanglement” will often be highly asymmetrical, and unlikely to be a sufficient measure for efficient deterrence. Small states usually have a relatively weak position in the international system, but nonetheless have an opportunity to influence the norms for what is considered acceptable interaction between states -- and through this, to some degree, even out the imbalance of “hard power.” This acknowledgement is one of the reasons small states' security-strategies tend to focus on “idealistic and norm-oriented policy” with the aim of strengthening international institutions, norms and laws. To some extent, major powers will always operate according to the principle “might is right”, also outside established frameworks, but still risks being held accountable in accordance with these frameworks. The implications for states seen “in breach”, may be loss of legitimacy and support -- or sometimes more tangible reactions of e.g. economic nature. By working toward establishing and strengthening a normative framework for behavior\nin the cyber domain, one might be capable of generating real deterrence by norms. Such a framework would also constitute a viable “objective” basis to legitimize deterrence by punishment.\nTo establish effective frameworks for deterrence in the cyber-domain requires a collective effort, and the current staring point is not the best. But it is the only one we have. A smart first step might be to concretize the efforts through establishing a structure or organization whose purpose is to regulate cyber-behavior -- which in turn might enable cyber-deterrence to a larger degree, and in a more systematic manner. Such an organization should ideally find its basis in existing security cooperation and alliances but should not exclude a wider community of interest. Although we might think of a grander scale when it comes to cyber, the logic of the British Fighter Command gives an idea of how this could be structured. Without going into further details of how such an organization should/could be set up, it seems pertinent to comment that a “unified command” would form a better basis for any form of deterrence strategy. By tying the major powers to such an amalgamation of stake holders, it would also be possible to generate the capability necessary for all deterrence strategies -- something that would be impossible for small states outside such an organization.\nParticipation in the organization would also balance small states' norm-focused policies with what might be seen as an strengthening of alliances that to a larger degree also can serve as guarantors for concrete national interest in the short term. A balance between the apparently idealistic and very real alliances is an approach already well-known form Norwegian policy, strategy and doctrines. Such a divided focus might seem as contradictory, but is a quite rational choice. Empiricism tells us that that international laws and norms have limited value when conflict erupts between small and major states. Alliances and international normative frameworks thus become complimentary tools; where the former ensures that actors (through the threat of force) can be held accountable to the latter.\nA modern Fighter Command -- or Unified Cyber Command -- must also be granted authority to make decisions that commits participating states, and there-through regulates behavior both between members internally -- and between the organization and the international society at large. The organization would play a major role in establishing the premises for international cyber behavior and thereby by an important actor in the forming of norms. As such, the establishment of a Unified Cyber Command would serve both the need for short term security and the wish for a better regulated cyber-domain in the long term. This would also be complimentary and mutually reinforcing efforts, where a Unified Cyber Command can strengthen the establishment of normative frameworks -- which in turn forms a stronger basis for how the Unified Cyber Command acts in the domain. Put differently; a Unified Cyber Command might form a viable basis for classical deterrence, while it may also be an important agent in forming the framework needed for deterrence by norms.\n## Conclusion: Implications for small states\nBased on the challenges and possibilities that exist in the cyber-domain, and the options deterrence-theory offers, what should small states like Norway do? Firstly, one\nmust acknowledge the inherent limitations of small states -- also in the cyber-domain. Cyber-security is a demanding task, and it is reasonable to assume that the highest effects can be achieved together with others. Secondly, we see it as well substantiated that deterrence has a place in cyber-security strategy, if one does not see the different deterrence strategies as mutually exclusive but complimentary. Norway may very well entertain several lines of operations to achieve more robust deterrence. Thirdly, it is important to start immediately to explore how one can establish a coherent strategy for realizing true deterrence in the cyber-domain -- both in the short and the long term. Whether ideas like a modern Unified Cyber Command are realistic or practical are difficult to discern before one starts to explore the array of opportunities.\nAs the situation now stands, cyberattacks of varying sorts represents an extension of the classical kinetic conflict, but with attractive qualities such as plausible deniability. Our assessment is that it is important to start a grander initiative before the isolationist urge behind proverbial firewalls and security-measures, the search for profit, or the fear of being tricked increases the threshold even higher. For small states, like Norway, it is significant to realize what major powers like the US has already recognized as a necessity; establishing an internationally recognized, cross-sectorial cross-departmental organization, that also includes private actors -- with the responsibility of regulating the cyber-domain for the common good. Without such an initiative, the world will soon find itself at the edge of a cliff (if we are not already there), with an excellent view over a anarchistic cyber-landscape eating away on the solid foundation we now stand on -- as the cyber-domain becomes ever more dominant in all aspects of our interactions. A landscape paved with good intentions, where individual actors have done their best to create order from chaos, but thereby paradoxically contributing to its character of contradictory policies, rules and expectations. This landscape allows regional or even global conflicts to be instigated by the mere pushing of a few buttons. It should not be necessary with a cyber-equivalent of Operation Centerboard before we step up to the task.\n## ORCID\nMarius Kristiansen http://orcid.org/0000-0002-6966-3553\nNjaal Hoem http://orcid.org/0000-0001-6468-0111"
    },
    "author_year": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 123,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "author_year"
      },
      "results": [],
      "flat_text": "COMPARATIVE STRATEGY AN INTERNATIONAL PROGRAM COMPARATIVE STRATEGY INFORMATION Comparative Strategy Routledge Taylor &amp; Francis Group ISSN: 0149-5933 (Print) 1521-0448 (Online) Journal homepage: www.tandfonline.com/journals/ucst20 # Small players in a limitless domain: Cyber deterrence as small state strategy Marius Kristiansen &amp; Njaal Hoem To cite this article: Marius Kristiansen &amp; Njaal Hoem (2022) Small players in a limitless domain: Cyber deterrence as small state strategy, Comparative Strategy, 41:1, 19-31, DOI: 10.1080/01495933.2021.2017740 To link to this article: https://doi.org/10.1080/01495933.2021.2017740 Published online: 02 Feb 2022.\nSubmit your article to this journal Article views: 708 View related articles View Crossmark data Full Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=ucst20 # Small players in a limitless domain: Cyber deterrence as small state strategy Marius Kristiansen, Njaal Hoem ## Abstract This article explores deterrence as an element in cybersecurity strategy from a small state perspective. The cyber domain presents novel challenges for strategy makers, and applying deterrence in the cyber domain requires an organized and multinational approach -- since few states can leverage deterrence in this all-encompassing domain on their own. Deterrence has been an important factor in shaping global security for half a century, but when applied to the cyber domain there are certain inherent mechanisms that must be understood in order to generate the desired effects. Key issues discussed are the volume of agents capable of operating and creating effects in the domain, and the availability of tools and techniques. These issues concerning actors and vectors makes it difficult to survey threats and create targeted deterrence. Furthermore, the cyber milieu makes it difficult to connect action to motives, thereby further complicating any attempt to analyze the actual importance of observable effects. From a strategist's point of view, these general characteristics are exacerbated by the fact that the international community does not have a common language or shared platform to uniformly approach these issues. Absent clarity on some fundamentals the core issues of attribution and proportionality becomes a hindrance to effective deterrence.\n## Introduction: A new domain -- for better and for worse Global connectivity is ever increasing,1 and our personal and social lives have become dependent on- and intertwined with the technological progress.2 Similarly, on the societal and nation-state level, we have far surpassed the point where electronic communication services (ECS) shifted from ancillary to pivotal. In Norway, ECS is on the top of the list of “critical public focus areas” -- deemed necessary to ensure the sustainment of “critical societal functions.”3 Access to the Internet, and by extension “the web” or “cyberspace”, undoubtedly offers historically unprecedented possibilities but also creates dependencies, and widespread dependence on the cyber domain at all levels of society and the state expose new challenges and vulnerabilities.4 And the flip side is grim.\nThe military and strategic community has already defined a “cyber domain,”5 and thus acknowledged that this is an arena also for strategic competition and for war.6 This is a globally recognized “truth”, and the cyber domain is increasingly becoming militarized. But the cyber domain is something “different.” While it is the fastest growing dimension of modern warfare, it is also the most obscure.\nWhen Norway signed the NATO “Cyber Defence Pledge” it was one of many markers for the increasing political and military acknowledgement that the cyber domain may represent one of the biggest gaps in existing security theory and strategy.\nThe domain is practically unregulated and unpoliced, and therefore highly unpredictable. The UN Secretary General has called out for the need to regulate warfare in the cyber domain, and the UN has on several occasions underlined the pressing need for common guidelines. Despite the fact that the global community, since the turn of the millennium, slowly but steadily has moved toward an acceptance of the applicability of international law (and the Charter of the United Nations) for states' actions in the cyber domain, we are still far from a consensus on what should be regulated and how.\nKeeping pace with the development in this “lawless” domain requires dedication, but also immense resources invested -- making the full utilization of cyber as a state-tool only obtainable by major powers. This logic has motivated some to argue that the current state of cyber is at “... the same stage of intellectual development as we were in the 1950s in relation to possible nuclear war.” The extension of the same logic has led several authors to argue that deterrence might be a navigable path toward strategic success in the cyber domain. In a global security perspective nuclear deterrence has undoubtedly played a pivotal role in shaping states' behavior on the international arena since 1945. If the same conceptions can be used to shape behavior in the digital space, it would have great global impact. Identifying how this can be done, and generally how the cyber domain can and should be regulated, is a task that affects us all. But, for high-tech small states where technology sets the agenda for all parts of state and society, it is critical.\nThe intention with this article is to outline some of the more prominent possibilities and challenges tied to cyber deterrence as part of a cybersecurity strategy. The authors argue that the ability to generate real cyber-deterrence depends on the establishment and accountability of a multinational and multi-departmental/sectorial cyberorganization. As will become evident in the following, both classical and extended deterrence theory are predicated on certain criteria, which do not easily translate to the cyber domain. The authors argue that these challenges make it more difficult, but perhaps even more important to identify how to generate deterrence in the cyber domain -- especially for high-tech small states, like Norway.\nCoping with this in an effective way presupposes that one looks at the width of deterrence theory over time, and small states must acknowledge their weaknesses and play to their strengths. The recommendations proposed are opening moves to do just that, and at the same time prepare to exploit complimentary effects of different dimensions of cyber-deterrence in the long run.\n## Deterrence: The concept Conceptually, deterrence can be described as using “...the threat of punishment, or increasing expected costs of an activity, to prevent an actor from taking an action they might otherwise take.” A traditional perception of deterrence as part of security strategy is that it involves influencing one or more actors' intentions. Three preconditions must be present for effective deterrence. Firstly, there must exist a real capability -- the ability to effectuate actions toward an adversary. Second, the threat must be credible -- the will to effectuate actions must not be questionable. And lastly, one must be able to communicate effectively -- ensuring that the message is clearly communicated to all relevant parties.\nWhen operationalized, there are four types of deterrence strategy. The two first are oftentimes referred to as “classical deterrence”, while the latter two are part of what has been dubbed “broad deterrence.” The first strategy has is deterrence by punishment. The second is deterrence by denial. Det third is deterrence by entanglement. The fourth is deterrence by norms. The desired deterrent effect is achieved when one has established the perception in a cost-benefit calculation that there is a real risk of disproportional consequences for actions that violates normative and/or stated premises. Security strategy based upon deterrence therefore depends on maintaining a perception of the ability and will to effectuate such consequences at all times.\nDeterrence is typically a superpower/major power strategical behavior. It is not excluded for small states, but within “classical deterrence” it is close to impossible for small states to unilaterally generate the necessary capability and credibility. States like Norway depend on security cooperation to achieve this. Small states are more likely to generate a degree of deterrence within the framework of “broad deterrence”, but this often depends on the existence of a universal normative baseline -- widely known and communicated. With perhaps the exception of deterrence by entanglement, small states are thus largely dependent on other actors to achieve any relevant deterrent effect.\nThere are in principle three main reasons why deterrence strategies fail. The first is that communicated consequences are not real. The second is when it is possible to avoid/circumvent the consequences because an actor exploits earlier unidentified loopholes. The third is when it is challenging, or impossible, to clearly communicate the message to the relevant actors. These factors might seem simple, but credible deterrence has proven difficult enough even with “only” four dimensions of warfare and security strategy. To generate credible deterrence in the fifth dimension -- cyber -- can prove difficult, for a multitude of reasons.\n## Cyber-deterrence challenges Cyber-deterrence can be defined as: > [...] a strategy by which a defending state seeks to maintain the status quo by signaling its intentions to deter hostile cyber activity by targeting and influencing an adversary's decision making apparatus to avoid engaging in destructive cyber activity for fear of a greater reprisal by the initial aggressor.\nLogically, all classes of deterrence theory should be domain-independent, and dependent on the three same criteria. However, an important difference between traditional deterrence and cyber-deterrence is that the latter seems to require a more coherent effort from both state and society. Cyber-threats are not only directed toward the state proper, but also other actors whose security nonetheless is pivotal to the security of society at large. The nature of the cyber domain also creates very specific challenges that also makes it difficult to meet all the criteria across the width of the different strategies.\n### Actors and vectors In contrast to other domains, there is an almost infinite number of actors that can influence the security situation in the cyber domain -- both directly and indirectly. This is largely due to the share number and accessibility of “vectors” in the digital space. In simple terms, a “vector” can be defined as: “... a specific method or technique to access equipment, computers, or systems to deliver hostile payload for a malicious outcome.”\nThe number of vectors, the complexity they represent, and the level of refinement increases daily. What seems like an almost exponential increase in this area permits a number of actions that are (1) challenging to detect and protect against, and (2) of a character that makes them difficult to define from a security perspective. The effects of the vectors span wide; from service-denial to manipulation and/or even destruction of data. The accessibility and design of vectors makes it possible for almost “anyone” with access to the Internet to influence the security situation in the cyber-domain. Actors ranging from nation states to organized groups and individuals acting alone can all create undesired effects.\nThe combination of the overwhelming number of vectors and possible actors makes it particularly demanding to generate deterrence in the digital space. This is primarily due to the large range of potential security-threats making it difficult to map up what to protect against and how, and it becomes increasingly difficult to respond to each individual infringement. Techniques and procedures to handle individual challenges are short-lived, and the security landscape is dynamic. Further, the credibility of traditional deterrence is undermined by the capability to address a large number of actors with different modus operandi. The number of actors is not necessarily a challenge for “broad deterrence” per se, but there are no recognized international norms in place, and the width of potential actors makes it difficult to charter where, how and to what extent mutual dependence caters to deterrence by entanglement.\n### Multitudes of motives The motivation for different actors' actions is also muddying the water. The motives span from large state actors' strategic objectives of global or regional character, to organized groups or individuals' actions for short-term financial gains or prestige. This means that the threat from the cyber-domain has an impact on all sides and levels of society. At the same time, the different motives and threat-actors are not always as independent as they can seem -- isolated “random” and “non-critical” actions can be part of a more deliberate and intricate cyber-operation. Even though individual effects are possible to identify and quantify, it is extremely difficult to identify the motivation behind each action, and whether multiple actions must be seen in relation. Thus, it also becomes difficult to assess how each (or all) incidents should be handled.\nDue to how these different (or indeed connected) motives are expressed in actions, inefficient cooperation and conflicts of interest will most likely arise between relevant actors -- whose cooperation and comprehensive efforts are crucial to cope with the conglomerate of threats in the cyber domain. Inter-state this might be due to the inability to see the correlated patterns of isolated incidents, because actors are unwilling to share information due to national security concerns -- or simply because one does not know what information to share. But even intra-state one is highly likely to experience conflicts of interest that undermine the comprehensive approach, which effective cyber deterrence requires. Commercial actors may be unwilling to share relevant data with state agencies in fear of lost confidentiality and customer trust, which in turn may affect revenue. The state itself may not want to share their data, methods and techniques with commercial actors, as this may reveal capabilities and vulnerabilities. The sum of these mechanisms means that it becomes incredibly difficult to attain a good situational awareness and understanding of the problem-complex, and therefore a comprehensive approach almost unattainable.\nWhen one combines the challenges of multitudes of motives with the dynamic of vectors and actors, it is quite obvious that the cyber-domain represents an incredibly complex and dynamic security-challenge. Effective handling of incidents requires an understanding of the context, to ensure that efforts and resources are prioritized where relevant effects can be achieved. This requires cooperation. A minimum to ensure credibility of cyber deterrence is a level of transparency -- as basis for collective efforts -- between actors that can be reasonably defined as part of the same target-complex.\n### Attribution and proportionality A basic premise for deterrence is the ability to identify who has committed the actions one is seeking to deter. As of now, there are no common and widely recognized method to ensure a definitive attribution of actions in the cyber domain. This is largely due to the multitude of actors and the difficulty of discerning the difference between who are the “tools” and who are the “brains”, but the most important factor is that many vectors have technical properties that prevent attribution. This means that clever actors can operate with very little risk; “...the technical properties of cyber-attack vectors that prevent attribution allow actors with near anonymity and impunity.”\nThe challenge of attribution can be divided in two categories: technical attribution and human attribution. To put it simply, technical attribution is a question of analyzing and identifying the vector and the node used. Human attribution often leans on technical attribution and collates this with other available information to identify who committed the action (the “tool”), and who sponsored or motivated the actions (the “brains”).\nFrom the side of the defending part, and especially small states, the question of attribution is extremely important. As a minimum, accurate attribution is a necessity to identify against who and what to protect in the future. Attribution is even more important when assessing whether and how to respond. This is equally important for all actors, but especially if one hopes to trigger a response from international organizations intended to manage global or regional security -- who are often the only real security-guarantors for small states. The U.S. have vindicated that they will respond toward threats in the cyber domain like they would in any other domain, and in 2016 the NATO Secretary General declared that major cyberattacks could activate a reaction from the Alliance. Still, it must be presumed that the target of the attack (and its allies) bears the burden of evidence if such provisions shall be activated.\nIn the cases where accurate attribution is possible, the next challenge is a proportional response. Again, there are no universally recognized international guidelines on how the principle of proportionality is to be managed in cyber space. At the most basic level it is a question of whether the response should take place in the same domain as the initial action. Defining where the threshold for response should be is equally important. These are questions NATO has already acknowledged, but there are significant differences of opinion within the Alliance -- as evidenced after the cyberattacks against Estonia in 2007. Estonian decision-makers interpreted the situation as a clear-cut cause to invoke NATO Article V, while the NATO leadership was not of the same opinion.\nThe challenges associated with attribution and proportionality obviously undermines the credibility of any deterrence-strategy, and at the same time the targeted state's credibility in more absolute terms. A response that is not seen as proportional or directed toward the wrong actor can have genuine consequences. The worst outcome is perhaps that it can cause an unintended escalation of a conflict that may not have been real or as grave as it was perceived. In some instances, reactions can be provoked by cyber-manipulation from an actor whose interests are served by creating/increasing tensions between the two parties. This is what one may call strategic exploitation of the challenges tied to attribution. Since the credibility of a state's overarching security policy is dependent on its ability to meet any and all cyberattacks with a proportional response, one is faced with a security policy-paradox; even though the state feels obliged to respond in order to maintain own credibility -- any response toward the wrong actor, or retaliations outside what is normatively seen as proportional, will have the opposite effect.\nFrom the perspective of a small state the question of attribution and proportionality therefore becomes especially important -- as their security is dependent on international support. These questions hamper the abilities to create coherent national security strategies, which presupposes clarity in what allied support can be expected when. This, in turn, has an explicit consequence for communicating effectively that deterrence relies on. As long as there is ambiguity tied to these questions, it creates and enormous room for maneuver for a potential attacker.\n### Lack of a shared conceptual foundation Despite all the challenges above, the most basic issue with the cyber-domain is the lack of a shared conceptual foundation to address the problems in question. Absent a shared terminology, procedures, and international judicial precedence it is difficult to establish effective deterrence. There are still major disputes between the large actors on simple issues such as terminology, and the meaning of concepts and terms. While the U.S. utilizes the term “cyber-security”, China and Russia have decided on “information-security.” This is more than a semantic discussion, as it directly influences the prerequisites for effective and clear communication: Without a common lexicon in place, communication between the two sides is fated to remain in disagreement [...]. [W]hen addressing hostile activities in cyberspace where the actors are foreign to each other, the inability to communicate further impedes the ability to send clear messages and deescalate tensions.”\nA complete agreement on terminology is perhaps utopian, but a minimum is necessary to address the most prevalent challenges. There have been many attempts to achieve this. The European initiative -- The 2001 Council of Europe's Convention on Cybercrime -- gives a short but precise description of the most important terminology needed in the cyber-domain. However, there are only about forty states that have actually ratified the convention, with Russia and China being the biggest actors who have chosen to refrain.\nAnother initiative was the establishment of NATO Cooperative Cyber Defence Center of Excellence in 2008, which aimed to handle principle questions regarding the defense of the alliance in the digital space. In the period between 2013-2017, the organization produced two editions of a manual intended to describe how NATO should deal with issues such as judicial questions in an international context. The manual also addresses whether and how actions in the cyber-dimension can be characterized as armed attack, although this definition deviates from the description given in NATO's Policy on cyber Defense. This dissonance only serves to underline the difficulties of establishing a shared conceptual framework -- even within the Alliance.\nRunning in parallel with the internal NATO processes, NATO has also been a promoter for establishing global norms and regulations. As mentioned in the introduction, this has been on the international agenda for a long time. Yet, there is still international disagreement on whether (and if so -- how) for instances international humanitarian law should apply in a cyber-conflict. Simple, but crucial, questions such as what can be seen as aggression in accordance with the UN Charter for cyber space has not been resolved either. With such questions it also seems apparent that some actors find it in their interest that the ambiguity remains: “Since the domain allows room to operate offensively below the threshold of what is seen as an armed attack, such operations can influence the power balance through stealing other states' intellectual property, or threaten infrastructure in a relevant state in peacetime” Lacking regulation in the cyber-domain hampers the ability to define what constitutes breach of norms, what is the threshold for legitimate response, and what a legitimate response is -- thereby making it excessively difficult to communicate effectively and clearly to potential attackers. The lack of clarity in this regard also opens up for already identified actors to attempt cyber-brinkmanship -- pushing it as far as they can while at the same time circumvent or avoid retribution because the legality and legitimacy of the response from any “victim” might be questioned. This undermines cyber-deterrence in general, but especially strategies based on deterrence by norms.\n## Cyber-deterrence strategy “The emergence of cyber as a separate domain of warfighting does not necessarily offer magic solutions and miraculous short-cuts to achieve strategic goals.”\nterrence as an overarching strategy is nothing new. Nuclear-deterrence was a response to a significant upheaval in the reality of global security policy -- not unlike (some would argue) the cyber-driven upheaval we are experiencing today. Therefore it is not unnatural that one attempts to draw parallels between known and tested strategies for nuclear-deterrence and cyber-deterrence. At the same time, it is important to be cognizant of the differences, and some have even gone as far as claiming that “...despite some crossover, there are too many inconsistencies that prevent an even partial adoption of the nuclear deterrence model.”\nThe four “problem areas” described above makes it difficult for any state with ambitions of deterrence in the cyber domain to satisfy the necessary preconditions for effective deterrence. Generally speaking, to get closer to creating real deterrence in the cyber-domain requires clarifications in several areas where there are currently too many unexplored variables and underdeveloped concept that undermines efficiency. This becomes most evident for the classical forms of deterrence, and especially deterrence by punishment, which requires absolute clarity in many of the above issues to be implemented. It might be relatively easier to establish the necessary preconditions for deterrence by denial, deterrence by entanglement, and deterrence by norms in a shorter time span.\nDeterrence by entanglement is an approach that might actually exploit what is normally seen as the main challenges in the cyber domain. The increasingly interconnectedness of actors (states, organizations, individuals) creates more potential vulnerabilities, but it can also make it more difficult to conduct offensive cyberoperations without causing collateral damage. By strengthening the emergence of virtual globalization, one can theoretically reduce the risk propensity of a would-be aggressor: “By more thoroughly entangling both friend and fore the aggregate benefits for maintaining and enhancing good behavior within the cyberspace increase and reinforce risk averse behaviors.” For small states, this might be the more attractive path, because it does not require parity in offensive and defensive cyber capabilities to have an effect. By creating stronger mutual dependence with partners and allies in the cyber domain, one can also effectively generate a situation where common defensive cyber capabilities are in everyone's interest, and thereby also corroborate a shared (Allied) deterrence by denial.\nHowever, for small states even situations of “entanglement” will often be highly asymmetrical, and unlikely to be a sufficient measure for efficient deterrence. Small states usually have a relatively weak position in the international system, but nonetheless have an opportunity to influence the norms for what is considered acceptable interaction between states -- and through this, to some degree, even out the imbalance of “hard power.” This acknowledgement is one of the reasons small states' security-strategies tend to focus on “idealistic and norm-oriented policy” with the aim of strengthening international institutions, norms and laws. To some extent, major powers will always operate according to the principle “might is right”, also outside established frameworks, but still risks being held accountable in accordance with these frameworks. The implications for states seen “in breach”, may be loss of legitimacy and support -- or sometimes more tangible reactions of e.g. economic nature. By working toward establishing and strengthening a normative framework for behavior in the cyber domain, one might be capable of generating real deterrence by norms. Such a framework would also constitute a viable “objective” basis to legitimize deterrence by punishment.\nTo establish effective frameworks for deterrence in the cyber-domain requires a collective effort, and the current staring point is not the best. But it is the only one we have. A smart first step might be to concretize the efforts through establishing a structure or organization whose purpose is to regulate cyber-behavior -- which in turn might enable cyber-deterrence to a larger degree, and in a more systematic manner. Such an organization should ideally find its basis in existing security cooperation and alliances but should not exclude a wider community of interest. Although we might think of a grander scale when it comes to cyber, the logic of the British Fighter Command gives an idea of how this could be structured. Without going into further details of how such an organization should/could be set up, it seems pertinent to comment that a “unified command” would form a better basis for any form of deterrence strategy. By tying the major powers to such an amalgamation of stake holders, it would also be possible to generate the capability necessary for all deterrence strategies -- something that would be impossible for small states outside such an organization.\nParticipation in the organization would also balance small states' norm-focused policies with what might be seen as an strengthening of alliances that to a larger degree also can serve as guarantors for concrete national interest in the short term. A balance between the apparently idealistic and very real alliances is an approach already well-known form Norwegian policy, strategy and doctrines. Such a divided focus might seem as contradictory, but is a quite rational choice. Empiricism tells us that that international laws and norms have limited value when conflict erupts between small and major states. Alliances and international normative frameworks thus become complimentary tools; where the former ensures that actors (through the threat of force) can be held accountable to the latter.\nA modern Fighter Command -- or Unified Cyber Command -- must also be granted authority to make decisions that commits participating states, and there-through regulates behavior both between members internally -- and between the organization and the international society at large. The organization would play a major role in establishing the premises for international cyber behavior and thereby by an important actor in the forming of norms. As such, the establishment of a Unified Cyber Command would serve both the need for short term security and the wish for a better regulated cyber-domain in the long term. This would also be complimentary and mutually reinforcing efforts, where a Unified Cyber Command can strengthen the establishment of normative frameworks -- which in turn forms a stronger basis for how the Unified Cyber Command acts in the domain. Put differently; a Unified Cyber Command might form a viable basis for classical deterrence, while it may also be an important agent in forming the framework needed for deterrence by norms.\n## Conclusion: Implications for small states Based on the challenges and possibilities that exist in the cyber-domain, and the options deterrence-theory offers, what should small states like Norway do? Firstly, one must acknowledge the inherent limitations of small states -- also in the cyber-domain. Cyber-security is a demanding task, and it is reasonable to assume that the highest effects can be achieved together with others. Secondly, we see it as well substantiated that deterrence has a place in cyber-security strategy, if one does not see the different deterrence strategies as mutually exclusive but complimentary. Norway may very well entertain several lines of operations to achieve more robust deterrence. Thirdly, it is important to start immediately to explore how one can establish a coherent strategy for realizing true deterrence in the cyber-domain -- both in the short and the long term. Whether ideas like a modern Unified Cyber Command are realistic or practical are difficult to discern before one starts to explore the array of opportunities.\nAs the situation now stands, cyberattacks of varying sorts represents an extension of the classical kinetic conflict, but with attractive qualities such as plausible deniability. Our assessment is that it is important to start a grander initiative before the isolationist urge behind proverbial firewalls and security-measures, the search for profit, or the fear of being tricked increases the threshold even higher. For small states, like Norway, it is significant to realize what major powers like the US has already recognized as a necessity; establishing an internationally recognized, cross-sectorial cross-departmental organization, that also includes private actors -- with the responsibility of regulating the cyber-domain for the common good. Without such an initiative, the world will soon find itself at the edge of a cliff (if we are not already there), with an excellent view over a anarchistic cyber-landscape eating away on the solid foundation we now stand on -- as the cyber-domain becomes ever more dominant in all aspects of our interactions. A landscape paved with good intentions, where individual actors have done their best to create order from chaos, but thereby paradoxically contributing to its character of contradictory policies, rules and expectations. This landscape allows regional or even global conflicts to be instigated by the mere pushing of a few buttons. It should not be necessary with a cyber-equivalent of Operation Centerboard before we step up to the task.\n## ORCID Marius Kristiansen http://orcid.org/0000-0002-6966-3553 Njaal Hoem http://orcid.org/0000-0001-6468-0111"
    }
  },
  "citation_summary": {
    "style": "author_year",
    "dominant_bucket": "author_year",
    "dominant": {
      "intext_total": 0.0,
      "success_occurrences": 0.0,
      "success_unique": 0.0,
      "bib_unique_total": 123.0,
      "occurrence_match_rate": 0.0,
      "bib_coverage_rate": 0.0,
      "success_percentage": 0.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "author_year"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 59.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "numeric": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 59.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 123.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "Small players in a limitless domain: Cyber deterrence as small state strategy",
    "subtitle": "To link to this article: https://doi.org/10.1080/01495933.2021.2017740",
    "document_type": "journal_article",
    "venue": "ISSN: 0149-5933 (Print) 1521-0448 (Online) Journal homepage: www.tandfonline.com/journals/ucst20",
    "publication_year": 2021,
    "authors": [
      "COMPARATIVE STRATEGY",
      "Routledge Taylor",
      "Francis Group",
      "Marius Kristiansen",
      "Njaal Hoem",
      "View Crossmark data"
    ],
    "affiliations": [],
    "emails": [],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "This article explores deterrence as an element in cybersecurity strategy from a small state perspective. The cyber domain presents novel challenges for strategy makers, and applying deterrence in the cyber domain requires an organized and multinational approach -- since few states can leverage deterrence in this all-encompassing domain on their own. Deterrence has been an important factor in shaping global security for half a century, but when applied to the cyber domain there are certain inherent mechanisms that must be understood in order to generate the desired effects. Key issues discussed are the volume of agents capable of operating and creating effects in the domain, and the availability of tools and techniques. These issues concerning actors and vectors makes it difficult to survey threats and create targeted deterrence. Furthermore, the cyber milieu makes it difficult to connect action to motives, thereby further complicating any attempt to analyze the actual importance of observable effects. From a strategist's point of view, these general characteristics are exacerbated by the fact that the international community does not have a common language or shared platform to uniformly approach these issues. Absent clarity on some fundamentals the core issues of attribution and proportionality becomes a hindrance to effective deterrence.",
    "keywords": [],
    "publication_dates": {
      "published": "02 Feb 2022",
      "online": "02 Feb 2022"
    },
    "identifiers": {
      "doi": [
        "10.1080/01495933.2021.2017740"
      ],
      "issn": [
        "ISSN: 0149-5933"
      ],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "www.tandfonline.com/journals/ucst20",
        "https://doi.org/10.1080/01495933.2021.2017740",
        "https://www.tandfonline.com/action/journalInformation?journalCode=ucst20"
      ]
    },
    "references_block_count": 1,
    "references_entries_estimated": 59,
    "heading_count": 15,
    "max_heading_level": 3,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "author_year",
      "recommended_style": "unknown",
      "aligned": true,
      "signals": {
        "superscript_hits": 0,
        "superscript_definition_lines": 0,
        "numeric_bracket_hits": 0,
        "numeric_endnote_lines": 0,
        "author_year_hits": 0
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 123.0,
      "dominant_bib_coverage_rate": 0.0,
      "dominant_link_target": "bibliography",
      "dominant_unresolved_flag": "unresolved_reference_links"
    },
    "heading_validation": {
      "heading_count": 15,
      "max_heading_level": 3,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": true,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": false,
        "emails": false,
        "orcids": false,
        "abstract": true,
        "keywords": false,
        "venue": true,
        "persistent_identifier": true,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 6,
        "affiliations": 0,
        "emails": 0,
        "orcids": 0,
        "keywords": 0,
        "doi": 1,
        "issn": 1,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 3
      },
      "coverage": {
        "core_coverage": 0.8333333333333334,
        "email_author_link_rate": 0.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [],
        "toc_dot_lines": 0
      },
      "flags": []
    },
    "flags": []
  },
  "updated_at_utc": "2026-02-14T08:26:57.677807+00:00"
}