{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\G922R75D\\Lehto - 2023 - Finland's views on international law and cyberspace introduction.pdf",
  "custom_id": "261",
  "response": {
    "id": "batch-b6235e9e-262-b056c017-998d-46b1-9a15-7a8139bf7915",
    "custom_id": "261",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "BRILL\nNIJHOFF\nNORDIC JOURNAL OF INTERNATIONAL LAW\n92 (2023) 456–469\nNORDIC JOURNAL OF INTERNATIONAL LAW\nbrill.com/nord\n\n# Finland's views on International Law and Cyberspace\n\nIntroduction\n\nMarja Lehto\nMinistry of Foreign Affairs of Finland, Helsinki, Finland\nMarja.Lehto@formin.fi\n\nPublished online: 4 July 2023\n\nIn 2013, the Group of Governmental Experts (GGE) under the United Nations auspices reached agreement on the critical question that international law applies in cyberspace.¹ While this point of departure has since then been confirmed in successive reports of the GGE,² as well as by the Open-ended Working Group (OEWG) of the General Assembly,³ further discussions on how international law applies in cyberspace, and where adjustments might be needed to accommodate the specific features of cyberspace, have proved challenging. The deadlock of the fifth GGE, which failed to adopt a report in 2017 because of fundamentally differing views on international law may have been decisive in triggering unilateral responses from individual States.⁴ The\n\n1. 2013 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/68/98).\n2. 2015 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/70/174), para. 24; 2021 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/76/135), para. 69.\n3. Open-ended Working Group on developments in the field of information and telecommunication in the context of international security, Final Substantive Report (2021), (U.N.Doc. A/AC.290/2021/CRP.2), para. 34.\n4. See, for instance, the national position papers of the United States (2016), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_United_States_of_America_(2016); United Kingdom (2018), available at https://www.gov.uk/government/speeches/cyber-and-international-law-in-the-21st-century and (2021), available at https://www.gov.uk/government/publications/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement; The Netherlands (2019), available at https://cyberlaw.ccdcoe.org/wiki\n\nPublished with license by Koninklijke Brill NV | DOI: 10.1163/15718107-20230002\n© MARJA LEHTO, 2023 | ISSN: 0902-7351 (print) 1571-8107 (online)\nThis is an open access article distributed under the terms of the CC BY 4.0 license.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          },
          {
            "index": 1,
            "markdown": "FINLAND'S POSITION PAPER\n457\n\nemerging practice of issuing national statements and position papers on international law and cyberspace has provided an alternative way to bring clarity to the contentious issues.\n\nFinland's position paper that is reproduced below was issued in 2020 as a contribution to the ongoing debate.⁵ As such, it comments on selected issues and does not provide a comprehensive compilation of Finland's legal views on cybersecurity. The limited scope of the paper reflects the mandate of the GGE, established by the General Assembly's First Committee, to address, inter alia, existing and emerging threats in cyberspace that may jeopardize international peace and security.⁶ The paper confirms the applicability and essential role of international law in cyberspace, in line with the major GGE findings. It also comments on a number of topical issues such as sovereignty, State responsibility, prevention of transboundary harm, illegal intervention, use of force and armed attack, international humanitarian law and human rights law.\n\nThe position papers and statements issued so far, including the present one, share a lot of common substance, which is obvious as they generally have the same background and have been prepared by States belonging, in the context of the GGES and the OEWG, to the Western 'like-minded' group. While the papers are consistent on most questions, there are also differences regarding how the legal limitations concerning State action in cyberspace are defined, most notably with regard to the legal nature of the principles of sovereignty and due diligence. These differences have given a further reason for Finland to articulate its own views in a public position paper.\n\n/National_position_of_the_Netherlands_(2019); France (2019), available at https://documents.unoda.org/wp-content/uploads/2021/12/French-position-on-international-law-applied-to-cyberspace.pdf; New Zealand (2019), available at https://dpmc.govt.nz/publications/application-international-law-state-activity-cyberspace; Australia (2020), available at https://www.internationalcybertech.gov.au/our-work/annexes/annex-b; Israel (2020), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Israel_(2020); Italy (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_Italian_Republic_(2021); Estonia (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Estonia_(2021); Switzerland (2021), available at https://www.eda.admin.ch&gt;eda&gt;voelkerrecht.pdf; Poland (2022), available at https://www.gov.pl/web/diplomacy/the-republic-of-polands-position-on-the-application-of-international-law-in-cyberspace and Canada (2022), available at https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/peace_security-paix_security/cyberspace_law-cyberespace_droit.aspx?lang=eng (all accessed on 27 February 2023). See also the position papers by Denmark, Norway and Sweden reproduced in the current issue of NJIL\n\n⁵ Also available at https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859 (accessed on 27 February 2023). See also Michael Schmitt, 'Finland sets out key Positions on International Cyber Law', October 27, 2020, available at https://www.justsecurity.org/73061/finland-sets-out-key-positions-on-international-cyber-law/\n\n⁶ See, for instance, A/RES/68/243, op. para. 4.\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          },
          {
            "index": 2,
            "markdown": "FINLAND\n\nThe statement that international law applies to State activities when they are using information and communication technologies may seem as little more than stating the obvious. While questions related to non-State actors increasingly occupy international lawyers and few would claim that States are the only subjects of international law, the one question that can be taken for granted is its applicability to State action. In spite of the self-evidence of the issue, the successive GGES and the OEWG have so far not been able to clearly state, for instance, that international humanitarian law applies to the use of cyber means and methods of war in an armed conflict.7 Whether this inability has something to do with the mystification of the concept of 'cyberspace', or rather reflects an attempt to circumscribe or put aside the existing rules, the debate has proved persistent. Finland's paper seeks, on its part, to make it clear that cyberspace is no lawless area.\n\nFor the reasons mentioned above, the issue of State sovereignty occupies a prominent place in the paper. Finland disagrees with the claim that no rights and obligations would flow from the principle of sovereignty as such, or that no rule prohibiting violations of sovereignty would have crystallized in respect of cyber activities. This contention seems to overlook the established status in international law of the rule that prohibits violations of sovereignty, confirmed both by State practice and international jurisprudence. Finland sees sovereignty as both a principle and a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers the wrongdoing State's international responsibility. Similarly, in response to the claim that there would be no legal obligation to exercise due diligence in cyberspace, the paper recalls \"each State's obligation not to knowingly allow its territory to be used to harm the rights of other States\" that the International Court of Justice called 'well-recognized' already in 1949.8 According to the paper, the general principle of due diligence is applicable to any activity which involves the risk of causing significant transboundary harm.\n\nThe question of sovereignty as a rule or as a mere principle, and that of the binding nature of due diligence in cyberspace, are examples of legal disagreements that have important concrete implications. Should it be accepted that sovereignty cannot be violated, it would mean that there are no legal consequences for violations that fall below the notoriously high threshold of\n\n7 See, however, Group of Governmental Experts on Advancing Responsible State Behaviour in Cyberspace in the Context of International Security, Final Report, 14 July 2021, U.N. Doc. A/73/135, para. 71(f), in which, referring to the principles of humanity, necessity, proportionality and distinction, \"the group recognized the need to further study on how and when these principles apply to the use of ICTs by States\".\n\n8 Corfu Channel case, Judgment of April 9th, 1949: I.C. J. Reports 1949, P. 4, p. 22.\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          },
          {
            "index": 3,
            "markdown": "FINLAND'S POSITION PAPER\n459\n\nprohibited intervention in the internal affairs of a State. It is also not comprehensible that States would have no legal obligation to take efforts to ensure that cyber activities within their territory or jurisdiction do not seriously harm other States. It further seems politically unwise to question the applicability of such long-standing rules in cyberspace, as carving out a cyber-specific exception from their application may give credence to the claim that international law does not apply in cyberspace in the absence of specific regulation.\n\nTwo further questions addressed in the paper seem worth drawing attention to. First, regarding the use of force, like most if not all of the States that have pronounced on the issue, Finland agrees that for a cyberattack to be comparable to use of force, it must be sufficiently serious and have effects in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of traditional armed force. To be equated to an armed attack, a cyberattack must further fulfil the requirements of scale and effects. The paper is open to the possibility that a cyberattack producing significant economic effects such as the collapse of a State's financial system or parts of its economy could possibly be comparable to an armed attack. Indeed, such a collapse would be likely to cause serious effects on the population.\n\nIn general, however, the paper underlines that any understanding of the use of force in cyberspace should respect the UN Charter, and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. Particular issues concerning the use of force in cyberspace may need cyber-specific solutions but these should always be assessed in light of the more general understandings. It should also be kept in mind that many of the issues related to the use of force continue to be debated even in the physical, or kinetic context. The ILA Committee on the Use of Force, in its 2018 report, made a similar point stating that conclusions concerning cyber operations as a use of force \"must be reached with great caution\" because a wide interpretation of Articles 2(4) and 51 of the Charter in the cyber context \"may affect the interpretation and debate surrounding other areas of the law of use of force\".9\n\nSecond, regarding International Humanitarian Law (IHL), the paper does not only state that the use of cyber means and methods in the context of an armed conflict is subject to the rules of IHL, including the principles of distinction, proportionality and precautions, but also underlines that the foreseeable direct and indirect effects of cyber means and methods must be taken into account when assessing their capacity to cause prohibited harm. The paper\n\n9 International Law Association, Sydney Conference (2018), Final Report on Aggression and the Use of Force, p. 26.\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          },
          {
            "index": 4,
            "markdown": "FINLAND\n\nalso takes a stand in favor of including data within the concept of object for the purposes of IHL in stating that there is an obligation to take constant care \"to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data\".\n\nSince 2020, new questions have arisen in the ongoing exchange of views, both as regards the national statements and within the two UN working groups. Peaceful settlement of disputes is one of such new themes and one that would most likely have been addressed in Finland's paper, had it been issued later.¹⁰ Indeed, if States abided by the fundamental Charter-based and customary obligation to settle their disputes peacefully and in a manner that does not endanger international peace and security, less attention would need to be paid to the intricacies of prohibited intervention, use of force, armed attack and application of IHL in cyberspace.\n\nMay, 2023\n\n---\n\n# International Law and Cyberspace\n## Finland’s National Positions\n\n### Introduction\n\nIn line with its general support to rules-based international cooperation and respect for international law, Finland sees international law as an essential framework for responsible State behaviour in cyberspace. In the same vein, the UN Group of Governmental Experts (GGE) has reaffirmed that “international law, and in particular the Charter of the United Nations, is applicable and is essential to maintaining peace and stability and promoting an open, secure, stable, accessible and peaceful ICT environment”.¹ As this formulation, reflecting the specific mandate of the GGE, focuses on questions of international\n\n¹⁰ See the statement of the delegations of Finland and Sweden in the OEWG in March 2021, available at https://reachingcriticalwill.org/images/documents/Disarmament-fora/other/icts/oewg/statements/9March_FinlandSweden.pdf (accessed on 27 February 2023).\n\n¹¹ See Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security, 2013 Report (UN Doc. A/68/98, para.20; 2015 report (UN Doc. A/70/174), para.\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          },
          {
            "index": 5,
            "markdown": "FINLAND'S POSITION PAPER\n461\n\npeace and security, there is reason to underline that the same applies to other rights and obligations of States, whether based on treaty law or customary international law.\n\nWhile the existing rules and principles of international law are applicable in cyberspace, the application of certain provisions may give rise to practical problems due to the specific characteristics of cyberspace. Finland therefore welcomes the current exchange of views on particular questions regarding how international law applies to State use of information and communication technologies and wishes to contribute to the discussion by commenting on some of the issues that have been raised recently in this regard.\n\n## Sovereignty\n\nIt is undisputed that the principle of State sovereignty applies in cyberspace. While cyberspace as a whole cannot be subject to appropriation by any State, each State has jurisdiction over the cyber infrastructure and the persons engaged in cyber activities within its territory.² Sovereignty confers each State the exclusive right to exercise the functions of a State within a certain territory,³ and protects its territorial integrity and political independence from interference by other States.⁴ In this sense, sovereignty is a foundational principle of the international legal order.\n\nThe principle of State sovereignty has also given rise to a number of specific rules, such as those prohibiting the use of force and intervention in the internal affairs of other States. Below the threshold of prohibited intervention, all States have an obligation to refrain from acts that violate the territorial integrity or political independence of other States.\n\nThe International Court of Justice has consistently confirmed that it is a duty of every State to respect the territorial sovereignty of others. This applies\n\n2 The Group of Governmental Experts has stated in this regard that “State sovereignty and international norms and principles that flow from sovereignty apply to State conduct of ICT-related and to their jurisdiction over ICT infrastructure within their territory”. See GGE 2015 Report, para. 27. Other bases of jurisdiction may be applicable to cyber activities in accordance with international law.\n\n3 As Judge Max Huber stated in the *Island of Palmas* arbitral award: “Sovereignty in the relations between States signifies independence. Independence in regard to a portion of the globe is the right to exercise therein, to the exclusion of any other State, the functions of a State.” See *Island of Palmas (Netherlands v. the US)*, 2 UNRIAA 829, 838 (PCA 1928).\n\n4 According to the International Court of Justice, “between independent States, respect for territorial sovereignty is an essential foundation of international relations.” See *Corfu Channel Case (UK v. Albania)*, ICJ reports 1949, p. 4, at 35.\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          },
          {
            "index": 6,
            "markdown": "FINLAND\n\nto unauthorized intrusions to physical spaces such as overflight of a State's territory by an aircraft belonging to another State or under its control,⁵ penetration of territorial waters by foreign warships,⁶ conducting of certain activities in another State's territory without its consent⁷ but also to producing effects in another State's territory without physical intrusion.⁸ According to the Court, it is \"quite obvious that a State possesses a legal interest in the protection of its territory from any form of external harmful action\".⁹\n\nSimilarly, a non-consensual intrusion in the computer networks and systems that rely on the cyber infrastructure in another State's territory may amount to a violation of that State's sovereignty. The prohibition of cyber operations violating the territorial sovereignty of another State protects, first of all, the cyber infrastructure located in the territory of that State, or otherwise under its jurisdiction, as well as computer networks and systems supported by such infrastructure, from material harm. The situation is the same irrespective of whether such infrastructure belongs to or is operated by governmental institutions, private entities or private individuals. In addition to material harm that may be caused by such an operation, other relevant considerations include whether an intrusion in the cyber infrastructure triggers a loss of functionality of the equipment relying on it, or modifies or deletes information belonging to the target State, or to private actors in its territory.\n\nMore generally, an unauthorized intrusion by cyber means may be seen as a violation of the target State's territorial sovereignty if it interferes with data or services that are necessary for the exercise of inherently governmental functions. This rule put forward in the Tallinn Manual 2.0¹⁰ is consistent with the understanding of violations of sovereignty as unauthorized exercise of authority in another State's territory. Finally, cyber operations against objects that enjoy sovereign immunity (warships, ships owned by a State and used only for government or noncommercial service; State aircraft) can be characterized as violations of sovereignty.¹¹\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\n\n5 Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. United States of America), Merits, Judgment, I.C.J. Reports 1986, p. 14, paras. 251, 253, 292.\n6 Corfu Channel case (United Kingdom v. Albania), Judgment, I.C.J. Reports 1949, p. 4, at 26, 35, 36.\n7 Certain Activities carried out by Nicaragua in the Border Area (Costa Rica v. Nicaragua) and Construction of a Road in Costa Rica along the San Juan River (Nicaragua v. Costa Rica), Judgment, I.C.J. Reports 2015, p. 665, paras. 67, 69, 93, 221-223 and 229.\n8 Nuclear Tests (Australia v. France), Judgment, I.C.J. Reports 1974, p. 253, para. 454.\n9 Ibid. para 456, emphasis added.\n10 Michael N. Schmitt (ed.), Tallinn Manual 2.0, Cambridge University Press 2017, Rule 4, para. 15.\n11 Cf. Ibid., Rule 5.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          },
          {
            "index": 7,
            "markdown": "FINLAND'S POSITION PAPER\n463\n\nThe argument has been raised recently that no legal consequences could be attached to sovereignty as a general principle, at least for the purposes of cyber activities. It is not only difficult to reconcile such an idea with the established status of the rule prohibiting violations of sovereignty in international law but it also gives rise to policy concerns. Agreeing that a hostile cyber operation below the threshold of prohibited intervention cannot amount to an internationally wrongful act would leave such operations unregulated and deprive the target State of an important opportunity to claim its rights.\n\nFinland sees sovereignty as a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers State responsibility. This rule is fully applicable in cyberspace. Whether an unauthorized cyber intrusion violates the target State's sovereignty depends on its nature and consequences and is subject to a case-by-case assessment.\n\n## Illegal intervention\n\nA hostile interference by cyber means may also breach the customary prohibition of intervention in the internal affairs of another State, provided that it is done with the purpose of compelling or coercing that State in relation to affairs regarding which it has free choice (so-called domaine réservé). The requirement of coercion leaves out lesser forms of influence and persuasion that are commonplace in international relations. The limitation to sovereign affairs – such as a State's political, economic or cultural system or the direction of its foreign policy¹²– further distinguishes prohibited intervention from measures, the purpose of which is to compel another State to comply with its international obligations.\n\nFor a cyber operation to amount to a prohibited intervention, both above-mentioned elements must be present. Most open questions relate to the element of coercion and to how it manifests itself in cyber operations. For instance, while the conduct of elections belongs undisputedly to the internal affairs of each State, all methods of electoral interference do not display the element of coercion.¹³ Hacking of voter databases or manipulation of vote counts in order to alter the election results has nevertheless been recognized as a fairly clear case. To be comparable to a real world intervention, cyber interference must also be of a serious nature.\n\n¹² Military and Paramilitary Activities in and against Nicaragua, para. 205.\n¹³ All methods of electoral interference are not coercive, see EU vs. disinfo, 10 Methods of electoral interference (2019).\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          },
          {
            "index": 8,
            "markdown": "FINLAND\n\nAccording to the International Court of Justice, the element of coercion is particularly clear if force is used through means of military action, threats of such action, or through support to armed groups in another State.¹⁴ Military or economic pressure may also qualify as coercion. Hostile cyber interference done with the purpose of promoting or supporting armed action in another State could constitute an example of prohibited intervention, provided that it seeks to force a certain policy change.¹⁵\n\nCompared to a violation of sovereignty, the requirement of coercive nature and that of domaine réservé make the threshold of prohibited intervention considerably higher. This underlines the importance of continued understanding of sovereignty as not only a principle but also an independent primary rule of international law.\n\n## Transboundary harm\n\nAnother cardinal principle flowing from sovereignty, closely related to the obligation to respect the sovereignty of other States, is each State's obligation not to knowingly allow its territory to be used to cause significant harm to the rights of other States. It is widely recognized that this principle, often referred to as due diligence, is applicable to any activity which involves the risk of causing significant transboundary harm.¹⁶ Due diligence is a variable standard in the sense that its content can change over time as a result of technological development or changes in risk assessment,¹⁷ and as such fully applicable to cyber operations.\n\nStates may thus not knowingly allow their territory, or cyber infrastructure within a territory under their control, to be used to cyber operations that\n\n¹⁴ Military and Paramilitary Activities in and against Nicaragua, para.247.\n\n¹⁵ Ibid., see also paras 241 and 242. See also Friendly Relations Declaration, UN Doc. A/RES/2625(XXV).\n\n¹⁶ International Law Commission, Draft Articles on the Prevention of transboundary harm from hazardous activities, art. 3: \"The State of origin shall take all appropriate measures to prevent significant transboundary harm or at any event to minimize the risk thereof\", Yearbook... 2001, vol. II (Part Two), pp. 144–170; International Law Association, Second Report on Due Diligence in International Law, July 2016, p. 6: \"This broad principle of due diligence can be understood as underlying more specific rules of due diligence. Hence, it can be viewed as a default standard that is triggered in operation if no more specific elaboration of due diligence or stricter standard is in existence.\"\n\n¹⁷ International Tribunal for the Law of the Sea, Seabed Disputes Chamber, Responsibilities and Obligations of States Sponsoring Persons and Entities with Respect to Activities in the Area, Advisory opinion, 1 February 2011, List of Cases: No. 17, para. 117.\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          },
          {
            "index": 9,
            "markdown": "FINLAND'S POSITION PAPER\n465\n\nproduce serious adverse consequences for other States. While only States can violate sovereignty, the sovereignty-based obligation of due diligence extends to private activities taking place in a State's territory. Significant harm caused to other States by private cyber activities may give rise to a State's international responsibility but only if the State in question has breached its due diligence obligations.\n\nSome legal obligations are inherent in the principle of due diligence and apply to cyber activities even in the absence of cyber-specific elaborations of the principle. For instance, if a State knows about a planned cyber activity in its territory likely to affect another State adversely and seriously, it must notify that other State. In addition to actual knowledge of harmful acts emanating from the territory of a State, a State's responsibility may be engaged in situations in which it should have known about the activities in question. It is nevertheless clear that \"it cannot be concluded from the mere fact of the control exercised [...] over its territory [...] that [a] State necessarily knew, or ought to have known, of any unlawful act perpetrated therein\".[18]\n\nIf harmful cyber activity takes place and causes serious harm to another State, the State of origin must take appropriate action to terminate it, as well as to investigate the incident and bring those responsible to justice. In order to be able to do this, States should have the necessary procedural and legal mechanisms in place. It should nevertheless be recalled that due diligence is an obligation of conduct, not one of result. In general, what is required of States is that they take all measures that are feasible under the circumstances. A particular question in this regard is related to the position of transit States through which a particular harmful data is routed. Much depends on whether such a State has any knowledge of the ongoing operation, or ability to take feasible measures to terminate it.\n\nFurthermore, while States must show due diligence in the control of the national territory, doing so does not release them from the observance of other international obligations such as those related to human rights.\n\n## State responsibility\n\nThe law of State responsibility consists of secondary rules that apply generally in the absence of clear specific rules that modify their effect. As there is no specific regulation concerning State activities in cyberspace that would constitute\n\n[18] International Court of Justice, *Corfu Channel case*, Judgment of April 9th, 1949, I.C.J. Reports 1949, p.4, at 18.\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          },
          {
            "index": 10,
            "markdown": "FINLAND\n\nsuch lex specialis, it can be concluded that the normal rules of State responsibility apply in cyberspace.\n\nWhen a State's cyber operation violates its obligations under international law, it constitutes an internationally wrongful act. An internationally wrongful act of a State entails its international responsibility and gives rise to an obligation to make full reparation for the damage that may be caused by the act.¹⁹ This requires that the act is attributable to the State. The rules of attribution reflected in the UN International Law Commission's Articles on State Responsibility²⁰ remain fully valid in cyberspace. If State organs, or private groups or individuals acting on behalf of the State, can be identified as the authors of a cyber operation that violates the State's international obligations, its international responsibility is engaged. It is in this regard useful to distinguish identification as a technical operation from attribution as a legal operation. Identification may be technically challenging given the often covert nature of hostile cyber activities but this is without consequence to the legal rules of attribution.\n\nAn internationally wrongful act may justify recourse to countermeasures by the injured State if the State responsible for an internationally wrongful act declines to cease the wrongful conduct or pay reparation. Countermeasures may only be taken with the purpose of ensuring compliance, not for retaliation. Countermeasures may furthermore not breach the prohibition of the threat or use of force, or other peremptory norms of general international law, and must be consistent with other customary law requirements and limitations concerning countermeasures, most of which are reflected in the International Law Commission's Articles on State Responsibility.²¹ Some of the procedural requirements concerning countermeasures may nevertheless require adjustment. For instance, it may be possible to attribute a hostile cyber operation only afterwards whereas countermeasures normally should be taken while the wrongful act is ongoing.\n\nThere is no general obligation for a State taking countermeasures to disclose the information on the basis of which the action is taken. At the same time, it is in each State's best interests to ensure that a decision to take countermeasures is based on solid evidence, given that recourse to countermeasures would otherwise constitute an internationally wrongful act. A State that responds to a hostile cyber operation must therefore have adequate proof of the source\n\n¹⁹ International Law Commission, Responsibility of States for Internationally Wrongful Acts (2001), available at www.legal.un.org/ILC (ARSIWA).\n\n²⁰ Ibid., arts. 4–11.\n\n²¹ Ibid., arts. 49–54.\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          },
          {
            "index": 11,
            "markdown": "FINLAND'S POSITION PAPER\n467\n\nof the operation and convincing evidence of the responsibility of a particular State.\n\nPublic attribution, as a sovereign choice, is primarily a question of political consideration. Public attribution may nevertheless have legal effects to the extent it includes determinations of conduct that constitutes an internationally wrongful act.\n\nIn addition to countermeasures, other circumstances precluding wrongfulness may justify taking of cyber measures that would otherwise constitute an internationally wrongful act.²² This may be the case, for instance, if deviating from an international obligation is the only way for the State to safeguard an essential interest against a grave and imminent peril. Facing such an exceptional situation, a State may deviate from its international obligations within the limits specified in the law of State responsibility.²³\n\n## Use of force/ armed attack\n\nWhile there is currently no established definition of a cyberattack that would pass the threshold of \"use of force\" in the sense of article 2(4) of the UN Charter, or \"armed attack\" in the sense of article 51, it is widely recognized that such a qualification depends on the consequences of a cyberattack. For a cyberattack to be comparable to use of force, it must be sufficiently serious and have impacts in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of force. A threat of such a cyberattack could also violate Article 2(4) of the Charter, if the threat is sufficiently precise and directed against another State.\n\nSimilarly, most commentators agree that when the scale and effects of a cyberattack correspond to those of an armed attack responding to the cyberattack is justifiable as self-defence. It is obvious that the attack must have caused death, injury or substantial material damage, but it is impossible to set a precise quantitative threshold for the effects, and other circumstantial factors must be taken into account in the analysis, as well. A widely discussed question is, to what extent the definition of a cyberattack comparable to an armed attack should take account of the indirect and long-term impacts of the attack. In any case, this would require that the impacts can be assessed with sufficient precision. A question has also been raised, whether a cyberattack producing significant economic effects such as the collapse of a State's financial system\n\n²² ARSIWA, Chapter V, Circumstances precluding wrongfulness.\n²³ Ibid., art. 25. See also Tallinn Manual 2.0, Rule 26.\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          },
          {
            "index": 12,
            "markdown": "FINLAND\n\nor parts of its economy should be equated to an armed attack. This question merits further consideration.\n\nAny interpretation of the use of force in cyberspace should respect the UN Charter and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. This would mean, for instance, that the distinction between armed attack as a particularly serious violation of the Charter, on the one hand, and any lesser uses of force, on the other, is preserved. Similarly, the conditions for the exercise of the right of self-defence apply in cyberspace as they do with regard to the use of armed force. The right of self-defence arises if a cyberattack comparable to an armed attack occurs and can be attributed to a particular State.²⁴ It is reasonable to think that a State victim to such an attack can respond with either cyber means or armed action. At the same time, the use of force must not be disproportionate or excessive.\n\n## International Humanitarian Law\n\nInternational humanitarian law only applies to cyber operations when such operations are part of, or amount to, an armed conflict. Most so far known cyberattacks have not been launched in the context of an armed conflict or have met the threshold of armed conflict. At the same time, when cyber means are used in the context of a pre-existing armed conflict, as has been done in many current conflicts, there is no reason to deny the need for the protections that international humanitarian law provides.\n\nThis includes that cyber means and methods of warfare must be used consistently with the principles of distinction, proportionality and precautions, as well as the specific rules flowing from these principles. When assessing the capacity of cyber means and methods to cause prohibited harm, their foreseeable direct and indirect effects shall be taken into account. Constant care shall be taken to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data.\n\nThe unique characteristics of cyberspace, such as interconnectedness and anonymity, may affect how international humanitarian law is interpreted and applied with regard to certain cyber means and methods warfare. The related problems can nevertheless mostly be solved on the basis of existing rules. New\n\n²⁴ While the possibility of a cyberattack rising to the level of an armed attack without the involvement of any State is conceivable, the related questions of self-defence against non-State actors are too complicated to be discussed here.\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          },
          {
            "index": 13,
            "markdown": "FINLAND'S POSITION PAPER\n469\n\ntechnologies do not render the existing rules of international humanitarian law meaningless or necessarily require new legal regulation. Furthermore, while international humanitarian law is *lex specialis* in an armed conflict, it does not override other areas of international law, such as human rights law, which may continue to apply throughout the conflict.\n\n## Human rights law\n\nA number of specific human rights such as the freedom of opinion and expression, including the right to access to information, and the right to privacy are particularly relevant in cyberspace. It should nevertheless be underlined that individuals enjoy the same international human rights with respect to cyber-related activities as otherwise and, accordingly, that States are bound by all their human rights obligations both online and offline. Furthermore, each State has to protect individuals within its territory and subject to its jurisdiction from interference with their rights by third parties.\n\n## Note from the publisher\n\nThe author mentioned at the start of this article, Marja Lehto, is only responsible for the introduction to this position paper. The position paper is a product of the government of Finland and available online: https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859.\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1851,
              "width": 1221
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 14,
          "doc_size_bytes": 246917
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "BRILL\nNIJHOFF\nNORDIC JOURNAL OF INTERNATIONAL LAW\n92 (2023) 456–469\nNORDIC JOURNAL OF INTERNATIONAL LAW\nbrill.com/nord\n# Finland's views on International Law and Cyberspace\nIntroduction\nMarja Lehto\nMinistry of Foreign Affairs of Finland, Helsinki, Finland\nMarja.Lehto@formin.fi\nPublished online: 4 July 2023\nIn 2013, the Group of Governmental Experts (GGE) under the United Nations auspices reached agreement on the critical question that international law applies in cyberspace.¹ While this point of departure has since then been confirmed in successive reports of the GGE,² as well as by the Open-ended Working Group (OEWG) of the General Assembly,³ further discussions on how international law applies in cyberspace, and where adjustments might be needed to accommodate the specific features of cyberspace, have proved challenging. The deadlock of the fifth GGE, which failed to adopt a report in 2017 because of fundamentally differing views on international law may have been decisive in triggering unilateral responses from individual States.⁴ The\n1. 2013 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/68/98).\n2. 2015 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/70/174), para. 24; 2021 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/76/135), para. 69.\n3. Open-ended Working Group on developments in the field of information and telecommunication in the context of international security, Final Substantive Report (2021), (U.N.Doc. A/AC.290/2021/CRP.2), para. 34.\n4. See, for instance, the national position papers of the United States (2016), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_United_States_of_America_(2016); United Kingdom (2018), available at https://www.gov.uk/government/speeches/cyber-and-international-law-in-the-21st-century and (2021), available at https://www.gov.uk/government/publications/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement; The Netherlands (2019), available at https://cyberlaw.ccdcoe.org/wiki\nPublished with license by Koninklijke Brill NV | DOI: 10.1163/15718107-20230002\n© MARJA LEHTO, 2023 | ISSN: 0902-7351 (print) 1571-8107 (online)\nThis is an open access article distributed under the terms of the CC BY 4.0 license.\nFINLAND'S POSITION PAPER\n457\nemerging practice of issuing national statements and position papers on international law and cyberspace has provided an alternative way to bring clarity to the contentious issues.\nFinland's position paper that is reproduced below was issued in 2020 as a contribution to the ongoing debate.⁵ As such, it comments on selected issues and does not provide a comprehensive compilation of Finland's legal views on cybersecurity. The limited scope of the paper reflects the mandate of the GGE, established by the General Assembly's First Committee, to address, inter alia, existing and emerging threats in cyberspace that may jeopardize international peace and security.⁶ The paper confirms the applicability and essential role of international law in cyberspace, in line with the major GGE findings. It also comments on a number of topical issues such as sovereignty, State responsibility, prevention of transboundary harm, illegal intervention, use of force and armed attack, international humanitarian law and human rights law.\nThe position papers and statements issued so far, including the present one, share a lot of common substance, which is obvious as they generally have the same background and have been prepared by States belonging, in the context of the GGES and the OEWG, to the Western 'like-minded' group. While the papers are consistent on most questions, there are also differences regarding how the legal limitations concerning State action in cyberspace are defined, most notably with regard to the legal nature of the principles of sovereignty and due diligence. These differences have given a further reason for Finland to articulate its own views in a public position paper.\n/National_position_of_the_Netherlands_(2019); France (2019), available at https://documents.unoda.org/wp-content/uploads/2021/12/French-position-on-international-law-applied-to-cyberspace.pdf; New Zealand (2019), available at https://dpmc.govt.nz/publications/application-international-law-state-activity-cyberspace; Australia (2020), available at https://www.internationalcybertech.gov.au/our-work/annexes/annex-b; Israel (2020), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Israel_(2020); Italy (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_Italian_Republic_(2021); Estonia (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Estonia_(2021); Switzerland (2021), available at https://www.eda.admin.ch&gt;eda&gt;voelkerrecht.pdf; Poland (2022), available at https://www.gov.pl/web/diplomacy/the-republic-of-polands-position-on-the-application-of-international-law-in-cyberspace and Canada (2022), available at https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/peace_security-paix_security/cyberspace_law-cyberespace_droit.aspx?lang=eng (all accessed on 27 February 2023). See also the position papers by Denmark, Norway and Sweden reproduced in the current issue of NJIL\n⁵ Also available at https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859 (accessed on 27 February 2023). See also Michael Schmitt, 'Finland sets out key Positions on International Cyber Law', October 27, 2020, available at https://www.justsecurity.org/73061/finland-sets-out-key-positions-on-international-cyber-law/\n⁶ See, for instance, A/RES/68/243, op. para. 4.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND\nThe statement that international law applies to State activities when they are using information and communication technologies may seem as little more than stating the obvious. While questions related to non-State actors increasingly occupy international lawyers and few would claim that States are the only subjects of international law, the one question that can be taken for granted is its applicability to State action. In spite of the self-evidence of the issue, the successive GGES and the OEWG have so far not been able to clearly state, for instance, that international humanitarian law applies to the use of cyber means and methods of war in an armed conflict.7 Whether this inability has something to do with the mystification of the concept of 'cyberspace', or rather reflects an attempt to circumscribe or put aside the existing rules, the debate has proved persistent. Finland's paper seeks, on its part, to make it clear that cyberspace is no lawless area.\nFor the reasons mentioned above, the issue of State sovereignty occupies a prominent place in the paper. Finland disagrees with the claim that no rights and obligations would flow from the principle of sovereignty as such, or that no rule prohibiting violations of sovereignty would have crystallized in respect of cyber activities. This contention seems to overlook the established status in international law of the rule that prohibits violations of sovereignty, confirmed both by State practice and international jurisprudence. Finland sees sovereignty as both a principle and a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers the wrongdoing State's international responsibility. Similarly, in response to the claim that there would be no legal obligation to exercise due diligence in cyberspace, the paper recalls \"each State's obligation not to knowingly allow its territory to be used to harm the rights of other States\" that the International Court of Justice called 'well-recognized' already in 1949.8 According to the paper, the general principle of due diligence is applicable to any activity which involves the risk of causing significant transboundary harm.\nThe question of sovereignty as a rule or as a mere principle, and that of the binding nature of due diligence in cyberspace, are examples of legal disagreements that have important concrete implications. Should it be accepted that sovereignty cannot be violated, it would mean that there are no legal consequences for violations that fall below the notoriously high threshold of\n7 See, however, Group of Governmental Experts on Advancing Responsible State Behaviour in Cyberspace in the Context of International Security, Final Report, 14 July 2021, U.N. Doc. A/73/135, para. 71(f), in which, referring to the principles of humanity, necessity, proportionality and distinction, \"the group recognized the need to further study on how and when these principles apply to the use of ICTs by States\".\n8 Corfu Channel case, Judgment of April 9th, 1949: I.C. J. Reports 1949, P. 4, p. 22.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n459\nprohibited intervention in the internal affairs of a State. It is also not comprehensible that States would have no legal obligation to take efforts to ensure that cyber activities within their territory or jurisdiction do not seriously harm other States. It further seems politically unwise to question the applicability of such long-standing rules in cyberspace, as carving out a cyber-specific exception from their application may give credence to the claim that international law does not apply in cyberspace in the absence of specific regulation.\nTwo further questions addressed in the paper seem worth drawing attention to. First, regarding the use of force, like most if not all of the States that have pronounced on the issue, Finland agrees that for a cyberattack to be comparable to use of force, it must be sufficiently serious and have effects in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of traditional armed force. To be equated to an armed attack, a cyberattack must further fulfil the requirements of scale and effects. The paper is open to the possibility that a cyberattack producing significant economic effects such as the collapse of a State's financial system or parts of its economy could possibly be comparable to an armed attack. Indeed, such a collapse would be likely to cause serious effects on the population.\nIn general, however, the paper underlines that any understanding of the use of force in cyberspace should respect the UN Charter, and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. Particular issues concerning the use of force in cyberspace may need cyber-specific solutions but these should always be assessed in light of the more general understandings. It should also be kept in mind that many of the issues related to the use of force continue to be debated even in the physical, or kinetic context. The ILA Committee on the Use of Force, in its 2018 report, made a similar point stating that conclusions concerning cyber operations as a use of force \"must be reached with great caution\" because a wide interpretation of Articles 2(4) and 51 of the Charter in the cyber context \"may affect the interpretation and debate surrounding other areas of the law of use of force\".9\nSecond, regarding International Humanitarian Law (IHL), the paper does not only state that the use of cyber means and methods in the context of an armed conflict is subject to the rules of IHL, including the principles of distinction, proportionality and precautions, but also underlines that the foreseeable direct and indirect effects of cyber means and methods must be taken into account when assessing their capacity to cause prohibited harm. The paper\n9 International Law Association, Sydney Conference (2018), Final Report on Aggression and the Use of Force, p. 26.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND\nalso takes a stand in favor of including data within the concept of object for the purposes of IHL in stating that there is an obligation to take constant care \"to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data\".\nSince 2020, new questions have arisen in the ongoing exchange of views, both as regards the national statements and within the two UN working groups. Peaceful settlement of disputes is one of such new themes and one that would most likely have been addressed in Finland's paper, had it been issued later.¹⁰ Indeed, if States abided by the fundamental Charter-based and customary obligation to settle their disputes peacefully and in a manner that does not endanger international peace and security, less attention would need to be paid to the intricacies of prohibited intervention, use of force, armed attack and application of IHL in cyberspace.\nMay, 2023\n---\n# International Law and Cyberspace\n## Finland’s National Positions\n### Introduction\nIn line with its general support to rules-based international cooperation and respect for international law, Finland sees international law as an essential framework for responsible State behaviour in cyberspace. In the same vein, the UN Group of Governmental Experts (GGE) has reaffirmed that “international law, and in particular the Charter of the United Nations, is applicable and is essential to maintaining peace and stability and promoting an open, secure, stable, accessible and peaceful ICT environment”.¹ As this formulation, reflecting the specific mandate of the GGE, focuses on questions of international\n¹⁰ See the statement of the delegations of Finland and Sweden in the OEWG in March 2021, available at https://reachingcriticalwill.org/images/documents/Disarmament-fora/other/icts/oewg/statements/9March_FinlandSweden.pdf (accessed on 27 February 2023).\n¹¹ See Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security, 2013 Report (UN Doc. A/68/98, para.20; 2015 report (UN Doc. A/70/174), para.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n461\npeace and security, there is reason to underline that the same applies to other rights and obligations of States, whether based on treaty law or customary international law.\nWhile the existing rules and principles of international law are applicable in cyberspace, the application of certain provisions may give rise to practical problems due to the specific characteristics of cyberspace. Finland therefore welcomes the current exchange of views on particular questions regarding how international law applies to State use of information and communication technologies and wishes to contribute to the discussion by commenting on some of the issues that have been raised recently in this regard.\n## Sovereignty\nIt is undisputed that the principle of State sovereignty applies in cyberspace. While cyberspace as a whole cannot be subject to appropriation by any State, each State has jurisdiction over the cyber infrastructure and the persons engaged in cyber activities within its territory.² Sovereignty confers each State the exclusive right to exercise the functions of a State within a certain territory,³ and protects its territorial integrity and political independence from interference by other States.⁴ In this sense, sovereignty is a foundational principle of the international legal order.\nThe principle of State sovereignty has also given rise to a number of specific rules, such as those prohibiting the use of force and intervention in the internal affairs of other States. Below the threshold of prohibited intervention, all States have an obligation to refrain from acts that violate the territorial integrity or political independence of other States.\nThe International Court of Justice has consistently confirmed that it is a duty of every State to respect the territorial sovereignty of others. This applies\n2 The Group of Governmental Experts has stated in this regard that “State sovereignty and international norms and principles that flow from sovereignty apply to State conduct of ICT-related and to their jurisdiction over ICT infrastructure within their territory”. See GGE 2015 Report, para. 27. Other bases of jurisdiction may be applicable to cyber activities in accordance with international law.\n3 As Judge Max Huber stated in the *Island of Palmas* arbitral award: “Sovereignty in the relations between States signifies independence. Independence in regard to a portion of the globe is the right to exercise therein, to the exclusion of any other State, the functions of a State.” See *Island of Palmas (Netherlands v. the US)*, 2 UNRIAA 829, 838 (PCA 1928).\n4 According to the International Court of Justice, “between independent States, respect for territorial sovereignty is an essential foundation of international relations.” See *Corfu Channel Case (UK v. Albania)*, ICJ reports 1949, p. 4, at 35.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nto unauthorized intrusions to physical spaces such as overflight of a State's territory by an aircraft belonging to another State or under its control,⁵ penetration of territorial waters by foreign warships,⁶ conducting of certain activities in another State's territory without its consent⁷ but also to producing effects in another State's territory without physical intrusion.⁸ According to the Court, it is \"quite obvious that a State possesses a legal interest in the protection of its territory from any form of external harmful action\".⁹\nSimilarly, a non-consensual intrusion in the computer networks and systems that rely on the cyber infrastructure in another State's territory may amount to a violation of that State's sovereignty. The prohibition of cyber operations violating the territorial sovereignty of another State protects, first of all, the cyber infrastructure located in the territory of that State, or otherwise under its jurisdiction, as well as computer networks and systems supported by such infrastructure, from material harm. The situation is the same irrespective of whether such infrastructure belongs to or is operated by governmental institutions, private entities or private individuals. In addition to material harm that may be caused by such an operation, other relevant considerations include whether an intrusion in the cyber infrastructure triggers a loss of functionality of the equipment relying on it, or modifies or deletes information belonging to the target State, or to private actors in its territory.\nMore generally, an unauthorized intrusion by cyber means may be seen as a violation of the target State's territorial sovereignty if it interferes with data or services that are necessary for the exercise of inherently governmental functions. This rule put forward in the Tallinn Manual 2.0¹⁰ is consistent with the understanding of violations of sovereignty as unauthorized exercise of authority in another State's territory. Finally, cyber operations against objects that enjoy sovereign immunity (warships, ships owned by a State and used only for government or noncommercial service; State aircraft) can be characterized as violations of sovereignty.¹¹\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\n5 Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. United States of America), Merits, Judgment, I.C.J. Reports 1986, p. 14, paras. 251, 253, 292.\n6 Corfu Channel case (United Kingdom v. Albania), Judgment, I.C.J. Reports 1949, p. 4, at 26, 35, 36.\n7 Certain Activities carried out by Nicaragua in the Border Area (Costa Rica v. Nicaragua) and Construction of a Road in Costa Rica along the San Juan River (Nicaragua v. Costa Rica), Judgment, I.C.J. Reports 2015, p. 665, paras. 67, 69, 93, 221-223 and 229.\n8 Nuclear Tests (Australia v. France), Judgment, I.C.J. Reports 1974, p. 253, para. 454.\n9 Ibid. para 456, emphasis added.\n10 Michael N. Schmitt (ed.), Tallinn Manual 2.0, Cambridge University Press 2017, Rule 4, para. 15.\n11 Cf. Ibid., Rule 5.\nFINLAND'S POSITION PAPER\n463\nThe argument has been raised recently that no legal consequences could be attached to sovereignty as a general principle, at least for the purposes of cyber activities. It is not only difficult to reconcile such an idea with the established status of the rule prohibiting violations of sovereignty in international law but it also gives rise to policy concerns. Agreeing that a hostile cyber operation below the threshold of prohibited intervention cannot amount to an internationally wrongful act would leave such operations unregulated and deprive the target State of an important opportunity to claim its rights.\nFinland sees sovereignty as a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers State responsibility. This rule is fully applicable in cyberspace. Whether an unauthorized cyber intrusion violates the target State's sovereignty depends on its nature and consequences and is subject to a case-by-case assessment.\n## Illegal intervention\nA hostile interference by cyber means may also breach the customary prohibition of intervention in the internal affairs of another State, provided that it is done with the purpose of compelling or coercing that State in relation to affairs regarding which it has free choice (so-called domaine réservé). The requirement of coercion leaves out lesser forms of influence and persuasion that are commonplace in international relations. The limitation to sovereign affairs – such as a State's political, economic or cultural system or the direction of its foreign policy¹²– further distinguishes prohibited intervention from measures, the purpose of which is to compel another State to comply with its international obligations.\nFor a cyber operation to amount to a prohibited intervention, both above-mentioned elements must be present. Most open questions relate to the element of coercion and to how it manifests itself in cyber operations. For instance, while the conduct of elections belongs undisputedly to the internal affairs of each State, all methods of electoral interference do not display the element of coercion.¹³ Hacking of voter databases or manipulation of vote counts in order to alter the election results has nevertheless been recognized as a fairly clear case. To be comparable to a real world intervention, cyber interference must also be of a serious nature.\n¹² Military and Paramilitary Activities in and against Nicaragua, para. 205.\n¹³ All methods of electoral interference are not coercive, see EU vs. disinfo, 10 Methods of electoral interference (2019).\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nAccording to the International Court of Justice, the element of coercion is particularly clear if force is used through means of military action, threats of such action, or through support to armed groups in another State.¹⁴ Military or economic pressure may also qualify as coercion. Hostile cyber interference done with the purpose of promoting or supporting armed action in another State could constitute an example of prohibited intervention, provided that it seeks to force a certain policy change.¹⁵\nCompared to a violation of sovereignty, the requirement of coercive nature and that of domaine réservé make the threshold of prohibited intervention considerably higher. This underlines the importance of continued understanding of sovereignty as not only a principle but also an independent primary rule of international law.\n## Transboundary harm\nAnother cardinal principle flowing from sovereignty, closely related to the obligation to respect the sovereignty of other States, is each State's obligation not to knowingly allow its territory to be used to cause significant harm to the rights of other States. It is widely recognized that this principle, often referred to as due diligence, is applicable to any activity which involves the risk of causing significant transboundary harm.¹⁶ Due diligence is a variable standard in the sense that its content can change over time as a result of technological development or changes in risk assessment,¹⁷ and as such fully applicable to cyber operations.\nStates may thus not knowingly allow their territory, or cyber infrastructure within a territory under their control, to be used to cyber operations that\n¹⁴ Military and Paramilitary Activities in and against Nicaragua, para.247.\n¹⁵ Ibid., see also paras 241 and 242. See also Friendly Relations Declaration, UN Doc. A/RES/2625(XXV).\n¹⁶ International Law Commission, Draft Articles on the Prevention of transboundary harm from hazardous activities, art. 3: \"The State of origin shall take all appropriate measures to prevent significant transboundary harm or at any event to minimize the risk thereof\", Yearbook... 2001, vol. II (Part Two), pp. 144–170; International Law Association, Second Report on Due Diligence in International Law, July 2016, p. 6: \"This broad principle of due diligence can be understood as underlying more specific rules of due diligence. Hence, it can be viewed as a default standard that is triggered in operation if no more specific elaboration of due diligence or stricter standard is in existence.\"\n¹⁷ International Tribunal for the Law of the Sea, Seabed Disputes Chamber, Responsibilities and Obligations of States Sponsoring Persons and Entities with Respect to Activities in the Area, Advisory opinion, 1 February 2011, List of Cases: No. 17, para. 117.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND'S POSITION PAPER\n465\nproduce serious adverse consequences for other States. While only States can violate sovereignty, the sovereignty-based obligation of due diligence extends to private activities taking place in a State's territory. Significant harm caused to other States by private cyber activities may give rise to a State's international responsibility but only if the State in question has breached its due diligence obligations.\nSome legal obligations are inherent in the principle of due diligence and apply to cyber activities even in the absence of cyber-specific elaborations of the principle. For instance, if a State knows about a planned cyber activity in its territory likely to affect another State adversely and seriously, it must notify that other State. In addition to actual knowledge of harmful acts emanating from the territory of a State, a State's responsibility may be engaged in situations in which it should have known about the activities in question. It is nevertheless clear that \"it cannot be concluded from the mere fact of the control exercised [...] over its territory [...] that [a] State necessarily knew, or ought to have known, of any unlawful act perpetrated therein\".[18]\nIf harmful cyber activity takes place and causes serious harm to another State, the State of origin must take appropriate action to terminate it, as well as to investigate the incident and bring those responsible to justice. In order to be able to do this, States should have the necessary procedural and legal mechanisms in place. It should nevertheless be recalled that due diligence is an obligation of conduct, not one of result. In general, what is required of States is that they take all measures that are feasible under the circumstances. A particular question in this regard is related to the position of transit States through which a particular harmful data is routed. Much depends on whether such a State has any knowledge of the ongoing operation, or ability to take feasible measures to terminate it.\nFurthermore, while States must show due diligence in the control of the national territory, doing so does not release them from the observance of other international obligations such as those related to human rights.\n## State responsibility\nThe law of State responsibility consists of secondary rules that apply generally in the absence of clear specific rules that modify their effect. As there is no specific regulation concerning State activities in cyberspace that would constitute\n[18] International Court of Justice, *Corfu Channel case*, Judgment of April 9th, 1949, I.C.J. Reports 1949, p.4, at 18.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nsuch lex specialis, it can be concluded that the normal rules of State responsibility apply in cyberspace.\nWhen a State's cyber operation violates its obligations under international law, it constitutes an internationally wrongful act. An internationally wrongful act of a State entails its international responsibility and gives rise to an obligation to make full reparation for the damage that may be caused by the act.¹⁹ This requires that the act is attributable to the State. The rules of attribution reflected in the UN International Law Commission's Articles on State Responsibility²⁰ remain fully valid in cyberspace. If State organs, or private groups or individuals acting on behalf of the State, can be identified as the authors of a cyber operation that violates the State's international obligations, its international responsibility is engaged. It is in this regard useful to distinguish identification as a technical operation from attribution as a legal operation. Identification may be technically challenging given the often covert nature of hostile cyber activities but this is without consequence to the legal rules of attribution.\nAn internationally wrongful act may justify recourse to countermeasures by the injured State if the State responsible for an internationally wrongful act declines to cease the wrongful conduct or pay reparation. Countermeasures may only be taken with the purpose of ensuring compliance, not for retaliation. Countermeasures may furthermore not breach the prohibition of the threat or use of force, or other peremptory norms of general international law, and must be consistent with other customary law requirements and limitations concerning countermeasures, most of which are reflected in the International Law Commission's Articles on State Responsibility.²¹ Some of the procedural requirements concerning countermeasures may nevertheless require adjustment. For instance, it may be possible to attribute a hostile cyber operation only afterwards whereas countermeasures normally should be taken while the wrongful act is ongoing.\nThere is no general obligation for a State taking countermeasures to disclose the information on the basis of which the action is taken. At the same time, it is in each State's best interests to ensure that a decision to take countermeasures is based on solid evidence, given that recourse to countermeasures would otherwise constitute an internationally wrongful act. A State that responds to a hostile cyber operation must therefore have adequate proof of the source\n¹⁹ International Law Commission, Responsibility of States for Internationally Wrongful Acts (2001), available at www.legal.un.org/ILC (ARSIWA).\n²⁰ Ibid., arts. 4–11.\n²¹ Ibid., arts. 49–54.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND'S POSITION PAPER\n467\nof the operation and convincing evidence of the responsibility of a particular State.\nPublic attribution, as a sovereign choice, is primarily a question of political consideration. Public attribution may nevertheless have legal effects to the extent it includes determinations of conduct that constitutes an internationally wrongful act.\nIn addition to countermeasures, other circumstances precluding wrongfulness may justify taking of cyber measures that would otherwise constitute an internationally wrongful act.²² This may be the case, for instance, if deviating from an international obligation is the only way for the State to safeguard an essential interest against a grave and imminent peril. Facing such an exceptional situation, a State may deviate from its international obligations within the limits specified in the law of State responsibility.²³\n## Use of force/ armed attack\nWhile there is currently no established definition of a cyberattack that would pass the threshold of \"use of force\" in the sense of article 2(4) of the UN Charter, or \"armed attack\" in the sense of article 51, it is widely recognized that such a qualification depends on the consequences of a cyberattack. For a cyberattack to be comparable to use of force, it must be sufficiently serious and have impacts in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of force. A threat of such a cyberattack could also violate Article 2(4) of the Charter, if the threat is sufficiently precise and directed against another State.\nSimilarly, most commentators agree that when the scale and effects of a cyberattack correspond to those of an armed attack responding to the cyberattack is justifiable as self-defence. It is obvious that the attack must have caused death, injury or substantial material damage, but it is impossible to set a precise quantitative threshold for the effects, and other circumstantial factors must be taken into account in the analysis, as well. A widely discussed question is, to what extent the definition of a cyberattack comparable to an armed attack should take account of the indirect and long-term impacts of the attack. In any case, this would require that the impacts can be assessed with sufficient precision. A question has also been raised, whether a cyberattack producing significant economic effects such as the collapse of a State's financial system\n²² ARSIWA, Chapter V, Circumstances precluding wrongfulness.\n²³ Ibid., art. 25. See also Tallinn Manual 2.0, Rule 26.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nor parts of its economy should be equated to an armed attack. This question merits further consideration.\nAny interpretation of the use of force in cyberspace should respect the UN Charter and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. This would mean, for instance, that the distinction between armed attack as a particularly serious violation of the Charter, on the one hand, and any lesser uses of force, on the other, is preserved. Similarly, the conditions for the exercise of the right of self-defence apply in cyberspace as they do with regard to the use of armed force. The right of self-defence arises if a cyberattack comparable to an armed attack occurs and can be attributed to a particular State.²⁴ It is reasonable to think that a State victim to such an attack can respond with either cyber means or armed action. At the same time, the use of force must not be disproportionate or excessive.\n## International Humanitarian Law\nInternational humanitarian law only applies to cyber operations when such operations are part of, or amount to, an armed conflict. Most so far known cyberattacks have not been launched in the context of an armed conflict or have met the threshold of armed conflict. At the same time, when cyber means are used in the context of a pre-existing armed conflict, as has been done in many current conflicts, there is no reason to deny the need for the protections that international humanitarian law provides.\nThis includes that cyber means and methods of warfare must be used consistently with the principles of distinction, proportionality and precautions, as well as the specific rules flowing from these principles. When assessing the capacity of cyber means and methods to cause prohibited harm, their foreseeable direct and indirect effects shall be taken into account. Constant care shall be taken to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data.\nThe unique characteristics of cyberspace, such as interconnectedness and anonymity, may affect how international humanitarian law is interpreted and applied with regard to certain cyber means and methods warfare. The related problems can nevertheless mostly be solved on the basis of existing rules. New\n²⁴ While the possibility of a cyberattack rising to the level of an armed attack without the involvement of any State is conceivable, the related questions of self-defence against non-State actors are too complicated to be discussed here.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n469\ntechnologies do not render the existing rules of international humanitarian law meaningless or necessarily require new legal regulation. Furthermore, while international humanitarian law is *lex specialis* in an armed conflict, it does not override other areas of international law, such as human rights law, which may continue to apply throughout the conflict.\n## Human rights law\nA number of specific human rights such as the freedom of opinion and expression, including the right to access to information, and the right to privacy are particularly relevant in cyberspace. It should nevertheless be underlined that individuals enjoy the same international human rights with respect to cyber-related activities as otherwise and, accordingly, that States are bound by all their human rights obligations both online and offline. Furthermore, each State has to protect individuals within its territory and subject to its jurisdiction from interference with their rights by third parties.\n## Note from the publisher\nThe author mentioned at the start of this article, Marja Lehto, is only responsible for the introduction to this position paper. The position paper is a product of the government of Finland and available online: https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469",
  "references": [],
  "flat_text": "BRILL\nNIJHOFF\nNORDIC JOURNAL OF INTERNATIONAL LAW\n\nNORDIC JOURNAL OF INTERNATIONAL LAW\nbrill.com/nord\n# Finland's views on International Law and Cyberspace\nIntroduction\nMarja Lehto\nMinistry of Foreign Affairs of Finland, Helsinki, Finland\nMarja.Lehto@formin.fi\nPublished online: 4 July 2023\nIn 2013, the Group of Governmental Experts (GGE) under the United Nations auspices reached agreement on the critical question that international law applies in cyberspace. While this point of departure has since then been confirmed in successive reports of the GGE, as well as by the Open-ended Working Group (OEWG) of the General Assembly, further discussions on how international law applies in cyberspace, and where adjustments might be needed to accommodate the specific features of cyberspace, have proved challenging. The deadlock of the fifth GGE, which failed to adopt a report in 2017 because of fundamentally differing views on international law may have been decisive in triggering unilateral responses from individual States. The\n1. 2013 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/68/98).\n2. 2015 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/70/174), para. 24; 2021 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/76/135), para. 69.\n3. Open-ended Working Group on developments in the field of information and telecommunication in the context of international security, Final Substantive Report (2021), (U.N.Doc. A/AC.290/2021/CRP.2), para. 34.\n4. See, for instance, the national position papers of the United States (2016), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_United_States_of_America_(2016); United Kingdom (2018), available at https://www.gov.uk/government/speeches/cyber-and-international-law-in-the-21st-century and (2021), available at https://www.gov.uk/government/publications/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement; The Netherlands (2019), available at https://cyberlaw.ccdcoe.org/wiki\nPublished with license by Koninklijke Brill NV | DOI: 10.1163/15718107-20230002\n© MARJA LEHTO, 2023 | ISSN: 0902-7351 (print) 1571-8107 (online)\nThis is an open access article distributed under the terms of the CC BY 4.0 license.\nFINLAND'S POSITION PAPER\n\nFinland's position paper that is reproduced below was issued in 2020 as a contribution to the ongoing debate. As such, it comments on selected issues and does not provide a comprehensive compilation of Finland's legal views on cybersecurity. The limited scope of the paper reflects the mandate of the GGE, established by the General Assembly's First Committee, to address, inter alia, existing and emerging threats in cyberspace that may jeopardize international peace and security. The paper confirms the applicability and essential role of international law in cyberspace, in line with the major GGE findings. It also comments on a number of topical issues such as sovereignty, State responsibility, prevention of transboundary harm, illegal intervention, use of force and armed attack, international humanitarian law and human rights law.\nThe position papers and statements issued so far, including the present one, share a lot of common substance, which is obvious as they generally have the same background and have been prepared by States belonging, in the context of the GGES and the OEWG, to the Western 'like-minded' group. While the papers are consistent on most questions, there are also differences regarding how the legal limitations concerning State action in cyberspace are defined, most notably with regard to the legal nature of the principles of sovereignty and due diligence. These differences have given a further reason for Finland to articulate its own views in a public position paper.\n/National_position_of_the_Netherlands_(2019); France (2019), available at https://documents.unoda.org/wp-content/uploads/2021/12/French-position-on-international-law-applied-to-cyberspace.pdf; New Zealand (2019), available at https://dpmc.govt.nz/publications/application-international-law-state-activity-cyberspace; Australia (2020), available at https://www.internationalcybertech.gov.au/our-work/annexes/annex-b; Israel (2020), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Israel_(2020); Italy (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_Italian_Republic_(2021); Estonia (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Estonia_(2021); Switzerland (2021), available at https://www.eda.admin.ch&gt;eda&gt;voelkerrecht.pdf; Poland (2022), available at https://www.gov.pl/web/diplomacy/the-republic-of-polands-position-on-the-application-of-international-law-in-cyberspace and Canada (2022), available at https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/peace_security-paix_security/cyberspace_law-cyberespace_droit.aspx?lang=eng (all accessed on 27 February 2023). See also the position papers by Denmark, Norway and Sweden reproduced in the current issue of NJIL\n Also available at https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859 (accessed on 27 February 2023). See also Michael Schmitt, 'Finland sets out key Positions on International Cyber Law', October 27, 2020, available at https://www.justsecurity.org/73061/finland-sets-out-key-positions-on-international-cyber-law/\n See, for instance, A/RES/68/243, op. para. 4.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND\nThe statement that international law applies to State activities when they are using information and communication technologies may seem as little more than stating the obvious. While questions related to non-State actors increasingly occupy international lawyers and few would claim that States are the only subjects of international law, the one question that can be taken for granted is its applicability to State action. In spite of the self-evidence of the issue, the successive GGES and the OEWG have so far not been able to clearly state, for instance, that international humanitarian law applies to the use of cyber means and methods of war in an armed conflict.7 Whether this inability has something to do with the mystification of the concept of 'cyberspace', or rather reflects an attempt to circumscribe or put aside the existing rules, the debate has proved persistent. Finland's paper seeks, on its part, to make it clear that cyberspace is no lawless area.\nFor the reasons mentioned above, the issue of State sovereignty occupies a prominent place in the paper. Finland disagrees with the claim that no rights and obligations would flow from the principle of sovereignty as such, or that no rule prohibiting violations of sovereignty would have crystallized in respect of cyber activities. This contention seems to overlook the established status in international law of the rule that prohibits violations of sovereignty, confirmed both by State practice and international jurisprudence. Finland sees sovereignty as both a principle and a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers the wrongdoing State's international responsibility. Similarly, in response to the claim that there would be no legal obligation to exercise due diligence in cyberspace, the paper recalls \"each State's obligation not to knowingly allow its territory to be used to harm the rights of other States\" that the International Court of Justice called 'well-recognized' already in 1949.8 According to the paper, the general principle of due diligence is applicable to any activity which involves the risk of causing significant transboundary harm.\nThe question of sovereignty as a rule or as a mere principle, and that of the binding nature of due diligence in cyberspace, are examples of legal disagreements that have important concrete implications. Should it be accepted that sovereignty cannot be violated, it would mean that there are no legal consequences for violations that fall below the notoriously high threshold of\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n\nTwo further questions addressed in the paper seem worth drawing attention to. First, regarding the use of force, like most if not all of the States that have pronounced on the issue, Finland agrees that for a cyberattack to be comparable to use of force, it must be sufficiently serious and have effects in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of traditional armed force. To be equated to an armed attack, a cyberattack must further fulfil the requirements of scale and effects. The paper is open to the possibility that a cyberattack producing significant economic effects such as the collapse of a State's financial system or parts of its economy could possibly be comparable to an armed attack. Indeed, such a collapse would be likely to cause serious effects on the population.\nIn general, however, the paper underlines that any understanding of the use of force in cyberspace should respect the UN Charter, and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. Particular issues concerning the use of force in cyberspace may need cyber-specific solutions but these should always be assessed in light of the more general understandings. It should also be kept in mind that many of the issues related to the use of force continue to be debated even in the physical, or kinetic context. The ILA Committee on the Use of Force, in its 2018 report, made a similar point stating that conclusions concerning cyber operations as a use of force \"must be reached with great caution\" because a wide interpretation of Articles 2(4) and 51 of the Charter in the cyber context \"may affect the interpretation and debate surrounding other areas of the law of use of force\".9\nSecond, regarding International Humanitarian Law (IHL), the paper does not only state that the use of cyber means and methods in the context of an armed conflict is subject to the rules of IHL, including the principles of distinction, proportionality and precautions, but also underlines that the foreseeable direct and indirect effects of cyber means and methods must be taken into account when assessing their capacity to cause prohibited harm. The paper\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND\nalso takes a stand in favor of including data within the concept of object for the purposes of IHL in stating that there is an obligation to take constant care \"to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data\".\nSince 2020, new questions have arisen in the ongoing exchange of views, both as regards the national statements and within the two UN working groups. Peaceful settlement of disputes is one of such new themes and one that would most likely have been addressed in Finland's paper, had it been issued later. Indeed, if States abided by the fundamental Charter-based and customary obligation to settle their disputes peacefully and in a manner that does not endanger international peace and security, less attention would need to be paid to the intricacies of prohibited intervention, use of force, armed attack and application of IHL in cyberspace.\nMay, 2023\n---\n# International Law and Cyberspace\n## Finland’s National Positions\n### Introduction\nIn line with its general support to rules-based international cooperation and respect for international law, Finland sees international law as an essential framework for responsible State behaviour in cyberspace. In the same vein, the UN Group of Governmental Experts (GGE) has reaffirmed that “international law, and in particular the Charter of the United Nations, is applicable and is essential to maintaining peace and stability and promoting an open, secure, stable, accessible and peaceful ICT environment”. As this formulation, reflecting the specific mandate of the GGE, focuses on questions of international\n See the statement of the delegations of Finland and Sweden in the OEWG in March 2021, available at https://reachingcriticalwill.org/images/documents/Disarmament-fora/other/icts/oewg/statements/9March_FinlandSweden.pdf (accessed on 27 February 2023).\n See Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security, 2013 Report (UN Doc. A/68/98, para.20; 2015 report (UN Doc. A/70/174), para.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n\nWhile the existing rules and principles of international law are applicable in cyberspace, the application of certain provisions may give rise to practical problems due to the specific characteristics of cyberspace. Finland therefore welcomes the current exchange of views on particular questions regarding how international law applies to State use of information and communication technologies and wishes to contribute to the discussion by commenting on some of the issues that have been raised recently in this regard.\n## Sovereignty\nIt is undisputed that the principle of State sovereignty applies in cyberspace. While cyberspace as a whole cannot be subject to appropriation by any State, each State has jurisdiction over the cyber infrastructure and the persons engaged in cyber activities within its territory. Sovereignty confers each State the exclusive right to exercise the functions of a State within a certain territory, and protects its territorial integrity and political independence from interference by other States. In this sense, sovereignty is a foundational principle of the international legal order.\nThe principle of State sovereignty has also given rise to a number of specific rules, such as those prohibiting the use of force and intervention in the internal affairs of other States. Below the threshold of prohibited intervention, all States have an obligation to refrain from acts that violate the territorial integrity or political independence of other States.\nThe International Court of Justice has consistently confirmed that it is a duty of every State to respect the territorial sovereignty of others. This applies\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nto unauthorized intrusions to physical spaces such as overflight of a State's territory by an aircraft belonging to another State or under its control, penetration of territorial waters by foreign warships, conducting of certain activities in another State's territory without its consent but also to producing effects in another State's territory without physical intrusion. According to the Court, it is \"quite obvious that a State possesses a legal interest in the protection of its territory from any form of external harmful action\".\nSimilarly, a non-consensual intrusion in the computer networks and systems that rely on the cyber infrastructure in another State's territory may amount to a violation of that State's sovereignty. The prohibition of cyber operations violating the territorial sovereignty of another State protects, first of all, the cyber infrastructure located in the territory of that State, or otherwise under its jurisdiction, as well as computer networks and systems supported by such infrastructure, from material harm. The situation is the same irrespective of whether such infrastructure belongs to or is operated by governmental institutions, private entities or private individuals. In addition to material harm that may be caused by such an operation, other relevant considerations include whether an intrusion in the cyber infrastructure triggers a loss of functionality of the equipment relying on it, or modifies or deletes information belonging to the target State, or to private actors in its territory.\nMore generally, an unauthorized intrusion by cyber means may be seen as a violation of the target State's territorial sovereignty if it interferes with data or services that are necessary for the exercise of inherently governmental functions. This rule put forward in the Tallinn Manual 2.0 is consistent with the understanding of violations of sovereignty as unauthorized exercise of authority in another State's territory. Finally, cyber operations against objects that enjoy sovereign immunity (warships, ships owned by a State and used only for government or noncommercial service; State aircraft) can be characterized as violations of sovereignty.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\n\nFINLAND'S POSITION PAPER\n\nFinland sees sovereignty as a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers State responsibility. This rule is fully applicable in cyberspace. Whether an unauthorized cyber intrusion violates the target State's sovereignty depends on its nature and consequences and is subject to a case-by-case assessment.\n## Illegal intervention\nA hostile interference by cyber means may also breach the customary prohibition of intervention in the internal affairs of another State, provided that it is done with the purpose of compelling or coercing that State in relation to affairs regarding which it has free choice (so-called domaine réservé). The requirement of coercion leaves out lesser forms of influence and persuasion that are commonplace in international relations. The limitation to sovereign affairs – such as a State's political, economic or cultural system or the direction of its foreign policy– further distinguishes prohibited intervention from measures, the purpose of which is to compel another State to comply with its international obligations.\nFor a cyber operation to amount to a prohibited intervention, both above-mentioned elements must be present. Most open questions relate to the element of coercion and to how it manifests itself in cyber operations. For instance, while the conduct of elections belongs undisputedly to the internal affairs of each State, all methods of electoral interference do not display the element of coercion. Hacking of voter databases or manipulation of vote counts in order to alter the election results has nevertheless been recognized as a fairly clear case. To be comparable to a real world intervention, cyber interference must also be of a serious nature.\n Military and Paramilitary Activities in and against Nicaragua, para. 205.\n All methods of electoral interference are not coercive, see EU vs. disinfo, 10 Methods of electoral interference (2019).\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nAccording to the International Court of Justice, the element of coercion is particularly clear if force is used through means of military action, threats of such action, or through support to armed groups in another State. Military or economic pressure may also qualify as coercion. Hostile cyber interference done with the purpose of promoting or supporting armed action in another State could constitute an example of prohibited intervention, provided that it seeks to force a certain policy change.\nCompared to a violation of sovereignty, the requirement of coercive nature and that of domaine réservé make the threshold of prohibited intervention considerably higher. This underlines the importance of continued understanding of sovereignty as not only a principle but also an independent primary rule of international law.\n## Transboundary harm\nAnother cardinal principle flowing from sovereignty, closely related to the obligation to respect the sovereignty of other States, is each State's obligation not to knowingly allow its territory to be used to cause significant harm to the rights of other States. It is widely recognized that this principle, often referred to as due diligence, is applicable to any activity which involves the risk of causing significant transboundary harm. Due diligence is a variable standard in the sense that its content can change over time as a result of technological development or changes in risk assessment, and as such fully applicable to cyber operations.\nStates may thus not knowingly allow their territory, or cyber infrastructure within a territory under their control, to be used to cyber operations that\n Military and Paramilitary Activities in and against Nicaragua, para.247.\n Ibid., see also paras 241 and 242. See also Friendly Relations Declaration, UN Doc. A/RES/2625(XXV).\n International Law Commission, Draft Articles on the Prevention of transboundary harm from hazardous activities, art. 3: \"The State of origin shall take all appropriate measures to prevent significant transboundary harm or at any event to minimize the risk thereof\", Yearbook... 2001, vol. II (Part Two), pp. 144–170; International Law Association, Second Report on Due Diligence in International Law, July 2016, p. 6: \"This broad principle of due diligence can be understood as underlying more specific rules of due diligence. Hence, it can be viewed as a default standard that is triggered in operation if no more specific elaboration of due diligence or stricter standard is in existence.\"\n International Tribunal for the Law of the Sea, Seabed Disputes Chamber, Responsibilities and Obligations of States Sponsoring Persons and Entities with Respect to Activities in the Area, Advisory opinion, 1 February 2011, List of Cases: No. 17, para. 117.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND'S POSITION PAPER\n\nSome legal obligations are inherent in the principle of due diligence and apply to cyber activities even in the absence of cyber-specific elaborations of the principle. For instance, if a State knows about a planned cyber activity in its territory likely to affect another State adversely and seriously, it must notify that other State. In addition to actual knowledge of harmful acts emanating from the territory of a State, a State's responsibility may be engaged in situations in which it should have known about the activities in question. It is nevertheless clear that \"it cannot be concluded from the mere fact of the control exercised [...] over its territory [...] that [a] State necessarily knew, or ought to have known, of any unlawful act perpetrated therein\".[18]\nIf harmful cyber activity takes place and causes serious harm to another State, the State of origin must take appropriate action to terminate it, as well as to investigate the incident and bring those responsible to justice. In order to be able to do this, States should have the necessary procedural and legal mechanisms in place. It should nevertheless be recalled that due diligence is an obligation of conduct, not one of result. In general, what is required of States is that they take all measures that are feasible under the circumstances. A particular question in this regard is related to the position of transit States through which a particular harmful data is routed. Much depends on whether such a State has any knowledge of the ongoing operation, or ability to take feasible measures to terminate it.\nFurthermore, while States must show due diligence in the control of the national territory, doing so does not release them from the observance of other international obligations such as those related to human rights.\n## State responsibility\nThe law of State responsibility consists of secondary rules that apply generally in the absence of clear specific rules that modify their effect. As there is no specific regulation concerning State activities in cyberspace that would constitute\n[18] International Court of Justice, *Corfu Channel case*, Judgment of April 9th, 1949, I.C.J. Reports 1949, p.4, at 18.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nsuch lex specialis, it can be concluded that the normal rules of State responsibility apply in cyberspace.\nWhen a State's cyber operation violates its obligations under international law, it constitutes an internationally wrongful act. An internationally wrongful act of a State entails its international responsibility and gives rise to an obligation to make full reparation for the damage that may be caused by the act. This requires that the act is attributable to the State. The rules of attribution reflected in the UN International Law Commission's Articles on State Responsibility remain fully valid in cyberspace. If State organs, or private groups or individuals acting on behalf of the State, can be identified as the authors of a cyber operation that violates the State's international obligations, its international responsibility is engaged. It is in this regard useful to distinguish identification as a technical operation from attribution as a legal operation. Identification may be technically challenging given the often covert nature of hostile cyber activities but this is without consequence to the legal rules of attribution.\nAn internationally wrongful act may justify recourse to countermeasures by the injured State if the State responsible for an internationally wrongful act declines to cease the wrongful conduct or pay reparation. Countermeasures may only be taken with the purpose of ensuring compliance, not for retaliation. Countermeasures may furthermore not breach the prohibition of the threat or use of force, or other peremptory norms of general international law, and must be consistent with other customary law requirements and limitations concerning countermeasures, most of which are reflected in the International Law Commission's Articles on State Responsibility. Some of the procedural requirements concerning countermeasures may nevertheless require adjustment. For instance, it may be possible to attribute a hostile cyber operation only afterwards whereas countermeasures normally should be taken while the wrongful act is ongoing.\nThere is no general obligation for a State taking countermeasures to disclose the information on the basis of which the action is taken. At the same time, it is in each State's best interests to ensure that a decision to take countermeasures is based on solid evidence, given that recourse to countermeasures would otherwise constitute an internationally wrongful act. A State that responds to a hostile cyber operation must therefore have adequate proof of the source\n International Law Commission, Responsibility of States for Internationally Wrongful Acts (2001), available at www.legal.un.org/ILC (ARSIWA).\n Ibid., arts. 4–11.\n Ibid., arts. 49–54.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND'S POSITION PAPER\n\nPublic attribution, as a sovereign choice, is primarily a question of political consideration. Public attribution may nevertheless have legal effects to the extent it includes determinations of conduct that constitutes an internationally wrongful act.\nIn addition to countermeasures, other circumstances precluding wrongfulness may justify taking of cyber measures that would otherwise constitute an internationally wrongful act. This may be the case, for instance, if deviating from an international obligation is the only way for the State to safeguard an essential interest against a grave and imminent peril. Facing such an exceptional situation, a State may deviate from its international obligations within the limits specified in the law of State responsibility.\n## Use of force/ armed attack\nWhile there is currently no established definition of a cyberattack that would pass the threshold of \"use of force\" in the sense of article 2(4) of the UN Charter, or \"armed attack\" in the sense of article 51, it is widely recognized that such a qualification depends on the consequences of a cyberattack. For a cyberattack to be comparable to use of force, it must be sufficiently serious and have impacts in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of force. A threat of such a cyberattack could also violate Article 2(4) of the Charter, if the threat is sufficiently precise and directed against another State.\nSimilarly, most commentators agree that when the scale and effects of a cyberattack correspond to those of an armed attack responding to the cyberattack is justifiable as self-defence. It is obvious that the attack must have caused death, injury or substantial material damage, but it is impossible to set a precise quantitative threshold for the effects, and other circumstantial factors must be taken into account in the analysis, as well. A widely discussed question is, to what extent the definition of a cyberattack comparable to an armed attack should take account of the indirect and long-term impacts of the attack. In any case, this would require that the impacts can be assessed with sufficient precision. A question has also been raised, whether a cyberattack producing significant economic effects such as the collapse of a State's financial system\n ARSIWA, Chapter V, Circumstances precluding wrongfulness.\n Ibid., art. 25. See also Tallinn Manual 2.0, Rule 26.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nor parts of its economy should be equated to an armed attack. This question merits further consideration.\nAny interpretation of the use of force in cyberspace should respect the UN Charter and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. This would mean, for instance, that the distinction between armed attack as a particularly serious violation of the Charter, on the one hand, and any lesser uses of force, on the other, is preserved. Similarly, the conditions for the exercise of the right of self-defence apply in cyberspace as they do with regard to the use of armed force. The right of self-defence arises if a cyberattack comparable to an armed attack occurs and can be attributed to a particular State. It is reasonable to think that a State victim to such an attack can respond with either cyber means or armed action. At the same time, the use of force must not be disproportionate or excessive.\n## International Humanitarian Law\nInternational humanitarian law only applies to cyber operations when such operations are part of, or amount to, an armed conflict. Most so far known cyberattacks have not been launched in the context of an armed conflict or have met the threshold of armed conflict. At the same time, when cyber means are used in the context of a pre-existing armed conflict, as has been done in many current conflicts, there is no reason to deny the need for the protections that international humanitarian law provides.\nThis includes that cyber means and methods of warfare must be used consistently with the principles of distinction, proportionality and precautions, as well as the specific rules flowing from these principles. When assessing the capacity of cyber means and methods to cause prohibited harm, their foreseeable direct and indirect effects shall be taken into account. Constant care shall be taken to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data.\nThe unique characteristics of cyberspace, such as interconnectedness and anonymity, may affect how international humanitarian law is interpreted and applied with regard to certain cyber means and methods warfare. The related problems can nevertheless mostly be solved on the basis of existing rules. New\n While the possibility of a cyberattack rising to the level of an armed attack without the involvement of any State is conceivable, the related questions of self-defence against non-State actors are too complicated to be discussed here.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n\n## Human rights law\nA number of specific human rights such as the freedom of opinion and expression, including the right to access to information, and the right to privacy are particularly relevant in cyberspace. It should nevertheless be underlined that individuals enjoy the same international human rights with respect to cyber-related activities as otherwise and, accordingly, that States are bound by all their human rights obligations both online and offline. Furthermore, each State has to protect individuals within its territory and subject to its jurisdiction from interference with their rights by third parties.\n## Note from the publisher\nThe author mentioned at the start of this article, Marja Lehto, is only responsible for the introduction to this position paper. The position paper is a product of the government of Finland and available online: https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469",
  "citations": {
    "style": "superscript",
    "flat_text": "BRILL\nNIJHOFF\nNORDIC JOURNAL OF INTERNATIONAL LAW\n\nNORDIC JOURNAL OF INTERNATIONAL LAW\nbrill.com/nord\n# Finland's views on International Law and Cyberspace\nIntroduction\nMarja Lehto\nMinistry of Foreign Affairs of Finland, Helsinki, Finland\nMarja.Lehto@formin.fi\nPublished online: 4 July 2023\nIn 2013, the Group of Governmental Experts (GGE) under the United Nations auspices reached agreement on the critical question that international law applies in cyberspace. While this point of departure has since then been confirmed in successive reports of the GGE, as well as by the Open-ended Working Group (OEWG) of the General Assembly, further discussions on how international law applies in cyberspace, and where adjustments might be needed to accommodate the specific features of cyberspace, have proved challenging. The deadlock of the fifth GGE, which failed to adopt a report in 2017 because of fundamentally differing views on international law may have been decisive in triggering unilateral responses from individual States. The\n1. 2013 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/68/98).\n2. 2015 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/70/174), para. 24; 2021 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/76/135), para. 69.\n3. Open-ended Working Group on developments in the field of information and telecommunication in the context of international security, Final Substantive Report (2021), (U.N.Doc. A/AC.290/2021/CRP.2), para. 34.\n4. See, for instance, the national position papers of the United States (2016), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_United_States_of_America_(2016); United Kingdom (2018), available at https://www.gov.uk/government/speeches/cyber-and-international-law-in-the-21st-century and (2021), available at https://www.gov.uk/government/publications/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement; The Netherlands (2019), available at https://cyberlaw.ccdcoe.org/wiki\nPublished with license by Koninklijke Brill NV | DOI: 10.1163/15718107-20230002\n© MARJA LEHTO, 2023 | ISSN: 0902-7351 (print) 1571-8107 (online)\nThis is an open access article distributed under the terms of the CC BY 4.0 license.\nFINLAND'S POSITION PAPER\n\nFinland's position paper that is reproduced below was issued in 2020 as a contribution to the ongoing debate. As such, it comments on selected issues and does not provide a comprehensive compilation of Finland's legal views on cybersecurity. The limited scope of the paper reflects the mandate of the GGE, established by the General Assembly's First Committee, to address, inter alia, existing and emerging threats in cyberspace that may jeopardize international peace and security. The paper confirms the applicability and essential role of international law in cyberspace, in line with the major GGE findings. It also comments on a number of topical issues such as sovereignty, State responsibility, prevention of transboundary harm, illegal intervention, use of force and armed attack, international humanitarian law and human rights law.\nThe position papers and statements issued so far, including the present one, share a lot of common substance, which is obvious as they generally have the same background and have been prepared by States belonging, in the context of the GGES and the OEWG, to the Western 'like-minded' group. While the papers are consistent on most questions, there are also differences regarding how the legal limitations concerning State action in cyberspace are defined, most notably with regard to the legal nature of the principles of sovereignty and due diligence. These differences have given a further reason for Finland to articulate its own views in a public position paper.\n/National_position_of_the_Netherlands_(2019); France (2019), available at https://documents.unoda.org/wp-content/uploads/2021/12/French-position-on-international-law-applied-to-cyberspace.pdf; New Zealand (2019), available at https://dpmc.govt.nz/publications/application-international-law-state-activity-cyberspace; Australia (2020), available at https://www.internationalcybertech.gov.au/our-work/annexes/annex-b; Israel (2020), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Israel_(2020); Italy (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_Italian_Republic_(2021); Estonia (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Estonia_(2021); Switzerland (2021), available at https://www.eda.admin.ch&gt;eda&gt;voelkerrecht.pdf; Poland (2022), available at https://www.gov.pl/web/diplomacy/the-republic-of-polands-position-on-the-application-of-international-law-in-cyberspace and Canada (2022), available at https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/peace_security-paix_security/cyberspace_law-cyberespace_droit.aspx?lang=eng (all accessed on 27 February 2023). See also the position papers by Denmark, Norway and Sweden reproduced in the current issue of NJIL\n Also available at https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859 (accessed on 27 February 2023). See also Michael Schmitt, 'Finland sets out key Positions on International Cyber Law', October 27, 2020, available at https://www.justsecurity.org/73061/finland-sets-out-key-positions-on-international-cyber-law/\n See, for instance, A/RES/68/243, op. para. 4.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND\nThe statement that international law applies to State activities when they are using information and communication technologies may seem as little more than stating the obvious. While questions related to non-State actors increasingly occupy international lawyers and few would claim that States are the only subjects of international law, the one question that can be taken for granted is its applicability to State action. In spite of the self-evidence of the issue, the successive GGES and the OEWG have so far not been able to clearly state, for instance, that international humanitarian law applies to the use of cyber means and methods of war in an armed conflict.7 Whether this inability has something to do with the mystification of the concept of 'cyberspace', or rather reflects an attempt to circumscribe or put aside the existing rules, the debate has proved persistent. Finland's paper seeks, on its part, to make it clear that cyberspace is no lawless area.\nFor the reasons mentioned above, the issue of State sovereignty occupies a prominent place in the paper. Finland disagrees with the claim that no rights and obligations would flow from the principle of sovereignty as such, or that no rule prohibiting violations of sovereignty would have crystallized in respect of cyber activities. This contention seems to overlook the established status in international law of the rule that prohibits violations of sovereignty, confirmed both by State practice and international jurisprudence. Finland sees sovereignty as both a principle and a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers the wrongdoing State's international responsibility. Similarly, in response to the claim that there would be no legal obligation to exercise due diligence in cyberspace, the paper recalls \"each State's obligation not to knowingly allow its territory to be used to harm the rights of other States\" that the International Court of Justice called 'well-recognized' already in 1949.8 According to the paper, the general principle of due diligence is applicable to any activity which involves the risk of causing significant transboundary harm.\nThe question of sovereignty as a rule or as a mere principle, and that of the binding nature of due diligence in cyberspace, are examples of legal disagreements that have important concrete implications. Should it be accepted that sovereignty cannot be violated, it would mean that there are no legal consequences for violations that fall below the notoriously high threshold of\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n\nTwo further questions addressed in the paper seem worth drawing attention to. First, regarding the use of force, like most if not all of the States that have pronounced on the issue, Finland agrees that for a cyberattack to be comparable to use of force, it must be sufficiently serious and have effects in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of traditional armed force. To be equated to an armed attack, a cyberattack must further fulfil the requirements of scale and effects. The paper is open to the possibility that a cyberattack producing significant economic effects such as the collapse of a State's financial system or parts of its economy could possibly be comparable to an armed attack. Indeed, such a collapse would be likely to cause serious effects on the population.\nIn general, however, the paper underlines that any understanding of the use of force in cyberspace should respect the UN Charter, and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. Particular issues concerning the use of force in cyberspace may need cyber-specific solutions but these should always be assessed in light of the more general understandings. It should also be kept in mind that many of the issues related to the use of force continue to be debated even in the physical, or kinetic context. The ILA Committee on the Use of Force, in its 2018 report, made a similar point stating that conclusions concerning cyber operations as a use of force \"must be reached with great caution\" because a wide interpretation of Articles 2(4) and 51 of the Charter in the cyber context \"may affect the interpretation and debate surrounding other areas of the law of use of force\".9\nSecond, regarding International Humanitarian Law (IHL), the paper does not only state that the use of cyber means and methods in the context of an armed conflict is subject to the rules of IHL, including the principles of distinction, proportionality and precautions, but also underlines that the foreseeable direct and indirect effects of cyber means and methods must be taken into account when assessing their capacity to cause prohibited harm. The paper\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND\nalso takes a stand in favor of including data within the concept of object for the purposes of IHL in stating that there is an obligation to take constant care \"to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data\".\nSince 2020, new questions have arisen in the ongoing exchange of views, both as regards the national statements and within the two UN working groups. Peaceful settlement of disputes is one of such new themes and one that would most likely have been addressed in Finland's paper, had it been issued later. Indeed, if States abided by the fundamental Charter-based and customary obligation to settle their disputes peacefully and in a manner that does not endanger international peace and security, less attention would need to be paid to the intricacies of prohibited intervention, use of force, armed attack and application of IHL in cyberspace.\nMay, 2023\n---\n# International Law and Cyberspace\n## Finland’s National Positions\n### Introduction\nIn line with its general support to rules-based international cooperation and respect for international law, Finland sees international law as an essential framework for responsible State behaviour in cyberspace. In the same vein, the UN Group of Governmental Experts (GGE) has reaffirmed that “international law, and in particular the Charter of the United Nations, is applicable and is essential to maintaining peace and stability and promoting an open, secure, stable, accessible and peaceful ICT environment”. As this formulation, reflecting the specific mandate of the GGE, focuses on questions of international\n See the statement of the delegations of Finland and Sweden in the OEWG in March 2021, available at https://reachingcriticalwill.org/images/documents/Disarmament-fora/other/icts/oewg/statements/9March_FinlandSweden.pdf (accessed on 27 February 2023).\n See Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security, 2013 Report (UN Doc. A/68/98, para.20; 2015 report (UN Doc. A/70/174), para.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n\nWhile the existing rules and principles of international law are applicable in cyberspace, the application of certain provisions may give rise to practical problems due to the specific characteristics of cyberspace. Finland therefore welcomes the current exchange of views on particular questions regarding how international law applies to State use of information and communication technologies and wishes to contribute to the discussion by commenting on some of the issues that have been raised recently in this regard.\n## Sovereignty\nIt is undisputed that the principle of State sovereignty applies in cyberspace. While cyberspace as a whole cannot be subject to appropriation by any State, each State has jurisdiction over the cyber infrastructure and the persons engaged in cyber activities within its territory. Sovereignty confers each State the exclusive right to exercise the functions of a State within a certain territory, and protects its territorial integrity and political independence from interference by other States. In this sense, sovereignty is a foundational principle of the international legal order.\nThe principle of State sovereignty has also given rise to a number of specific rules, such as those prohibiting the use of force and intervention in the internal affairs of other States. Below the threshold of prohibited intervention, all States have an obligation to refrain from acts that violate the territorial integrity or political independence of other States.\nThe International Court of Justice has consistently confirmed that it is a duty of every State to respect the territorial sovereignty of others. This applies\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nto unauthorized intrusions to physical spaces such as overflight of a State's territory by an aircraft belonging to another State or under its control, penetration of territorial waters by foreign warships, conducting of certain activities in another State's territory without its consent but also to producing effects in another State's territory without physical intrusion. According to the Court, it is \"quite obvious that a State possesses a legal interest in the protection of its territory from any form of external harmful action\".\nSimilarly, a non-consensual intrusion in the computer networks and systems that rely on the cyber infrastructure in another State's territory may amount to a violation of that State's sovereignty. The prohibition of cyber operations violating the territorial sovereignty of another State protects, first of all, the cyber infrastructure located in the territory of that State, or otherwise under its jurisdiction, as well as computer networks and systems supported by such infrastructure, from material harm. The situation is the same irrespective of whether such infrastructure belongs to or is operated by governmental institutions, private entities or private individuals. In addition to material harm that may be caused by such an operation, other relevant considerations include whether an intrusion in the cyber infrastructure triggers a loss of functionality of the equipment relying on it, or modifies or deletes information belonging to the target State, or to private actors in its territory.\nMore generally, an unauthorized intrusion by cyber means may be seen as a violation of the target State's territorial sovereignty if it interferes with data or services that are necessary for the exercise of inherently governmental functions. This rule put forward in the Tallinn Manual 2.0 is consistent with the understanding of violations of sovereignty as unauthorized exercise of authority in another State's territory. Finally, cyber operations against objects that enjoy sovereign immunity (warships, ships owned by a State and used only for government or noncommercial service; State aircraft) can be characterized as violations of sovereignty.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\n\nFINLAND'S POSITION PAPER\n\nFinland sees sovereignty as a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers State responsibility. This rule is fully applicable in cyberspace. Whether an unauthorized cyber intrusion violates the target State's sovereignty depends on its nature and consequences and is subject to a case-by-case assessment.\n## Illegal intervention\nA hostile interference by cyber means may also breach the customary prohibition of intervention in the internal affairs of another State, provided that it is done with the purpose of compelling or coercing that State in relation to affairs regarding which it has free choice (so-called domaine réservé). The requirement of coercion leaves out lesser forms of influence and persuasion that are commonplace in international relations. The limitation to sovereign affairs – such as a State's political, economic or cultural system or the direction of its foreign policy– further distinguishes prohibited intervention from measures, the purpose of which is to compel another State to comply with its international obligations.\nFor a cyber operation to amount to a prohibited intervention, both above-mentioned elements must be present. Most open questions relate to the element of coercion and to how it manifests itself in cyber operations. For instance, while the conduct of elections belongs undisputedly to the internal affairs of each State, all methods of electoral interference do not display the element of coercion. Hacking of voter databases or manipulation of vote counts in order to alter the election results has nevertheless been recognized as a fairly clear case. To be comparable to a real world intervention, cyber interference must also be of a serious nature.\n Military and Paramilitary Activities in and against Nicaragua, para. 205.\n All methods of electoral interference are not coercive, see EU vs. disinfo, 10 Methods of electoral interference (2019).\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nAccording to the International Court of Justice, the element of coercion is particularly clear if force is used through means of military action, threats of such action, or through support to armed groups in another State. Military or economic pressure may also qualify as coercion. Hostile cyber interference done with the purpose of promoting or supporting armed action in another State could constitute an example of prohibited intervention, provided that it seeks to force a certain policy change.\nCompared to a violation of sovereignty, the requirement of coercive nature and that of domaine réservé make the threshold of prohibited intervention considerably higher. This underlines the importance of continued understanding of sovereignty as not only a principle but also an independent primary rule of international law.\n## Transboundary harm\nAnother cardinal principle flowing from sovereignty, closely related to the obligation to respect the sovereignty of other States, is each State's obligation not to knowingly allow its territory to be used to cause significant harm to the rights of other States. It is widely recognized that this principle, often referred to as due diligence, is applicable to any activity which involves the risk of causing significant transboundary harm. Due diligence is a variable standard in the sense that its content can change over time as a result of technological development or changes in risk assessment, and as such fully applicable to cyber operations.\nStates may thus not knowingly allow their territory, or cyber infrastructure within a territory under their control, to be used to cyber operations that\n Military and Paramilitary Activities in and against Nicaragua, para.247.\n Ibid., see also paras 241 and 242. See also Friendly Relations Declaration, UN Doc. A/RES/2625(XXV).\n International Law Commission, Draft Articles on the Prevention of transboundary harm from hazardous activities, art. 3: \"The State of origin shall take all appropriate measures to prevent significant transboundary harm or at any event to minimize the risk thereof\", Yearbook... 2001, vol. II (Part Two), pp. 144–170; International Law Association, Second Report on Due Diligence in International Law, July 2016, p. 6: \"This broad principle of due diligence can be understood as underlying more specific rules of due diligence. Hence, it can be viewed as a default standard that is triggered in operation if no more specific elaboration of due diligence or stricter standard is in existence.\"\n International Tribunal for the Law of the Sea, Seabed Disputes Chamber, Responsibilities and Obligations of States Sponsoring Persons and Entities with Respect to Activities in the Area, Advisory opinion, 1 February 2011, List of Cases: No. 17, para. 117.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND'S POSITION PAPER\n\nSome legal obligations are inherent in the principle of due diligence and apply to cyber activities even in the absence of cyber-specific elaborations of the principle. For instance, if a State knows about a planned cyber activity in its territory likely to affect another State adversely and seriously, it must notify that other State. In addition to actual knowledge of harmful acts emanating from the territory of a State, a State's responsibility may be engaged in situations in which it should have known about the activities in question. It is nevertheless clear that \"it cannot be concluded from the mere fact of the control exercised [...] over its territory [...] that [a] State necessarily knew, or ought to have known, of any unlawful act perpetrated therein\".[18]\nIf harmful cyber activity takes place and causes serious harm to another State, the State of origin must take appropriate action to terminate it, as well as to investigate the incident and bring those responsible to justice. In order to be able to do this, States should have the necessary procedural and legal mechanisms in place. It should nevertheless be recalled that due diligence is an obligation of conduct, not one of result. In general, what is required of States is that they take all measures that are feasible under the circumstances. A particular question in this regard is related to the position of transit States through which a particular harmful data is routed. Much depends on whether such a State has any knowledge of the ongoing operation, or ability to take feasible measures to terminate it.\nFurthermore, while States must show due diligence in the control of the national territory, doing so does not release them from the observance of other international obligations such as those related to human rights.\n## State responsibility\nThe law of State responsibility consists of secondary rules that apply generally in the absence of clear specific rules that modify their effect. As there is no specific regulation concerning State activities in cyberspace that would constitute\n[18] International Court of Justice, *Corfu Channel case*, Judgment of April 9th, 1949, I.C.J. Reports 1949, p.4, at 18.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nsuch lex specialis, it can be concluded that the normal rules of State responsibility apply in cyberspace.\nWhen a State's cyber operation violates its obligations under international law, it constitutes an internationally wrongful act. An internationally wrongful act of a State entails its international responsibility and gives rise to an obligation to make full reparation for the damage that may be caused by the act. This requires that the act is attributable to the State. The rules of attribution reflected in the UN International Law Commission's Articles on State Responsibility remain fully valid in cyberspace. If State organs, or private groups or individuals acting on behalf of the State, can be identified as the authors of a cyber operation that violates the State's international obligations, its international responsibility is engaged. It is in this regard useful to distinguish identification as a technical operation from attribution as a legal operation. Identification may be technically challenging given the often covert nature of hostile cyber activities but this is without consequence to the legal rules of attribution.\nAn internationally wrongful act may justify recourse to countermeasures by the injured State if the State responsible for an internationally wrongful act declines to cease the wrongful conduct or pay reparation. Countermeasures may only be taken with the purpose of ensuring compliance, not for retaliation. Countermeasures may furthermore not breach the prohibition of the threat or use of force, or other peremptory norms of general international law, and must be consistent with other customary law requirements and limitations concerning countermeasures, most of which are reflected in the International Law Commission's Articles on State Responsibility. Some of the procedural requirements concerning countermeasures may nevertheless require adjustment. For instance, it may be possible to attribute a hostile cyber operation only afterwards whereas countermeasures normally should be taken while the wrongful act is ongoing.\nThere is no general obligation for a State taking countermeasures to disclose the information on the basis of which the action is taken. At the same time, it is in each State's best interests to ensure that a decision to take countermeasures is based on solid evidence, given that recourse to countermeasures would otherwise constitute an internationally wrongful act. A State that responds to a hostile cyber operation must therefore have adequate proof of the source\n International Law Commission, Responsibility of States for Internationally Wrongful Acts (2001), available at www.legal.un.org/ILC (ARSIWA).\n Ibid., arts. 4–11.\n Ibid., arts. 49–54.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND'S POSITION PAPER\n\nPublic attribution, as a sovereign choice, is primarily a question of political consideration. Public attribution may nevertheless have legal effects to the extent it includes determinations of conduct that constitutes an internationally wrongful act.\nIn addition to countermeasures, other circumstances precluding wrongfulness may justify taking of cyber measures that would otherwise constitute an internationally wrongful act. This may be the case, for instance, if deviating from an international obligation is the only way for the State to safeguard an essential interest against a grave and imminent peril. Facing such an exceptional situation, a State may deviate from its international obligations within the limits specified in the law of State responsibility.\n## Use of force/ armed attack\nWhile there is currently no established definition of a cyberattack that would pass the threshold of \"use of force\" in the sense of article 2(4) of the UN Charter, or \"armed attack\" in the sense of article 51, it is widely recognized that such a qualification depends on the consequences of a cyberattack. For a cyberattack to be comparable to use of force, it must be sufficiently serious and have impacts in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of force. A threat of such a cyberattack could also violate Article 2(4) of the Charter, if the threat is sufficiently precise and directed against another State.\nSimilarly, most commentators agree that when the scale and effects of a cyberattack correspond to those of an armed attack responding to the cyberattack is justifiable as self-defence. It is obvious that the attack must have caused death, injury or substantial material damage, but it is impossible to set a precise quantitative threshold for the effects, and other circumstantial factors must be taken into account in the analysis, as well. A widely discussed question is, to what extent the definition of a cyberattack comparable to an armed attack should take account of the indirect and long-term impacts of the attack. In any case, this would require that the impacts can be assessed with sufficient precision. A question has also been raised, whether a cyberattack producing significant economic effects such as the collapse of a State's financial system\n ARSIWA, Chapter V, Circumstances precluding wrongfulness.\n Ibid., art. 25. See also Tallinn Manual 2.0, Rule 26.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nor parts of its economy should be equated to an armed attack. This question merits further consideration.\nAny interpretation of the use of force in cyberspace should respect the UN Charter and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. This would mean, for instance, that the distinction between armed attack as a particularly serious violation of the Charter, on the one hand, and any lesser uses of force, on the other, is preserved. Similarly, the conditions for the exercise of the right of self-defence apply in cyberspace as they do with regard to the use of armed force. The right of self-defence arises if a cyberattack comparable to an armed attack occurs and can be attributed to a particular State. It is reasonable to think that a State victim to such an attack can respond with either cyber means or armed action. At the same time, the use of force must not be disproportionate or excessive.\n## International Humanitarian Law\nInternational humanitarian law only applies to cyber operations when such operations are part of, or amount to, an armed conflict. Most so far known cyberattacks have not been launched in the context of an armed conflict or have met the threshold of armed conflict. At the same time, when cyber means are used in the context of a pre-existing armed conflict, as has been done in many current conflicts, there is no reason to deny the need for the protections that international humanitarian law provides.\nThis includes that cyber means and methods of warfare must be used consistently with the principles of distinction, proportionality and precautions, as well as the specific rules flowing from these principles. When assessing the capacity of cyber means and methods to cause prohibited harm, their foreseeable direct and indirect effects shall be taken into account. Constant care shall be taken to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data.\nThe unique characteristics of cyberspace, such as interconnectedness and anonymity, may affect how international humanitarian law is interpreted and applied with regard to certain cyber means and methods warfare. The related problems can nevertheless mostly be solved on the basis of existing rules. New\n While the possibility of a cyberattack rising to the level of an armed attack without the involvement of any State is conceivable, the related questions of self-defence against non-State actors are too complicated to be discussed here.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n\n## Human rights law\nA number of specific human rights such as the freedom of opinion and expression, including the right to access to information, and the right to privacy are particularly relevant in cyberspace. It should nevertheless be underlined that individuals enjoy the same international human rights with respect to cyber-related activities as otherwise and, accordingly, that States are bound by all their human rights obligations both online and offline. Furthermore, each State has to protect individuals within its territory and subject to its jurisdiction from interference with their rights by third parties.\n## Note from the publisher\nThe author mentioned at the start of this article, Marja Lehto, is only responsible for the introduction to this position paper. The position paper is a product of the government of Finland and available online: https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 44,
        "success_occurrences": 44,
        "success_unique": 22,
        "bib_unique_total": 30,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.7333333333333333,
        "success_percentage": 100.0,
        "style": "superscript"
      },
      "results": [
        {
          "index": 2,
          "intext_citation": "²",
          "preceding_text": "successive reports of the GGE,",
          "footnote": "The Group of Governmental Experts has stated in this regard that “State sovereignty and international norms and principles that flow from sovereignty apply to State conduct of ICT-related and to their jurisdiction over ICT infrastructure within their territory”. See GGE 2015 Report, para. 27. Other bases of jurisdiction may be applicable to cyber activities in accordance with international law.",
          "position": 574
        },
        {
          "index": 3,
          "intext_citation": "³",
          "preceding_text": "OEWG) of the General Assembly,",
          "footnote": "As Judge Max Huber stated in the *Island of Palmas* arbitral award: “Sovereignty in the relations between States signifies independence. Independence in regard to a portion of the globe is the right to exercise therein, to the exclusion of any other State, the functions of a State.” See *Island of Palmas (Netherlands v. the US)*, 2 UNRIAA 829, 838 (PCA 1928).",
          "position": 650
        },
        {
          "index": 4,
          "intext_citation": "⁴",
          "preceding_text": "",
          "footnote": "According to the International Court of Justice, “between independent States, respect for territorial sovereignty is an essential foundation of international relations.” See *Corfu Channel Case (UK v. Albania)*, ICJ reports 1949, p. 4, at 35.",
          "position": 1048
        },
        {
          "index": 5,
          "intext_citation": "⁵",
          "preceding_text": "",
          "footnote": "Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. United States of America), Merits, Judgment, I.C.J. Reports 1986, p. 14, paras. 251, 253, 292.",
          "position": 2975
        },
        {
          "index": 6,
          "intext_citation": "⁶",
          "preceding_text": "",
          "footnote": "Corfu Channel case (United Kingdom v. Albania), Judgment, I.C.J. Reports 1949, p. 4, at 26, 35, 36.",
          "position": 3349
        },
        {
          "index": 5,
          "intext_citation": "⁵",
          "preceding_text": " in the current issue of NJIL\n",
          "footnote": "Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. United States of America), Merits, Judgment, I.C.J. Reports 1986, p. 14, paras. 251, 253, 292.",
          "position": 5660
        },
        {
          "index": 6,
          "intext_citation": "⁶",
          "preceding_text": "s-on-international-cyber-law/\n",
          "footnote": "Corfu Channel case (United Kingdom v. Albania), Judgment, I.C.J. Reports 1949, p. 4, at 26, 35, 36.",
          "position": 6062
        },
        {
          "index": 10,
          "intext_citation": "¹⁰",
          "preceding_text": "",
          "footnote": "Michael N. Schmitt (ed.), Tallinn Manual 2.0, Cambridge University Press 2017, Rule 4, para. 15.",
          "position": 12943
        },
        {
          "index": 10,
          "intext_citation": "¹⁰",
          "preceding_text": "on questions of international\n",
          "footnote": "Michael N. Schmitt (ed.), Tallinn Manual 2.0, Cambridge University Press 2017, Rule 4, para. 15.",
          "position": 14003
        },
        {
          "index": 11,
          "intext_citation": "¹¹",
          "preceding_text": "",
          "footnote": "Cf. Ibid., Rule 5.",
          "position": 14256
        },
        {
          "index": 2,
          "intext_citation": "²",
          "preceding_text": "",
          "footnote": "The Group of Governmental Experts has stated in this regard that “State sovereignty and international norms and principles that flow from sovereignty apply to State conduct of ICT-related and to their jurisdiction over ICT infrastructure within their territory”. See GGE 2015 Report, para. 27. Other bases of jurisdiction may be applicable to cyber activities in accordance with international law.",
          "position": 15553
        },
        {
          "index": 3,
          "intext_citation": "³",
          "preceding_text": "te within a certain territory,",
          "footnote": "As Judge Max Huber stated in the *Island of Palmas* arbitral award: “Sovereignty in the relations between States signifies independence. Independence in regard to a portion of the globe is the right to exercise therein, to the exclusion of any other State, the functions of a State.” See *Island of Palmas (Netherlands v. the US)*, 2 UNRIAA 829, 838 (PCA 1928).",
          "position": 15670
        },
        {
          "index": 4,
          "intext_citation": "⁴",
          "preceding_text": "",
          "footnote": "According to the International Court of Justice, “between independent States, respect for territorial sovereignty is an essential foundation of international relations.” See *Corfu Channel Case (UK v. Albania)*, ICJ reports 1949, p. 4, at 35.",
          "position": 15772
        },
        {
          "index": 5,
          "intext_citation": "⁵",
          "preceding_text": "er State or under its control,",
          "footnote": "Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. United States of America), Merits, Judgment, I.C.J. Reports 1986, p. 14, paras. 251, 253, 292.",
          "position": 17611
        },
        {
          "index": 6,
          "intext_citation": "⁶",
          "preceding_text": "al waters by foreign warships,",
          "footnote": "Corfu Channel case (United Kingdom v. Albania), Judgment, I.C.J. Reports 1949, p. 4, at 26, 35, 36.",
          "position": 17667
        },
        {
          "index": 7,
          "intext_citation": "⁷",
          "preceding_text": " territory without its consent",
          "footnote": "Certain Activities carried out by Nicaragua in the Border Area (Costa Rica v. Nicaragua) and Construction of a Road in Costa Rica along the San Juan River (Nicaragua v. Costa Rica), Judgment, I.C.J. Reports 2015, p. 665, paras. 67, 69, 93, 221-223 and 229.",
          "position": 17750
        },
        {
          "index": 8,
          "intext_citation": "⁸",
          "preceding_text": "",
          "footnote": "Nuclear Tests (Australia v. France), Judgment, I.C.J. Reports 1974, p. 253, para. 454.",
          "position": 17838
        },
        {
          "index": 9,
          "intext_citation": "⁹",
          "preceding_text": "",
          "footnote": "Ibid. para 456, emphasis added.",
          "position": 18002
        },
        {
          "index": 10,
          "intext_citation": "¹⁰",
          "preceding_text": "0",
          "footnote": "Michael N. Schmitt (ed.), Tallinn Manual 2.0, Cambridge University Press 2017, Rule 4, para. 15.",
          "position": 19297
        },
        {
          "index": 11,
          "intext_citation": "¹¹",
          "preceding_text": "",
          "footnote": "Cf. Ibid., Rule 5.",
          "position": 19661
        },
        {
          "index": 12,
          "intext_citation": "¹²",
          "preceding_text": "irection of its foreign policy",
          "footnote": "Military and Paramilitary Activities in and against Nicaragua, para. 205.",
          "position": 22102
        },
        {
          "index": 13,
          "intext_citation": "¹³",
          "preceding_text": "",
          "footnote": "All methods of electoral interference are not coercive, see EU vs. disinfo, 10 Methods of electoral interference (2019).",
          "position": 22658
        },
        {
          "index": 12,
          "intext_citation": "¹²",
          "preceding_text": "",
          "footnote": "Military and Paramilitary Activities in and against Nicaragua, para. 205.",
          "position": 22915
        },
        {
          "index": 13,
          "intext_citation": "¹³",
          "preceding_text": "",
          "footnote": "All methods of electoral interference are not coercive, see EU vs. disinfo, 10 Methods of electoral interference (2019).",
          "position": 22992
        },
        {
          "index": 14,
          "intext_citation": "¹⁴",
          "preceding_text": "",
          "footnote": "Military and Paramilitary Activities in and against Nicaragua, para.247.",
          "position": 23400
        },
        {
          "index": 15,
          "intext_citation": "¹⁵",
          "preceding_text": "",
          "footnote": "Ibid., see also paras 241 and 242. See also Friendly Relations Declaration, UN Doc. A/RES/2625(XXV).",
          "position": 23681
        },
        {
          "index": 16,
          "intext_citation": "¹⁶",
          "preceding_text": "",
          "footnote": "International Law Commission, Draft Articles on the Prevention of transboundary harm from hazardous activities, art. 3: \"The State of origin shall take all appropriate measures to prevent significant transboundary harm or at any event to minimize the risk thereof\", Yearbook... 2001, vol. II (Part Two), pp. 144–170; International Law Association, Second Report on Due Diligence in International Law, July 2016, p. 6: \"This broad principle of due diligence can be understood as underlying more specific rules of due diligence. Hence, it can be viewed as a default standard that is triggered in operation if no more specific elaboration of due diligence or stricter standard is in existence.\"",
          "position": 24472
        },
        {
          "index": 17,
          "intext_citation": "¹⁷",
          "preceding_text": "or changes in risk assessment,",
          "footnote": "International Tribunal for the Law of the Sea, Seabed Disputes Chamber, Responsibilities and Obligations of States Sponsoring Persons and Entities with Respect to Activities in the Area, Advisory opinion, 1 February 2011, List of Cases: No. 17, para. 117.",
          "position": 24634
        },
        {
          "index": 14,
          "intext_citation": "¹⁴",
          "preceding_text": "used to cyber operations that\n",
          "footnote": "Military and Paramilitary Activities in and against Nicaragua, para.247.",
          "position": 24840
        },
        {
          "index": 15,
          "intext_citation": "¹⁵",
          "preceding_text": "",
          "footnote": "Ibid., see also paras 241 and 242. See also Friendly Relations Declaration, UN Doc. A/RES/2625(XXV).",
          "position": 24916
        },
        {
          "index": 16,
          "intext_citation": "¹⁶",
          "preceding_text": "",
          "footnote": "International Law Commission, Draft Articles on the Prevention of transboundary harm from hazardous activities, art. 3: \"The State of origin shall take all appropriate measures to prevent significant transboundary harm or at any event to minimize the risk thereof\", Yearbook... 2001, vol. II (Part Two), pp. 144–170; International Law Association, Second Report on Due Diligence in International Law, July 2016, p. 6: \"This broad principle of due diligence can be understood as underlying more specific rules of due diligence. Hence, it can be viewed as a default standard that is triggered in operation if no more specific elaboration of due diligence or stricter standard is in existence.\"",
          "position": 25020
        },
        {
          "index": 17,
          "intext_citation": "¹⁷",
          "preceding_text": "\"",
          "footnote": "International Tribunal for the Law of the Sea, Seabed Disputes Chamber, Responsibilities and Obligations of States Sponsoring Persons and Entities with Respect to Activities in the Area, Advisory opinion, 1 February 2011, List of Cases: No. 17, para. 117.",
          "position": 25715
        },
        {
          "index": 19,
          "intext_citation": "¹⁹",
          "preceding_text": "",
          "footnote": "International Law Commission, Responsibility of States for Internationally Wrongful Acts (2001), available at www.legal.un.org/ILC (ARSIWA).",
          "position": 29155
        },
        {
          "index": 20,
          "intext_citation": "²⁰",
          "preceding_text": "ticles on State Responsibility",
          "footnote": "Ibid., arts. 4–11.",
          "position": 29323
        },
        {
          "index": 21,
          "intext_citation": "²¹",
          "preceding_text": "",
          "footnote": "Ibid., arts. 49–54.",
          "position": 30544
        },
        {
          "index": 19,
          "intext_citation": "¹⁹",
          "preceding_text": " adequate proof of the source\n",
          "footnote": "International Law Commission, Responsibility of States for Internationally Wrongful Acts (2001), available at www.legal.un.org/ILC (ARSIWA).",
          "position": 31288
        },
        {
          "index": 20,
          "intext_citation": "²⁰",
          "preceding_text": "",
          "footnote": "Ibid., arts. 4–11.",
          "position": 31432
        },
        {
          "index": 21,
          "intext_citation": "²¹",
          "preceding_text": "",
          "footnote": "Ibid., arts. 49–54.",
          "position": 31454
        },
        {
          "index": 22,
          "intext_citation": "²²",
          "preceding_text": "",
          "footnote": "ARSIWA, Chapter V, Circumstances precluding wrongfulness.",
          "position": 32075
        },
        {
          "index": 23,
          "intext_citation": "²³",
          "preceding_text": "",
          "footnote": "Ibid., art. 25. See also Tallinn Manual 2.0, Rule 26.",
          "position": 32417
        },
        {
          "index": 22,
          "intext_citation": "²²",
          "preceding_text": "of a State's financial system\n",
          "footnote": "ARSIWA, Chapter V, Circumstances precluding wrongfulness.",
          "position": 33993
        },
        {
          "index": 23,
          "intext_citation": "²³",
          "preceding_text": "",
          "footnote": "Ibid., art. 25. See also Tallinn Manual 2.0, Rule 26.",
          "position": 34054
        },
        {
          "index": 24,
          "intext_citation": "²⁴",
          "preceding_text": "",
          "footnote": "While the possibility of a cyberattack rising to the level of an armed attack without the involvement of any State is conceivable, the related questions of self-defence against non-State actors are too complicated to be discussed here.",
          "position": 34963
        },
        {
          "index": 24,
          "intext_citation": "²⁴",
          "preceding_text": "New",
          "footnote": "While the possibility of a cyberattack rising to the level of an armed attack without the involvement of any State is conceivable, the related questions of self-defence against non-State actors are too complicated to be discussed here.",
          "position": 36541
        }
      ],
      "flat_text": "BRILL\nNIJHOFF\nNORDIC JOURNAL OF INTERNATIONAL LAW\n\nNORDIC JOURNAL OF INTERNATIONAL LAW\nbrill.com/nord\n# Finland's views on International Law and Cyberspace\nIntroduction\nMarja Lehto\nMinistry of Foreign Affairs of Finland, Helsinki, Finland\nMarja.Lehto@formin.fi\nPublished online: 4 July 2023\nIn 2013, the Group of Governmental Experts (GGE) under the United Nations auspices reached agreement on the critical question that international law applies in cyberspace. While this point of departure has since then been confirmed in successive reports of the GGE, as well as by the Open-ended Working Group (OEWG) of the General Assembly, further discussions on how international law applies in cyberspace, and where adjustments might be needed to accommodate the specific features of cyberspace, have proved challenging. The deadlock of the fifth GGE, which failed to adopt a report in 2017 because of fundamentally differing views on international law may have been decisive in triggering unilateral responses from individual States. The\n1. 2013 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/68/98).\n2. 2015 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/70/174), para. 24; 2021 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/76/135), para. 69.\n3. Open-ended Working Group on developments in the field of information and telecommunication in the context of international security, Final Substantive Report (2021), (U.N.Doc. A/AC.290/2021/CRP.2), para. 34.\n4. See, for instance, the national position papers of the United States (2016), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_United_States_of_America_(2016); United Kingdom (2018), available at https://www.gov.uk/government/speeches/cyber-and-international-law-in-the-21st-century and (2021), available at https://www.gov.uk/government/publications/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement; The Netherlands (2019), available at https://cyberlaw.ccdcoe.org/wiki\nPublished with license by Koninklijke Brill NV | DOI: 10.1163/15718107-20230002\n© MARJA LEHTO, 2023 | ISSN: 0902-7351 (print) 1571-8107 (online)\nThis is an open access article distributed under the terms of the CC BY 4.0 license.\nFINLAND'S POSITION PAPER\n\nFinland's position paper that is reproduced below was issued in 2020 as a contribution to the ongoing debate. As such, it comments on selected issues and does not provide a comprehensive compilation of Finland's legal views on cybersecurity. The limited scope of the paper reflects the mandate of the GGE, established by the General Assembly's First Committee, to address, inter alia, existing and emerging threats in cyberspace that may jeopardize international peace and security. The paper confirms the applicability and essential role of international law in cyberspace, in line with the major GGE findings. It also comments on a number of topical issues such as sovereignty, State responsibility, prevention of transboundary harm, illegal intervention, use of force and armed attack, international humanitarian law and human rights law.\nThe position papers and statements issued so far, including the present one, share a lot of common substance, which is obvious as they generally have the same background and have been prepared by States belonging, in the context of the GGES and the OEWG, to the Western 'like-minded' group. While the papers are consistent on most questions, there are also differences regarding how the legal limitations concerning State action in cyberspace are defined, most notably with regard to the legal nature of the principles of sovereignty and due diligence. These differences have given a further reason for Finland to articulate its own views in a public position paper.\n/National_position_of_the_Netherlands_(2019); France (2019), available at https://documents.unoda.org/wp-content/uploads/2021/12/French-position-on-international-law-applied-to-cyberspace.pdf; New Zealand (2019), available at https://dpmc.govt.nz/publications/application-international-law-state-activity-cyberspace; Australia (2020), available at https://www.internationalcybertech.gov.au/our-work/annexes/annex-b; Israel (2020), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Israel_(2020); Italy (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_Italian_Republic_(2021); Estonia (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Estonia_(2021); Switzerland (2021), available at https://www.eda.admin.ch&gt;eda&gt;voelkerrecht.pdf; Poland (2022), available at https://www.gov.pl/web/diplomacy/the-republic-of-polands-position-on-the-application-of-international-law-in-cyberspace and Canada (2022), available at https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/peace_security-paix_security/cyberspace_law-cyberespace_droit.aspx?lang=eng (all accessed on 27 February 2023). See also the position papers by Denmark, Norway and Sweden reproduced in the current issue of NJIL\n Also available at https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859 (accessed on 27 February 2023). See also Michael Schmitt, 'Finland sets out key Positions on International Cyber Law', October 27, 2020, available at https://www.justsecurity.org/73061/finland-sets-out-key-positions-on-international-cyber-law/\n See, for instance, A/RES/68/243, op. para. 4.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND\nThe statement that international law applies to State activities when they are using information and communication technologies may seem as little more than stating the obvious. While questions related to non-State actors increasingly occupy international lawyers and few would claim that States are the only subjects of international law, the one question that can be taken for granted is its applicability to State action. In spite of the self-evidence of the issue, the successive GGES and the OEWG have so far not been able to clearly state, for instance, that international humanitarian law applies to the use of cyber means and methods of war in an armed conflict.7 Whether this inability has something to do with the mystification of the concept of 'cyberspace', or rather reflects an attempt to circumscribe or put aside the existing rules, the debate has proved persistent. Finland's paper seeks, on its part, to make it clear that cyberspace is no lawless area.\nFor the reasons mentioned above, the issue of State sovereignty occupies a prominent place in the paper. Finland disagrees with the claim that no rights and obligations would flow from the principle of sovereignty as such, or that no rule prohibiting violations of sovereignty would have crystallized in respect of cyber activities. This contention seems to overlook the established status in international law of the rule that prohibits violations of sovereignty, confirmed both by State practice and international jurisprudence. Finland sees sovereignty as both a principle and a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers the wrongdoing State's international responsibility. Similarly, in response to the claim that there would be no legal obligation to exercise due diligence in cyberspace, the paper recalls \"each State's obligation not to knowingly allow its territory to be used to harm the rights of other States\" that the International Court of Justice called 'well-recognized' already in 1949.8 According to the paper, the general principle of due diligence is applicable to any activity which involves the risk of causing significant transboundary harm.\nThe question of sovereignty as a rule or as a mere principle, and that of the binding nature of due diligence in cyberspace, are examples of legal disagreements that have important concrete implications. Should it be accepted that sovereignty cannot be violated, it would mean that there are no legal consequences for violations that fall below the notoriously high threshold of\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n\nTwo further questions addressed in the paper seem worth drawing attention to. First, regarding the use of force, like most if not all of the States that have pronounced on the issue, Finland agrees that for a cyberattack to be comparable to use of force, it must be sufficiently serious and have effects in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of traditional armed force. To be equated to an armed attack, a cyberattack must further fulfil the requirements of scale and effects. The paper is open to the possibility that a cyberattack producing significant economic effects such as the collapse of a State's financial system or parts of its economy could possibly be comparable to an armed attack. Indeed, such a collapse would be likely to cause serious effects on the population.\nIn general, however, the paper underlines that any understanding of the use of force in cyberspace should respect the UN Charter, and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. Particular issues concerning the use of force in cyberspace may need cyber-specific solutions but these should always be assessed in light of the more general understandings. It should also be kept in mind that many of the issues related to the use of force continue to be debated even in the physical, or kinetic context. The ILA Committee on the Use of Force, in its 2018 report, made a similar point stating that conclusions concerning cyber operations as a use of force \"must be reached with great caution\" because a wide interpretation of Articles 2(4) and 51 of the Charter in the cyber context \"may affect the interpretation and debate surrounding other areas of the law of use of force\".9\nSecond, regarding International Humanitarian Law (IHL), the paper does not only state that the use of cyber means and methods in the context of an armed conflict is subject to the rules of IHL, including the principles of distinction, proportionality and precautions, but also underlines that the foreseeable direct and indirect effects of cyber means and methods must be taken into account when assessing their capacity to cause prohibited harm. The paper\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND\nalso takes a stand in favor of including data within the concept of object for the purposes of IHL in stating that there is an obligation to take constant care \"to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data\".\nSince 2020, new questions have arisen in the ongoing exchange of views, both as regards the national statements and within the two UN working groups. Peaceful settlement of disputes is one of such new themes and one that would most likely have been addressed in Finland's paper, had it been issued later. Indeed, if States abided by the fundamental Charter-based and customary obligation to settle their disputes peacefully and in a manner that does not endanger international peace and security, less attention would need to be paid to the intricacies of prohibited intervention, use of force, armed attack and application of IHL in cyberspace.\nMay, 2023\n---\n# International Law and Cyberspace\n## Finland’s National Positions\n### Introduction\nIn line with its general support to rules-based international cooperation and respect for international law, Finland sees international law as an essential framework for responsible State behaviour in cyberspace. In the same vein, the UN Group of Governmental Experts (GGE) has reaffirmed that “international law, and in particular the Charter of the United Nations, is applicable and is essential to maintaining peace and stability and promoting an open, secure, stable, accessible and peaceful ICT environment”. As this formulation, reflecting the specific mandate of the GGE, focuses on questions of international\n See the statement of the delegations of Finland and Sweden in the OEWG in March 2021, available at https://reachingcriticalwill.org/images/documents/Disarmament-fora/other/icts/oewg/statements/9March_FinlandSweden.pdf (accessed on 27 February 2023).\n See Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security, 2013 Report (UN Doc. A/68/98, para.20; 2015 report (UN Doc. A/70/174), para.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n\nWhile the existing rules and principles of international law are applicable in cyberspace, the application of certain provisions may give rise to practical problems due to the specific characteristics of cyberspace. Finland therefore welcomes the current exchange of views on particular questions regarding how international law applies to State use of information and communication technologies and wishes to contribute to the discussion by commenting on some of the issues that have been raised recently in this regard.\n## Sovereignty\nIt is undisputed that the principle of State sovereignty applies in cyberspace. While cyberspace as a whole cannot be subject to appropriation by any State, each State has jurisdiction over the cyber infrastructure and the persons engaged in cyber activities within its territory. Sovereignty confers each State the exclusive right to exercise the functions of a State within a certain territory, and protects its territorial integrity and political independence from interference by other States. In this sense, sovereignty is a foundational principle of the international legal order.\nThe principle of State sovereignty has also given rise to a number of specific rules, such as those prohibiting the use of force and intervention in the internal affairs of other States. Below the threshold of prohibited intervention, all States have an obligation to refrain from acts that violate the territorial integrity or political independence of other States.\nThe International Court of Justice has consistently confirmed that it is a duty of every State to respect the territorial sovereignty of others. This applies\n\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nto unauthorized intrusions to physical spaces such as overflight of a State's territory by an aircraft belonging to another State or under its control, penetration of territorial waters by foreign warships, conducting of certain activities in another State's territory without its consent but also to producing effects in another State's territory without physical intrusion. According to the Court, it is \"quite obvious that a State possesses a legal interest in the protection of its territory from any form of external harmful action\".\nSimilarly, a non-consensual intrusion in the computer networks and systems that rely on the cyber infrastructure in another State's territory may amount to a violation of that State's sovereignty. The prohibition of cyber operations violating the territorial sovereignty of another State protects, first of all, the cyber infrastructure located in the territory of that State, or otherwise under its jurisdiction, as well as computer networks and systems supported by such infrastructure, from material harm. The situation is the same irrespective of whether such infrastructure belongs to or is operated by governmental institutions, private entities or private individuals. In addition to material harm that may be caused by such an operation, other relevant considerations include whether an intrusion in the cyber infrastructure triggers a loss of functionality of the equipment relying on it, or modifies or deletes information belonging to the target State, or to private actors in its territory.\nMore generally, an unauthorized intrusion by cyber means may be seen as a violation of the target State's territorial sovereignty if it interferes with data or services that are necessary for the exercise of inherently governmental functions. This rule put forward in the Tallinn Manual 2.0 is consistent with the understanding of violations of sovereignty as unauthorized exercise of authority in another State's territory. Finally, cyber operations against objects that enjoy sovereign immunity (warships, ships owned by a State and used only for government or noncommercial service; State aircraft) can be characterized as violations of sovereignty.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\n\nFINLAND'S POSITION PAPER\n\nFinland sees sovereignty as a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers State responsibility. This rule is fully applicable in cyberspace. Whether an unauthorized cyber intrusion violates the target State's sovereignty depends on its nature and consequences and is subject to a case-by-case assessment.\n## Illegal intervention\nA hostile interference by cyber means may also breach the customary prohibition of intervention in the internal affairs of another State, provided that it is done with the purpose of compelling or coercing that State in relation to affairs regarding which it has free choice (so-called domaine réservé). The requirement of coercion leaves out lesser forms of influence and persuasion that are commonplace in international relations. The limitation to sovereign affairs – such as a State's political, economic or cultural system or the direction of its foreign policy– further distinguishes prohibited intervention from measures, the purpose of which is to compel another State to comply with its international obligations.\nFor a cyber operation to amount to a prohibited intervention, both above-mentioned elements must be present. Most open questions relate to the element of coercion and to how it manifests itself in cyber operations. For instance, while the conduct of elections belongs undisputedly to the internal affairs of each State, all methods of electoral interference do not display the element of coercion. Hacking of voter databases or manipulation of vote counts in order to alter the election results has nevertheless been recognized as a fairly clear case. To be comparable to a real world intervention, cyber interference must also be of a serious nature.\n Military and Paramilitary Activities in and against Nicaragua, para. 205.\n All methods of electoral interference are not coercive, see EU vs. disinfo, 10 Methods of electoral interference (2019).\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nAccording to the International Court of Justice, the element of coercion is particularly clear if force is used through means of military action, threats of such action, or through support to armed groups in another State. Military or economic pressure may also qualify as coercion. Hostile cyber interference done with the purpose of promoting or supporting armed action in another State could constitute an example of prohibited intervention, provided that it seeks to force a certain policy change.\nCompared to a violation of sovereignty, the requirement of coercive nature and that of domaine réservé make the threshold of prohibited intervention considerably higher. This underlines the importance of continued understanding of sovereignty as not only a principle but also an independent primary rule of international law.\n## Transboundary harm\nAnother cardinal principle flowing from sovereignty, closely related to the obligation to respect the sovereignty of other States, is each State's obligation not to knowingly allow its territory to be used to cause significant harm to the rights of other States. It is widely recognized that this principle, often referred to as due diligence, is applicable to any activity which involves the risk of causing significant transboundary harm. Due diligence is a variable standard in the sense that its content can change over time as a result of technological development or changes in risk assessment, and as such fully applicable to cyber operations.\nStates may thus not knowingly allow their territory, or cyber infrastructure within a territory under their control, to be used to cyber operations that\n Military and Paramilitary Activities in and against Nicaragua, para.247.\n Ibid., see also paras 241 and 242. See also Friendly Relations Declaration, UN Doc. A/RES/2625(XXV).\n International Law Commission, Draft Articles on the Prevention of transboundary harm from hazardous activities, art. 3: \"The State of origin shall take all appropriate measures to prevent significant transboundary harm or at any event to minimize the risk thereof\", Yearbook... 2001, vol. II (Part Two), pp. 144–170; International Law Association, Second Report on Due Diligence in International Law, July 2016, p. 6: \"This broad principle of due diligence can be understood as underlying more specific rules of due diligence. Hence, it can be viewed as a default standard that is triggered in operation if no more specific elaboration of due diligence or stricter standard is in existence.\"\n International Tribunal for the Law of the Sea, Seabed Disputes Chamber, Responsibilities and Obligations of States Sponsoring Persons and Entities with Respect to Activities in the Area, Advisory opinion, 1 February 2011, List of Cases: No. 17, para. 117.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND'S POSITION PAPER\n\nSome legal obligations are inherent in the principle of due diligence and apply to cyber activities even in the absence of cyber-specific elaborations of the principle. For instance, if a State knows about a planned cyber activity in its territory likely to affect another State adversely and seriously, it must notify that other State. In addition to actual knowledge of harmful acts emanating from the territory of a State, a State's responsibility may be engaged in situations in which it should have known about the activities in question. It is nevertheless clear that \"it cannot be concluded from the mere fact of the control exercised [...] over its territory [...] that [a] State necessarily knew, or ought to have known, of any unlawful act perpetrated therein\".[18]\nIf harmful cyber activity takes place and causes serious harm to another State, the State of origin must take appropriate action to terminate it, as well as to investigate the incident and bring those responsible to justice. In order to be able to do this, States should have the necessary procedural and legal mechanisms in place. It should nevertheless be recalled that due diligence is an obligation of conduct, not one of result. In general, what is required of States is that they take all measures that are feasible under the circumstances. A particular question in this regard is related to the position of transit States through which a particular harmful data is routed. Much depends on whether such a State has any knowledge of the ongoing operation, or ability to take feasible measures to terminate it.\nFurthermore, while States must show due diligence in the control of the national territory, doing so does not release them from the observance of other international obligations such as those related to human rights.\n## State responsibility\nThe law of State responsibility consists of secondary rules that apply generally in the absence of clear specific rules that modify their effect. As there is no specific regulation concerning State activities in cyberspace that would constitute\n[18] International Court of Justice, *Corfu Channel case*, Judgment of April 9th, 1949, I.C.J. Reports 1949, p.4, at 18.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nsuch lex specialis, it can be concluded that the normal rules of State responsibility apply in cyberspace.\nWhen a State's cyber operation violates its obligations under international law, it constitutes an internationally wrongful act. An internationally wrongful act of a State entails its international responsibility and gives rise to an obligation to make full reparation for the damage that may be caused by the act. This requires that the act is attributable to the State. The rules of attribution reflected in the UN International Law Commission's Articles on State Responsibility remain fully valid in cyberspace. If State organs, or private groups or individuals acting on behalf of the State, can be identified as the authors of a cyber operation that violates the State's international obligations, its international responsibility is engaged. It is in this regard useful to distinguish identification as a technical operation from attribution as a legal operation. Identification may be technically challenging given the often covert nature of hostile cyber activities but this is without consequence to the legal rules of attribution.\nAn internationally wrongful act may justify recourse to countermeasures by the injured State if the State responsible for an internationally wrongful act declines to cease the wrongful conduct or pay reparation. Countermeasures may only be taken with the purpose of ensuring compliance, not for retaliation. Countermeasures may furthermore not breach the prohibition of the threat or use of force, or other peremptory norms of general international law, and must be consistent with other customary law requirements and limitations concerning countermeasures, most of which are reflected in the International Law Commission's Articles on State Responsibility. Some of the procedural requirements concerning countermeasures may nevertheless require adjustment. For instance, it may be possible to attribute a hostile cyber operation only afterwards whereas countermeasures normally should be taken while the wrongful act is ongoing.\nThere is no general obligation for a State taking countermeasures to disclose the information on the basis of which the action is taken. At the same time, it is in each State's best interests to ensure that a decision to take countermeasures is based on solid evidence, given that recourse to countermeasures would otherwise constitute an internationally wrongful act. A State that responds to a hostile cyber operation must therefore have adequate proof of the source\n International Law Commission, Responsibility of States for Internationally Wrongful Acts (2001), available at www.legal.un.org/ILC (ARSIWA).\n Ibid., arts. 4–11.\n Ibid., arts. 49–54.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND'S POSITION PAPER\n\nPublic attribution, as a sovereign choice, is primarily a question of political consideration. Public attribution may nevertheless have legal effects to the extent it includes determinations of conduct that constitutes an internationally wrongful act.\nIn addition to countermeasures, other circumstances precluding wrongfulness may justify taking of cyber measures that would otherwise constitute an internationally wrongful act. This may be the case, for instance, if deviating from an international obligation is the only way for the State to safeguard an essential interest against a grave and imminent peril. Facing such an exceptional situation, a State may deviate from its international obligations within the limits specified in the law of State responsibility.\n## Use of force/ armed attack\nWhile there is currently no established definition of a cyberattack that would pass the threshold of \"use of force\" in the sense of article 2(4) of the UN Charter, or \"armed attack\" in the sense of article 51, it is widely recognized that such a qualification depends on the consequences of a cyberattack. For a cyberattack to be comparable to use of force, it must be sufficiently serious and have impacts in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of force. A threat of such a cyberattack could also violate Article 2(4) of the Charter, if the threat is sufficiently precise and directed against another State.\nSimilarly, most commentators agree that when the scale and effects of a cyberattack correspond to those of an armed attack responding to the cyberattack is justifiable as self-defence. It is obvious that the attack must have caused death, injury or substantial material damage, but it is impossible to set a precise quantitative threshold for the effects, and other circumstantial factors must be taken into account in the analysis, as well. A widely discussed question is, to what extent the definition of a cyberattack comparable to an armed attack should take account of the indirect and long-term impacts of the attack. In any case, this would require that the impacts can be assessed with sufficient precision. A question has also been raised, whether a cyberattack producing significant economic effects such as the collapse of a State's financial system\n ARSIWA, Chapter V, Circumstances precluding wrongfulness.\n Ibid., art. 25. See also Tallinn Manual 2.0, Rule 26.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nor parts of its economy should be equated to an armed attack. This question merits further consideration.\nAny interpretation of the use of force in cyberspace should respect the UN Charter and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. This would mean, for instance, that the distinction between armed attack as a particularly serious violation of the Charter, on the one hand, and any lesser uses of force, on the other, is preserved. Similarly, the conditions for the exercise of the right of self-defence apply in cyberspace as they do with regard to the use of armed force. The right of self-defence arises if a cyberattack comparable to an armed attack occurs and can be attributed to a particular State. It is reasonable to think that a State victim to such an attack can respond with either cyber means or armed action. At the same time, the use of force must not be disproportionate or excessive.\n## International Humanitarian Law\nInternational humanitarian law only applies to cyber operations when such operations are part of, or amount to, an armed conflict. Most so far known cyberattacks have not been launched in the context of an armed conflict or have met the threshold of armed conflict. At the same time, when cyber means are used in the context of a pre-existing armed conflict, as has been done in many current conflicts, there is no reason to deny the need for the protections that international humanitarian law provides.\nThis includes that cyber means and methods of warfare must be used consistently with the principles of distinction, proportionality and precautions, as well as the specific rules flowing from these principles. When assessing the capacity of cyber means and methods to cause prohibited harm, their foreseeable direct and indirect effects shall be taken into account. Constant care shall be taken to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data.\nThe unique characteristics of cyberspace, such as interconnectedness and anonymity, may affect how international humanitarian law is interpreted and applied with regard to certain cyber means and methods warfare. The related problems can nevertheless mostly be solved on the basis of existing rules. New\n While the possibility of a cyberattack rising to the level of an armed attack without the involvement of any State is conceivable, the related questions of self-defence against non-State actors are too complicated to be discussed here.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n\n## Human rights law\nA number of specific human rights such as the freedom of opinion and expression, including the right to access to information, and the right to privacy are particularly relevant in cyberspace. It should nevertheless be underlined that individuals enjoy the same international human rights with respect to cyber-related activities as otherwise and, accordingly, that States are bound by all their human rights obligations both online and offline. Furthermore, each State has to protect individuals within its territory and subject to its jurisdiction from interference with their rights by third parties.\n## Note from the publisher\nThe author mentioned at the start of this article, Marja Lehto, is only responsible for the introduction to this position paper. The position paper is a product of the government of Finland and available online: https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469"
    },
    "numeric": {
      "total": {
        "intext_total": 1,
        "success_occurrences": 1,
        "success_unique": 1,
        "bib_unique_total": 1,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 1.0,
        "success_percentage": 100.0,
        "style": "numeric"
      },
      "results": [
        {
          "index": "18",
          "intext_citation": "[18]",
          "preceding_text": "evertheless clear that \"it cannot be concluded from the mere fact of the control exercised [...] over its territory [...] that [a] State necessarily knew, or ought to have known, of any unlawful act perpetrated therein\".",
          "footnote": "International Court of Justice, *Corfu Channel case*, Judgment of April 9th, 1949, I.C.J. Reports 1949, p.4, at 18. NORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469 FINLAND such lex specialis, it can be concluded that the normal rules of State responsibility apply in cyberspace. When a State's cyber operation violates its obligations under international law, it constitutes an internationally wrongful act. An internationally wrongful act of a State entails its international responsibility and gives rise to an obligation to make full reparation for the damage that may be caused by the act.¹⁹ This requires that the act is attributable to the State. The rules of attribution reflected in the UN International Law Commission's Articles on State Responsibility²⁰ remain fully valid in cyberspace. If State organs, or private groups or individuals acting on behalf of the State, can be identified as the authors of a cyber operation that violates the State's international obligations, its international responsibility is engaged. It is in this regard useful to distinguish identification as a technical operation from attribution as a legal operation. Identification may be technically challenging given the often covert nature of hostile cyber activities but this is without consequence to the legal rules of attribution. An internationally wrongful act may justify recourse to countermeasures by the injured State if the State responsible for an internationally wrongful act declines to cease the wrongful conduct or pay reparation. Countermeasures may only be taken with the purpose of ensuring compliance, not for retaliation. Countermeasures may furthermore not breach the prohibition of the threat or use of force, or other peremptory norms of general international law, and must be consistent with other customary law requirements and limitations concerning countermeasures, most of which are reflected in the International Law Commission's Articles on State Responsibility.²¹ Some of the procedural requirements concerning countermeasures may nevertheless require adjustment. For instance, it may be possible to attribute a hostile cyber operation only afterwards whereas countermeasures normally should be taken while the wrongful act is ongoing. There is no general obligation for a State taking countermeasures to disclose the information on the basis of which the action is taken. At the same time, it is in each State's best interests to ensure that a decision to take countermeasures is based on solid evidence, given that recourse to countermeasures would otherwise constitute an internationally wrongful act. A State that responds to a hostile cyber operation must therefore have adequate proof of the source ¹⁹ International Law Commission, Responsibility of States for Internationally Wrongful Acts (2001), available at www.legal.un.org/ILC (ARSIWA). ²⁰ Ibid., arts. 4–11. ²¹ Ibid., arts. 49–54. NORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469 FINLAND'S POSITION PAPER 467"
        }
      ],
      "flat_text": "BRILL\nNIJHOFF\nNORDIC JOURNAL OF INTERNATIONAL LAW\n92 (2023) 456–469\nNORDIC JOURNAL OF INTERNATIONAL LAW\nbrill.com/nord\n# Finland's views on International Law and Cyberspace\nIntroduction\nMarja Lehto\nMinistry of Foreign Affairs of Finland, Helsinki, Finland\nMarja.Lehto@formin.fi\nPublished online: 4 July 2023\nIn 2013, the Group of Governmental Experts (GGE) under the United Nations auspices reached agreement on the critical question that international law applies in cyberspace.¹ While this point of departure has since then been confirmed in successive reports of the GGE,² as well as by the Open-ended Working Group (OEWG) of the General Assembly,³ further discussions on how international law applies in cyberspace, and where adjustments might be needed to accommodate the specific features of cyberspace, have proved challenging. The deadlock of the fifth GGE, which failed to adopt a report in 2017 because of fundamentally differing views on international law may have been decisive in triggering unilateral responses from individual States.⁴ The\n1. 2013 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/68/98).\n2. 2015 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/70/174), para. 24; 2021 Report of the Group of governmental experts on developments in the field of information and telecommunication in the context of international security (U.N. Doc. A/76/135), para. 69.\n3. Open-ended Working Group on developments in the field of information and telecommunication in the context of international security, Final Substantive Report (2021), (U.N.Doc. A/AC.290/2021/CRP.2), para. 34.\n4. See, for instance, the national position papers of the United States (2016), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_United_States_of_America_(2016); United Kingdom (2018), available at https://www.gov.uk/government/speeches/cyber-and-international-law-in-the-21st-century and (2021), available at https://www.gov.uk/government/publications/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement; The Netherlands (2019), available at https://cyberlaw.ccdcoe.org/wiki\nPublished with license by Koninklijke Brill NV | DOI: 10.1163/15718107-20230002\n© MARJA LEHTO, 2023 | ISSN: 0902-7351 (print) 1571-8107 (online)\nThis is an open access article distributed under the terms of the CC BY 4.0 license.\nFINLAND'S POSITION PAPER\n457\nemerging practice of issuing national statements and position papers on international law and cyberspace has provided an alternative way to bring clarity to the contentious issues.\nFinland's position paper that is reproduced below was issued in 2020 as a contribution to the ongoing debate.⁵ As such, it comments on selected issues and does not provide a comprehensive compilation of Finland's legal views on cybersecurity. The limited scope of the paper reflects the mandate of the GGE, established by the General Assembly's First Committee, to address, inter alia, existing and emerging threats in cyberspace that may jeopardize international peace and security.⁶ The paper confirms the applicability and essential role of international law in cyberspace, in line with the major GGE findings. It also comments on a number of topical issues such as sovereignty, State responsibility, prevention of transboundary harm, illegal intervention, use of force and armed attack, international humanitarian law and human rights law.\nThe position papers and statements issued so far, including the present one, share a lot of common substance, which is obvious as they generally have the same background and have been prepared by States belonging, in the context of the GGES and the OEWG, to the Western 'like-minded' group. While the papers are consistent on most questions, there are also differences regarding how the legal limitations concerning State action in cyberspace are defined, most notably with regard to the legal nature of the principles of sovereignty and due diligence. These differences have given a further reason for Finland to articulate its own views in a public position paper.\n/National_position_of_the_Netherlands_(2019); France (2019), available at https://documents.unoda.org/wp-content/uploads/2021/12/French-position-on-international-law-applied-to-cyberspace.pdf; New Zealand (2019), available at https://dpmc.govt.nz/publications/application-international-law-state-activity-cyberspace; Australia (2020), available at https://www.internationalcybertech.gov.au/our-work/annexes/annex-b; Israel (2020), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Israel_(2020); Italy (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_Italian_Republic_(2021); Estonia (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Estonia_(2021); Switzerland (2021), available at https://www.eda.admin.ch&gt;eda&gt;voelkerrecht.pdf; Poland (2022), available at https://www.gov.pl/web/diplomacy/the-republic-of-polands-position-on-the-application-of-international-law-in-cyberspace and Canada (2022), available at https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/peace_security-paix_security/cyberspace_law-cyberespace_droit.aspx?lang=eng (all accessed on 27 February 2023). See also the position papers by Denmark, Norway and Sweden reproduced in the current issue of NJIL\n⁵ Also available at https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859 (accessed on 27 February 2023). See also Michael Schmitt, 'Finland sets out key Positions on International Cyber Law', October 27, 2020, available at https://www.justsecurity.org/73061/finland-sets-out-key-positions-on-international-cyber-law/\n⁶ See, for instance, A/RES/68/243, op. para. 4.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND\nThe statement that international law applies to State activities when they are using information and communication technologies may seem as little more than stating the obvious. While questions related to non-State actors increasingly occupy international lawyers and few would claim that States are the only subjects of international law, the one question that can be taken for granted is its applicability to State action. In spite of the self-evidence of the issue, the successive GGES and the OEWG have so far not been able to clearly state, for instance, that international humanitarian law applies to the use of cyber means and methods of war in an armed conflict.7 Whether this inability has something to do with the mystification of the concept of 'cyberspace', or rather reflects an attempt to circumscribe or put aside the existing rules, the debate has proved persistent. Finland's paper seeks, on its part, to make it clear that cyberspace is no lawless area.\nFor the reasons mentioned above, the issue of State sovereignty occupies a prominent place in the paper. Finland disagrees with the claim that no rights and obligations would flow from the principle of sovereignty as such, or that no rule prohibiting violations of sovereignty would have crystallized in respect of cyber activities. This contention seems to overlook the established status in international law of the rule that prohibits violations of sovereignty, confirmed both by State practice and international jurisprudence. Finland sees sovereignty as both a principle and a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers the wrongdoing State's international responsibility. Similarly, in response to the claim that there would be no legal obligation to exercise due diligence in cyberspace, the paper recalls \"each State's obligation not to knowingly allow its territory to be used to harm the rights of other States\" that the International Court of Justice called 'well-recognized' already in 1949.8 According to the paper, the general principle of due diligence is applicable to any activity which involves the risk of causing significant transboundary harm.\nThe question of sovereignty as a rule or as a mere principle, and that of the binding nature of due diligence in cyberspace, are examples of legal disagreements that have important concrete implications. Should it be accepted that sovereignty cannot be violated, it would mean that there are no legal consequences for violations that fall below the notoriously high threshold of\n7 See, however, Group of Governmental Experts on Advancing Responsible State Behaviour in Cyberspace in the Context of International Security, Final Report, 14 July 2021, U.N. Doc. A/73/135, para. 71(f), in which, referring to the principles of humanity, necessity, proportionality and distinction, \"the group recognized the need to further study on how and when these principles apply to the use of ICTs by States\".\n8 Corfu Channel case, Judgment of April 9th, 1949: I.C. J. Reports 1949, P. 4, p. 22.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n459\nprohibited intervention in the internal affairs of a State. It is also not comprehensible that States would have no legal obligation to take efforts to ensure that cyber activities within their territory or jurisdiction do not seriously harm other States. It further seems politically unwise to question the applicability of such long-standing rules in cyberspace, as carving out a cyber-specific exception from their application may give credence to the claim that international law does not apply in cyberspace in the absence of specific regulation.\nTwo further questions addressed in the paper seem worth drawing attention to. First, regarding the use of force, like most if not all of the States that have pronounced on the issue, Finland agrees that for a cyberattack to be comparable to use of force, it must be sufficiently serious and have effects in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of traditional armed force. To be equated to an armed attack, a cyberattack must further fulfil the requirements of scale and effects. The paper is open to the possibility that a cyberattack producing significant economic effects such as the collapse of a State's financial system or parts of its economy could possibly be comparable to an armed attack. Indeed, such a collapse would be likely to cause serious effects on the population.\nIn general, however, the paper underlines that any understanding of the use of force in cyberspace should respect the UN Charter, and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. Particular issues concerning the use of force in cyberspace may need cyber-specific solutions but these should always be assessed in light of the more general understandings. It should also be kept in mind that many of the issues related to the use of force continue to be debated even in the physical, or kinetic context. The ILA Committee on the Use of Force, in its 2018 report, made a similar point stating that conclusions concerning cyber operations as a use of force \"must be reached with great caution\" because a wide interpretation of Articles 2(4) and 51 of the Charter in the cyber context \"may affect the interpretation and debate surrounding other areas of the law of use of force\".9\nSecond, regarding International Humanitarian Law (IHL), the paper does not only state that the use of cyber means and methods in the context of an armed conflict is subject to the rules of IHL, including the principles of distinction, proportionality and precautions, but also underlines that the foreseeable direct and indirect effects of cyber means and methods must be taken into account when assessing their capacity to cause prohibited harm. The paper\n9 International Law Association, Sydney Conference (2018), Final Report on Aggression and the Use of Force, p. 26.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND\nalso takes a stand in favor of including data within the concept of object for the purposes of IHL in stating that there is an obligation to take constant care \"to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data\".\nSince 2020, new questions have arisen in the ongoing exchange of views, both as regards the national statements and within the two UN working groups. Peaceful settlement of disputes is one of such new themes and one that would most likely have been addressed in Finland's paper, had it been issued later.¹⁰ Indeed, if States abided by the fundamental Charter-based and customary obligation to settle their disputes peacefully and in a manner that does not endanger international peace and security, less attention would need to be paid to the intricacies of prohibited intervention, use of force, armed attack and application of IHL in cyberspace.\nMay, 2023\n---\n# International Law and Cyberspace\n## Finland’s National Positions\n### Introduction\nIn line with its general support to rules-based international cooperation and respect for international law, Finland sees international law as an essential framework for responsible State behaviour in cyberspace. In the same vein, the UN Group of Governmental Experts (GGE) has reaffirmed that “international law, and in particular the Charter of the United Nations, is applicable and is essential to maintaining peace and stability and promoting an open, secure, stable, accessible and peaceful ICT environment”.¹ As this formulation, reflecting the specific mandate of the GGE, focuses on questions of international\n¹⁰ See the statement of the delegations of Finland and Sweden in the OEWG in March 2021, available at https://reachingcriticalwill.org/images/documents/Disarmament-fora/other/icts/oewg/statements/9March_FinlandSweden.pdf (accessed on 27 February 2023).\n¹¹ See Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security, 2013 Report (UN Doc. A/68/98, para.20; 2015 report (UN Doc. A/70/174), para.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n461\npeace and security, there is reason to underline that the same applies to other rights and obligations of States, whether based on treaty law or customary international law.\nWhile the existing rules and principles of international law are applicable in cyberspace, the application of certain provisions may give rise to practical problems due to the specific characteristics of cyberspace. Finland therefore welcomes the current exchange of views on particular questions regarding how international law applies to State use of information and communication technologies and wishes to contribute to the discussion by commenting on some of the issues that have been raised recently in this regard.\n## Sovereignty\nIt is undisputed that the principle of State sovereignty applies in cyberspace. While cyberspace as a whole cannot be subject to appropriation by any State, each State has jurisdiction over the cyber infrastructure and the persons engaged in cyber activities within its territory.² Sovereignty confers each State the exclusive right to exercise the functions of a State within a certain territory,³ and protects its territorial integrity and political independence from interference by other States.⁴ In this sense, sovereignty is a foundational principle of the international legal order.\nThe principle of State sovereignty has also given rise to a number of specific rules, such as those prohibiting the use of force and intervention in the internal affairs of other States. Below the threshold of prohibited intervention, all States have an obligation to refrain from acts that violate the territorial integrity or political independence of other States.\nThe International Court of Justice has consistently confirmed that it is a duty of every State to respect the territorial sovereignty of others. This applies\n2 The Group of Governmental Experts has stated in this regard that “State sovereignty and international norms and principles that flow from sovereignty apply to State conduct of ICT-related and to their jurisdiction over ICT infrastructure within their territory”. See GGE 2015 Report, para. 27. Other bases of jurisdiction may be applicable to cyber activities in accordance with international law.\n3 As Judge Max Huber stated in the *Island of Palmas* arbitral award: “Sovereignty in the relations between States signifies independence. Independence in regard to a portion of the globe is the right to exercise therein, to the exclusion of any other State, the functions of a State.” See *Island of Palmas (Netherlands v. the US)*, 2 UNRIAA 829, 838 (PCA 1928).\n4 According to the International Court of Justice, “between independent States, respect for territorial sovereignty is an essential foundation of international relations.” See *Corfu Channel Case (UK v. Albania)*, ICJ reports 1949, p. 4, at 35.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nto unauthorized intrusions to physical spaces such as overflight of a State's territory by an aircraft belonging to another State or under its control,⁵ penetration of territorial waters by foreign warships,⁶ conducting of certain activities in another State's territory without its consent⁷ but also to producing effects in another State's territory without physical intrusion.⁸ According to the Court, it is \"quite obvious that a State possesses a legal interest in the protection of its territory from any form of external harmful action\".⁹\nSimilarly, a non-consensual intrusion in the computer networks and systems that rely on the cyber infrastructure in another State's territory may amount to a violation of that State's sovereignty. The prohibition of cyber operations violating the territorial sovereignty of another State protects, first of all, the cyber infrastructure located in the territory of that State, or otherwise under its jurisdiction, as well as computer networks and systems supported by such infrastructure, from material harm. The situation is the same irrespective of whether such infrastructure belongs to or is operated by governmental institutions, private entities or private individuals. In addition to material harm that may be caused by such an operation, other relevant considerations include whether an intrusion in the cyber infrastructure triggers a loss of functionality of the equipment relying on it, or modifies or deletes information belonging to the target State, or to private actors in its territory.\nMore generally, an unauthorized intrusion by cyber means may be seen as a violation of the target State's territorial sovereignty if it interferes with data or services that are necessary for the exercise of inherently governmental functions. This rule put forward in the Tallinn Manual 2.0¹⁰ is consistent with the understanding of violations of sovereignty as unauthorized exercise of authority in another State's territory. Finally, cyber operations against objects that enjoy sovereign immunity (warships, ships owned by a State and used only for government or noncommercial service; State aircraft) can be characterized as violations of sovereignty.¹¹\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\n5 Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. United States of America), Merits, Judgment, I.C.J. Reports 1986, p. 14, paras. 251, 253, 292.\n6 Corfu Channel case (United Kingdom v. Albania), Judgment, I.C.J. Reports 1949, p. 4, at 26, 35, 36.\n7 Certain Activities carried out by Nicaragua in the Border Area (Costa Rica v. Nicaragua) and Construction of a Road in Costa Rica along the San Juan River (Nicaragua v. Costa Rica), Judgment, I.C.J. Reports 2015, p. 665, paras. 67, 69, 93, 221-223 and 229.\n8 Nuclear Tests (Australia v. France), Judgment, I.C.J. Reports 1974, p. 253, para. 454.\n9 Ibid. para 456, emphasis added.\n10 Michael N. Schmitt (ed.), Tallinn Manual 2.0, Cambridge University Press 2017, Rule 4, para. 15.\n11 Cf. Ibid., Rule 5.\nFINLAND'S POSITION PAPER\n463\nThe argument has been raised recently that no legal consequences could be attached to sovereignty as a general principle, at least for the purposes of cyber activities. It is not only difficult to reconcile such an idea with the established status of the rule prohibiting violations of sovereignty in international law but it also gives rise to policy concerns. Agreeing that a hostile cyber operation below the threshold of prohibited intervention cannot amount to an internationally wrongful act would leave such operations unregulated and deprive the target State of an important opportunity to claim its rights.\nFinland sees sovereignty as a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers State responsibility. This rule is fully applicable in cyberspace. Whether an unauthorized cyber intrusion violates the target State's sovereignty depends on its nature and consequences and is subject to a case-by-case assessment.\n## Illegal intervention\nA hostile interference by cyber means may also breach the customary prohibition of intervention in the internal affairs of another State, provided that it is done with the purpose of compelling or coercing that State in relation to affairs regarding which it has free choice (so-called domaine réservé). The requirement of coercion leaves out lesser forms of influence and persuasion that are commonplace in international relations. The limitation to sovereign affairs – such as a State's political, economic or cultural system or the direction of its foreign policy¹²– further distinguishes prohibited intervention from measures, the purpose of which is to compel another State to comply with its international obligations.\nFor a cyber operation to amount to a prohibited intervention, both above-mentioned elements must be present. Most open questions relate to the element of coercion and to how it manifests itself in cyber operations. For instance, while the conduct of elections belongs undisputedly to the internal affairs of each State, all methods of electoral interference do not display the element of coercion.¹³ Hacking of voter databases or manipulation of vote counts in order to alter the election results has nevertheless been recognized as a fairly clear case. To be comparable to a real world intervention, cyber interference must also be of a serious nature.\n¹² Military and Paramilitary Activities in and against Nicaragua, para. 205.\n¹³ All methods of electoral interference are not coercive, see EU vs. disinfo, 10 Methods of electoral interference (2019).\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nAccording to the International Court of Justice, the element of coercion is particularly clear if force is used through means of military action, threats of such action, or through support to armed groups in another State.¹⁴ Military or economic pressure may also qualify as coercion. Hostile cyber interference done with the purpose of promoting or supporting armed action in another State could constitute an example of prohibited intervention, provided that it seeks to force a certain policy change.¹⁵\nCompared to a violation of sovereignty, the requirement of coercive nature and that of domaine réservé make the threshold of prohibited intervention considerably higher. This underlines the importance of continued understanding of sovereignty as not only a principle but also an independent primary rule of international law.\n## Transboundary harm\nAnother cardinal principle flowing from sovereignty, closely related to the obligation to respect the sovereignty of other States, is each State's obligation not to knowingly allow its territory to be used to cause significant harm to the rights of other States. It is widely recognized that this principle, often referred to as due diligence, is applicable to any activity which involves the risk of causing significant transboundary harm.¹⁶ Due diligence is a variable standard in the sense that its content can change over time as a result of technological development or changes in risk assessment,¹⁷ and as such fully applicable to cyber operations.\nStates may thus not knowingly allow their territory, or cyber infrastructure within a territory under their control, to be used to cyber operations that\n¹⁴ Military and Paramilitary Activities in and against Nicaragua, para.247.\n¹⁵ Ibid., see also paras 241 and 242. See also Friendly Relations Declaration, UN Doc. A/RES/2625(XXV).\n¹⁶ International Law Commission, Draft Articles on the Prevention of transboundary harm from hazardous activities, art. 3: \"The State of origin shall take all appropriate measures to prevent significant transboundary harm or at any event to minimize the risk thereof\", Yearbook... 2001, vol. II (Part Two), pp. 144–170; International Law Association, Second Report on Due Diligence in International Law, July 2016, p. 6: \"This broad principle of due diligence can be understood as underlying more specific rules of due diligence. Hence, it can be viewed as a default standard that is triggered in operation if no more specific elaboration of due diligence or stricter standard is in existence.\"\n¹⁷ International Tribunal for the Law of the Sea, Seabed Disputes Chamber, Responsibilities and Obligations of States Sponsoring Persons and Entities with Respect to Activities in the Area, Advisory opinion, 1 February 2011, List of Cases: No. 17, para. 117.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND'S POSITION PAPER\n465\nproduce serious adverse consequences for other States. While only States can violate sovereignty, the sovereignty-based obligation of due diligence extends to private activities taking place in a State's territory. Significant harm caused to other States by private cyber activities may give rise to a State's international responsibility but only if the State in question has breached its due diligence obligations.\nSome legal obligations are inherent in the principle of due diligence and apply to cyber activities even in the absence of cyber-specific elaborations of the principle. For instance, if a State knows about a planned cyber activity in its territory likely to affect another State adversely and seriously, it must notify that other State. In addition to actual knowledge of harmful acts emanating from the territory of a State, a State's responsibility may be engaged in situations in which it should have known about the activities in question. It is nevertheless clear that \"it cannot be concluded from the mere fact of the control exercised [...] over its territory [...] that [a] State necessarily knew, or ought to have known, of any unlawful act perpetrated therein\".\nIf harmful cyber activity takes place and causes serious harm to another State, the State of origin must take appropriate action to terminate it, as well as to investigate the incident and bring those responsible to justice. In order to be able to do this, States should have the necessary procedural and legal mechanisms in place. It should nevertheless be recalled that due diligence is an obligation of conduct, not one of result. In general, what is required of States is that they take all measures that are feasible under the circumstances. A particular question in this regard is related to the position of transit States through which a particular harmful data is routed. Much depends on whether such a State has any knowledge of the ongoing operation, or ability to take feasible measures to terminate it.\nFurthermore, while States must show due diligence in the control of the national territory, doing so does not release them from the observance of other international obligations such as those related to human rights.\n## State responsibility\nThe law of State responsibility consists of secondary rules that apply generally in the absence of clear specific rules that modify their effect. As there is no specific regulation concerning State activities in cyberspace that would constitute\n International Court of Justice, *Corfu Channel case*, Judgment of April 9th, 1949, I.C.J. Reports 1949, p.4, at 18.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nsuch lex specialis, it can be concluded that the normal rules of State responsibility apply in cyberspace.\nWhen a State's cyber operation violates its obligations under international law, it constitutes an internationally wrongful act. An internationally wrongful act of a State entails its international responsibility and gives rise to an obligation to make full reparation for the damage that may be caused by the act.¹⁹ This requires that the act is attributable to the State. The rules of attribution reflected in the UN International Law Commission's Articles on State Responsibility²⁰ remain fully valid in cyberspace. If State organs, or private groups or individuals acting on behalf of the State, can be identified as the authors of a cyber operation that violates the State's international obligations, its international responsibility is engaged. It is in this regard useful to distinguish identification as a technical operation from attribution as a legal operation. Identification may be technically challenging given the often covert nature of hostile cyber activities but this is without consequence to the legal rules of attribution.\nAn internationally wrongful act may justify recourse to countermeasures by the injured State if the State responsible for an internationally wrongful act declines to cease the wrongful conduct or pay reparation. Countermeasures may only be taken with the purpose of ensuring compliance, not for retaliation. Countermeasures may furthermore not breach the prohibition of the threat or use of force, or other peremptory norms of general international law, and must be consistent with other customary law requirements and limitations concerning countermeasures, most of which are reflected in the International Law Commission's Articles on State Responsibility.²¹ Some of the procedural requirements concerning countermeasures may nevertheless require adjustment. For instance, it may be possible to attribute a hostile cyber operation only afterwards whereas countermeasures normally should be taken while the wrongful act is ongoing.\nThere is no general obligation for a State taking countermeasures to disclose the information on the basis of which the action is taken. At the same time, it is in each State's best interests to ensure that a decision to take countermeasures is based on solid evidence, given that recourse to countermeasures would otherwise constitute an internationally wrongful act. A State that responds to a hostile cyber operation must therefore have adequate proof of the source\n¹⁹ International Law Commission, Responsibility of States for Internationally Wrongful Acts (2001), available at www.legal.un.org/ILC (ARSIWA).\n²⁰ Ibid., arts. 4–11.\n²¹ Ibid., arts. 49–54.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND'S POSITION PAPER\n467\nof the operation and convincing evidence of the responsibility of a particular State.\nPublic attribution, as a sovereign choice, is primarily a question of political consideration. Public attribution may nevertheless have legal effects to the extent it includes determinations of conduct that constitutes an internationally wrongful act.\nIn addition to countermeasures, other circumstances precluding wrongfulness may justify taking of cyber measures that would otherwise constitute an internationally wrongful act.²² This may be the case, for instance, if deviating from an international obligation is the only way for the State to safeguard an essential interest against a grave and imminent peril. Facing such an exceptional situation, a State may deviate from its international obligations within the limits specified in the law of State responsibility.²³\n## Use of force/ armed attack\nWhile there is currently no established definition of a cyberattack that would pass the threshold of \"use of force\" in the sense of article 2(4) of the UN Charter, or \"armed attack\" in the sense of article 51, it is widely recognized that such a qualification depends on the consequences of a cyberattack. For a cyberattack to be comparable to use of force, it must be sufficiently serious and have impacts in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of force. A threat of such a cyberattack could also violate Article 2(4) of the Charter, if the threat is sufficiently precise and directed against another State.\nSimilarly, most commentators agree that when the scale and effects of a cyberattack correspond to those of an armed attack responding to the cyberattack is justifiable as self-defence. It is obvious that the attack must have caused death, injury or substantial material damage, but it is impossible to set a precise quantitative threshold for the effects, and other circumstantial factors must be taken into account in the analysis, as well. A widely discussed question is, to what extent the definition of a cyberattack comparable to an armed attack should take account of the indirect and long-term impacts of the attack. In any case, this would require that the impacts can be assessed with sufficient precision. A question has also been raised, whether a cyberattack producing significant economic effects such as the collapse of a State's financial system\n²² ARSIWA, Chapter V, Circumstances precluding wrongfulness.\n²³ Ibid., art. 25. See also Tallinn Manual 2.0, Rule 26.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469\nFINLAND\nor parts of its economy should be equated to an armed attack. This question merits further consideration.\nAny interpretation of the use of force in cyberspace should respect the UN Charter and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. This would mean, for instance, that the distinction between armed attack as a particularly serious violation of the Charter, on the one hand, and any lesser uses of force, on the other, is preserved. Similarly, the conditions for the exercise of the right of self-defence apply in cyberspace as they do with regard to the use of armed force. The right of self-defence arises if a cyberattack comparable to an armed attack occurs and can be attributed to a particular State.²⁴ It is reasonable to think that a State victim to such an attack can respond with either cyber means or armed action. At the same time, the use of force must not be disproportionate or excessive.\n## International Humanitarian Law\nInternational humanitarian law only applies to cyber operations when such operations are part of, or amount to, an armed conflict. Most so far known cyberattacks have not been launched in the context of an armed conflict or have met the threshold of armed conflict. At the same time, when cyber means are used in the context of a pre-existing armed conflict, as has been done in many current conflicts, there is no reason to deny the need for the protections that international humanitarian law provides.\nThis includes that cyber means and methods of warfare must be used consistently with the principles of distinction, proportionality and precautions, as well as the specific rules flowing from these principles. When assessing the capacity of cyber means and methods to cause prohibited harm, their foreseeable direct and indirect effects shall be taken into account. Constant care shall be taken to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data.\nThe unique characteristics of cyberspace, such as interconnectedness and anonymity, may affect how international humanitarian law is interpreted and applied with regard to certain cyber means and methods warfare. The related problems can nevertheless mostly be solved on the basis of existing rules. New\n²⁴ While the possibility of a cyberattack rising to the level of an armed attack without the involvement of any State is conceivable, the related questions of self-defence against non-State actors are too complicated to be discussed here.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\nFINLAND'S POSITION PAPER\n469\ntechnologies do not render the existing rules of international humanitarian law meaningless or necessarily require new legal regulation. Furthermore, while international humanitarian law is *lex specialis* in an armed conflict, it does not override other areas of international law, such as human rights law, which may continue to apply throughout the conflict.\n## Human rights law\nA number of specific human rights such as the freedom of opinion and expression, including the right to access to information, and the right to privacy are particularly relevant in cyberspace. It should nevertheless be underlined that individuals enjoy the same international human rights with respect to cyber-related activities as otherwise and, accordingly, that States are bound by all their human rights obligations both online and offline. Furthermore, each State has to protect individuals within its territory and subject to its jurisdiction from interference with their rights by third parties.\n## Note from the publisher\nThe author mentioned at the start of this article, Marja Lehto, is only responsible for the introduction to this position paper. The position paper is a product of the government of Finland and available online: https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469"
    },
    "author_year": {
      "total": {
        "intext_total": 1,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 10,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "author_year"
      },
      "results": [
        {
          "index": "pca|1928",
          "intext_citation": "(PCA 1928)",
          "preceding_text": "the US)*, 2 UNRIAA 829, 838",
          "footnote": null
        }
      ],
      "flat_text": "BRILL NIJHOFF NORDIC JOURNAL OF INTERNATIONAL LAW\n\nNORDIC JOURNAL OF INTERNATIONAL LAW brill.com/nord # Finland's views on International Law and Cyberspace Introduction Marja Lehto Ministry of Foreign Affairs of Finland, Helsinki, Finland Marja.Lehto@formin.fi Published online: 4 July 2023 In 2013, the Group of Governmental Experts (GGE) under the United Nations auspices reached agreement on the critical question that international law applies in cyberspace.¹ While this point of departure has since then been confirmed in successive reports of the GGE,² as well as by the Open-ended Working Group (OEWG) of the General Assembly,³ further discussions on how international law applies in cyberspace, and where adjustments might be needed to accommodate the specific features of cyberspace, have proved challenging. The deadlock of the fifth GGE, which failed to adopt a report in 2017 because of fundamentally differing views on international law may have been decisive in triggering unilateral responses from individual States.⁴ The Published with license by Koninklijke Brill NV | DOI: 10.1163/15718107-20230002 © MARJA LEHTO, 2023 | ISSN: 0902-7351 (print) 1571-8107 (online) This is an open access article distributed under the terms of the CC BY 4.0 license.\nFINLAND'S POSITION PAPER Finland's position paper that is reproduced below was issued in 2020 as a contribution to the ongoing debate.⁵ As such, it comments on selected issues and does not provide a comprehensive compilation of Finland's legal views on cybersecurity. The limited scope of the paper reflects the mandate of the GGE, established by the General Assembly's First Committee, to address, inter alia, existing and emerging threats in cyberspace that may jeopardize international peace and security.⁶ The paper confirms the applicability and essential role of international law in cyberspace, in line with the major GGE findings. It also comments on a number of topical issues such as sovereignty, State responsibility, prevention of transboundary harm, illegal intervention, use of force and armed attack, international humanitarian law and human rights law.\nThe position papers and statements issued so far, including the present one, share a lot of common substance, which is obvious as they generally have the same background and have been prepared by States belonging, in the context of the GGES and the OEWG, to the Western 'like-minded' group. While the papers are consistent on most questions, there are also differences regarding how the legal limitations concerning State action in cyberspace are defined, most notably with regard to the legal nature of the principles of sovereignty and due diligence. These differences have given a further reason for Finland to articulate its own views in a public position paper.\n/National_position_of_the_Netherlands_(2019); France (2019), available at https://documents.unoda.org/wp-content/uploads/2021/12/French-position-on-international-law-applied-to-cyberspace.pdf; New Zealand (2019), available at https://dpmc.govt.nz/publications/application-international-law-state-activity-cyberspace; Australia (2020), available at https://www.internationalcybertech.gov.au/our-work/annexes/annex-b; Israel (2020), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Israel_(2020); Italy (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_Italian_Republic_(2021); Estonia (2021), available at https://cyberlaw.ccdcoe.org/wiki/National_position_of_Estonia_(2021); Switzerland (2021), available at https://www.eda.admin.ch&gt;eda&gt;voelkerrecht.pdf; Poland (2022), available at https://www.gov.pl/web/diplomacy/the-republic-of-polands-position-on-the-application-of-international-law-in-cyberspace and Canada (2022), available at https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/peace_security-paix_security/cyberspace_law-cyberespace_droit.aspx?lang=eng (all accessed on 27 February 2023). See also the position papers by Denmark, Norway and Sweden reproduced in the current issue of NJIL ⁵ Also available at https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859 (accessed on 27 February 2023). See also Michael Schmitt, 'Finland sets out key Positions on International Cyber Law', October 27, 2020, available at https://www.justsecurity.org/73061/finland-sets-out-key-positions-on-international-cyber-law/ ⁶ See, for instance, A/RES/68/243, op. para. 4.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469 FINLAND The statement that international law applies to State activities when they are using information and communication technologies may seem as little more than stating the obvious. While questions related to non-State actors increasingly occupy international lawyers and few would claim that States are the only subjects of international law, the one question that can be taken for granted is its applicability to State action. In spite of the self-evidence of the issue, the successive GGES and the OEWG have so far not been able to clearly state, for instance, that international humanitarian law applies to the use of cyber means and methods of war in an armed conflict.7 Whether this inability has something to do with the mystification of the concept of 'cyberspace', or rather reflects an attempt to circumscribe or put aside the existing rules, the debate has proved persistent. Finland's paper seeks, on its part, to make it clear that cyberspace is no lawless area.\nFor the reasons mentioned above, the issue of State sovereignty occupies a prominent place in the paper. Finland disagrees with the claim that no rights and obligations would flow from the principle of sovereignty as such, or that no rule prohibiting violations of sovereignty would have crystallized in respect of cyber activities. This contention seems to overlook the established status in international law of the rule that prohibits violations of sovereignty, confirmed both by State practice and international jurisprudence. Finland sees sovereignty as both a principle and a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers the wrongdoing State's international responsibility. Similarly, in response to the claim that there would be no legal obligation to exercise due diligence in cyberspace, the paper recalls\"each State's obligation not to knowingly allow its territory to be used to harm the rights of other States\"that the International Court of Justice called 'well-recognized' already in 1949.8 According to the paper, the general principle of due diligence is applicable to any activity which involves the risk of causing significant transboundary harm.\nThe question of sovereignty as a rule or as a mere principle, and that of the binding nature of due diligence in cyberspace, are examples of legal disagreements that have important concrete implications. Should it be accepted that sovereignty cannot be violated, it would mean that there are no legal consequences for violations that fall below the notoriously high threshold of NORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469 FINLAND'S POSITION PAPER Two further questions addressed in the paper seem worth drawing attention to. First, regarding the use of force, like most if not all of the States that have pronounced on the issue, Finland agrees that for a cyberattack to be comparable to use of force, it must be sufficiently serious and have effects in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of traditional armed force. To be equated to an armed attack, a cyberattack must further fulfil the requirements of scale and effects. The paper is open to the possibility that a cyberattack producing significant economic effects such as the collapse of a State's financial system or parts of its economy could possibly be comparable to an armed attack. Indeed, such a collapse would be likely to cause serious effects on the population.\nIn general, however, the paper underlines that any understanding of the use of force in cyberspace should respect the UN Charter, and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. Particular issues concerning the use of force in cyberspace may need cyber-specific solutions but these should always be assessed in light of the more general understandings. It should also be kept in mind that many of the issues related to the use of force continue to be debated even in the physical, or kinetic context. The ILA Committee on the Use of Force, in its 2018 report, made a similar point stating that conclusions concerning cyber operations as a use of force\"must be reached with great caution\"because a wide interpretation of Articles 2(4) and 51 of the Charter in the cyber context\"may affect the interpretation and debate surrounding other areas of the law of use of force\".9 Second, regarding International Humanitarian Law (IHL), the paper does not only state that the use of cyber means and methods in the context of an armed conflict is subject to the rules of IHL, including the principles of distinction, proportionality and precautions, but also underlines that the foreseeable direct and indirect effects of cyber means and methods must be taken into account when assessing their capacity to cause prohibited harm. The paper NORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469 FINLAND also takes a stand in favor of including data within the concept of object for the purposes of IHL in stating that there is an obligation to take constant care\"to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data\".\nSince 2020, new questions have arisen in the ongoing exchange of views, both as regards the national statements and within the two UN working groups. Peaceful settlement of disputes is one of such new themes and one that would most likely have been addressed in Finland's paper, had it been issued later.¹⁰ Indeed, if States abided by the fundamental Charter-based and customary obligation to settle their disputes peacefully and in a manner that does not endanger international peace and security, less attention would need to be paid to the intricacies of prohibited intervention, use of force, armed attack and application of IHL in cyberspace.\nMay, 2023 --- # International Law and Cyberspace ## Finland’s National Positions ### Introduction In line with its general support to rules-based international cooperation and respect for international law, Finland sees international law as an essential framework for responsible State behaviour in cyberspace. In the same vein, the UN Group of Governmental Experts (GGE) has reaffirmed that “international law, and in particular the Charter of the United Nations, is applicable and is essential to maintaining peace and stability and promoting an open, secure, stable, accessible and peaceful ICT environment”.¹ As this formulation, reflecting the specific mandate of the GGE, focuses on questions of international ¹⁰ See the statement of the delegations of Finland and Sweden in the OEWG in March 2021, available at https://reachingcriticalwill.org/images/documents/Disarmament-fora/other/icts/oewg/statements/9March_FinlandSweden.pdf (accessed on 27 February 2023).\n¹¹ See Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security, 2013 Report (UN Doc. A/68/98, para.20; 2015 report (UN Doc. A/70/174), para.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469 FINLAND'S POSITION PAPER While the existing rules and principles of international law are applicable in cyberspace, the application of certain provisions may give rise to practical problems due to the specific characteristics of cyberspace. Finland therefore welcomes the current exchange of views on particular questions regarding how international law applies to State use of information and communication technologies and wishes to contribute to the discussion by commenting on some of the issues that have been raised recently in this regard.\n## Sovereignty It is undisputed that the principle of State sovereignty applies in cyberspace. While cyberspace as a whole cannot be subject to appropriation by any State, each State has jurisdiction over the cyber infrastructure and the persons engaged in cyber activities within its territory.² Sovereignty confers each State the exclusive right to exercise the functions of a State within a certain territory,³ and protects its territorial integrity and political independence from interference by other States.⁴ In this sense, sovereignty is a foundational principle of the international legal order.\nThe principle of State sovereignty has also given rise to a number of specific rules, such as those prohibiting the use of force and intervention in the internal affairs of other States. Below the threshold of prohibited intervention, all States have an obligation to refrain from acts that violate the territorial integrity or political independence of other States.\nThe International Court of Justice has consistently confirmed that it is a duty of every State to respect the territorial sovereignty of others. This applies NORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469 FINLAND to unauthorized intrusions to physical spaces such as overflight of a State's territory by an aircraft belonging to another State or under its control,⁵ penetration of territorial waters by foreign warships,⁶ conducting of certain activities in another State's territory without its consent⁷ but also to producing effects in another State's territory without physical intrusion.⁸ According to the Court, it is\"quite obvious that a State possesses a legal interest in the protection of its territory from any form of external harmful action\".⁹ Similarly, a non-consensual intrusion in the computer networks and systems that rely on the cyber infrastructure in another State's territory may amount to a violation of that State's sovereignty. The prohibition of cyber operations violating the territorial sovereignty of another State protects, first of all, the cyber infrastructure located in the territory of that State, or otherwise under its jurisdiction, as well as computer networks and systems supported by such infrastructure, from material harm. The situation is the same irrespective of whether such infrastructure belongs to or is operated by governmental institutions, private entities or private individuals. In addition to material harm that may be caused by such an operation, other relevant considerations include whether an intrusion in the cyber infrastructure triggers a loss of functionality of the equipment relying on it, or modifies or deletes information belonging to the target State, or to private actors in its territory.\nMore generally, an unauthorized intrusion by cyber means may be seen as a violation of the target State's territorial sovereignty if it interferes with data or services that are necessary for the exercise of inherently governmental functions. This rule put forward in the Tallinn Manual 2.0¹⁰ is consistent with the understanding of violations of sovereignty as unauthorized exercise of authority in another State's territory. Finally, cyber operations against objects that enjoy sovereign immunity (warships, ships owned by a State and used only for government or noncommercial service; State aircraft) can be characterized as violations of sovereignty.¹¹ NORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469\n\nFINLAND'S POSITION PAPER\n\nFinland sees sovereignty as a primary rule of international law, a breach of which amounts to an internationally wrongful act and triggers State responsibility. This rule is fully applicable in cyberspace. Whether an unauthorized cyber intrusion violates the target State's sovereignty depends on its nature and consequences and is subject to a case-by-case assessment.\n## Illegal intervention A hostile interference by cyber means may also breach the customary prohibition of intervention in the internal affairs of another State, provided that it is done with the purpose of compelling or coercing that State in relation to affairs regarding which it has free choice (so-called domaine réservé). The requirement of coercion leaves out lesser forms of influence and persuasion that are commonplace in international relations. The limitation to sovereign affairs – such as a State's political, economic or cultural system or the direction of its foreign policy¹²– further distinguishes prohibited intervention from measures, the purpose of which is to compel another State to comply with its international obligations.\nFor a cyber operation to amount to a prohibited intervention, both above-mentioned elements must be present. Most open questions relate to the element of coercion and to how it manifests itself in cyber operations. For instance, while the conduct of elections belongs undisputedly to the internal affairs of each State, all methods of electoral interference do not display the element of coercion.¹³ Hacking of voter databases or manipulation of vote counts in order to alter the election results has nevertheless been recognized as a fairly clear case. To be comparable to a real world intervention, cyber interference must also be of a serious nature.\n¹² Military and Paramilitary Activities in and against Nicaragua, para. 205.\n¹³ All methods of electoral interference are not coercive, see EU vs. disinfo, 10 Methods of electoral interference (2019).\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469 FINLAND According to the International Court of Justice, the element of coercion is particularly clear if force is used through means of military action, threats of such action, or through support to armed groups in another State.¹⁴ Military or economic pressure may also qualify as coercion. Hostile cyber interference done with the purpose of promoting or supporting armed action in another State could constitute an example of prohibited intervention, provided that it seeks to force a certain policy change.¹⁵ Compared to a violation of sovereignty, the requirement of coercive nature and that of domaine réservé make the threshold of prohibited intervention considerably higher. This underlines the importance of continued understanding of sovereignty as not only a principle but also an independent primary rule of international law.\n## Transboundary harm Another cardinal principle flowing from sovereignty, closely related to the obligation to respect the sovereignty of other States, is each State's obligation not to knowingly allow its territory to be used to cause significant harm to the rights of other States. It is widely recognized that this principle, often referred to as due diligence, is applicable to any activity which involves the risk of causing significant transboundary harm.¹⁶ Due diligence is a variable standard in the sense that its content can change over time as a result of technological development or changes in risk assessment,¹⁷ and as such fully applicable to cyber operations.\nStates may thus not knowingly allow their territory, or cyber infrastructure within a territory under their control, to be used to cyber operations that ¹⁴ Military and Paramilitary Activities in and against Nicaragua, para.247.\n¹⁵ Ibid., see also paras 241 and 242. See also Friendly Relations Declaration, UN Doc. A/RES/2625(XXV).\n¹⁶ International Law Commission, Draft Articles on the Prevention of transboundary harm from hazardous activities, art. 3:\"The State of origin shall take all appropriate measures to prevent significant transboundary harm or at any event to minimize the risk thereof\", Yearbook... 2001, vol. II (Part Two), pp. 144–170; International Law Association, Second Report on Due Diligence in International Law, July 2016, p. 6:\"This broad principle of due diligence can be understood as underlying more specific rules of due diligence. Hence, it can be viewed as a default standard that is triggered in operation if no more specific elaboration of due diligence or stricter standard is in existence.\"¹⁷ International Tribunal for the Law of the Sea, Seabed Disputes Chamber, Responsibilities and Obligations of States Sponsoring Persons and Entities with Respect to Activities in the Area, Advisory opinion, 1 February 2011, List of Cases: No. 17, para. 117.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469 FINLAND'S POSITION PAPER Some legal obligations are inherent in the principle of due diligence and apply to cyber activities even in the absence of cyber-specific elaborations of the principle. For instance, if a State knows about a planned cyber activity in its territory likely to affect another State adversely and seriously, it must notify that other State. In addition to actual knowledge of harmful acts emanating from the territory of a State, a State's responsibility may be engaged in situations in which it should have known about the activities in question. It is nevertheless clear that\"it cannot be concluded from the mere fact of the control exercised [...] over its territory [...] that [a] State necessarily knew, or ought to have known, of any unlawful act perpetrated therein\".[18] If harmful cyber activity takes place and causes serious harm to another State, the State of origin must take appropriate action to terminate it, as well as to investigate the incident and bring those responsible to justice. In order to be able to do this, States should have the necessary procedural and legal mechanisms in place. It should nevertheless be recalled that due diligence is an obligation of conduct, not one of result. In general, what is required of States is that they take all measures that are feasible under the circumstances. A particular question in this regard is related to the position of transit States through which a particular harmful data is routed. Much depends on whether such a State has any knowledge of the ongoing operation, or ability to take feasible measures to terminate it.\nFurthermore, while States must show due diligence in the control of the national territory, doing so does not release them from the observance of other international obligations such as those related to human rights.\n## State responsibility The law of State responsibility consists of secondary rules that apply generally in the absence of clear specific rules that modify their effect. As there is no specific regulation concerning State activities in cyberspace that would constitute [18] International Court of Justice, *Corfu Channel case*, Judgment of April 9th, 1949, I.C.J. Reports 1949, p.4, at 18.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469 FINLAND such lex specialis, it can be concluded that the normal rules of State responsibility apply in cyberspace.\nWhen a State's cyber operation violates its obligations under international law, it constitutes an internationally wrongful act. An internationally wrongful act of a State entails its international responsibility and gives rise to an obligation to make full reparation for the damage that may be caused by the act.¹⁹ This requires that the act is attributable to the State. The rules of attribution reflected in the UN International Law Commission's Articles on State Responsibility²⁰ remain fully valid in cyberspace. If State organs, or private groups or individuals acting on behalf of the State, can be identified as the authors of a cyber operation that violates the State's international obligations, its international responsibility is engaged. It is in this regard useful to distinguish identification as a technical operation from attribution as a legal operation. Identification may be technically challenging given the often covert nature of hostile cyber activities but this is without consequence to the legal rules of attribution.\nAn internationally wrongful act may justify recourse to countermeasures by the injured State if the State responsible for an internationally wrongful act declines to cease the wrongful conduct or pay reparation. Countermeasures may only be taken with the purpose of ensuring compliance, not for retaliation. Countermeasures may furthermore not breach the prohibition of the threat or use of force, or other peremptory norms of general international law, and must be consistent with other customary law requirements and limitations concerning countermeasures, most of which are reflected in the International Law Commission's Articles on State Responsibility.²¹ Some of the procedural requirements concerning countermeasures may nevertheless require adjustment. For instance, it may be possible to attribute a hostile cyber operation only afterwards whereas countermeasures normally should be taken while the wrongful act is ongoing.\nThere is no general obligation for a State taking countermeasures to disclose the information on the basis of which the action is taken. At the same time, it is in each State's best interests to ensure that a decision to take countermeasures is based on solid evidence, given that recourse to countermeasures would otherwise constitute an internationally wrongful act. A State that responds to a hostile cyber operation must therefore have adequate proof of the source ¹⁹ International Law Commission, Responsibility of States for Internationally Wrongful Acts (2001), available at www.legal.un.org/ILC (ARSIWA).\n²⁰ Ibid., arts. 4–11.\n²¹ Ibid., arts. 49–54.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469 FINLAND'S POSITION PAPER Public attribution, as a sovereign choice, is primarily a question of political consideration. Public attribution may nevertheless have legal effects to the extent it includes determinations of conduct that constitutes an internationally wrongful act.\nIn addition to countermeasures, other circumstances precluding wrongfulness may justify taking of cyber measures that would otherwise constitute an internationally wrongful act.²² This may be the case, for instance, if deviating from an international obligation is the only way for the State to safeguard an essential interest against a grave and imminent peril. Facing such an exceptional situation, a State may deviate from its international obligations within the limits specified in the law of State responsibility.²³ ## Use of force/ armed attack While there is currently no established definition of a cyberattack that would pass the threshold of\"use of force\"in the sense of article 2(4) of the UN Charter, or\"armed attack\"in the sense of article 51, it is widely recognized that such a qualification depends on the consequences of a cyberattack. For a cyberattack to be comparable to use of force, it must be sufficiently serious and have impacts in the territory of the target State, or in areas within its jurisdiction, that are similar to those of the use of force. A threat of such a cyberattack could also violate Article 2(4) of the Charter, if the threat is sufficiently precise and directed against another State.\nSimilarly, most commentators agree that when the scale and effects of a cyberattack correspond to those of an armed attack responding to the cyberattack is justifiable as self-defence. It is obvious that the attack must have caused death, injury or substantial material damage, but it is impossible to set a precise quantitative threshold for the effects, and other circumstantial factors must be taken into account in the analysis, as well. A widely discussed question is, to what extent the definition of a cyberattack comparable to an armed attack should take account of the indirect and long-term impacts of the attack. In any case, this would require that the impacts can be assessed with sufficient precision. A question has also been raised, whether a cyberattack producing significant economic effects such as the collapse of a State's financial system ²² ARSIWA, Chapter V, Circumstances precluding wrongfulness.\n²³ Ibid., art. 25. See also Tallinn Manual 2.0, Rule 26.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456–469 FINLAND or parts of its economy should be equated to an armed attack. This question merits further consideration.\nAny interpretation of the use of force in cyberspace should respect the UN Charter and not just the letter of the Charter but also its object and purpose, which is to prevent the escalation of armed activities. This would mean, for instance, that the distinction between armed attack as a particularly serious violation of the Charter, on the one hand, and any lesser uses of force, on the other, is preserved. Similarly, the conditions for the exercise of the right of self-defence apply in cyberspace as they do with regard to the use of armed force. The right of self-defence arises if a cyberattack comparable to an armed attack occurs and can be attributed to a particular State.²⁴ It is reasonable to think that a State victim to such an attack can respond with either cyber means or armed action. At the same time, the use of force must not be disproportionate or excessive.\n## International Humanitarian Law International humanitarian law only applies to cyber operations when such operations are part of, or amount to, an armed conflict. Most so far known cyberattacks have not been launched in the context of an armed conflict or have met the threshold of armed conflict. At the same time, when cyber means are used in the context of a pre-existing armed conflict, as has been done in many current conflicts, there is no reason to deny the need for the protections that international humanitarian law provides.\nThis includes that cyber means and methods of warfare must be used consistently with the principles of distinction, proportionality and precautions, as well as the specific rules flowing from these principles. When assessing the capacity of cyber means and methods to cause prohibited harm, their foreseeable direct and indirect effects shall be taken into account. Constant care shall be taken to ensure the protection of civilians and civilian objects, including essential civilian infrastructure, civilian services and civilian data.\nThe unique characteristics of cyberspace, such as interconnectedness and anonymity, may affect how international humanitarian law is interpreted and applied with regard to certain cyber means and methods warfare. The related problems can nevertheless mostly be solved on the basis of existing rules. New ²⁴ While the possibility of a cyberattack rising to the level of an armed attack without the involvement of any State is conceivable, the related questions of self-defence against non-State actors are too complicated to be discussed here.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469 FINLAND'S POSITION PAPER\n\n## Human rights law\nA number of specific human rights such as the freedom of opinion and expression, including the right to access to information, and the right to privacy are particularly relevant in cyberspace. It should nevertheless be underlined that individuals enjoy the same international human rights with respect to cyber-related activities as otherwise and, accordingly, that States are bound by all their human rights obligations both online and offline. Furthermore, each State has to protect individuals within its territory and subject to its jurisdiction from interference with their rights by third parties.\n## Note from the publisher\nThe author mentioned at the start of this article, Marja Lehto, is only responsible for the introduction to this position paper. The position paper is a product of the government of Finland and available online: https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859.\nNORDIC JOURNAL OF INTERNATIONAL LAW 92 (2023) 456-469"
    }
  },
  "citation_summary": {
    "style": "superscript",
    "dominant_bucket": "tex",
    "dominant": {
      "intext_total": 44.0,
      "success_occurrences": 44.0,
      "success_unique": 22.0,
      "bib_unique_total": 30.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 0.7333333333333333,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "superscript"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 44.0,
        "success_occurrences": 44.0,
        "success_unique": 22.0,
        "bib_unique_total": 30.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.7333333333333333,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "superscript"
      },
      "numeric": {
        "intext_total": 1.0,
        "success_occurrences": 1.0,
        "success_unique": 1.0,
        "bib_unique_total": 1.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 1.0,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 1.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 10.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "Finland's views on International Law and Cyberspace",
    "subtitle": "",
    "document_type": "journal_article",
    "venue": "NORDIC JOURNAL OF INTERNATIONAL LAW",
    "publication_year": 2013,
    "authors": [
      "Marja Lehto"
    ],
    "affiliations": [
      "Ministry of Foreign Affairs of Finland, Helsinki, Finland"
    ],
    "emails": [
      "Marja.Lehto@formin.fi"
    ],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "",
    "keywords": [],
    "publication_dates": {
      "published": "4 July 2023",
      "online": "4 July 2023"
    },
    "identifiers": {
      "doi": [
        "10.1163/15718107-20230002"
      ],
      "issn": [
        "ISSN: 0902-7351"
      ],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_United_States_of_America_(2016",
        "https://www.gov.uk/government/speeches/cyber-and-international-law-in-the-21st-century",
        "https://www.gov.uk/government/publications/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement/application-of-international-law-to-states-conduct-in-cyberspace-uk-statement",
        "https://cyberlaw.ccdcoe.org/wiki",
        "https://documents.unoda.org/wp-content/uploads/2021/12/French-position-on-international-law-applied-to-cyberspace.pdf",
        "https://dpmc.govt.nz/publications/application-international-law-state-activity-cyberspace",
        "https://www.internationalcybertech.gov.au/our-work/annexes/annex-b",
        "https://cyberlaw.ccdcoe.org/wiki/National_position_of_Israel_(2020",
        "https://cyberlaw.ccdcoe.org/wiki/National_position_of_the_Italian_Republic_(2021",
        "https://cyberlaw.ccdcoe.org/wiki/National_position_of_Estonia_(2021",
        "https://www.eda.admin.ch&gt;eda&gt;voelkerrecht.pdf",
        "https://www.gov.pl/web/diplomacy/the-republic-of-polands-position-on-the-application-of-international-law-in-cyberspace",
        "https://www.international.gc.ca/world-monde/issues_development-enjeux_developpement/peace_security-paix_security/cyberspace_law-cyberespace_droit.aspx?lang=eng",
        "https://um.fi/documents/35732/0/Cyber+and+international+law%3B+Finland%27s+views.pdf/41404cbb-d300-a3b9-92e4-a7d675d5d585?t=1602758856859",
        "https://www.justsecurity.org/73061/finland-sets-out-key-positions-on-international-cyber-law",
        "https://reachingcriticalwill.org/images/documents/Disarmament-fora/other/icts/oewg/statements/9March_FinlandSweden.pdf"
      ]
    },
    "references_block_count": 0,
    "references_entries_estimated": 0,
    "heading_count": 12,
    "max_heading_level": 3,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "no_abstract"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 44,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 0.4090909090909091,
      "footnote_coverage": 1.0,
      "unique_index_count": 22
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "superscript",
      "recommended_style": "superscript",
      "aligned": true,
      "signals": {
        "superscript_hits": 46,
        "superscript_definition_lines": 16,
        "numeric_bracket_hits": 2,
        "numeric_endnote_lines": 4,
        "author_year_hits": 0
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 30.0,
      "dominant_bib_coverage_rate": 0.7333333333333333,
      "dominant_link_target": "footnotes",
      "dominant_unresolved_flag": "unresolved_footnote_links"
    },
    "heading_validation": {
      "heading_count": 12,
      "max_heading_level": 3,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": false,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": true,
        "emails": true,
        "orcids": false,
        "abstract": false,
        "keywords": false,
        "venue": true,
        "persistent_identifier": true,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 1,
        "affiliations": 1,
        "emails": 1,
        "orcids": 0,
        "keywords": 0,
        "doi": 1,
        "issn": 1,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 16
      },
      "coverage": {
        "core_coverage": 0.8333333333333334,
        "email_author_link_rate": 1.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "no_abstract"
        ],
        "toc_dot_lines": 0
      },
      "flags": [
        "meta_missing_abstract_and_keywords"
      ]
    },
    "flags": [
      "missing_preceding_text",
      "missing_reference_heading",
      "meta_missing_abstract_and_keywords"
    ]
  },
  "updated_at_utc": "2026-02-14T08:27:12.314532+00:00"
}