{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\4KQ2BT2W\\XVFULTHJ.pdf",
  "custom_id": "46",
  "response": {
    "id": "batch-b6235e9e-47-b6f09d89-fcca-47b5-9872-d2c233bb1439",
    "custom_id": "46",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "HEINONLINE\n\nDATE DOWNLOADED: Thu Jul 3 11:43:55 2025\nSOURCE: Content Downloaded from HeinOnline\n\nCitations:\nPlease note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n\nBluebook 21st ed.\nBen Buchanan, Cyber Deterrence Isn't MAD; It's Mosaic, 15 GEO. J. INT'l AFF. 130 (2014).\n\nALWD 7th ed.\nBen Buchanan, Cyber Deterrence Isn't MAD; It's Mosaic, 15 Geo. J. Int'l Aff. 130 (2014).\n\nAPA 7th ed.\nBuchanan, Ben. (2014). Cyber deterrence isn't mad; it's mosaic. Georgetown Journal of International Affairs, 15(3), 130-140.\n\nChicago 17th ed.\nBen Buchanan, \"Cyber Deterrence Isn't MAD; It's Mosaic,\" Georgetown Journal of International Affairs 15, no. 3 (2014): 130-140\n\nMcGill Guide 10th ed.\nBen Buchanan, \"Cyber Deterrence Isn't MAD; It's Mosaic\" (2014) 15:3 Geo J Int'l Aff 130.\n\nAGLC 4th ed.\nBen Buchanan, 'Cyber Deterrence Isn't MAD; It's Mosaic' (2014) 15(3) Georgetown Journal of International Affairs 130\n\nMLA 9th ed.\nBuchanan, Ben. \"Cyber Deterrence Isn't MAD; It's Mosaic.\" Georgetown Journal of International Affairs, vol. 15, no. 3, 2014, pp. 130-140. HeinOnline.\n\nOSCOLA 4th ed.\nBen Buchanan, 'Cyber Deterrence Isn't MAD; It's Mosaic' (2014) 15 Geo J Int'l Aff 130\nx Please note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\nCite this document\nPinCite this document\n\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1667,
              "width": 1112
            }
          },
          {
            "index": 1,
            "markdown": "# Cyber Deterrence Isn't MAD; It's Mosaic\n\n## Ben Buchanan\n\nDeterrence is always associated most strongly with Mutually Assured Destruction and nuclear weapons. Nevertheless, the fading memory of the Cold War should not leave a monolithic concept of deterrence as its legacy. In facing new threats and new actors, governments must develop a more nuanced and multi-faceted understanding of deterrence. Perhaps in no case is this more apt than threats in cyberspace. This article contends that there is no single way to deter an adversary's cyber operations. Rather, different actors and even different acts are subject to varying kinds of deterrence. Therefore, states must build a multi-faceted strategy to approach the cyber domain.\n\nThe argument consists of three steps. First, drawing on notions of deterrence that exist outside the Cold War, including in counterterrorism and law enforcement contexts, this article introduces the two main ways in which deterrence can vary: how much a threat must be deterred, which is correlated inexactly with its severity, and whether a specific actor is to be deterred or a large group. Second, it then places each variable onto a spectrum along an axis to construct a two dimensional model of types of deterrence. Different threats in cyberspace fit into different parts of\n\nBen Buchanan is a PhD student focusing on cybersecurity and national strategy at King's College London, where he is a Marshall Scholar. He graduated from Georgetown University in 2011 and received his Masters from Georgetown in Security Studies in 2013. He is a certified computer forensic analyst.\n\n[130] Georgetown Journal of International Affairs",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2100,
              "width": 1500
            }
          },
          {
            "index": 2,
            "markdown": "CYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\n\nthe model depending on their characteristics. Lastly, it describes how these forms of deterrence can together form the basis of a mosaic strategy for achieving realistic deterrence in cyberspace—and for recognizing where deterrence is not fully possible.\n\nBefore proceeding, it is worth clarifying an important definition: cyber deterrence is the art of deterring an adversary's cyber operations. It should not imply that a state's own cyber capabilities must be used in this effort. Indeed, a key part of the argument presented here is that the decision to launch a particular cyber operation can be predicated on factors that are entirely removed from cyberspace, including other military goals, the political context, potential consequences for individual actors, and more. Tools in these other areas thus can contribute to effective cyber deterrence.\n\n# Different Types of Deterrence.\n\nDeterrence—the art of making another actor decide not to do something because of the threat of reprisal—is a concept that predates even the idea of statehood. As such, it is best to examine it in ways not bound to modern international relations. Drawing on work on deterring crime and political violence, Thomas Rid, amongst others, argues that there are two main theoretical distinctions between different types of deterrence. These two distinctions are particularly useful in their application to cyberspace.[1]\n\nFirst, deterrence can be specific or it can be general. Deterrence against a specific threat involves crafting a set of punishments designed to respond\n\nto a specific action by a specific actor. Presumably, these consequences are tailored to cause meaningful pain to the actor.[2] General deterrence, in contrast, is the crafting of a set of punishments that are not targeted to any individual actor, but which could apply to any individual from a large and broadly-defined group of actors, should he or she perform an undesirable action. General deterrence often involves making an example of those who act in objectionable ways for others to see.\n\nSecond, deterrence can be absolute or restrictive. Absolute deterrence seeks to prevent any deviant behavior of a particularly damaging sort, such as the launch of nuclear weapons. Restrictive deterrence seeks to encourage other actors to moderate their behavior in either quantity or quality in order to reduce the likelihood of consequences. A simplistic understanding of deterrence rejects this distinction between restrictive deterrence and absolute deterrence. It states that every transgression should be deterred fully, and, if committed, punished massively. While attractive in its simplicity, such a model is not credible or effective.[3] Is a state really willing to use kinetic weapons to punish a relatively minor transgression like espionage against a mid-tier target? It is also undesirable because it poses escalatory risks. If a state is going to disproportionately retaliate against a relatively minor offense, it should not expect its retaliation to go unanswered. As a general rule, then, actors more often want to absolutely deter severe threats and\n\nInternational Engagement on Cyber IV [131]",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2100,
              "width": 1500
            }
          },
          {
            "index": 3,
            "markdown": "BUCHANAN Military Matters\n\nare more credible when they communicate this desire. There is at least one exception: they might wish to deter actions that in themselves are not especially harmful, but could either provide the basis for greater destabilization or set a dangerous precedent.\n\nIn this two dimensional model, the United States' Cold War deterrence strategy that is so familiar to modern international relations the\n\nApplying the Model to Cyber Operations. The two theoretical distinctions—specific versus general and absolute versus restrictive—can be plotted on two axes to form a two dimensional model, as below. Note that the most restrictive, but not absolute, point occurs just as the y-axis values turn negative; the lowest values of the y-axis are for activities where restrictive deterrence minimally applies.\n\n![img-0.jpeg](img-0.jpeg)\n\nory is in fact just one type of deterrence against one type of threat: absolute deterrence against the specific Soviet nuclear threat. This type of absolute and specific deterrence is alive and well today, given the nuclear deterrent many nations possess. It has only narrow utility, however, when applied to cyber operations. A more nuanced approach is required because many different threats exist in the cyber domain.\n\nFor any given class of threats, such as those posed by cyber operations, an actor can create a model to visualize what it seeks to deter. Some threats might be discrete points on the chart—where the actor and threat are known—while others are best represented as boxes, with heights and widths that reflect variability either in the specificity of the actor or the severity of the threat. Given the uncertainty of cyber operations, most will fall into this class.\n\nFor example, a model for the\n\nGeorgetown Journal of International Affairs",
            "images": [
              {
                "id": "img-0.jpeg",
                "top_left_x": 342,
                "top_left_y": 699,
                "bottom_right_x": 1150,
                "bottom_right_y": 1299,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 2100,
              "width": 1500
            }
          },
          {
            "index": 4,
            "markdown": "CYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\n\nUnited States might look something like what is below.⁴ To be clear, this version is for purely illustrative purposes based on public domain information. Actual threat analysis would incorporate classified information and could well come to different conclusions. This model does not currently include a provision for assessing the relative likelihood of each threat, as threats either meet a threshold for inclusion or are left out entirely. To show some indication of relative likelihood, boxes and points can be given varying degrees of opacity. Limited discussion of each box follows below.\n\nthat cause widespread blackouts to the power grid, disable critical military systems like the Global Positioning System, or otherwise have significant or lethal physical consequences. China is often theorized as an actor with the sophistication to perform such an attack, and some speculate that its activities have been aimed at refining this capability.⁷\n\nRussian Strategic Computer Network Attack: A Russian computer network attack might be similar to above in terms of its severity, but Russia is a different actor with a different set of calculations. In addition, the\n\n![img-1.jpeg](img-1.jpeg)\n\nChinese Strategic Computer Network Attack: There is no shortage of writers and strategists warning of the dangers of a strategic computer network attack, though skeptics question the likelihood.⁵,⁶ Certainly, though, the damage of such an attack, if it were possible, could be immense. Activities in this category include attacks\n\nRussians might choose an entirely different target. For example, they might be more inclined to target the American financial system, since they trade significantly less with the United States.⁸ Thus, from an American perspective, what deters the Chinese might not deter the Russians, and vice versa.\n\nInternational Engagement on Cyber IV [133]",
            "images": [
              {
                "id": "img-1.jpeg",
                "top_left_x": 342,
                "top_left_y": 886,
                "bottom_right_x": 1156,
                "bottom_right_y": 1491,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 2100,
              "width": 1500
            }
          },
          {
            "index": 5,
            "markdown": "BUCHANAN Military Matters\n\nNorth Korean Strategic Computer Network Attack: In theory, a strategic network attack need not come from an adversary with a heavy reliance on computers. Though it is unlikely North Korean computer network attack capabilities could match the Chinese or Russians in their lethality, the state has shown some willingness to use computer network attacks in the past, primarily against South Korea. Since North Korea has relatively few cyber assets of its own to serve as the targets of American retaliation, and is internationally ostracized, the United States will again have to consider deterrence differently.\n\nIranian Operational Computer Network Attack: According to reports, the Iranians conducted the Shamoon attack against an American ally, as well as other direct attacks against American financial companies.[10] The available reporting suggests the attacks against U.S. firms were less severe than the Shamoon operation. It remains unclear if the Iranians' failure to truly impact the American financial system was due to a lack of capability or the effects of restrictive deterrence.\n\nChinese Computer Network Exploitation: While the dangers of Chinese network exploitation are widely reported, they are unquestionably less immediate than the imagined devastating strategic computer network attacks.[11] They therefore receive less of an absolute deterrent. This box refers to the best hackers directly associated and under the control of\n\nthe Chinese intelligence and military services. They thus may be open to certain models of deterrence aimed at Chinese decision-makers.\n\nChinese Patriotic Hackers Computer Network Exploitation: There are reports of a number of hacking groups acting in concert with general Chinese interests without direct affiliations with the Chinese government.[12] In their exploitation of American (and other) networks, these groups are not primary under the control of the Chinese decision-makers, but may in some ways be protected by them. They have their own capabilities, which can be assumed to be less than those of the best Chinese military and intelligence units, and their own incentives. They thus are deterred differently, and may be more suited to a general rather than specific approach.\n\nAnonymous Computer Network Exploitation and Attack: The independent hacking group Anonymous, along with offshoots such as LulzSec, has demonstrated a willingness to hack American government entities, financial providers, and universities.[13] Their computer network attacks are reasonably unsophisticated—mostly minor denial of service attacks—although some of their exploitation operations have been effective, such as those against Stratfor and HB Gary.[14] Given that they are an ad-hoc collective, they are primarily subject to general deterrence.\n\nGeorgetown Journal of International Affairs",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2100,
              "width": 1500
            }
          },
          {
            "index": 6,
            "markdown": "CYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\n\nFinancial Fraud by computer criminals: There are a large number of mostly faceless computer criminals who make money through identity fraud, so-called ransomware, and surreptitious Bitcoin mining. They frequently target Americans. While they can pose an economic nuisance and can be deeply detrimental to individuals, they are not of primary concern to American national security policymakers.\n\nThe Mosaic of Cyber Deterrence—and Its Limits. Every deterrence strategy begins with attribution. Without it, the entire discussion is moot. Since attribution is a complex problem worthy of its own detailed discussion, this paper accepts the assertion of American policymakers that the United States can perform attribution when targeted with a cyber operation. Certainly, recent American rhetoric and actions has been designed to draw attention to its attribution capabilities, with an eye to creating foundations for deterrence. Prominent examples of this are former Secretary of Defense Leon Panetta's bold claim that, \"Potential aggressors should be aware that the United States has the capacity to locate them and to hold them accountable for their actions...\" and the indictment of five Chinese hackers believed to be affiliated with the Chinese People's Liberation Army.[15, 16]\n\nEven when a state's attribution capabilities are known, there is no single dominant strategy that meets each cyber challenge. Rather, the United States should construct a\n\nmosaic of different deterrence strategies to confront the full spectrum of cyber threats. The differences in these assorted types of deterrence loosely correspond to the four quadrants of the model. Even so, cyber deterrence alone is incomplete. Policymakers must advance defensive measures as well.\n\nStrategic computer network attack, spanning the top two quadrants, can be deterred in two ways. It can first be deterred with the threat of a retaliatory computer network attack, in the same way second strike capabilities were positioned during the Cold War. This relies on the existence of realistic and sufficiently important targets to strike with a cyber attack.\n\nIf no such targets exist, the United States can employ the second method of deterrence: kinetic equivalency. This doctrine states that the attacked state will deploy its conventional kinetic arsenal to retaliate for a cyber attack. It is particularly useful for deterring states that do not have many cyber targets, like North Korea, or that could, in extreme circumstances, potentially disconnect themselves from the internet, like China. The United States has already made such a declaration of equivalency.[17] Whether it is viewed credibly is hard to know, as no state has yet tested it. Other states without the overwhelming power-projecting capabilities of the American military might find this doctrine hard to promulgate credibly.\n\nSince kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence\n\nInternational Engagement on Cyber IV [135]",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2100,
              "width": 1500
            }
          },
          {
            "index": 7,
            "markdown": "BUCHANAN Military Matters\n\nmosaic. Operational cyber attacks by a specific enemy that are not strategic in their outcome, such as the Iranian attack against the American financial system in 2012, fall in the bottom right quadrant. They are\n\nintrusion. Indeed, most intrusions go undetected for months, if not years, a challenge to the foundation of attribution on which deterrence is based.[18] Second, states suffering exploitation are unlikely to be the\n\n# Since kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence mosaic.\n\ntherefore subject to more restrictive deterrence. According to the mosaic model, an adversary who launched this kind of attack should suffer some consequences, but not as severe consequences as one that launched a strategic attack. Examples of such mid-tier punishments include diplomatic protest, isolation from internet governance bodies, and black-holing of internet traffic from a targeted range of IP addresses. Policymakers have the option of clearly spelling out their \"red lines\"—essentially, what is in the top right quadrant and what is in the bottom right—or of leaving them deliberately ambiguous, with the hope of deterring a broader range of activity than they are actually willing to punish.\n\nDeterring exploitation by states and those who are their direct agents is much harder (this group is also mostly in the bottom right quadrant, with some small overlap into the top right). First, exploiters may feel they are less likely to suffer deterrence because there is no immediate damage to alert the adversary of an\n\nfirst to launch an attack in response. Nevertheless, some forms of deterrence can be theorized.\n\nFor actors directly linked to the state, such as sophisticated foreign intelligence agencies, it may be possible to communicate, potentially in secret, some gradations of severity. Doing so can provide some narrow absolute deterrence and a greater deal of restrictive deterrence. For example, any exploitation or attack that potentially might harm America's nuclear umbrella could prompt a fiercer response than economic espionage. In this way, then, even sophisticated foreign entities directly linked to the government could be directed away from the most serious targets. Deterring their activities against less critical, but still deeply important, targets is much more difficult. Some restrictive deterrence is still possible, such as sanctions or indictments if economic espionage crosses a certain level.\n\nIn the case of hackers loosely affiliated with an adversary's government (who, because they are sometimes known and sometimes unknown,\n\nGeorgetown Journal of International Affairs",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2100,
              "width": 1500
            }
          },
          {
            "index": 8,
            "markdown": "CYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\n\nmostly span the bottom two quadrants), some combination of narrow absolute deterrence and restrictive deterrence is necessary, but not sufficient. These hackers, absent formal government protection, must be careful not to go too far, lest the targeted country retaliate against them and their host government decline to protect them. As a result, they are likely to avoid some targets entirely and employ the utmost discretion when hitting others. There are limits to this restrictive deterrence, however, and limits to how well absolute deterrence can be communicated when the threat is more general. Such deterrence is based in large part on the hacking group's collective and self-reinforcing perceptions. It is unlikely to be effective\n\nthrough the framework of traditional criminology. Here, the goal of the state should be to achieve maximum deterrence while recognizing that it can never truly eliminate the threat. The state should focus on identifying the truly capable hackers who pose a legitimate threat and apply restrictive deterrence to them, discouraging them from high value targets. In the short history of these hacking groups, these sophisticated hackers have thus far focused on exploitation against mid-tier targets, which may reflect their ideology, capability, or successful restrictive deterrence. Because it is difficult to identify in advance who poses a threat, the state should employ techniques from general deterrence used in traditional criminology. It should\n\n**Thoughtful use** of positive incentives...may better contrast the punishments and encourage hackers to be economically productive for the state rather than a thorn in its side.\n\nin stopping them from exploiting mid-tier targets, since the hackers are presumably protected enough by their government to withstand any response, minimal as they believe it is likely to be.\n\nIn the above model of cyber threats facing the United States, two sets of hackers not even loosely affiliated with a state comprise threats in the bottom left quadrant. Hackers not associated with any state but instead motivated by political intention, like Anonymous, are best viewed\n\nuse the punishments it delivers to some hackers as a warning to others, taking care to be proportional in these punishments. There is one key difference between these hackers and other criminals: while theft and murder have little social value, those with computer skills can be useful to the state. Thoughtful use of positive incentives—some of which may be political in nature, such as minor concessions on political grievances—may better contrast the punishments and encourage hackers to be eco\n\nInternational Engagement on Cyber IV [137]",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2100,
              "width": 1500
            }
          },
          {
            "index": 9,
            "markdown": "BUCHANAN Military Matters\n\nnomically productive for the state rather than a thorn in its side.\n\nHackers not associated with any state and motivated by money, such as identity thieves, are nearly impossible to absolutely deter. When such hackers are overseas, their own governments may have willful ignorance of their activities. In the long run, this group should be approached with traditional restrictive deterrence. This probably means attempting to set up agreements of international cooperation to make it more difficult to escape punishment. In the short run, where prosecution is possible it should be pursued, but the United States will likely have to recognize the limits of its power to deter in this regard.\n\n**Conclusion: The Limits of Deterrence.** There are significant limits to even the best mosaic of cyber deterrence. Given the amount of computer fraud, state-sponsored exploitation, potentially-state-sponsored\n\nexploitation, and hacking collective activity against the United States, restrictive deterrence is at best a necessary but insufficient solution. Absolute deterrence thus far seems to fare better, but it is difficult to prove a negative, especially while the possibility of strategic computer network attack is subject to such debate. A final conclusion, then, is that the mosaic must be accompanied by strong cybersecurity practice. This includes, but is not limited to, careful network monitoring, patching, and penetration testing.\n\nThese defensive countermeasures should have two main goals. First is keeping general adversaries, such as Anonymous, from being able to conduct strategic attacks. Absolute deterrence may not be as effective against them, because there is little of value to retaliate against, because attribution is particularly difficult, or because they simply might not care about the consequences of retaliation. Second is minimizing the\n\n![img-2.jpeg](img-2.jpeg)\n\nGeorgetown Journal of International Affairs",
            "images": [
              {
                "id": "img-2.jpeg",
                "top_left_x": 349,
                "top_left_y": 1245,
                "bottom_right_x": 1147,
                "bottom_right_y": 1839,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 2100,
              "width": 1500
            }
          },
          {
            "index": 10,
            "markdown": "CYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\n\nharm that adversaries who are only subject to restrictive deterrence, such as patriotic exploiters in China or operational attackers in Iran, can do. The figure below summarizes the barrier and downward pressure these defensive measures are designed to create.\n\nThis focus on defensive measures alongside deterrence is a break from the traditional understanding of deterrence in international relations. Historically, in situations that call primarily for absolute and specific deterrence—such as the Cold War—excessive defensive measures can be destabilizing because they hamper an adversary's ability to perform a second strike. In that case, preserving stability was more important than defense and so anti-ballistic missiles were mutually banned. In the case of cyber deterrence, as in criminology, defense is not destabilizing. There are\n\ntwo main reasons for this. First, further escalation—to kinetic weaponry—is always possible, so the fear of a devastating first cyber strike that renders a powerful state like the United States or China unable to respond does not apply. Second, it is easy, and obviously correct, to justify any defensive cyber measures as a means of supplementing restrictive deterrence. Such countermeasures are widely accepted and broadly recommended—though certainly not always implemented fully—so their presence is not questioned. Defenses, coupled with a smart mosaic of deterrence, are therefore a key part of keeping cyberspace safe.\n\nThe author would like to thank Professor Thomas Rid of King's College London for reading an earlier draft of this article.\n\nInternational Engagement on Cyber IV [139]",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2100,
              "width": 1500
            }
          },
          {
            "index": 11,
            "markdown": "BUCHANAN Military Matters\n\n# NOTES\n\n1. Rid, T. \"Deterrence Beyond the State. The Israeli Experience.\" *Contemporary Security Policy*, April, vol 33, iss 1, p. 124-147. 2012. DOI:10.1080/13523260.2012.659593\n\n2. In some constructions specific deterrence can require actually enacting the punishment. In international relations, however, where the punishments are likely to have grave and broad consequences, this seems unreasonable. Instead, specific deterrence in international relations relies on credible communication of consequences to the deterred actor, which requires knowing specifically who the actor is.\n\n3. Shavell, Steven. \"A Note on Marginal Deterrence.\" *International Review of Law and Economics*. 1992. 12, 345-355.\n\n4. A similar model could be constructed by the Chinese or Russians regarding American activity in cyberspace. The American model is presented here because, based on public reporting, it appears the United States faces a broad range of threats, while the Chinese and Russians are likely targeted most prominently by the United States' National Security Agency. Further, there is simply more public reporting on the range of threats facing the United States.\n\n5. \"Remarks by Secretary Panetta on Cybersecurity to the Business Executives for National Security, New York City.\" Department of Defense. http://www.defense.gov/transcripts/transcript.aspx?transcriptid=5136 Panetta's Cyber Pearl Harbor speech.\n\n6. Rid, Thomas. Cyber War Will Not Take Place. 2013. Oxford University Press.\n\n7. Capaccio, Tony and Bliss, Jeff. \"Chinese Military Suspected in Hacker Attacks on U.S. Satellites.\" *Businessweek*. 27 October 2011. http://www.businessweek.com/news/2011-10-27/chinese-military-suspected-in-hacker-attacks-on-u-s-satellites.html\n\n8. \"U.S. Trade in Goods by Country.\" US Census Bureau. http://www.census.gov/foreign-trade/balance/.\n\n9. \"North Korea 'behind cyber attack' on South websites.\" *BBC News*. 10 July 2013. http://www.bbc.co.uk/news/world-asia-23324172\n\n10. Perlroth, Nicole. \"In Cyberattack on Saudi Firm, U.S. Sees Iran Firing Back.\" *New York Times*. 23 October, 2012. http://www.nytimes.com/2012/10/24/business/global/cyberattack-on-saudi-oil-firm-disquiets-us.html?pagewanted=all. Gorman, Siobhan and Barnes, Julian. \"Iran Blamed for Cyberattacks.\" *The Wall Street Journal*. 12 October 2012. http://online.wsj.com/news/articles/SB10000872396390444657804578052931555576700\n\n11. Clarke, Richard. \"How China Steals Our Secrets.\" *New York Times*. 2 April 2012. http://www.nytimes.com/2012/04/03/opinion/how-china-steals-our-secrets.html. See also \"APT1.\" Mandiant. 18 February 2013. http://intelreport.mandiant.com/Mandiant_APT1_Report.pdf\n\n12. For one example, see Markoff, John. \"Vast Spy System Loots Computers in 103 Countries\". *New York Times*. 28 March 2009. http://www.nytimes.com/2009/03/29/technology/29spy.html\n\n13. Wakefield, Jane. \"Anonymous Wikileaks supporters explain web attacks.\" *BBC News*. 10 December 2010. http://www.bbc.co.uk/news/technology-11971259. Kao, Joanna and Solomon, Ethan. \"Anonymous Hacks MIT.\" The Tech. 15 January 2013. http://tech.mit.edu/VI32/N61/anonymous.html. Sheets, Connor. \"NSA Website Down Following Apparent DDoS Attack Possibly By Anonymous Or A Foreign Government.\" International Business Times. 25 October 2013. http://www.ibtimes.com/ns-a-website-down=following-apparent-ddos-attack=possibly-anonymous-or-foreign-government-1442452.\n\n14. Anderson, Nate. \"Anonymous vs. HBGary: the aftermath.\" *Ars Technica*. 25 February 2011. http://arstechnica.com/tech-policy/2011/02/anonymous-vs-hbgary-the-aftermath/. Meyers, Michelle. \"Report Details Extent of Anonymous Hack of Stratfor.\" CNET. 27 December 2011. http://www.cnet.com/news/report-details-extent-of-anonymous-hack-on-stratfor/\n\n15. \"Remarks by Secretary Panetta on Cybersecurity to the Business Executives for National Security, New York City.\" Department of Defense. http://www.defense.gov/transcripts/transcript.aspx?transcriptid=5136 Panetta's Cyber Pearl Harbor speech.\n\n16. Schmidt, Michael and Sanger, David. \"5 in China Army Face U.S. Charges of Cyberattacks.\" *New York Times*. 19 May 2014. http://eng.chinamil.com.cn/news-channels/china-military-news/2014-06/30/content_6025789.htm.\n\n17. Gorman, Siobhan and Barnes, Julian. \"Cyber Combat: Act of War.\" *Wall Street Journal*. 31 March 2011. http://online.wsj.com/news/articles/SB10001424052702304563104576355623135782718\n\n18. The median number of days until detection is 243. \"Mandiant Releases Annual Threat Report on Advanced Targeted Attacks.\" *Mandiant*. 13 March 2013. https://www.mandiant.com/media-room/release/mandiant-releases-annual-threat-report-on-advanced-targeted-attackst/\n\nGeorgetown Journal of International Affairs",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2100,
              "width": 1500
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 12,
          "doc_size_bytes": 667305
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "HEINONLINE\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\n# Cyber Deterrence Isn't MAD; It's Mosaic\n## Ben Buchanan\nDeterrence is always associated most strongly with Mutually Assured Destruction and nuclear weapons. Nevertheless, the fading memory of the Cold War should not leave a monolithic concept of deterrence as its legacy. In facing new threats and new actors, governments must develop a more nuanced and multi-faceted understanding of deterrence. Perhaps in no case is this more apt than threats in cyberspace. This article contends that there is no single way to deter an adversary's cyber operations. Rather, different actors and even different acts are subject to varying kinds of deterrence. Therefore, states must build a multi-faceted strategy to approach the cyber domain.\nThe argument consists of three steps. First, drawing on notions of deterrence that exist outside the Cold War, including in counterterrorism and law enforcement contexts, this article introduces the two main ways in which deterrence can vary: how much a threat must be deterred, which is correlated inexactly with its severity, and whether a specific actor is to be deterred or a large group. Second, it then places each variable onto a spectrum along an axis to construct a two dimensional model of types of deterrence. Different threats in cyberspace fit into different parts of\nBen Buchanan is a PhD student focusing on cybersecurity and national strategy at King's College London, where he is a Marshall Scholar. He graduated from Georgetown University in 2011 and received his Masters from Georgetown in Security Studies in 2013. He is a certified computer forensic analyst.\n[130] Georgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nthe model depending on their characteristics. Lastly, it describes how these forms of deterrence can together form the basis of a mosaic strategy for achieving realistic deterrence in cyberspace—and for recognizing where deterrence is not fully possible.\nBefore proceeding, it is worth clarifying an important definition: cyber deterrence is the art of deterring an adversary's cyber operations. It should not imply that a state's own cyber capabilities must be used in this effort. Indeed, a key part of the argument presented here is that the decision to launch a particular cyber operation can be predicated on factors that are entirely removed from cyberspace, including other military goals, the political context, potential consequences for individual actors, and more. Tools in these other areas thus can contribute to effective cyber deterrence.\n# Different Types of Deterrence.\nDeterrence—the art of making another actor decide not to do something because of the threat of reprisal—is a concept that predates even the idea of statehood. As such, it is best to examine it in ways not bound to modern international relations. Drawing on work on deterring crime and political violence, Thomas Rid, amongst others, argues that there are two main theoretical distinctions between different types of deterrence. These two distinctions are particularly useful in their application to cyberspace.[1]\nFirst, deterrence can be specific or it can be general. Deterrence against a specific threat involves crafting a set of punishments designed to respond\nto a specific action by a specific actor. Presumably, these consequences are tailored to cause meaningful pain to the actor.[2] General deterrence, in contrast, is the crafting of a set of punishments that are not targeted to any individual actor, but which could apply to any individual from a large and broadly-defined group of actors, should he or she perform an undesirable action. General deterrence often involves making an example of those who act in objectionable ways for others to see.\nSecond, deterrence can be absolute or restrictive. Absolute deterrence seeks to prevent any deviant behavior of a particularly damaging sort, such as the launch of nuclear weapons. Restrictive deterrence seeks to encourage other actors to moderate their behavior in either quantity or quality in order to reduce the likelihood of consequences. A simplistic understanding of deterrence rejects this distinction between restrictive deterrence and absolute deterrence. It states that every transgression should be deterred fully, and, if committed, punished massively. While attractive in its simplicity, such a model is not credible or effective.[3] Is a state really willing to use kinetic weapons to punish a relatively minor transgression like espionage against a mid-tier target? It is also undesirable because it poses escalatory risks. If a state is going to disproportionately retaliate against a relatively minor offense, it should not expect its retaliation to go unanswered. As a general rule, then, actors more often want to absolutely deter severe threats and\nInternational Engagement on Cyber IV [131]\nBUCHANAN Military Matters\nare more credible when they communicate this desire. There is at least one exception: they might wish to deter actions that in themselves are not especially harmful, but could either provide the basis for greater destabilization or set a dangerous precedent.\nIn this two dimensional model, the United States' Cold War deterrence strategy that is so familiar to modern international relations the\nApplying the Model to Cyber Operations. The two theoretical distinctions—specific versus general and absolute versus restrictive—can be plotted on two axes to form a two dimensional model, as below. Note that the most restrictive, but not absolute, point occurs just as the y-axis values turn negative; the lowest values of the y-axis are for activities where restrictive deterrence minimally applies.\nory is in fact just one type of deterrence against one type of threat: absolute deterrence against the specific Soviet nuclear threat. This type of absolute and specific deterrence is alive and well today, given the nuclear deterrent many nations possess. It has only narrow utility, however, when applied to cyber operations. A more nuanced approach is required because many different threats exist in the cyber domain.\nFor any given class of threats, such as those posed by cyber operations, an actor can create a model to visualize what it seeks to deter. Some threats might be discrete points on the chart—where the actor and threat are known—while others are best represented as boxes, with heights and widths that reflect variability either in the specificity of the actor or the severity of the threat. Given the uncertainty of cyber operations, most will fall into this class.\nFor example, a model for the\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nUnited States might look something like what is below.⁴ To be clear, this version is for purely illustrative purposes based on public domain information. Actual threat analysis would incorporate classified information and could well come to different conclusions. This model does not currently include a provision for assessing the relative likelihood of each threat, as threats either meet a threshold for inclusion or are left out entirely. To show some indication of relative likelihood, boxes and points can be given varying degrees of opacity. Limited discussion of each box follows below.\nthat cause widespread blackouts to the power grid, disable critical military systems like the Global Positioning System, or otherwise have significant or lethal physical consequences. China is often theorized as an actor with the sophistication to perform such an attack, and some speculate that its activities have been aimed at refining this capability.⁷\nRussian Strategic Computer Network Attack: A Russian computer network attack might be similar to above in terms of its severity, but Russia is a different actor with a different set of calculations. In addition, the\nChinese Strategic Computer Network Attack: There is no shortage of writers and strategists warning of the dangers of a strategic computer network attack, though skeptics question the likelihood.⁵,⁶ Certainly, though, the damage of such an attack, if it were possible, could be immense. Activities in this category include attacks\nRussians might choose an entirely different target. For example, they might be more inclined to target the American financial system, since they trade significantly less with the United States.⁸ Thus, from an American perspective, what deters the Chinese might not deter the Russians, and vice versa.\nInternational Engagement on Cyber IV [133]\nBUCHANAN Military Matters\nNorth Korean Strategic Computer Network Attack: In theory, a strategic network attack need not come from an adversary with a heavy reliance on computers. Though it is unlikely North Korean computer network attack capabilities could match the Chinese or Russians in their lethality, the state has shown some willingness to use computer network attacks in the past, primarily against South Korea. Since North Korea has relatively few cyber assets of its own to serve as the targets of American retaliation, and is internationally ostracized, the United States will again have to consider deterrence differently.\nIranian Operational Computer Network Attack: According to reports, the Iranians conducted the Shamoon attack against an American ally, as well as other direct attacks against American financial companies.[10] The available reporting suggests the attacks against U.S. firms were less severe than the Shamoon operation. It remains unclear if the Iranians' failure to truly impact the American financial system was due to a lack of capability or the effects of restrictive deterrence.\nChinese Computer Network Exploitation: While the dangers of Chinese network exploitation are widely reported, they are unquestionably less immediate than the imagined devastating strategic computer network attacks.[11] They therefore receive less of an absolute deterrent. This box refers to the best hackers directly associated and under the control of\nthe Chinese intelligence and military services. They thus may be open to certain models of deterrence aimed at Chinese decision-makers.\nChinese Patriotic Hackers Computer Network Exploitation: There are reports of a number of hacking groups acting in concert with general Chinese interests without direct affiliations with the Chinese government.[12] In their exploitation of American (and other) networks, these groups are not primary under the control of the Chinese decision-makers, but may in some ways be protected by them. They have their own capabilities, which can be assumed to be less than those of the best Chinese military and intelligence units, and their own incentives. They thus are deterred differently, and may be more suited to a general rather than specific approach.\nAnonymous Computer Network Exploitation and Attack: The independent hacking group Anonymous, along with offshoots such as LulzSec, has demonstrated a willingness to hack American government entities, financial providers, and universities.[13] Their computer network attacks are reasonably unsophisticated—mostly minor denial of service attacks—although some of their exploitation operations have been effective, such as those against Stratfor and HB Gary.[14] Given that they are an ad-hoc collective, they are primarily subject to general deterrence.\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nFinancial Fraud by computer criminals: There are a large number of mostly faceless computer criminals who make money through identity fraud, so-called ransomware, and surreptitious Bitcoin mining. They frequently target Americans. While they can pose an economic nuisance and can be deeply detrimental to individuals, they are not of primary concern to American national security policymakers.\nThe Mosaic of Cyber Deterrence—and Its Limits. Every deterrence strategy begins with attribution. Without it, the entire discussion is moot. Since attribution is a complex problem worthy of its own detailed discussion, this paper accepts the assertion of American policymakers that the United States can perform attribution when targeted with a cyber operation. Certainly, recent American rhetoric and actions has been designed to draw attention to its attribution capabilities, with an eye to creating foundations for deterrence. Prominent examples of this are former Secretary of Defense Leon Panetta's bold claim that, \"Potential aggressors should be aware that the United States has the capacity to locate them and to hold them accountable for their actions...\" and the indictment of five Chinese hackers believed to be affiliated with the Chinese People's Liberation Army.[15, 16]\nEven when a state's attribution capabilities are known, there is no single dominant strategy that meets each cyber challenge. Rather, the United States should construct a\nmosaic of different deterrence strategies to confront the full spectrum of cyber threats. The differences in these assorted types of deterrence loosely correspond to the four quadrants of the model. Even so, cyber deterrence alone is incomplete. Policymakers must advance defensive measures as well.\nStrategic computer network attack, spanning the top two quadrants, can be deterred in two ways. It can first be deterred with the threat of a retaliatory computer network attack, in the same way second strike capabilities were positioned during the Cold War. This relies on the existence of realistic and sufficiently important targets to strike with a cyber attack.\nIf no such targets exist, the United States can employ the second method of deterrence: kinetic equivalency. This doctrine states that the attacked state will deploy its conventional kinetic arsenal to retaliate for a cyber attack. It is particularly useful for deterring states that do not have many cyber targets, like North Korea, or that could, in extreme circumstances, potentially disconnect themselves from the internet, like China. The United States has already made such a declaration of equivalency.[17] Whether it is viewed credibly is hard to know, as no state has yet tested it. Other states without the overwhelming power-projecting capabilities of the American military might find this doctrine hard to promulgate credibly.\nSince kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence\nInternational Engagement on Cyber IV [135]\nBUCHANAN Military Matters\nmosaic. Operational cyber attacks by a specific enemy that are not strategic in their outcome, such as the Iranian attack against the American financial system in 2012, fall in the bottom right quadrant. They are\nintrusion. Indeed, most intrusions go undetected for months, if not years, a challenge to the foundation of attribution on which deterrence is based.[18] Second, states suffering exploitation are unlikely to be the\n# Since kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence mosaic.\ntherefore subject to more restrictive deterrence. According to the mosaic model, an adversary who launched this kind of attack should suffer some consequences, but not as severe consequences as one that launched a strategic attack. Examples of such mid-tier punishments include diplomatic protest, isolation from internet governance bodies, and black-holing of internet traffic from a targeted range of IP addresses. Policymakers have the option of clearly spelling out their \"red lines\"—essentially, what is in the top right quadrant and what is in the bottom right—or of leaving them deliberately ambiguous, with the hope of deterring a broader range of activity than they are actually willing to punish.\nDeterring exploitation by states and those who are their direct agents is much harder (this group is also mostly in the bottom right quadrant, with some small overlap into the top right). First, exploiters may feel they are less likely to suffer deterrence because there is no immediate damage to alert the adversary of an\nfirst to launch an attack in response. Nevertheless, some forms of deterrence can be theorized.\nFor actors directly linked to the state, such as sophisticated foreign intelligence agencies, it may be possible to communicate, potentially in secret, some gradations of severity. Doing so can provide some narrow absolute deterrence and a greater deal of restrictive deterrence. For example, any exploitation or attack that potentially might harm America's nuclear umbrella could prompt a fiercer response than economic espionage. In this way, then, even sophisticated foreign entities directly linked to the government could be directed away from the most serious targets. Deterring their activities against less critical, but still deeply important, targets is much more difficult. Some restrictive deterrence is still possible, such as sanctions or indictments if economic espionage crosses a certain level.\nIn the case of hackers loosely affiliated with an adversary's government (who, because they are sometimes known and sometimes unknown,\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nmostly span the bottom two quadrants), some combination of narrow absolute deterrence and restrictive deterrence is necessary, but not sufficient. These hackers, absent formal government protection, must be careful not to go too far, lest the targeted country retaliate against them and their host government decline to protect them. As a result, they are likely to avoid some targets entirely and employ the utmost discretion when hitting others. There are limits to this restrictive deterrence, however, and limits to how well absolute deterrence can be communicated when the threat is more general. Such deterrence is based in large part on the hacking group's collective and self-reinforcing perceptions. It is unlikely to be effective\nthrough the framework of traditional criminology. Here, the goal of the state should be to achieve maximum deterrence while recognizing that it can never truly eliminate the threat. The state should focus on identifying the truly capable hackers who pose a legitimate threat and apply restrictive deterrence to them, discouraging them from high value targets. In the short history of these hacking groups, these sophisticated hackers have thus far focused on exploitation against mid-tier targets, which may reflect their ideology, capability, or successful restrictive deterrence. Because it is difficult to identify in advance who poses a threat, the state should employ techniques from general deterrence used in traditional criminology. It should\n**Thoughtful use** of positive incentives...may better contrast the punishments and encourage hackers to be economically productive for the state rather than a thorn in its side.\nin stopping them from exploiting mid-tier targets, since the hackers are presumably protected enough by their government to withstand any response, minimal as they believe it is likely to be.\nIn the above model of cyber threats facing the United States, two sets of hackers not even loosely affiliated with a state comprise threats in the bottom left quadrant. Hackers not associated with any state but instead motivated by political intention, like Anonymous, are best viewed\nuse the punishments it delivers to some hackers as a warning to others, taking care to be proportional in these punishments. There is one key difference between these hackers and other criminals: while theft and murder have little social value, those with computer skills can be useful to the state. Thoughtful use of positive incentives—some of which may be political in nature, such as minor concessions on political grievances—may better contrast the punishments and encourage hackers to be eco\nInternational Engagement on Cyber IV [137]\nBUCHANAN Military Matters\nnomically productive for the state rather than a thorn in its side.\nHackers not associated with any state and motivated by money, such as identity thieves, are nearly impossible to absolutely deter. When such hackers are overseas, their own governments may have willful ignorance of their activities. In the long run, this group should be approached with traditional restrictive deterrence. This probably means attempting to set up agreements of international cooperation to make it more difficult to escape punishment. In the short run, where prosecution is possible it should be pursued, but the United States will likely have to recognize the limits of its power to deter in this regard.\n**Conclusion: The Limits of Deterrence.** There are significant limits to even the best mosaic of cyber deterrence. Given the amount of computer fraud, state-sponsored exploitation, potentially-state-sponsored\nexploitation, and hacking collective activity against the United States, restrictive deterrence is at best a necessary but insufficient solution. Absolute deterrence thus far seems to fare better, but it is difficult to prove a negative, especially while the possibility of strategic computer network attack is subject to such debate. A final conclusion, then, is that the mosaic must be accompanied by strong cybersecurity practice. This includes, but is not limited to, careful network monitoring, patching, and penetration testing.\nThese defensive countermeasures should have two main goals. First is keeping general adversaries, such as Anonymous, from being able to conduct strategic attacks. Absolute deterrence may not be as effective against them, because there is little of value to retaliate against, because attribution is particularly difficult, or because they simply might not care about the consequences of retaliation. Second is minimizing the\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nharm that adversaries who are only subject to restrictive deterrence, such as patriotic exploiters in China or operational attackers in Iran, can do. The figure below summarizes the barrier and downward pressure these defensive measures are designed to create.\nThis focus on defensive measures alongside deterrence is a break from the traditional understanding of deterrence in international relations. Historically, in situations that call primarily for absolute and specific deterrence—such as the Cold War—excessive defensive measures can be destabilizing because they hamper an adversary's ability to perform a second strike. In that case, preserving stability was more important than defense and so anti-ballistic missiles were mutually banned. In the case of cyber deterrence, as in criminology, defense is not destabilizing. There are\ntwo main reasons for this. First, further escalation—to kinetic weaponry—is always possible, so the fear of a devastating first cyber strike that renders a powerful state like the United States or China unable to respond does not apply. Second, it is easy, and obviously correct, to justify any defensive cyber measures as a means of supplementing restrictive deterrence. Such countermeasures are widely accepted and broadly recommended—though certainly not always implemented fully—so their presence is not questioned. Defenses, coupled with a smart mosaic of deterrence, are therefore a key part of keeping cyberspace safe.\nThe author would like to thank Professor Thomas Rid of King's College London for reading an earlier draft of this article.\nInternational Engagement on Cyber IV [139]\nBUCHANAN Military Matters",
  "references": [
    "# NOTES\n1. Rid, T. \"Deterrence Beyond the State. The Israeli Experience.\" *Contemporary Security Policy*, April, vol 33, iss 1, p. 124-147. 2012. DOI:10.1080/13523260.2012.659593\n2. In some constructions specific deterrence can require actually enacting the punishment. In international relations, however, where the punishments are likely to have grave and broad consequences, this seems unreasonable. Instead, specific deterrence in international relations relies on credible communication of consequences to the deterred actor, which requires knowing specifically who the actor is.\n3. Shavell, Steven. \"A Note on Marginal Deterrence.\" *International Review of Law and Economics*. 1992. 12, 345-355.\n4. A similar model could be constructed by the Chinese or Russians regarding American activity in cyberspace. The American model is presented here because, based on public reporting, it appears the United States faces a broad range of threats, while the Chinese and Russians are likely targeted most prominently by the United States' National Security Agency. Further, there is simply more public reporting on the range of threats facing the United States.\n5. \"Remarks by Secretary Panetta on Cybersecurity to the Business Executives for National Security, New York City.\" Department of Defense. http://www.defense.gov/transcripts/transcript.aspx?transcriptid=5136 Panetta's Cyber Pearl Harbor speech.\n6. Rid, Thomas. Cyber War Will Not Take Place. 2013. Oxford University Press.\n7. Capaccio, Tony and Bliss, Jeff. \"Chinese Military Suspected in Hacker Attacks on U.S. Satellites.\" *Businessweek*. 27 October 2011. http://www.businessweek.com/news/2011-10-27/chinese-military-suspected-in-hacker-attacks-on-u-s-satellites.html\n8. \"U.S. Trade in Goods by Country.\" US Census Bureau. http://www.census.gov/foreign-trade/balance/.\n9. \"North Korea 'behind cyber attack' on South websites.\" *BBC News*. 10 July 2013. http://www.bbc.co.uk/news/world-asia-23324172\n10. Perlroth, Nicole. \"In Cyberattack on Saudi Firm, U.S. Sees Iran Firing Back.\" *New York Times*. 23 October, 2012. http://www.nytimes.com/2012/10/24/business/global/cyberattack-on-saudi-oil-firm-disquiets-us.html?pagewanted=all. Gorman, Siobhan and Barnes, Julian. \"Iran Blamed for Cyberattacks.\" *The Wall Street Journal*. 12 October 2012. http://online.wsj.com/news/articles/SB10000872396390444657804578052931555576700\n11. Clarke, Richard. \"How China Steals Our Secrets.\" *New York Times*. 2 April 2012. http://www.nytimes.com/2012/04/03/opinion/how-china-steals-our-secrets.html. See also \"APT1.\" Mandiant. 18 February 2013. http://intelreport.mandiant.com/Mandiant_APT1_Report.pdf\n12. For one example, see Markoff, John. \"Vast Spy System Loots Computers in 103 Countries\". *New York Times*. 28 March 2009. http://www.nytimes.com/2009/03/29/technology/29spy.html\n13. Wakefield, Jane. \"Anonymous Wikileaks supporters explain web attacks.\" *BBC News*. 10 December 2010. http://www.bbc.co.uk/news/technology-11971259. Kao, Joanna and Solomon, Ethan. \"Anonymous Hacks MIT.\" The Tech. 15 January 2013. http://tech.mit.edu/VI32/N61/anonymous.html. Sheets, Connor. \"NSA Website Down Following Apparent DDoS Attack Possibly By Anonymous Or A Foreign Government.\" International Business Times. 25 October 2013. http://www.ibtimes.com/ns-a-website-down=following-apparent-ddos-attack=possibly-anonymous-or-foreign-government-1442452.\n14. Anderson, Nate. \"Anonymous vs. HBGary: the aftermath.\" *Ars Technica*. 25 February 2011. http://arstechnica.com/tech-policy/2011/02/anonymous-vs-hbgary-the-aftermath/. Meyers, Michelle. \"Report Details Extent of Anonymous Hack of Stratfor.\" CNET. 27 December 2011. http://www.cnet.com/news/report-details-extent-of-anonymous-hack-on-stratfor/\n15. \"Remarks by Secretary Panetta on Cybersecurity to the Business Executives for National Security, New York City.\" Department of Defense. http://www.defense.gov/transcripts/transcript.aspx?transcriptid=5136 Panetta's Cyber Pearl Harbor speech.\n16. Schmidt, Michael and Sanger, David. \"5 in China Army Face U.S. Charges of Cyberattacks.\" *New York Times*. 19 May 2014. http://eng.chinamil.com.cn/news-channels/china-military-news/2014-06/30/content_6025789.htm.\n17. Gorman, Siobhan and Barnes, Julian. \"Cyber Combat: Act of War.\" *Wall Street Journal*. 31 March 2011. http://online.wsj.com/news/articles/SB10001424052702304563104576355623135782718\n18. The median number of days until detection is 243. \"Mandiant Releases Annual Threat Report on Advanced Targeted Attacks.\" *Mandiant*. 13 March 2013. https://www.mandiant.com/media-room/release/mandiant-releases-annual-threat-report-on-advanced-targeted-attackst/\nGeorgetown Journal of International Affairs"
  ],
  "flat_text": "HEINONLINE\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\n# Cyber Deterrence Isn't MAD; It's Mosaic\n## Ben Buchanan\nDeterrence is always associated most strongly with Mutually Assured Destruction and nuclear weapons. Nevertheless, the fading memory of the Cold War should not leave a monolithic concept of deterrence as its legacy. In facing new threats and new actors, governments must develop a more nuanced and multi-faceted understanding of deterrence. Perhaps in no case is this more apt than threats in cyberspace. This article contends that there is no single way to deter an adversary's cyber operations. Rather, different actors and even different acts are subject to varying kinds of deterrence. Therefore, states must build a multi-faceted strategy to approach the cyber domain.\nThe argument consists of three steps. First, drawing on notions of deterrence that exist outside the Cold War, including in counterterrorism and law enforcement contexts, this article introduces the two main ways in which deterrence can vary: how much a threat must be deterred, which is correlated inexactly with its severity, and whether a specific actor is to be deterred or a large group. Second, it then places each variable onto a spectrum along an axis to construct a two dimensional model of types of deterrence. Different threats in cyberspace fit into different parts of\nBen Buchanan is a PhD student focusing on cybersecurity and national strategy at King's College London, where he is a Marshall Scholar. He graduated from Georgetown University in 2011 and received his Masters from Georgetown in Security Studies in 2013. He is a certified computer forensic analyst.\n Georgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nthe model depending on their characteristics. Lastly, it describes how these forms of deterrence can together form the basis of a mosaic strategy for achieving realistic deterrence in cyberspace—and for recognizing where deterrence is not fully possible.\nBefore proceeding, it is worth clarifying an important definition: cyber deterrence is the art of deterring an adversary's cyber operations. It should not imply that a state's own cyber capabilities must be used in this effort. Indeed, a key part of the argument presented here is that the decision to launch a particular cyber operation can be predicated on factors that are entirely removed from cyberspace, including other military goals, the political context, potential consequences for individual actors, and more. Tools in these other areas thus can contribute to effective cyber deterrence.\n# Different Types of Deterrence.\nDeterrence—the art of making another actor decide not to do something because of the threat of reprisal—is a concept that predates even the idea of statehood. As such, it is best to examine it in ways not bound to modern international relations. Drawing on work on deterring crime and political violence, Thomas Rid, amongst others, argues that there are two main theoretical distinctions between different types of deterrence. These two distinctions are particularly useful in their application to cyberspace.\nFirst, deterrence can be specific or it can be general. Deterrence against a specific threat involves crafting a set of punishments designed to respond\nto a specific action by a specific actor. Presumably, these consequences are tailored to cause meaningful pain to the actor. General deterrence, in contrast, is the crafting of a set of punishments that are not targeted to any individual actor, but which could apply to any individual from a large and broadly-defined group of actors, should he or she perform an undesirable action. General deterrence often involves making an example of those who act in objectionable ways for others to see.\nSecond, deterrence can be absolute or restrictive. Absolute deterrence seeks to prevent any deviant behavior of a particularly damaging sort, such as the launch of nuclear weapons. Restrictive deterrence seeks to encourage other actors to moderate their behavior in either quantity or quality in order to reduce the likelihood of consequences. A simplistic understanding of deterrence rejects this distinction between restrictive deterrence and absolute deterrence. It states that every transgression should be deterred fully, and, if committed, punished massively. While attractive in its simplicity, such a model is not credible or effective. Is a state really willing to use kinetic weapons to punish a relatively minor transgression like espionage against a mid-tier target? It is also undesirable because it poses escalatory risks. If a state is going to disproportionately retaliate against a relatively minor offense, it should not expect its retaliation to go unanswered. As a general rule, then, actors more often want to absolutely deter severe threats and\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nare more credible when they communicate this desire. There is at least one exception: they might wish to deter actions that in themselves are not especially harmful, but could either provide the basis for greater destabilization or set a dangerous precedent.\nIn this two dimensional model, the United States' Cold War deterrence strategy that is so familiar to modern international relations the\nApplying the Model to Cyber Operations. The two theoretical distinctions—specific versus general and absolute versus restrictive—can be plotted on two axes to form a two dimensional model, as below. Note that the most restrictive, but not absolute, point occurs just as the y-axis values turn negative; the lowest values of the y-axis are for activities where restrictive deterrence minimally applies.\nory is in fact just one type of deterrence against one type of threat: absolute deterrence against the specific Soviet nuclear threat. This type of absolute and specific deterrence is alive and well today, given the nuclear deterrent many nations possess. It has only narrow utility, however, when applied to cyber operations. A more nuanced approach is required because many different threats exist in the cyber domain.\nFor any given class of threats, such as those posed by cyber operations, an actor can create a model to visualize what it seeks to deter. Some threats might be discrete points on the chart—where the actor and threat are known—while others are best represented as boxes, with heights and widths that reflect variability either in the specificity of the actor or the severity of the threat. Given the uncertainty of cyber operations, most will fall into this class.\nFor example, a model for the\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nUnited States might look something like what is below.⁴ To be clear, this version is for purely illustrative purposes based on public domain information. Actual threat analysis would incorporate classified information and could well come to different conclusions. This model does not currently include a provision for assessing the relative likelihood of each threat, as threats either meet a threshold for inclusion or are left out entirely. To show some indication of relative likelihood, boxes and points can be given varying degrees of opacity. Limited discussion of each box follows below.\nthat cause widespread blackouts to the power grid, disable critical military systems like the Global Positioning System, or otherwise have significant or lethal physical consequences. China is often theorized as an actor with the sophistication to perform such an attack, and some speculate that its activities have been aimed at refining this capability.⁷\nRussian Strategic Computer Network Attack: A Russian computer network attack might be similar to above in terms of its severity, but Russia is a different actor with a different set of calculations. In addition, the\nChinese Strategic Computer Network Attack: There is no shortage of writers and strategists warning of the dangers of a strategic computer network attack, though skeptics question the likelihood.⁵,⁶ Certainly, though, the damage of such an attack, if it were possible, could be immense. Activities in this category include attacks\nRussians might choose an entirely different target. For example, they might be more inclined to target the American financial system, since they trade significantly less with the United States.⁸ Thus, from an American perspective, what deters the Chinese might not deter the Russians, and vice versa.\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nNorth Korean Strategic Computer Network Attack: In theory, a strategic network attack need not come from an adversary with a heavy reliance on computers. Though it is unlikely North Korean computer network attack capabilities could match the Chinese or Russians in their lethality, the state has shown some willingness to use computer network attacks in the past, primarily against South Korea. Since North Korea has relatively few cyber assets of its own to serve as the targets of American retaliation, and is internationally ostracized, the United States will again have to consider deterrence differently.\nIranian Operational Computer Network Attack: According to reports, the Iranians conducted the Shamoon attack against an American ally, as well as other direct attacks against American financial companies. The available reporting suggests the attacks against U.S. firms were less severe than the Shamoon operation. It remains unclear if the Iranians' failure to truly impact the American financial system was due to a lack of capability or the effects of restrictive deterrence.\nChinese Computer Network Exploitation: While the dangers of Chinese network exploitation are widely reported, they are unquestionably less immediate than the imagined devastating strategic computer network attacks. They therefore receive less of an absolute deterrent. This box refers to the best hackers directly associated and under the control of\nthe Chinese intelligence and military services. They thus may be open to certain models of deterrence aimed at Chinese decision-makers.\nChinese Patriotic Hackers Computer Network Exploitation: There are reports of a number of hacking groups acting in concert with general Chinese interests without direct affiliations with the Chinese government. In their exploitation of American (and other) networks, these groups are not primary under the control of the Chinese decision-makers, but may in some ways be protected by them. They have their own capabilities, which can be assumed to be less than those of the best Chinese military and intelligence units, and their own incentives. They thus are deterred differently, and may be more suited to a general rather than specific approach.\nAnonymous Computer Network Exploitation and Attack: The independent hacking group Anonymous, along with offshoots such as LulzSec, has demonstrated a willingness to hack American government entities, financial providers, and universities. Their computer network attacks are reasonably unsophisticated—mostly minor denial of service attacks—although some of their exploitation operations have been effective, such as those against Stratfor and HB Gary. Given that they are an ad-hoc collective, they are primarily subject to general deterrence.\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nFinancial Fraud by computer criminals: There are a large number of mostly faceless computer criminals who make money through identity fraud, so-called ransomware, and surreptitious Bitcoin mining. They frequently target Americans. While they can pose an economic nuisance and can be deeply detrimental to individuals, they are not of primary concern to American national security policymakers.\nThe Mosaic of Cyber Deterrence—and Its Limits. Every deterrence strategy begins with attribution. Without it, the entire discussion is moot. Since attribution is a complex problem worthy of its own detailed discussion, this paper accepts the assertion of American policymakers that the United States can perform attribution when targeted with a cyber operation. Certainly, recent American rhetoric and actions has been designed to draw attention to its attribution capabilities, with an eye to creating foundations for deterrence. Prominent examples of this are former Secretary of Defense Leon Panetta's bold claim that, \"Potential aggressors should be aware that the United States has the capacity to locate them and to hold them accountable for their actions...\" and the indictment of five Chinese hackers believed to be affiliated with the Chinese People's Liberation Army.\nEven when a state's attribution capabilities are known, there is no single dominant strategy that meets each cyber challenge. Rather, the United States should construct a\nmosaic of different deterrence strategies to confront the full spectrum of cyber threats. The differences in these assorted types of deterrence loosely correspond to the four quadrants of the model. Even so, cyber deterrence alone is incomplete. Policymakers must advance defensive measures as well.\nStrategic computer network attack, spanning the top two quadrants, can be deterred in two ways. It can first be deterred with the threat of a retaliatory computer network attack, in the same way second strike capabilities were positioned during the Cold War. This relies on the existence of realistic and sufficiently important targets to strike with a cyber attack.\nIf no such targets exist, the United States can employ the second method of deterrence: kinetic equivalency. This doctrine states that the attacked state will deploy its conventional kinetic arsenal to retaliate for a cyber attack. It is particularly useful for deterring states that do not have many cyber targets, like North Korea, or that could, in extreme circumstances, potentially disconnect themselves from the internet, like China. The United States has already made such a declaration of equivalency. Whether it is viewed credibly is hard to know, as no state has yet tested it. Other states without the overwhelming power-projecting capabilities of the American military might find this doctrine hard to promulgate credibly.\nSince kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nmosaic. Operational cyber attacks by a specific enemy that are not strategic in their outcome, such as the Iranian attack against the American financial system in 2012, fall in the bottom right quadrant. They are\nintrusion. Indeed, most intrusions go undetected for months, if not years, a challenge to the foundation of attribution on which deterrence is based. Second, states suffering exploitation are unlikely to be the\n# Since kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence mosaic.\ntherefore subject to more restrictive deterrence. According to the mosaic model, an adversary who launched this kind of attack should suffer some consequences, but not as severe consequences as one that launched a strategic attack. Examples of such mid-tier punishments include diplomatic protest, isolation from internet governance bodies, and black-holing of internet traffic from a targeted range of IP addresses. Policymakers have the option of clearly spelling out their \"red lines\"—essentially, what is in the top right quadrant and what is in the bottom right—or of leaving them deliberately ambiguous, with the hope of deterring a broader range of activity than they are actually willing to punish.\nDeterring exploitation by states and those who are their direct agents is much harder (this group is also mostly in the bottom right quadrant, with some small overlap into the top right). First, exploiters may feel they are less likely to suffer deterrence because there is no immediate damage to alert the adversary of an\nfirst to launch an attack in response. Nevertheless, some forms of deterrence can be theorized.\nFor actors directly linked to the state, such as sophisticated foreign intelligence agencies, it may be possible to communicate, potentially in secret, some gradations of severity. Doing so can provide some narrow absolute deterrence and a greater deal of restrictive deterrence. For example, any exploitation or attack that potentially might harm America's nuclear umbrella could prompt a fiercer response than economic espionage. In this way, then, even sophisticated foreign entities directly linked to the government could be directed away from the most serious targets. Deterring their activities against less critical, but still deeply important, targets is much more difficult. Some restrictive deterrence is still possible, such as sanctions or indictments if economic espionage crosses a certain level.\nIn the case of hackers loosely affiliated with an adversary's government (who, because they are sometimes known and sometimes unknown,\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nmostly span the bottom two quadrants), some combination of narrow absolute deterrence and restrictive deterrence is necessary, but not sufficient. These hackers, absent formal government protection, must be careful not to go too far, lest the targeted country retaliate against them and their host government decline to protect them. As a result, they are likely to avoid some targets entirely and employ the utmost discretion when hitting others. There are limits to this restrictive deterrence, however, and limits to how well absolute deterrence can be communicated when the threat is more general. Such deterrence is based in large part on the hacking group's collective and self-reinforcing perceptions. It is unlikely to be effective\nthrough the framework of traditional criminology. Here, the goal of the state should be to achieve maximum deterrence while recognizing that it can never truly eliminate the threat. The state should focus on identifying the truly capable hackers who pose a legitimate threat and apply restrictive deterrence to them, discouraging them from high value targets. In the short history of these hacking groups, these sophisticated hackers have thus far focused on exploitation against mid-tier targets, which may reflect their ideology, capability, or successful restrictive deterrence. Because it is difficult to identify in advance who poses a threat, the state should employ techniques from general deterrence used in traditional criminology. It should\n**Thoughtful use** of positive incentives...may better contrast the punishments and encourage hackers to be economically productive for the state rather than a thorn in its side.\nin stopping them from exploiting mid-tier targets, since the hackers are presumably protected enough by their government to withstand any response, minimal as they believe it is likely to be.\nIn the above model of cyber threats facing the United States, two sets of hackers not even loosely affiliated with a state comprise threats in the bottom left quadrant. Hackers not associated with any state but instead motivated by political intention, like Anonymous, are best viewed\nuse the punishments it delivers to some hackers as a warning to others, taking care to be proportional in these punishments. There is one key difference between these hackers and other criminals: while theft and murder have little social value, those with computer skills can be useful to the state. Thoughtful use of positive incentives—some of which may be political in nature, such as minor concessions on political grievances—may better contrast the punishments and encourage hackers to be eco\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nnomically productive for the state rather than a thorn in its side.\nHackers not associated with any state and motivated by money, such as identity thieves, are nearly impossible to absolutely deter. When such hackers are overseas, their own governments may have willful ignorance of their activities. In the long run, this group should be approached with traditional restrictive deterrence. This probably means attempting to set up agreements of international cooperation to make it more difficult to escape punishment. In the short run, where prosecution is possible it should be pursued, but the United States will likely have to recognize the limits of its power to deter in this regard.\n**Conclusion: The Limits of Deterrence.** There are significant limits to even the best mosaic of cyber deterrence. Given the amount of computer fraud, state-sponsored exploitation, potentially-state-sponsored\nexploitation, and hacking collective activity against the United States, restrictive deterrence is at best a necessary but insufficient solution. Absolute deterrence thus far seems to fare better, but it is difficult to prove a negative, especially while the possibility of strategic computer network attack is subject to such debate. A final conclusion, then, is that the mosaic must be accompanied by strong cybersecurity practice. This includes, but is not limited to, careful network monitoring, patching, and penetration testing.\nThese defensive countermeasures should have two main goals. First is keeping general adversaries, such as Anonymous, from being able to conduct strategic attacks. Absolute deterrence may not be as effective against them, because there is little of value to retaliate against, because attribution is particularly difficult, or because they simply might not care about the consequences of retaliation. Second is minimizing the\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nharm that adversaries who are only subject to restrictive deterrence, such as patriotic exploiters in China or operational attackers in Iran, can do. The figure below summarizes the barrier and downward pressure these defensive measures are designed to create.\nThis focus on defensive measures alongside deterrence is a break from the traditional understanding of deterrence in international relations. Historically, in situations that call primarily for absolute and specific deterrence—such as the Cold War—excessive defensive measures can be destabilizing because they hamper an adversary's ability to perform a second strike. In that case, preserving stability was more important than defense and so anti-ballistic missiles were mutually banned. In the case of cyber deterrence, as in criminology, defense is not destabilizing. There are\ntwo main reasons for this. First, further escalation—to kinetic weaponry—is always possible, so the fear of a devastating first cyber strike that renders a powerful state like the United States or China unable to respond does not apply. Second, it is easy, and obviously correct, to justify any defensive cyber measures as a means of supplementing restrictive deterrence. Such countermeasures are widely accepted and broadly recommended—though certainly not always implemented fully—so their presence is not questioned. Defenses, coupled with a smart mosaic of deterrence, are therefore a key part of keeping cyberspace safe.\nThe author would like to thank Professor Thomas Rid of King's College London for reading an earlier draft of this article.\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters",
  "citations": {
    "style": "numeric",
    "flat_text": "HEINONLINE\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\n# Cyber Deterrence Isn't MAD; It's Mosaic\n## Ben Buchanan\nDeterrence is always associated most strongly with Mutually Assured Destruction and nuclear weapons. Nevertheless, the fading memory of the Cold War should not leave a monolithic concept of deterrence as its legacy. In facing new threats and new actors, governments must develop a more nuanced and multi-faceted understanding of deterrence. Perhaps in no case is this more apt than threats in cyberspace. This article contends that there is no single way to deter an adversary's cyber operations. Rather, different actors and even different acts are subject to varying kinds of deterrence. Therefore, states must build a multi-faceted strategy to approach the cyber domain.\nThe argument consists of three steps. First, drawing on notions of deterrence that exist outside the Cold War, including in counterterrorism and law enforcement contexts, this article introduces the two main ways in which deterrence can vary: how much a threat must be deterred, which is correlated inexactly with its severity, and whether a specific actor is to be deterred or a large group. Second, it then places each variable onto a spectrum along an axis to construct a two dimensional model of types of deterrence. Different threats in cyberspace fit into different parts of\nBen Buchanan is a PhD student focusing on cybersecurity and national strategy at King's College London, where he is a Marshall Scholar. He graduated from Georgetown University in 2011 and received his Masters from Georgetown in Security Studies in 2013. He is a certified computer forensic analyst.\n Georgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nthe model depending on their characteristics. Lastly, it describes how these forms of deterrence can together form the basis of a mosaic strategy for achieving realistic deterrence in cyberspace—and for recognizing where deterrence is not fully possible.\nBefore proceeding, it is worth clarifying an important definition: cyber deterrence is the art of deterring an adversary's cyber operations. It should not imply that a state's own cyber capabilities must be used in this effort. Indeed, a key part of the argument presented here is that the decision to launch a particular cyber operation can be predicated on factors that are entirely removed from cyberspace, including other military goals, the political context, potential consequences for individual actors, and more. Tools in these other areas thus can contribute to effective cyber deterrence.\n# Different Types of Deterrence.\nDeterrence—the art of making another actor decide not to do something because of the threat of reprisal—is a concept that predates even the idea of statehood. As such, it is best to examine it in ways not bound to modern international relations. Drawing on work on deterring crime and political violence, Thomas Rid, amongst others, argues that there are two main theoretical distinctions between different types of deterrence. These two distinctions are particularly useful in their application to cyberspace.\nFirst, deterrence can be specific or it can be general. Deterrence against a specific threat involves crafting a set of punishments designed to respond\nto a specific action by a specific actor. Presumably, these consequences are tailored to cause meaningful pain to the actor. General deterrence, in contrast, is the crafting of a set of punishments that are not targeted to any individual actor, but which could apply to any individual from a large and broadly-defined group of actors, should he or she perform an undesirable action. General deterrence often involves making an example of those who act in objectionable ways for others to see.\nSecond, deterrence can be absolute or restrictive. Absolute deterrence seeks to prevent any deviant behavior of a particularly damaging sort, such as the launch of nuclear weapons. Restrictive deterrence seeks to encourage other actors to moderate their behavior in either quantity or quality in order to reduce the likelihood of consequences. A simplistic understanding of deterrence rejects this distinction between restrictive deterrence and absolute deterrence. It states that every transgression should be deterred fully, and, if committed, punished massively. While attractive in its simplicity, such a model is not credible or effective. Is a state really willing to use kinetic weapons to punish a relatively minor transgression like espionage against a mid-tier target? It is also undesirable because it poses escalatory risks. If a state is going to disproportionately retaliate against a relatively minor offense, it should not expect its retaliation to go unanswered. As a general rule, then, actors more often want to absolutely deter severe threats and\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nare more credible when they communicate this desire. There is at least one exception: they might wish to deter actions that in themselves are not especially harmful, but could either provide the basis for greater destabilization or set a dangerous precedent.\nIn this two dimensional model, the United States' Cold War deterrence strategy that is so familiar to modern international relations the\nApplying the Model to Cyber Operations. The two theoretical distinctions—specific versus general and absolute versus restrictive—can be plotted on two axes to form a two dimensional model, as below. Note that the most restrictive, but not absolute, point occurs just as the y-axis values turn negative; the lowest values of the y-axis are for activities where restrictive deterrence minimally applies.\nory is in fact just one type of deterrence against one type of threat: absolute deterrence against the specific Soviet nuclear threat. This type of absolute and specific deterrence is alive and well today, given the nuclear deterrent many nations possess. It has only narrow utility, however, when applied to cyber operations. A more nuanced approach is required because many different threats exist in the cyber domain.\nFor any given class of threats, such as those posed by cyber operations, an actor can create a model to visualize what it seeks to deter. Some threats might be discrete points on the chart—where the actor and threat are known—while others are best represented as boxes, with heights and widths that reflect variability either in the specificity of the actor or the severity of the threat. Given the uncertainty of cyber operations, most will fall into this class.\nFor example, a model for the\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nUnited States might look something like what is below.⁴ To be clear, this version is for purely illustrative purposes based on public domain information. Actual threat analysis would incorporate classified information and could well come to different conclusions. This model does not currently include a provision for assessing the relative likelihood of each threat, as threats either meet a threshold for inclusion or are left out entirely. To show some indication of relative likelihood, boxes and points can be given varying degrees of opacity. Limited discussion of each box follows below.\nthat cause widespread blackouts to the power grid, disable critical military systems like the Global Positioning System, or otherwise have significant or lethal physical consequences. China is often theorized as an actor with the sophistication to perform such an attack, and some speculate that its activities have been aimed at refining this capability.⁷\nRussian Strategic Computer Network Attack: A Russian computer network attack might be similar to above in terms of its severity, but Russia is a different actor with a different set of calculations. In addition, the\nChinese Strategic Computer Network Attack: There is no shortage of writers and strategists warning of the dangers of a strategic computer network attack, though skeptics question the likelihood.⁵,⁶ Certainly, though, the damage of such an attack, if it were possible, could be immense. Activities in this category include attacks\nRussians might choose an entirely different target. For example, they might be more inclined to target the American financial system, since they trade significantly less with the United States.⁸ Thus, from an American perspective, what deters the Chinese might not deter the Russians, and vice versa.\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nNorth Korean Strategic Computer Network Attack: In theory, a strategic network attack need not come from an adversary with a heavy reliance on computers. Though it is unlikely North Korean computer network attack capabilities could match the Chinese or Russians in their lethality, the state has shown some willingness to use computer network attacks in the past, primarily against South Korea. Since North Korea has relatively few cyber assets of its own to serve as the targets of American retaliation, and is internationally ostracized, the United States will again have to consider deterrence differently.\nIranian Operational Computer Network Attack: According to reports, the Iranians conducted the Shamoon attack against an American ally, as well as other direct attacks against American financial companies. The available reporting suggests the attacks against U.S. firms were less severe than the Shamoon operation. It remains unclear if the Iranians' failure to truly impact the American financial system was due to a lack of capability or the effects of restrictive deterrence.\nChinese Computer Network Exploitation: While the dangers of Chinese network exploitation are widely reported, they are unquestionably less immediate than the imagined devastating strategic computer network attacks. They therefore receive less of an absolute deterrent. This box refers to the best hackers directly associated and under the control of\nthe Chinese intelligence and military services. They thus may be open to certain models of deterrence aimed at Chinese decision-makers.\nChinese Patriotic Hackers Computer Network Exploitation: There are reports of a number of hacking groups acting in concert with general Chinese interests without direct affiliations with the Chinese government. In their exploitation of American (and other) networks, these groups are not primary under the control of the Chinese decision-makers, but may in some ways be protected by them. They have their own capabilities, which can be assumed to be less than those of the best Chinese military and intelligence units, and their own incentives. They thus are deterred differently, and may be more suited to a general rather than specific approach.\nAnonymous Computer Network Exploitation and Attack: The independent hacking group Anonymous, along with offshoots such as LulzSec, has demonstrated a willingness to hack American government entities, financial providers, and universities. Their computer network attacks are reasonably unsophisticated—mostly minor denial of service attacks—although some of their exploitation operations have been effective, such as those against Stratfor and HB Gary. Given that they are an ad-hoc collective, they are primarily subject to general deterrence.\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nFinancial Fraud by computer criminals: There are a large number of mostly faceless computer criminals who make money through identity fraud, so-called ransomware, and surreptitious Bitcoin mining. They frequently target Americans. While they can pose an economic nuisance and can be deeply detrimental to individuals, they are not of primary concern to American national security policymakers.\nThe Mosaic of Cyber Deterrence—and Its Limits. Every deterrence strategy begins with attribution. Without it, the entire discussion is moot. Since attribution is a complex problem worthy of its own detailed discussion, this paper accepts the assertion of American policymakers that the United States can perform attribution when targeted with a cyber operation. Certainly, recent American rhetoric and actions has been designed to draw attention to its attribution capabilities, with an eye to creating foundations for deterrence. Prominent examples of this are former Secretary of Defense Leon Panetta's bold claim that, \"Potential aggressors should be aware that the United States has the capacity to locate them and to hold them accountable for their actions...\" and the indictment of five Chinese hackers believed to be affiliated with the Chinese People's Liberation Army.\nEven when a state's attribution capabilities are known, there is no single dominant strategy that meets each cyber challenge. Rather, the United States should construct a\nmosaic of different deterrence strategies to confront the full spectrum of cyber threats. The differences in these assorted types of deterrence loosely correspond to the four quadrants of the model. Even so, cyber deterrence alone is incomplete. Policymakers must advance defensive measures as well.\nStrategic computer network attack, spanning the top two quadrants, can be deterred in two ways. It can first be deterred with the threat of a retaliatory computer network attack, in the same way second strike capabilities were positioned during the Cold War. This relies on the existence of realistic and sufficiently important targets to strike with a cyber attack.\nIf no such targets exist, the United States can employ the second method of deterrence: kinetic equivalency. This doctrine states that the attacked state will deploy its conventional kinetic arsenal to retaliate for a cyber attack. It is particularly useful for deterring states that do not have many cyber targets, like North Korea, or that could, in extreme circumstances, potentially disconnect themselves from the internet, like China. The United States has already made such a declaration of equivalency. Whether it is viewed credibly is hard to know, as no state has yet tested it. Other states without the overwhelming power-projecting capabilities of the American military might find this doctrine hard to promulgate credibly.\nSince kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nmosaic. Operational cyber attacks by a specific enemy that are not strategic in their outcome, such as the Iranian attack against the American financial system in 2012, fall in the bottom right quadrant. They are\nintrusion. Indeed, most intrusions go undetected for months, if not years, a challenge to the foundation of attribution on which deterrence is based. Second, states suffering exploitation are unlikely to be the\n# Since kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence mosaic.\ntherefore subject to more restrictive deterrence. According to the mosaic model, an adversary who launched this kind of attack should suffer some consequences, but not as severe consequences as one that launched a strategic attack. Examples of such mid-tier punishments include diplomatic protest, isolation from internet governance bodies, and black-holing of internet traffic from a targeted range of IP addresses. Policymakers have the option of clearly spelling out their \"red lines\"—essentially, what is in the top right quadrant and what is in the bottom right—or of leaving them deliberately ambiguous, with the hope of deterring a broader range of activity than they are actually willing to punish.\nDeterring exploitation by states and those who are their direct agents is much harder (this group is also mostly in the bottom right quadrant, with some small overlap into the top right). First, exploiters may feel they are less likely to suffer deterrence because there is no immediate damage to alert the adversary of an\nfirst to launch an attack in response. Nevertheless, some forms of deterrence can be theorized.\nFor actors directly linked to the state, such as sophisticated foreign intelligence agencies, it may be possible to communicate, potentially in secret, some gradations of severity. Doing so can provide some narrow absolute deterrence and a greater deal of restrictive deterrence. For example, any exploitation or attack that potentially might harm America's nuclear umbrella could prompt a fiercer response than economic espionage. In this way, then, even sophisticated foreign entities directly linked to the government could be directed away from the most serious targets. Deterring their activities against less critical, but still deeply important, targets is much more difficult. Some restrictive deterrence is still possible, such as sanctions or indictments if economic espionage crosses a certain level.\nIn the case of hackers loosely affiliated with an adversary's government (who, because they are sometimes known and sometimes unknown,\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nmostly span the bottom two quadrants), some combination of narrow absolute deterrence and restrictive deterrence is necessary, but not sufficient. These hackers, absent formal government protection, must be careful not to go too far, lest the targeted country retaliate against them and their host government decline to protect them. As a result, they are likely to avoid some targets entirely and employ the utmost discretion when hitting others. There are limits to this restrictive deterrence, however, and limits to how well absolute deterrence can be communicated when the threat is more general. Such deterrence is based in large part on the hacking group's collective and self-reinforcing perceptions. It is unlikely to be effective\nthrough the framework of traditional criminology. Here, the goal of the state should be to achieve maximum deterrence while recognizing that it can never truly eliminate the threat. The state should focus on identifying the truly capable hackers who pose a legitimate threat and apply restrictive deterrence to them, discouraging them from high value targets. In the short history of these hacking groups, these sophisticated hackers have thus far focused on exploitation against mid-tier targets, which may reflect their ideology, capability, or successful restrictive deterrence. Because it is difficult to identify in advance who poses a threat, the state should employ techniques from general deterrence used in traditional criminology. It should\n**Thoughtful use** of positive incentives...may better contrast the punishments and encourage hackers to be economically productive for the state rather than a thorn in its side.\nin stopping them from exploiting mid-tier targets, since the hackers are presumably protected enough by their government to withstand any response, minimal as they believe it is likely to be.\nIn the above model of cyber threats facing the United States, two sets of hackers not even loosely affiliated with a state comprise threats in the bottom left quadrant. Hackers not associated with any state but instead motivated by political intention, like Anonymous, are best viewed\nuse the punishments it delivers to some hackers as a warning to others, taking care to be proportional in these punishments. There is one key difference between these hackers and other criminals: while theft and murder have little social value, those with computer skills can be useful to the state. Thoughtful use of positive incentives—some of which may be political in nature, such as minor concessions on political grievances—may better contrast the punishments and encourage hackers to be eco\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nnomically productive for the state rather than a thorn in its side.\nHackers not associated with any state and motivated by money, such as identity thieves, are nearly impossible to absolutely deter. When such hackers are overseas, their own governments may have willful ignorance of their activities. In the long run, this group should be approached with traditional restrictive deterrence. This probably means attempting to set up agreements of international cooperation to make it more difficult to escape punishment. In the short run, where prosecution is possible it should be pursued, but the United States will likely have to recognize the limits of its power to deter in this regard.\n**Conclusion: The Limits of Deterrence.** There are significant limits to even the best mosaic of cyber deterrence. Given the amount of computer fraud, state-sponsored exploitation, potentially-state-sponsored\nexploitation, and hacking collective activity against the United States, restrictive deterrence is at best a necessary but insufficient solution. Absolute deterrence thus far seems to fare better, but it is difficult to prove a negative, especially while the possibility of strategic computer network attack is subject to such debate. A final conclusion, then, is that the mosaic must be accompanied by strong cybersecurity practice. This includes, but is not limited to, careful network monitoring, patching, and penetration testing.\nThese defensive countermeasures should have two main goals. First is keeping general adversaries, such as Anonymous, from being able to conduct strategic attacks. Absolute deterrence may not be as effective against them, because there is little of value to retaliate against, because attribution is particularly difficult, or because they simply might not care about the consequences of retaliation. Second is minimizing the\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nharm that adversaries who are only subject to restrictive deterrence, such as patriotic exploiters in China or operational attackers in Iran, can do. The figure below summarizes the barrier and downward pressure these defensive measures are designed to create.\nThis focus on defensive measures alongside deterrence is a break from the traditional understanding of deterrence in international relations. Historically, in situations that call primarily for absolute and specific deterrence—such as the Cold War—excessive defensive measures can be destabilizing because they hamper an adversary's ability to perform a second strike. In that case, preserving stability was more important than defense and so anti-ballistic missiles were mutually banned. In the case of cyber deterrence, as in criminology, defense is not destabilizing. There are\ntwo main reasons for this. First, further escalation—to kinetic weaponry—is always possible, so the fear of a devastating first cyber strike that renders a powerful state like the United States or China unable to respond does not apply. Second, it is easy, and obviously correct, to justify any defensive cyber measures as a means of supplementing restrictive deterrence. Such countermeasures are widely accepted and broadly recommended—though certainly not always implemented fully—so their presence is not questioned. Defenses, coupled with a smart mosaic of deterrence, are therefore a key part of keeping cyberspace safe.\nThe author would like to thank Professor Thomas Rid of King's College London for reading an earlier draft of this article.\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 12,
        "success_occurrences": 12,
        "success_unique": 12,
        "bib_unique_total": 18,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.6666666666666666,
        "success_percentage": 100.0,
        "style": "numeric"
      },
      "results": [
        {
          "index": "1",
          "intext_citation": "[1]",
          "preceding_text": "These two distinctions are particularly useful in their application to cyberspace.",
          "footnote": "Rid, T. \"Deterrence Beyond the State. The Israeli Experience.\" *Contemporary Security Policy*, April, vol 33, iss 1, p. 124-147. 2012. DOI:10.1080/13523260.2012.659593"
        },
        {
          "index": "2",
          "intext_citation": "[2]",
          "preceding_text": "Presumably, these consequences are tailored to cause meaningful pain to the actor.",
          "footnote": "In some constructions specific deterrence can require actually enacting the punishment. In international relations, however, where the punishments are likely to have grave and broad consequences, this seems unreasonable. Instead, specific deterrence in international relations relies on credible communication of consequences to the deterred actor, which requires knowing specifically who the actor is."
        },
        {
          "index": "3",
          "intext_citation": "[3]",
          "preceding_text": "It states that every transgression should be deterred fully, and, if committed, punished massively. While attractive in its simplicity, such a model is not credible or effective.",
          "footnote": "Shavell, Steven. \"A Note on Marginal Deterrence.\" *International Review of Law and Economics*. 1992. 12, 345-355."
        },
        {
          "index": "10",
          "intext_citation": "[10]",
          "preceding_text": "Iranian Operational Computer Network Attack: According to reports, the Iranians conducted the Shamoon attack against an American ally, as well as other direct attacks against American financial companies.",
          "footnote": "Perlroth, Nicole. \"In Cyberattack on Saudi Firm, U.S. Sees Iran Firing Back.\" *New York Times*. 23 October, 2012. http://www.nytimes.com/2012/10/24/business/global/cyberattack-on-saudi-oil-firm-disquiets-us.html?pagewanted=all. Gorman, Siobhan and Barnes, Julian. \"Iran Blamed for Cyberattacks.\" *The Wall Street Journal*. 12 October 2012. http://online.wsj.com/news/articles/SB10000872396390444657804578052931555576700"
        },
        {
          "index": "11",
          "intext_citation": "[11]",
          "preceding_text": "Chinese Computer Network Exploitation: While the dangers of Chinese network exploitation are widely reported, they are unquestionably less immediate than the imagined devastating strategic computer network attacks.",
          "footnote": "Clarke, Richard. \"How China Steals Our Secrets.\" *New York Times*. 2 April 2012. http://www.nytimes.com/2012/04/03/opinion/how-china-steals-our-secrets.html. See also \"APT1.\" Mandiant. 18 February 2013. http://intelreport.mandiant.com/Mandiant_APT1_Report.pdf"
        },
        {
          "index": "12",
          "intext_citation": "[12]",
          "preceding_text": "Chinese Patriotic Hackers Computer Network Exploitation: There are reports of a number of hacking groups acting in concert with general Chinese interests without direct affiliations with the Chinese government.",
          "footnote": "For one example, see Markoff, John. \"Vast Spy System Loots Computers in 103 Countries\". *New York Times*. 28 March 2009. http://www.nytimes.com/2009/03/29/technology/29spy.html"
        },
        {
          "index": "13",
          "intext_citation": "[13]",
          "preceding_text": "Network Exploitation and Attack: The independent hacking group Anonymous, along with offshoots such as LulzSec, has demonstrated a willingness to hack American government entities, financial providers, and universities.",
          "footnote": "Wakefield, Jane. \"Anonymous Wikileaks supporters explain web attacks.\" *BBC News*. 10 December 2010. http://www.bbc.co.uk/news/technology-11971259. Kao, Joanna and Solomon, Ethan. \"Anonymous Hacks MIT.\" The Tech. 15 January 2013. http://tech.mit.edu/VI32/N61/anonymous.html. Sheets, Connor. \"NSA Website Down Following Apparent DDoS Attack Possibly By Anonymous Or A Foreign Government.\" International Business Times. 25 October 2013. http://www.ibtimes.com/ns-a-website-down=following-apparent-ddos-attack=possibly-anonymous-or-foreign-government-1442452."
        },
        {
          "index": "14",
          "intext_citation": "[14]",
          "preceding_text": "es.[13] Their computer network attacks are reasonably unsophisticated—mostly minor denial of service attacks—although some of their exploitation operations have been effective, such as those against Stratfor and HB Gary.",
          "footnote": "Anderson, Nate. \"Anonymous vs. HBGary: the aftermath.\" *Ars Technica*. 25 February 2011. http://arstechnica.com/tech-policy/2011/02/anonymous-vs-hbgary-the-aftermath/. Meyers, Michelle. \"Report Details Extent of Anonymous Hack of Stratfor.\" CNET. 27 December 2011. http://www.cnet.com/news/report-details-extent-of-anonymous-hack-on-stratfor/"
        },
        {
          "index": "15",
          "intext_citation": "[15, 16]",
          "preceding_text": "re that the United States has the capacity to locate them and to hold them accountable for their actions...\" and the indictment of five Chinese hackers believed to be affiliated with the Chinese People's Liberation Army.",
          "footnote": "\"Remarks by Secretary Panetta on Cybersecurity to the Business Executives for National Security, New York City.\" Department of Defense. http://www.defense.gov/transcripts/transcript.aspx?transcriptid=5136 Panetta's Cyber Pearl Harbor speech."
        },
        {
          "index": "16",
          "intext_citation": "[15, 16]",
          "preceding_text": "re that the United States has the capacity to locate them and to hold them accountable for their actions...\" and the indictment of five Chinese hackers believed to be affiliated with the Chinese People's Liberation Army.",
          "footnote": "Schmidt, Michael and Sanger, David. \"5 in China Army Face U.S. Charges of Cyberattacks.\" *New York Times*. 19 May 2014. http://eng.chinamil.com.cn/news-channels/china-military-news/2014-06/30/content_6025789.htm."
        },
        {
          "index": "17",
          "intext_citation": "[17]",
          "preceding_text": "The United States has already made such a declaration of equivalency.",
          "footnote": "Gorman, Siobhan and Barnes, Julian. \"Cyber Combat: Act of War.\" *Wall Street Journal*. 31 March 2011. http://online.wsj.com/news/articles/SB10001424052702304563104576355623135782718"
        },
        {
          "index": "18",
          "intext_citation": "[18]",
          "preceding_text": "Indeed, most intrusions go undetected for months, if not years, a challenge to the foundation of attribution on which deterrence is based.",
          "footnote": "The median number of days until detection is 243. \"Mandiant Releases Annual Threat Report on Advanced Targeted Attacks.\" *Mandiant*. 13 March 2013. https://www.mandiant.com/media-room/release/mandiant-releases-annual-threat-report-on-advanced-targeted-attackst/ Georgetown Journal of International Affairs"
        }
      ],
      "flat_text": "HEINONLINE\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\n# Cyber Deterrence Isn't MAD; It's Mosaic\n## Ben Buchanan\nDeterrence is always associated most strongly with Mutually Assured Destruction and nuclear weapons. Nevertheless, the fading memory of the Cold War should not leave a monolithic concept of deterrence as its legacy. In facing new threats and new actors, governments must develop a more nuanced and multi-faceted understanding of deterrence. Perhaps in no case is this more apt than threats in cyberspace. This article contends that there is no single way to deter an adversary's cyber operations. Rather, different actors and even different acts are subject to varying kinds of deterrence. Therefore, states must build a multi-faceted strategy to approach the cyber domain.\nThe argument consists of three steps. First, drawing on notions of deterrence that exist outside the Cold War, including in counterterrorism and law enforcement contexts, this article introduces the two main ways in which deterrence can vary: how much a threat must be deterred, which is correlated inexactly with its severity, and whether a specific actor is to be deterred or a large group. Second, it then places each variable onto a spectrum along an axis to construct a two dimensional model of types of deterrence. Different threats in cyberspace fit into different parts of\nBen Buchanan is a PhD student focusing on cybersecurity and national strategy at King's College London, where he is a Marshall Scholar. He graduated from Georgetown University in 2011 and received his Masters from Georgetown in Security Studies in 2013. He is a certified computer forensic analyst.\n Georgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nthe model depending on their characteristics. Lastly, it describes how these forms of deterrence can together form the basis of a mosaic strategy for achieving realistic deterrence in cyberspace—and for recognizing where deterrence is not fully possible.\nBefore proceeding, it is worth clarifying an important definition: cyber deterrence is the art of deterring an adversary's cyber operations. It should not imply that a state's own cyber capabilities must be used in this effort. Indeed, a key part of the argument presented here is that the decision to launch a particular cyber operation can be predicated on factors that are entirely removed from cyberspace, including other military goals, the political context, potential consequences for individual actors, and more. Tools in these other areas thus can contribute to effective cyber deterrence.\n# Different Types of Deterrence.\nDeterrence—the art of making another actor decide not to do something because of the threat of reprisal—is a concept that predates even the idea of statehood. As such, it is best to examine it in ways not bound to modern international relations. Drawing on work on deterring crime and political violence, Thomas Rid, amongst others, argues that there are two main theoretical distinctions between different types of deterrence. These two distinctions are particularly useful in their application to cyberspace.\nFirst, deterrence can be specific or it can be general. Deterrence against a specific threat involves crafting a set of punishments designed to respond\nto a specific action by a specific actor. Presumably, these consequences are tailored to cause meaningful pain to the actor. General deterrence, in contrast, is the crafting of a set of punishments that are not targeted to any individual actor, but which could apply to any individual from a large and broadly-defined group of actors, should he or she perform an undesirable action. General deterrence often involves making an example of those who act in objectionable ways for others to see.\nSecond, deterrence can be absolute or restrictive. Absolute deterrence seeks to prevent any deviant behavior of a particularly damaging sort, such as the launch of nuclear weapons. Restrictive deterrence seeks to encourage other actors to moderate their behavior in either quantity or quality in order to reduce the likelihood of consequences. A simplistic understanding of deterrence rejects this distinction between restrictive deterrence and absolute deterrence. It states that every transgression should be deterred fully, and, if committed, punished massively. While attractive in its simplicity, such a model is not credible or effective. Is a state really willing to use kinetic weapons to punish a relatively minor transgression like espionage against a mid-tier target? It is also undesirable because it poses escalatory risks. If a state is going to disproportionately retaliate against a relatively minor offense, it should not expect its retaliation to go unanswered. As a general rule, then, actors more often want to absolutely deter severe threats and\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nare more credible when they communicate this desire. There is at least one exception: they might wish to deter actions that in themselves are not especially harmful, but could either provide the basis for greater destabilization or set a dangerous precedent.\nIn this two dimensional model, the United States' Cold War deterrence strategy that is so familiar to modern international relations the\nApplying the Model to Cyber Operations. The two theoretical distinctions—specific versus general and absolute versus restrictive—can be plotted on two axes to form a two dimensional model, as below. Note that the most restrictive, but not absolute, point occurs just as the y-axis values turn negative; the lowest values of the y-axis are for activities where restrictive deterrence minimally applies.\nory is in fact just one type of deterrence against one type of threat: absolute deterrence against the specific Soviet nuclear threat. This type of absolute and specific deterrence is alive and well today, given the nuclear deterrent many nations possess. It has only narrow utility, however, when applied to cyber operations. A more nuanced approach is required because many different threats exist in the cyber domain.\nFor any given class of threats, such as those posed by cyber operations, an actor can create a model to visualize what it seeks to deter. Some threats might be discrete points on the chart—where the actor and threat are known—while others are best represented as boxes, with heights and widths that reflect variability either in the specificity of the actor or the severity of the threat. Given the uncertainty of cyber operations, most will fall into this class.\nFor example, a model for the\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nUnited States might look something like what is below.⁴ To be clear, this version is for purely illustrative purposes based on public domain information. Actual threat analysis would incorporate classified information and could well come to different conclusions. This model does not currently include a provision for assessing the relative likelihood of each threat, as threats either meet a threshold for inclusion or are left out entirely. To show some indication of relative likelihood, boxes and points can be given varying degrees of opacity. Limited discussion of each box follows below.\nthat cause widespread blackouts to the power grid, disable critical military systems like the Global Positioning System, or otherwise have significant or lethal physical consequences. China is often theorized as an actor with the sophistication to perform such an attack, and some speculate that its activities have been aimed at refining this capability.⁷\nRussian Strategic Computer Network Attack: A Russian computer network attack might be similar to above in terms of its severity, but Russia is a different actor with a different set of calculations. In addition, the\nChinese Strategic Computer Network Attack: There is no shortage of writers and strategists warning of the dangers of a strategic computer network attack, though skeptics question the likelihood.⁵,⁶ Certainly, though, the damage of such an attack, if it were possible, could be immense. Activities in this category include attacks\nRussians might choose an entirely different target. For example, they might be more inclined to target the American financial system, since they trade significantly less with the United States.⁸ Thus, from an American perspective, what deters the Chinese might not deter the Russians, and vice versa.\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nNorth Korean Strategic Computer Network Attack: In theory, a strategic network attack need not come from an adversary with a heavy reliance on computers. Though it is unlikely North Korean computer network attack capabilities could match the Chinese or Russians in their lethality, the state has shown some willingness to use computer network attacks in the past, primarily against South Korea. Since North Korea has relatively few cyber assets of its own to serve as the targets of American retaliation, and is internationally ostracized, the United States will again have to consider deterrence differently.\nIranian Operational Computer Network Attack: According to reports, the Iranians conducted the Shamoon attack against an American ally, as well as other direct attacks against American financial companies. The available reporting suggests the attacks against U.S. firms were less severe than the Shamoon operation. It remains unclear if the Iranians' failure to truly impact the American financial system was due to a lack of capability or the effects of restrictive deterrence.\nChinese Computer Network Exploitation: While the dangers of Chinese network exploitation are widely reported, they are unquestionably less immediate than the imagined devastating strategic computer network attacks. They therefore receive less of an absolute deterrent. This box refers to the best hackers directly associated and under the control of\nthe Chinese intelligence and military services. They thus may be open to certain models of deterrence aimed at Chinese decision-makers.\nChinese Patriotic Hackers Computer Network Exploitation: There are reports of a number of hacking groups acting in concert with general Chinese interests without direct affiliations with the Chinese government. In their exploitation of American (and other) networks, these groups are not primary under the control of the Chinese decision-makers, but may in some ways be protected by them. They have their own capabilities, which can be assumed to be less than those of the best Chinese military and intelligence units, and their own incentives. They thus are deterred differently, and may be more suited to a general rather than specific approach.\nAnonymous Computer Network Exploitation and Attack: The independent hacking group Anonymous, along with offshoots such as LulzSec, has demonstrated a willingness to hack American government entities, financial providers, and universities. Their computer network attacks are reasonably unsophisticated—mostly minor denial of service attacks—although some of their exploitation operations have been effective, such as those against Stratfor and HB Gary. Given that they are an ad-hoc collective, they are primarily subject to general deterrence.\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nFinancial Fraud by computer criminals: There are a large number of mostly faceless computer criminals who make money through identity fraud, so-called ransomware, and surreptitious Bitcoin mining. They frequently target Americans. While they can pose an economic nuisance and can be deeply detrimental to individuals, they are not of primary concern to American national security policymakers.\nThe Mosaic of Cyber Deterrence—and Its Limits. Every deterrence strategy begins with attribution. Without it, the entire discussion is moot. Since attribution is a complex problem worthy of its own detailed discussion, this paper accepts the assertion of American policymakers that the United States can perform attribution when targeted with a cyber operation. Certainly, recent American rhetoric and actions has been designed to draw attention to its attribution capabilities, with an eye to creating foundations for deterrence. Prominent examples of this are former Secretary of Defense Leon Panetta's bold claim that, \"Potential aggressors should be aware that the United States has the capacity to locate them and to hold them accountable for their actions...\" and the indictment of five Chinese hackers believed to be affiliated with the Chinese People's Liberation Army.\nEven when a state's attribution capabilities are known, there is no single dominant strategy that meets each cyber challenge. Rather, the United States should construct a\nmosaic of different deterrence strategies to confront the full spectrum of cyber threats. The differences in these assorted types of deterrence loosely correspond to the four quadrants of the model. Even so, cyber deterrence alone is incomplete. Policymakers must advance defensive measures as well.\nStrategic computer network attack, spanning the top two quadrants, can be deterred in two ways. It can first be deterred with the threat of a retaliatory computer network attack, in the same way second strike capabilities were positioned during the Cold War. This relies on the existence of realistic and sufficiently important targets to strike with a cyber attack.\nIf no such targets exist, the United States can employ the second method of deterrence: kinetic equivalency. This doctrine states that the attacked state will deploy its conventional kinetic arsenal to retaliate for a cyber attack. It is particularly useful for deterring states that do not have many cyber targets, like North Korea, or that could, in extreme circumstances, potentially disconnect themselves from the internet, like China. The United States has already made such a declaration of equivalency. Whether it is viewed credibly is hard to know, as no state has yet tested it. Other states without the overwhelming power-projecting capabilities of the American military might find this doctrine hard to promulgate credibly.\nSince kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nmosaic. Operational cyber attacks by a specific enemy that are not strategic in their outcome, such as the Iranian attack against the American financial system in 2012, fall in the bottom right quadrant. They are\nintrusion. Indeed, most intrusions go undetected for months, if not years, a challenge to the foundation of attribution on which deterrence is based. Second, states suffering exploitation are unlikely to be the\n# Since kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence mosaic.\ntherefore subject to more restrictive deterrence. According to the mosaic model, an adversary who launched this kind of attack should suffer some consequences, but not as severe consequences as one that launched a strategic attack. Examples of such mid-tier punishments include diplomatic protest, isolation from internet governance bodies, and black-holing of internet traffic from a targeted range of IP addresses. Policymakers have the option of clearly spelling out their \"red lines\"—essentially, what is in the top right quadrant and what is in the bottom right—or of leaving them deliberately ambiguous, with the hope of deterring a broader range of activity than they are actually willing to punish.\nDeterring exploitation by states and those who are their direct agents is much harder (this group is also mostly in the bottom right quadrant, with some small overlap into the top right). First, exploiters may feel they are less likely to suffer deterrence because there is no immediate damage to alert the adversary of an\nfirst to launch an attack in response. Nevertheless, some forms of deterrence can be theorized.\nFor actors directly linked to the state, such as sophisticated foreign intelligence agencies, it may be possible to communicate, potentially in secret, some gradations of severity. Doing so can provide some narrow absolute deterrence and a greater deal of restrictive deterrence. For example, any exploitation or attack that potentially might harm America's nuclear umbrella could prompt a fiercer response than economic espionage. In this way, then, even sophisticated foreign entities directly linked to the government could be directed away from the most serious targets. Deterring their activities against less critical, but still deeply important, targets is much more difficult. Some restrictive deterrence is still possible, such as sanctions or indictments if economic espionage crosses a certain level.\nIn the case of hackers loosely affiliated with an adversary's government (who, because they are sometimes known and sometimes unknown,\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nmostly span the bottom two quadrants), some combination of narrow absolute deterrence and restrictive deterrence is necessary, but not sufficient. These hackers, absent formal government protection, must be careful not to go too far, lest the targeted country retaliate against them and their host government decline to protect them. As a result, they are likely to avoid some targets entirely and employ the utmost discretion when hitting others. There are limits to this restrictive deterrence, however, and limits to how well absolute deterrence can be communicated when the threat is more general. Such deterrence is based in large part on the hacking group's collective and self-reinforcing perceptions. It is unlikely to be effective\nthrough the framework of traditional criminology. Here, the goal of the state should be to achieve maximum deterrence while recognizing that it can never truly eliminate the threat. The state should focus on identifying the truly capable hackers who pose a legitimate threat and apply restrictive deterrence to them, discouraging them from high value targets. In the short history of these hacking groups, these sophisticated hackers have thus far focused on exploitation against mid-tier targets, which may reflect their ideology, capability, or successful restrictive deterrence. Because it is difficult to identify in advance who poses a threat, the state should employ techniques from general deterrence used in traditional criminology. It should\n**Thoughtful use** of positive incentives...may better contrast the punishments and encourage hackers to be economically productive for the state rather than a thorn in its side.\nin stopping them from exploiting mid-tier targets, since the hackers are presumably protected enough by their government to withstand any response, minimal as they believe it is likely to be.\nIn the above model of cyber threats facing the United States, two sets of hackers not even loosely affiliated with a state comprise threats in the bottom left quadrant. Hackers not associated with any state but instead motivated by political intention, like Anonymous, are best viewed\nuse the punishments it delivers to some hackers as a warning to others, taking care to be proportional in these punishments. There is one key difference between these hackers and other criminals: while theft and murder have little social value, those with computer skills can be useful to the state. Thoughtful use of positive incentives—some of which may be political in nature, such as minor concessions on political grievances—may better contrast the punishments and encourage hackers to be eco\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nnomically productive for the state rather than a thorn in its side.\nHackers not associated with any state and motivated by money, such as identity thieves, are nearly impossible to absolutely deter. When such hackers are overseas, their own governments may have willful ignorance of their activities. In the long run, this group should be approached with traditional restrictive deterrence. This probably means attempting to set up agreements of international cooperation to make it more difficult to escape punishment. In the short run, where prosecution is possible it should be pursued, but the United States will likely have to recognize the limits of its power to deter in this regard.\n**Conclusion: The Limits of Deterrence.** There are significant limits to even the best mosaic of cyber deterrence. Given the amount of computer fraud, state-sponsored exploitation, potentially-state-sponsored\nexploitation, and hacking collective activity against the United States, restrictive deterrence is at best a necessary but insufficient solution. Absolute deterrence thus far seems to fare better, but it is difficult to prove a negative, especially while the possibility of strategic computer network attack is subject to such debate. A final conclusion, then, is that the mosaic must be accompanied by strong cybersecurity practice. This includes, but is not limited to, careful network monitoring, patching, and penetration testing.\nThese defensive countermeasures should have two main goals. First is keeping general adversaries, such as Anonymous, from being able to conduct strategic attacks. Absolute deterrence may not be as effective against them, because there is little of value to retaliate against, because attribution is particularly difficult, or because they simply might not care about the consequences of retaliation. Second is minimizing the\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nharm that adversaries who are only subject to restrictive deterrence, such as patriotic exploiters in China or operational attackers in Iran, can do. The figure below summarizes the barrier and downward pressure these defensive measures are designed to create.\nThis focus on defensive measures alongside deterrence is a break from the traditional understanding of deterrence in international relations. Historically, in situations that call primarily for absolute and specific deterrence—such as the Cold War—excessive defensive measures can be destabilizing because they hamper an adversary's ability to perform a second strike. In that case, preserving stability was more important than defense and so anti-ballistic missiles were mutually banned. In the case of cyber deterrence, as in criminology, defense is not destabilizing. There are\ntwo main reasons for this. First, further escalation—to kinetic weaponry—is always possible, so the fear of a devastating first cyber strike that renders a powerful state like the United States or China unable to respond does not apply. Second, it is easy, and obviously correct, to justify any defensive cyber measures as a means of supplementing restrictive deterrence. Such countermeasures are widely accepted and broadly recommended—though certainly not always implemented fully—so their presence is not questioned. Defenses, coupled with a smart mosaic of deterrence, are therefore a key part of keeping cyberspace safe.\nThe author would like to thank Professor Thomas Rid of King's College London for reading an earlier draft of this article.\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters"
    },
    "numeric": {
      "total": {
        "intext_total": 12,
        "success_occurrences": 12,
        "success_unique": 12,
        "bib_unique_total": 18,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.6666666666666666,
        "success_percentage": 100.0,
        "style": "numeric"
      },
      "results": [
        {
          "index": "1",
          "intext_citation": "[1]",
          "preceding_text": "These two distinctions are particularly useful in their application to cyberspace.",
          "footnote": "Rid, T. \"Deterrence Beyond the State. The Israeli Experience.\" *Contemporary Security Policy*, April, vol 33, iss 1, p. 124-147. 2012. DOI:10.1080/13523260.2012.659593"
        },
        {
          "index": "2",
          "intext_citation": "[2]",
          "preceding_text": "Presumably, these consequences are tailored to cause meaningful pain to the actor.",
          "footnote": "In some constructions specific deterrence can require actually enacting the punishment. In international relations, however, where the punishments are likely to have grave and broad consequences, this seems unreasonable. Instead, specific deterrence in international relations relies on credible communication of consequences to the deterred actor, which requires knowing specifically who the actor is."
        },
        {
          "index": "3",
          "intext_citation": "[3]",
          "preceding_text": "It states that every transgression should be deterred fully, and, if committed, punished massively. While attractive in its simplicity, such a model is not credible or effective.",
          "footnote": "Shavell, Steven. \"A Note on Marginal Deterrence.\" *International Review of Law and Economics*. 1992. 12, 345-355."
        },
        {
          "index": "10",
          "intext_citation": "[10]",
          "preceding_text": "Iranian Operational Computer Network Attack: According to reports, the Iranians conducted the Shamoon attack against an American ally, as well as other direct attacks against American financial companies.",
          "footnote": "Perlroth, Nicole. \"In Cyberattack on Saudi Firm, U.S. Sees Iran Firing Back.\" *New York Times*. 23 October, 2012. http://www.nytimes.com/2012/10/24/business/global/cyberattack-on-saudi-oil-firm-disquiets-us.html?pagewanted=all. Gorman, Siobhan and Barnes, Julian. \"Iran Blamed for Cyberattacks.\" *The Wall Street Journal*. 12 October 2012. http://online.wsj.com/news/articles/SB10000872396390444657804578052931555576700"
        },
        {
          "index": "11",
          "intext_citation": "[11]",
          "preceding_text": "Chinese Computer Network Exploitation: While the dangers of Chinese network exploitation are widely reported, they are unquestionably less immediate than the imagined devastating strategic computer network attacks.",
          "footnote": "Clarke, Richard. \"How China Steals Our Secrets.\" *New York Times*. 2 April 2012. http://www.nytimes.com/2012/04/03/opinion/how-china-steals-our-secrets.html. See also \"APT1.\" Mandiant. 18 February 2013. http://intelreport.mandiant.com/Mandiant_APT1_Report.pdf"
        },
        {
          "index": "12",
          "intext_citation": "[12]",
          "preceding_text": "Chinese Patriotic Hackers Computer Network Exploitation: There are reports of a number of hacking groups acting in concert with general Chinese interests without direct affiliations with the Chinese government.",
          "footnote": "For one example, see Markoff, John. \"Vast Spy System Loots Computers in 103 Countries\". *New York Times*. 28 March 2009. http://www.nytimes.com/2009/03/29/technology/29spy.html"
        },
        {
          "index": "13",
          "intext_citation": "[13]",
          "preceding_text": "Network Exploitation and Attack: The independent hacking group Anonymous, along with offshoots such as LulzSec, has demonstrated a willingness to hack American government entities, financial providers, and universities.",
          "footnote": "Wakefield, Jane. \"Anonymous Wikileaks supporters explain web attacks.\" *BBC News*. 10 December 2010. http://www.bbc.co.uk/news/technology-11971259. Kao, Joanna and Solomon, Ethan. \"Anonymous Hacks MIT.\" The Tech. 15 January 2013. http://tech.mit.edu/VI32/N61/anonymous.html. Sheets, Connor. \"NSA Website Down Following Apparent DDoS Attack Possibly By Anonymous Or A Foreign Government.\" International Business Times. 25 October 2013. http://www.ibtimes.com/ns-a-website-down=following-apparent-ddos-attack=possibly-anonymous-or-foreign-government-1442452."
        },
        {
          "index": "14",
          "intext_citation": "[14]",
          "preceding_text": "es.[13] Their computer network attacks are reasonably unsophisticated—mostly minor denial of service attacks—although some of their exploitation operations have been effective, such as those against Stratfor and HB Gary.",
          "footnote": "Anderson, Nate. \"Anonymous vs. HBGary: the aftermath.\" *Ars Technica*. 25 February 2011. http://arstechnica.com/tech-policy/2011/02/anonymous-vs-hbgary-the-aftermath/. Meyers, Michelle. \"Report Details Extent of Anonymous Hack of Stratfor.\" CNET. 27 December 2011. http://www.cnet.com/news/report-details-extent-of-anonymous-hack-on-stratfor/"
        },
        {
          "index": "15",
          "intext_citation": "[15, 16]",
          "preceding_text": "re that the United States has the capacity to locate them and to hold them accountable for their actions...\" and the indictment of five Chinese hackers believed to be affiliated with the Chinese People's Liberation Army.",
          "footnote": "\"Remarks by Secretary Panetta on Cybersecurity to the Business Executives for National Security, New York City.\" Department of Defense. http://www.defense.gov/transcripts/transcript.aspx?transcriptid=5136 Panetta's Cyber Pearl Harbor speech."
        },
        {
          "index": "16",
          "intext_citation": "[15, 16]",
          "preceding_text": "re that the United States has the capacity to locate them and to hold them accountable for their actions...\" and the indictment of five Chinese hackers believed to be affiliated with the Chinese People's Liberation Army.",
          "footnote": "Schmidt, Michael and Sanger, David. \"5 in China Army Face U.S. Charges of Cyberattacks.\" *New York Times*. 19 May 2014. http://eng.chinamil.com.cn/news-channels/china-military-news/2014-06/30/content_6025789.htm."
        },
        {
          "index": "17",
          "intext_citation": "[17]",
          "preceding_text": "The United States has already made such a declaration of equivalency.",
          "footnote": "Gorman, Siobhan and Barnes, Julian. \"Cyber Combat: Act of War.\" *Wall Street Journal*. 31 March 2011. http://online.wsj.com/news/articles/SB10001424052702304563104576355623135782718"
        },
        {
          "index": "18",
          "intext_citation": "[18]",
          "preceding_text": "Indeed, most intrusions go undetected for months, if not years, a challenge to the foundation of attribution on which deterrence is based.",
          "footnote": "The median number of days until detection is 243. \"Mandiant Releases Annual Threat Report on Advanced Targeted Attacks.\" *Mandiant*. 13 March 2013. https://www.mandiant.com/media-room/release/mandiant-releases-annual-threat-report-on-advanced-targeted-attackst/ Georgetown Journal of International Affairs"
        }
      ],
      "flat_text": "HEINONLINE\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\n# Cyber Deterrence Isn't MAD; It's Mosaic\n## Ben Buchanan\nDeterrence is always associated most strongly with Mutually Assured Destruction and nuclear weapons. Nevertheless, the fading memory of the Cold War should not leave a monolithic concept of deterrence as its legacy. In facing new threats and new actors, governments must develop a more nuanced and multi-faceted understanding of deterrence. Perhaps in no case is this more apt than threats in cyberspace. This article contends that there is no single way to deter an adversary's cyber operations. Rather, different actors and even different acts are subject to varying kinds of deterrence. Therefore, states must build a multi-faceted strategy to approach the cyber domain.\nThe argument consists of three steps. First, drawing on notions of deterrence that exist outside the Cold War, including in counterterrorism and law enforcement contexts, this article introduces the two main ways in which deterrence can vary: how much a threat must be deterred, which is correlated inexactly with its severity, and whether a specific actor is to be deterred or a large group. Second, it then places each variable onto a spectrum along an axis to construct a two dimensional model of types of deterrence. Different threats in cyberspace fit into different parts of\nBen Buchanan is a PhD student focusing on cybersecurity and national strategy at King's College London, where he is a Marshall Scholar. He graduated from Georgetown University in 2011 and received his Masters from Georgetown in Security Studies in 2013. He is a certified computer forensic analyst.\n Georgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nthe model depending on their characteristics. Lastly, it describes how these forms of deterrence can together form the basis of a mosaic strategy for achieving realistic deterrence in cyberspace—and for recognizing where deterrence is not fully possible.\nBefore proceeding, it is worth clarifying an important definition: cyber deterrence is the art of deterring an adversary's cyber operations. It should not imply that a state's own cyber capabilities must be used in this effort. Indeed, a key part of the argument presented here is that the decision to launch a particular cyber operation can be predicated on factors that are entirely removed from cyberspace, including other military goals, the political context, potential consequences for individual actors, and more. Tools in these other areas thus can contribute to effective cyber deterrence.\n# Different Types of Deterrence.\nDeterrence—the art of making another actor decide not to do something because of the threat of reprisal—is a concept that predates even the idea of statehood. As such, it is best to examine it in ways not bound to modern international relations. Drawing on work on deterring crime and political violence, Thomas Rid, amongst others, argues that there are two main theoretical distinctions between different types of deterrence. These two distinctions are particularly useful in their application to cyberspace.\nFirst, deterrence can be specific or it can be general. Deterrence against a specific threat involves crafting a set of punishments designed to respond\nto a specific action by a specific actor. Presumably, these consequences are tailored to cause meaningful pain to the actor. General deterrence, in contrast, is the crafting of a set of punishments that are not targeted to any individual actor, but which could apply to any individual from a large and broadly-defined group of actors, should he or she perform an undesirable action. General deterrence often involves making an example of those who act in objectionable ways for others to see.\nSecond, deterrence can be absolute or restrictive. Absolute deterrence seeks to prevent any deviant behavior of a particularly damaging sort, such as the launch of nuclear weapons. Restrictive deterrence seeks to encourage other actors to moderate their behavior in either quantity or quality in order to reduce the likelihood of consequences. A simplistic understanding of deterrence rejects this distinction between restrictive deterrence and absolute deterrence. It states that every transgression should be deterred fully, and, if committed, punished massively. While attractive in its simplicity, such a model is not credible or effective. Is a state really willing to use kinetic weapons to punish a relatively minor transgression like espionage against a mid-tier target? It is also undesirable because it poses escalatory risks. If a state is going to disproportionately retaliate against a relatively minor offense, it should not expect its retaliation to go unanswered. As a general rule, then, actors more often want to absolutely deter severe threats and\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nare more credible when they communicate this desire. There is at least one exception: they might wish to deter actions that in themselves are not especially harmful, but could either provide the basis for greater destabilization or set a dangerous precedent.\nIn this two dimensional model, the United States' Cold War deterrence strategy that is so familiar to modern international relations the\nApplying the Model to Cyber Operations. The two theoretical distinctions—specific versus general and absolute versus restrictive—can be plotted on two axes to form a two dimensional model, as below. Note that the most restrictive, but not absolute, point occurs just as the y-axis values turn negative; the lowest values of the y-axis are for activities where restrictive deterrence minimally applies.\nory is in fact just one type of deterrence against one type of threat: absolute deterrence against the specific Soviet nuclear threat. This type of absolute and specific deterrence is alive and well today, given the nuclear deterrent many nations possess. It has only narrow utility, however, when applied to cyber operations. A more nuanced approach is required because many different threats exist in the cyber domain.\nFor any given class of threats, such as those posed by cyber operations, an actor can create a model to visualize what it seeks to deter. Some threats might be discrete points on the chart—where the actor and threat are known—while others are best represented as boxes, with heights and widths that reflect variability either in the specificity of the actor or the severity of the threat. Given the uncertainty of cyber operations, most will fall into this class.\nFor example, a model for the\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nUnited States might look something like what is below.⁴ To be clear, this version is for purely illustrative purposes based on public domain information. Actual threat analysis would incorporate classified information and could well come to different conclusions. This model does not currently include a provision for assessing the relative likelihood of each threat, as threats either meet a threshold for inclusion or are left out entirely. To show some indication of relative likelihood, boxes and points can be given varying degrees of opacity. Limited discussion of each box follows below.\nthat cause widespread blackouts to the power grid, disable critical military systems like the Global Positioning System, or otherwise have significant or lethal physical consequences. China is often theorized as an actor with the sophistication to perform such an attack, and some speculate that its activities have been aimed at refining this capability.⁷\nRussian Strategic Computer Network Attack: A Russian computer network attack might be similar to above in terms of its severity, but Russia is a different actor with a different set of calculations. In addition, the\nChinese Strategic Computer Network Attack: There is no shortage of writers and strategists warning of the dangers of a strategic computer network attack, though skeptics question the likelihood.⁵,⁶ Certainly, though, the damage of such an attack, if it were possible, could be immense. Activities in this category include attacks\nRussians might choose an entirely different target. For example, they might be more inclined to target the American financial system, since they trade significantly less with the United States.⁸ Thus, from an American perspective, what deters the Chinese might not deter the Russians, and vice versa.\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nNorth Korean Strategic Computer Network Attack: In theory, a strategic network attack need not come from an adversary with a heavy reliance on computers. Though it is unlikely North Korean computer network attack capabilities could match the Chinese or Russians in their lethality, the state has shown some willingness to use computer network attacks in the past, primarily against South Korea. Since North Korea has relatively few cyber assets of its own to serve as the targets of American retaliation, and is internationally ostracized, the United States will again have to consider deterrence differently.\nIranian Operational Computer Network Attack: According to reports, the Iranians conducted the Shamoon attack against an American ally, as well as other direct attacks against American financial companies. The available reporting suggests the attacks against U.S. firms were less severe than the Shamoon operation. It remains unclear if the Iranians' failure to truly impact the American financial system was due to a lack of capability or the effects of restrictive deterrence.\nChinese Computer Network Exploitation: While the dangers of Chinese network exploitation are widely reported, they are unquestionably less immediate than the imagined devastating strategic computer network attacks. They therefore receive less of an absolute deterrent. This box refers to the best hackers directly associated and under the control of\nthe Chinese intelligence and military services. They thus may be open to certain models of deterrence aimed at Chinese decision-makers.\nChinese Patriotic Hackers Computer Network Exploitation: There are reports of a number of hacking groups acting in concert with general Chinese interests without direct affiliations with the Chinese government. In their exploitation of American (and other) networks, these groups are not primary under the control of the Chinese decision-makers, but may in some ways be protected by them. They have their own capabilities, which can be assumed to be less than those of the best Chinese military and intelligence units, and their own incentives. They thus are deterred differently, and may be more suited to a general rather than specific approach.\nAnonymous Computer Network Exploitation and Attack: The independent hacking group Anonymous, along with offshoots such as LulzSec, has demonstrated a willingness to hack American government entities, financial providers, and universities. Their computer network attacks are reasonably unsophisticated—mostly minor denial of service attacks—although some of their exploitation operations have been effective, such as those against Stratfor and HB Gary. Given that they are an ad-hoc collective, they are primarily subject to general deterrence.\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nFinancial Fraud by computer criminals: There are a large number of mostly faceless computer criminals who make money through identity fraud, so-called ransomware, and surreptitious Bitcoin mining. They frequently target Americans. While they can pose an economic nuisance and can be deeply detrimental to individuals, they are not of primary concern to American national security policymakers.\nThe Mosaic of Cyber Deterrence—and Its Limits. Every deterrence strategy begins with attribution. Without it, the entire discussion is moot. Since attribution is a complex problem worthy of its own detailed discussion, this paper accepts the assertion of American policymakers that the United States can perform attribution when targeted with a cyber operation. Certainly, recent American rhetoric and actions has been designed to draw attention to its attribution capabilities, with an eye to creating foundations for deterrence. Prominent examples of this are former Secretary of Defense Leon Panetta's bold claim that, \"Potential aggressors should be aware that the United States has the capacity to locate them and to hold them accountable for their actions...\" and the indictment of five Chinese hackers believed to be affiliated with the Chinese People's Liberation Army.\nEven when a state's attribution capabilities are known, there is no single dominant strategy that meets each cyber challenge. Rather, the United States should construct a\nmosaic of different deterrence strategies to confront the full spectrum of cyber threats. The differences in these assorted types of deterrence loosely correspond to the four quadrants of the model. Even so, cyber deterrence alone is incomplete. Policymakers must advance defensive measures as well.\nStrategic computer network attack, spanning the top two quadrants, can be deterred in two ways. It can first be deterred with the threat of a retaliatory computer network attack, in the same way second strike capabilities were positioned during the Cold War. This relies on the existence of realistic and sufficiently important targets to strike with a cyber attack.\nIf no such targets exist, the United States can employ the second method of deterrence: kinetic equivalency. This doctrine states that the attacked state will deploy its conventional kinetic arsenal to retaliate for a cyber attack. It is particularly useful for deterring states that do not have many cyber targets, like North Korea, or that could, in extreme circumstances, potentially disconnect themselves from the internet, like China. The United States has already made such a declaration of equivalency. Whether it is viewed credibly is hard to know, as no state has yet tested it. Other states without the overwhelming power-projecting capabilities of the American military might find this doctrine hard to promulgate credibly.\nSince kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nmosaic. Operational cyber attacks by a specific enemy that are not strategic in their outcome, such as the Iranian attack against the American financial system in 2012, fall in the bottom right quadrant. They are\nintrusion. Indeed, most intrusions go undetected for months, if not years, a challenge to the foundation of attribution on which deterrence is based. Second, states suffering exploitation are unlikely to be the\n# Since kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence mosaic.\ntherefore subject to more restrictive deterrence. According to the mosaic model, an adversary who launched this kind of attack should suffer some consequences, but not as severe consequences as one that launched a strategic attack. Examples of such mid-tier punishments include diplomatic protest, isolation from internet governance bodies, and black-holing of internet traffic from a targeted range of IP addresses. Policymakers have the option of clearly spelling out their \"red lines\"—essentially, what is in the top right quadrant and what is in the bottom right—or of leaving them deliberately ambiguous, with the hope of deterring a broader range of activity than they are actually willing to punish.\nDeterring exploitation by states and those who are their direct agents is much harder (this group is also mostly in the bottom right quadrant, with some small overlap into the top right). First, exploiters may feel they are less likely to suffer deterrence because there is no immediate damage to alert the adversary of an\nfirst to launch an attack in response. Nevertheless, some forms of deterrence can be theorized.\nFor actors directly linked to the state, such as sophisticated foreign intelligence agencies, it may be possible to communicate, potentially in secret, some gradations of severity. Doing so can provide some narrow absolute deterrence and a greater deal of restrictive deterrence. For example, any exploitation or attack that potentially might harm America's nuclear umbrella could prompt a fiercer response than economic espionage. In this way, then, even sophisticated foreign entities directly linked to the government could be directed away from the most serious targets. Deterring their activities against less critical, but still deeply important, targets is much more difficult. Some restrictive deterrence is still possible, such as sanctions or indictments if economic espionage crosses a certain level.\nIn the case of hackers loosely affiliated with an adversary's government (who, because they are sometimes known and sometimes unknown,\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nmostly span the bottom two quadrants), some combination of narrow absolute deterrence and restrictive deterrence is necessary, but not sufficient. These hackers, absent formal government protection, must be careful not to go too far, lest the targeted country retaliate against them and their host government decline to protect them. As a result, they are likely to avoid some targets entirely and employ the utmost discretion when hitting others. There are limits to this restrictive deterrence, however, and limits to how well absolute deterrence can be communicated when the threat is more general. Such deterrence is based in large part on the hacking group's collective and self-reinforcing perceptions. It is unlikely to be effective\nthrough the framework of traditional criminology. Here, the goal of the state should be to achieve maximum deterrence while recognizing that it can never truly eliminate the threat. The state should focus on identifying the truly capable hackers who pose a legitimate threat and apply restrictive deterrence to them, discouraging them from high value targets. In the short history of these hacking groups, these sophisticated hackers have thus far focused on exploitation against mid-tier targets, which may reflect their ideology, capability, or successful restrictive deterrence. Because it is difficult to identify in advance who poses a threat, the state should employ techniques from general deterrence used in traditional criminology. It should\n**Thoughtful use** of positive incentives...may better contrast the punishments and encourage hackers to be economically productive for the state rather than a thorn in its side.\nin stopping them from exploiting mid-tier targets, since the hackers are presumably protected enough by their government to withstand any response, minimal as they believe it is likely to be.\nIn the above model of cyber threats facing the United States, two sets of hackers not even loosely affiliated with a state comprise threats in the bottom left quadrant. Hackers not associated with any state but instead motivated by political intention, like Anonymous, are best viewed\nuse the punishments it delivers to some hackers as a warning to others, taking care to be proportional in these punishments. There is one key difference between these hackers and other criminals: while theft and murder have little social value, those with computer skills can be useful to the state. Thoughtful use of positive incentives—some of which may be political in nature, such as minor concessions on political grievances—may better contrast the punishments and encourage hackers to be eco\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters\nnomically productive for the state rather than a thorn in its side.\nHackers not associated with any state and motivated by money, such as identity thieves, are nearly impossible to absolutely deter. When such hackers are overseas, their own governments may have willful ignorance of their activities. In the long run, this group should be approached with traditional restrictive deterrence. This probably means attempting to set up agreements of international cooperation to make it more difficult to escape punishment. In the short run, where prosecution is possible it should be pursued, but the United States will likely have to recognize the limits of its power to deter in this regard.\n**Conclusion: The Limits of Deterrence.** There are significant limits to even the best mosaic of cyber deterrence. Given the amount of computer fraud, state-sponsored exploitation, potentially-state-sponsored\nexploitation, and hacking collective activity against the United States, restrictive deterrence is at best a necessary but insufficient solution. Absolute deterrence thus far seems to fare better, but it is difficult to prove a negative, especially while the possibility of strategic computer network attack is subject to such debate. A final conclusion, then, is that the mosaic must be accompanied by strong cybersecurity practice. This includes, but is not limited to, careful network monitoring, patching, and penetration testing.\nThese defensive countermeasures should have two main goals. First is keeping general adversaries, such as Anonymous, from being able to conduct strategic attacks. Absolute deterrence may not be as effective against them, because there is little of value to retaliate against, because attribution is particularly difficult, or because they simply might not care about the consequences of retaliation. Second is minimizing the\nGeorgetown Journal of International Affairs\nCYBER DETERRENCE ISN'T MAD, IT'S MOSAIC\nharm that adversaries who are only subject to restrictive deterrence, such as patriotic exploiters in China or operational attackers in Iran, can do. The figure below summarizes the barrier and downward pressure these defensive measures are designed to create.\nThis focus on defensive measures alongside deterrence is a break from the traditional understanding of deterrence in international relations. Historically, in situations that call primarily for absolute and specific deterrence—such as the Cold War—excessive defensive measures can be destabilizing because they hamper an adversary's ability to perform a second strike. In that case, preserving stability was more important than defense and so anti-ballistic missiles were mutually banned. In the case of cyber deterrence, as in criminology, defense is not destabilizing. There are\ntwo main reasons for this. First, further escalation—to kinetic weaponry—is always possible, so the fear of a devastating first cyber strike that renders a powerful state like the United States or China unable to respond does not apply. Second, it is easy, and obviously correct, to justify any defensive cyber measures as a means of supplementing restrictive deterrence. Such countermeasures are widely accepted and broadly recommended—though certainly not always implemented fully—so their presence is not questioned. Defenses, coupled with a smart mosaic of deterrence, are therefore a key part of keeping cyberspace safe.\nThe author would like to thank Professor Thomas Rid of King's College London for reading an earlier draft of this article.\nInternational Engagement on Cyber IV\nBUCHANAN Military Matters"
    },
    "author_year": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 23,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "author_year"
      },
      "results": [],
      "flat_text": "HEINONLINE -- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License -- The search text of this PDF is generated from uncorrected OCR text.\n# Cyber Deterrence Isn't MAD; It's Mosaic ## Ben Buchanan Deterrence is always associated most strongly with Mutually Assured Destruction and nuclear weapons. Nevertheless, the fading memory of the Cold War should not leave a monolithic concept of deterrence as its legacy. In facing new threats and new actors, governments must develop a more nuanced and multi-faceted understanding of deterrence. Perhaps in no case is this more apt than threats in cyberspace. This article contends that there is no single way to deter an adversary's cyber operations. Rather, different actors and even different acts are subject to varying kinds of deterrence. Therefore, states must build a multi-faceted strategy to approach the cyber domain.\nThe argument consists of three steps. First, drawing on notions of deterrence that exist outside the Cold War, including in counterterrorism and law enforcement contexts, this article introduces the two main ways in which deterrence can vary: how much a threat must be deterred, which is correlated inexactly with its severity, and whether a specific actor is to be deterred or a large group. Second, it then places each variable onto a spectrum along an axis to construct a two dimensional model of types of deterrence. Different threats in cyberspace fit into different parts of Ben Buchanan is a PhD student focusing on cybersecurity and national strategy at King's College London, where he is a Marshall Scholar. He graduated from Georgetown University in 2011 and received his Masters from Georgetown in Security Studies in 2013. He is a certified computer forensic analyst.\n[130] Georgetown Journal of International Affairs CYBER DETERRENCE ISN'T MAD, IT'S MOSAIC the model depending on their characteristics. Lastly, it describes how these forms of deterrence can together form the basis of a mosaic strategy for achieving realistic deterrence in cyberspace—and for recognizing where deterrence is not fully possible.\nBefore proceeding, it is worth clarifying an important definition: cyber deterrence is the art of deterring an adversary's cyber operations. It should not imply that a state's own cyber capabilities must be used in this effort. Indeed, a key part of the argument presented here is that the decision to launch a particular cyber operation can be predicated on factors that are entirely removed from cyberspace, including other military goals, the political context, potential consequences for individual actors, and more. Tools in these other areas thus can contribute to effective cyber deterrence.\n# Different Types of Deterrence.\nDeterrence—the art of making another actor decide not to do something because of the threat of reprisal—is a concept that predates even the idea of statehood. As such, it is best to examine it in ways not bound to modern international relations. Drawing on work on deterring crime and political violence, Thomas Rid, amongst others, argues that there are two main theoretical distinctions between different types of deterrence. These two distinctions are particularly useful in their application to cyberspace.[1] First, deterrence can be specific or it can be general. Deterrence against a specific threat involves crafting a set of punishments designed to respond to a specific action by a specific actor. Presumably, these consequences are tailored to cause meaningful pain to the actor.[2] General deterrence, in contrast, is the crafting of a set of punishments that are not targeted to any individual actor, but which could apply to any individual from a large and broadly-defined group of actors, should he or she perform an undesirable action. General deterrence often involves making an example of those who act in objectionable ways for others to see.\nSecond, deterrence can be absolute or restrictive. Absolute deterrence seeks to prevent any deviant behavior of a particularly damaging sort, such as the launch of nuclear weapons. Restrictive deterrence seeks to encourage other actors to moderate their behavior in either quantity or quality in order to reduce the likelihood of consequences. A simplistic understanding of deterrence rejects this distinction between restrictive deterrence and absolute deterrence. It states that every transgression should be deterred fully, and, if committed, punished massively. While attractive in its simplicity, such a model is not credible or effective.[3] Is a state really willing to use kinetic weapons to punish a relatively minor transgression like espionage against a mid-tier target? It is also undesirable because it poses escalatory risks. If a state is going to disproportionately retaliate against a relatively minor offense, it should not expect its retaliation to go unanswered. As a general rule, then, actors more often want to absolutely deter severe threats and International Engagement on Cyber IV [131] BUCHANAN Military Matters are more credible when they communicate this desire. There is at least one exception: they might wish to deter actions that in themselves are not especially harmful, but could either provide the basis for greater destabilization or set a dangerous precedent.\nIn this two dimensional model, the United States' Cold War deterrence strategy that is so familiar to modern international relations the Applying the Model to Cyber Operations. The two theoretical distinctions—specific versus general and absolute versus restrictive—can be plotted on two axes to form a two dimensional model, as below. Note that the most restrictive, but not absolute, point occurs just as the y-axis values turn negative; the lowest values of the y-axis are for activities where restrictive deterrence minimally applies.\nory is in fact just one type of deterrence against one type of threat: absolute deterrence against the specific Soviet nuclear threat. This type of absolute and specific deterrence is alive and well today, given the nuclear deterrent many nations possess. It has only narrow utility, however, when applied to cyber operations. A more nuanced approach is required because many different threats exist in the cyber domain.\nFor any given class of threats, such as those posed by cyber operations, an actor can create a model to visualize what it seeks to deter. Some threats might be discrete points on the chart—where the actor and threat are known—while others are best represented as boxes, with heights and widths that reflect variability either in the specificity of the actor or the severity of the threat. Given the uncertainty of cyber operations, most will fall into this class.\nFor example, a model for the Georgetown Journal of International Affairs CYBER DETERRENCE ISN'T MAD, IT'S MOSAIC United States might look something like what is below.⁴ To be clear, this version is for purely illustrative purposes based on public domain information. Actual threat analysis would incorporate classified information and could well come to different conclusions. This model does not currently include a provision for assessing the relative likelihood of each threat, as threats either meet a threshold for inclusion or are left out entirely. To show some indication of relative likelihood, boxes and points can be given varying degrees of opacity. Limited discussion of each box follows below.\nthat cause widespread blackouts to the power grid, disable critical military systems like the Global Positioning System, or otherwise have significant or lethal physical consequences. China is often theorized as an actor with the sophistication to perform such an attack, and some speculate that its activities have been aimed at refining this capability.⁷ Russian Strategic Computer Network Attack: A Russian computer network attack might be similar to above in terms of its severity, but Russia is a different actor with a different set of calculations. In addition, the Chinese Strategic Computer Network Attack: There is no shortage of writers and strategists warning of the dangers of a strategic computer network attack, though skeptics question the likelihood.⁵,⁶ Certainly, though, the damage of such an attack, if it were possible, could be immense. Activities in this category include attacks Russians might choose an entirely different target. For example, they might be more inclined to target the American financial system, since they trade significantly less with the United States.⁸ Thus, from an American perspective, what deters the Chinese might not deter the Russians, and vice versa.\nInternational Engagement on Cyber IV [133] BUCHANAN Military Matters North Korean Strategic Computer Network Attack: In theory, a strategic network attack need not come from an adversary with a heavy reliance on computers. Though it is unlikely North Korean computer network attack capabilities could match the Chinese or Russians in their lethality, the state has shown some willingness to use computer network attacks in the past, primarily against South Korea. Since North Korea has relatively few cyber assets of its own to serve as the targets of American retaliation, and is internationally ostracized, the United States will again have to consider deterrence differently.\nIranian Operational Computer Network Attack: According to reports, the Iranians conducted the Shamoon attack against an American ally, as well as other direct attacks against American financial companies.[10] The available reporting suggests the attacks against U.S. firms were less severe than the Shamoon operation. It remains unclear if the Iranians' failure to truly impact the American financial system was due to a lack of capability or the effects of restrictive deterrence.\nChinese Computer Network Exploitation: While the dangers of Chinese network exploitation are widely reported, they are unquestionably less immediate than the imagined devastating strategic computer network attacks.[11] They therefore receive less of an absolute deterrent. This box refers to the best hackers directly associated and under the control of the Chinese intelligence and military services. They thus may be open to certain models of deterrence aimed at Chinese decision-makers.\nChinese Patriotic Hackers Computer Network Exploitation: There are reports of a number of hacking groups acting in concert with general Chinese interests without direct affiliations with the Chinese government.[12] In their exploitation of American (and other) networks, these groups are not primary under the control of the Chinese decision-makers, but may in some ways be protected by them. They have their own capabilities, which can be assumed to be less than those of the best Chinese military and intelligence units, and their own incentives. They thus are deterred differently, and may be more suited to a general rather than specific approach.\nAnonymous Computer Network Exploitation and Attack: The independent hacking group Anonymous, along with offshoots such as LulzSec, has demonstrated a willingness to hack American government entities, financial providers, and universities.[13] Their computer network attacks are reasonably unsophisticated—mostly minor denial of service attacks—although some of their exploitation operations have been effective, such as those against Stratfor and HB Gary.[14] Given that they are an ad-hoc collective, they are primarily subject to general deterrence.\nGeorgetown Journal of International Affairs CYBER DETERRENCE ISN'T MAD, IT'S MOSAIC Financial Fraud by computer criminals: There are a large number of mostly faceless computer criminals who make money through identity fraud, so-called ransomware, and surreptitious Bitcoin mining. They frequently target Americans. While they can pose an economic nuisance and can be deeply detrimental to individuals, they are not of primary concern to American national security policymakers.\nThe Mosaic of Cyber Deterrence—and Its Limits. Every deterrence strategy begins with attribution. Without it, the entire discussion is moot. Since attribution is a complex problem worthy of its own detailed discussion, this paper accepts the assertion of American policymakers that the United States can perform attribution when targeted with a cyber operation. Certainly, recent American rhetoric and actions has been designed to draw attention to its attribution capabilities, with an eye to creating foundations for deterrence. Prominent examples of this are former Secretary of Defense Leon Panetta's bold claim that,\"Potential aggressors should be aware that the United States has the capacity to locate them and to hold them accountable for their actions...\"and the indictment of five Chinese hackers believed to be affiliated with the Chinese People's Liberation Army.[15, 16] Even when a state's attribution capabilities are known, there is no single dominant strategy that meets each cyber challenge. Rather, the United States should construct a mosaic of different deterrence strategies to confront the full spectrum of cyber threats. The differences in these assorted types of deterrence loosely correspond to the four quadrants of the model. Even so, cyber deterrence alone is incomplete. Policymakers must advance defensive measures as well.\nStrategic computer network attack, spanning the top two quadrants, can be deterred in two ways. It can first be deterred with the threat of a retaliatory computer network attack, in the same way second strike capabilities were positioned during the Cold War. This relies on the existence of realistic and sufficiently important targets to strike with a cyber attack.\nIf no such targets exist, the United States can employ the second method of deterrence: kinetic equivalency. This doctrine states that the attacked state will deploy its conventional kinetic arsenal to retaliate for a cyber attack. It is particularly useful for deterring states that do not have many cyber targets, like North Korea, or that could, in extreme circumstances, potentially disconnect themselves from the internet, like China. The United States has already made such a declaration of equivalency.[17] Whether it is viewed credibly is hard to know, as no state has yet tested it. Other states without the overwhelming power-projecting capabilities of the American military might find this doctrine hard to promulgate credibly.\nSince kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence International Engagement on Cyber IV [135] BUCHANAN Military Matters mosaic. Operational cyber attacks by a specific enemy that are not strategic in their outcome, such as the Iranian attack against the American financial system in 2012, fall in the bottom right quadrant. They are intrusion. Indeed, most intrusions go undetected for months, if not years, a challenge to the foundation of attribution on which deterrence is based.[18] Second, states suffering exploitation are unlikely to be the # Since kinetic retaliation is not a credible threat in response to every infraction, states must develop alternative pieces of the deterrence mosaic.\ntherefore subject to more restrictive deterrence. According to the mosaic model, an adversary who launched this kind of attack should suffer some consequences, but not as severe consequences as one that launched a strategic attack. Examples of such mid-tier punishments include diplomatic protest, isolation from internet governance bodies, and black-holing of internet traffic from a targeted range of IP addresses. Policymakers have the option of clearly spelling out their\"red lines\"—essentially, what is in the top right quadrant and what is in the bottom right—or of leaving them deliberately ambiguous, with the hope of deterring a broader range of activity than they are actually willing to punish.\nDeterring exploitation by states and those who are their direct agents is much harder (this group is also mostly in the bottom right quadrant, with some small overlap into the top right). First, exploiters may feel they are less likely to suffer deterrence because there is no immediate damage to alert the adversary of an first to launch an attack in response. Nevertheless, some forms of deterrence can be theorized.\nFor actors directly linked to the state, such as sophisticated foreign intelligence agencies, it may be possible to communicate, potentially in secret, some gradations of severity. Doing so can provide some narrow absolute deterrence and a greater deal of restrictive deterrence. For example, any exploitation or attack that potentially might harm America's nuclear umbrella could prompt a fiercer response than economic espionage. In this way, then, even sophisticated foreign entities directly linked to the government could be directed away from the most serious targets. Deterring their activities against less critical, but still deeply important, targets is much more difficult. Some restrictive deterrence is still possible, such as sanctions or indictments if economic espionage crosses a certain level.\nIn the case of hackers loosely affiliated with an adversary's government (who, because they are sometimes known and sometimes unknown, Georgetown Journal of International Affairs CYBER DETERRENCE ISN'T MAD, IT'S MOSAIC mostly span the bottom two quadrants), some combination of narrow absolute deterrence and restrictive deterrence is necessary, but not sufficient. These hackers, absent formal government protection, must be careful not to go too far, lest the targeted country retaliate against them and their host government decline to protect them. As a result, they are likely to avoid some targets entirely and employ the utmost discretion when hitting others. There are limits to this restrictive deterrence, however, and limits to how well absolute deterrence can be communicated when the threat is more general. Such deterrence is based in large part on the hacking group's collective and self-reinforcing perceptions. It is unlikely to be effective through the framework of traditional criminology. Here, the goal of the state should be to achieve maximum deterrence while recognizing that it can never truly eliminate the threat. The state should focus on identifying the truly capable hackers who pose a legitimate threat and apply restrictive deterrence to them, discouraging them from high value targets. In the short history of these hacking groups, these sophisticated hackers have thus far focused on exploitation against mid-tier targets, which may reflect their ideology, capability, or successful restrictive deterrence. Because it is difficult to identify in advance who poses a threat, the state should employ techniques from general deterrence used in traditional criminology. It should **Thoughtful use** of positive incentives...may better contrast the punishments and encourage hackers to be economically productive for the state rather than a thorn in its side.\nin stopping them from exploiting mid-tier targets, since the hackers are presumably protected enough by their government to withstand any response, minimal as they believe it is likely to be.\nIn the above model of cyber threats facing the United States, two sets of hackers not even loosely affiliated with a state comprise threats in the bottom left quadrant. Hackers not associated with any state but instead motivated by political intention, like Anonymous, are best viewed use the punishments it delivers to some hackers as a warning to others, taking care to be proportional in these punishments. There is one key difference between these hackers and other criminals: while theft and murder have little social value, those with computer skills can be useful to the state. Thoughtful use of positive incentives—some of which may be political in nature, such as minor concessions on political grievances—may better contrast the punishments and encourage hackers to be eco International Engagement on Cyber IV [137] BUCHANAN Military Matters nomically productive for the state rather than a thorn in its side.\nHackers not associated with any state and motivated by money, such as identity thieves, are nearly impossible to absolutely deter. When such hackers are overseas, their own governments may have willful ignorance of their activities. In the long run, this group should be approached with traditional restrictive deterrence. This probably means attempting to set up agreements of international cooperation to make it more difficult to escape punishment. In the short run, where prosecution is possible it should be pursued, but the United States will likely have to recognize the limits of its power to deter in this regard.\n**Conclusion: The Limits of Deterrence.** There are significant limits to even the best mosaic of cyber deterrence. Given the amount of computer fraud, state-sponsored exploitation, potentially-state-sponsored exploitation, and hacking collective activity against the United States, restrictive deterrence is at best a necessary but insufficient solution. Absolute deterrence thus far seems to fare better, but it is difficult to prove a negative, especially while the possibility of strategic computer network attack is subject to such debate. A final conclusion, then, is that the mosaic must be accompanied by strong cybersecurity practice. This includes, but is not limited to, careful network monitoring, patching, and penetration testing.\nThese defensive countermeasures should have two main goals. First is keeping general adversaries, such as Anonymous, from being able to conduct strategic attacks. Absolute deterrence may not be as effective against them, because there is little of value to retaliate against, because attribution is particularly difficult, or because they simply might not care about the consequences of retaliation. Second is minimizing the Georgetown Journal of International Affairs CYBER DETERRENCE ISN'T MAD, IT'S MOSAIC harm that adversaries who are only subject to restrictive deterrence, such as patriotic exploiters in China or operational attackers in Iran, can do. The figure below summarizes the barrier and downward pressure these defensive measures are designed to create.\nThis focus on defensive measures alongside deterrence is a break from the traditional understanding of deterrence in international relations. Historically, in situations that call primarily for absolute and specific deterrence—such as the Cold War—excessive defensive measures can be destabilizing because they hamper an adversary's ability to perform a second strike. In that case, preserving stability was more important than defense and so anti-ballistic missiles were mutually banned. In the case of cyber deterrence, as in criminology, defense is not destabilizing. There are two main reasons for this. First, further escalation—to kinetic weaponry—is always possible, so the fear of a devastating first cyber strike that renders a powerful state like the United States or China unable to respond does not apply. Second, it is easy, and obviously correct, to justify any defensive cyber measures as a means of supplementing restrictive deterrence. Such countermeasures are widely accepted and broadly recommended—though certainly not always implemented fully—so their presence is not questioned. Defenses, coupled with a smart mosaic of deterrence, are therefore a key part of keeping cyberspace safe.\nThe author would like to thank Professor Thomas Rid of King's College London for reading an earlier draft of this article.\nInternational Engagement on Cyber IV [139] BUCHANAN Military Matters"
    }
  },
  "citation_summary": {
    "style": "numeric",
    "dominant_bucket": "numeric",
    "dominant": {
      "intext_total": 12.0,
      "success_occurrences": 12.0,
      "success_unique": 12.0,
      "bib_unique_total": 18.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 0.6666666666666666,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "numeric"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 12.0,
        "success_occurrences": 12.0,
        "success_unique": 12.0,
        "bib_unique_total": 18.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.6666666666666666,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "numeric": {
        "intext_total": 12.0,
        "success_occurrences": 12.0,
        "success_unique": 12.0,
        "bib_unique_total": 18.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.6666666666666666,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 23.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "Cyber Deterrence Isn't MAD; It's Mosaic",
    "subtitle": "[130] Georgetown Journal of International Affairs",
    "document_type": "journal_article",
    "venue": "[130] Georgetown Journal of International Affairs",
    "publication_year": 2011,
    "authors": [
      "Ben Buchanan",
      "Different Types of Deterrence."
    ],
    "affiliations": [],
    "emails": [],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "",
    "keywords": [],
    "publication_dates": {},
    "identifiers": {
      "doi": [
        "10.1080/13523260.2012.659593"
      ],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "https://heinonline.org/HOL/License"
      ]
    },
    "references_block_count": 1,
    "references_entries_estimated": 18,
    "heading_count": 5,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "no_abstract"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 12,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 1.0,
      "footnote_coverage": 1.0,
      "unique_index_count": 12
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "numeric",
      "recommended_style": "numeric",
      "aligned": true,
      "signals": {
        "superscript_hits": 5,
        "superscript_definition_lines": 0,
        "numeric_bracket_hits": 17,
        "numeric_endnote_lines": 0,
        "author_year_hits": 0
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 18.0,
      "dominant_bib_coverage_rate": 0.6666666666666666,
      "dominant_link_target": "footnotes",
      "dominant_unresolved_flag": "unresolved_footnote_links"
    },
    "heading_validation": {
      "heading_count": 5,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": true,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": false,
        "emails": false,
        "orcids": false,
        "abstract": false,
        "keywords": false,
        "venue": true,
        "persistent_identifier": true,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 2,
        "affiliations": 0,
        "emails": 0,
        "orcids": 0,
        "keywords": 0,
        "doi": 1,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 1
      },
      "coverage": {
        "core_coverage": 0.6666666666666666,
        "email_author_link_rate": 0.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "no_abstract"
        ],
        "toc_dot_lines": 0
      },
      "flags": [
        "meta_missing_abstract_and_keywords"
      ]
    },
    "flags": [
      "meta_missing_abstract_and_keywords"
    ]
  },
  "updated_at_utc": "2026-02-14T08:27:14.235149+00:00"
}