{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\HWJKV38N\\T5LE96UX.pdf",
  "custom_id": "277",
  "response": {
    "id": "batch-b6235e9e-278-fcc9b9d6-e7ea-44f6-9e92-c679a39763a6",
    "custom_id": "277",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "HEINONLINE\n\nDATE DOWNLOADED: Thu Apr 10 17:05:47 2025\n\nSOURCE: Content Downloaded from HeinOnline\n\n## Citations:\n\nPlease note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n\n## Bluebook 21st ed.\n\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 GEO. J. INT'L AFF. 75 (2013).\n\n## ALWD 7th ed.\n\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 Geo. J. Int'l Aff. 75 (2013).\n\n## APA 7th ed.\n\nLotrionte, Catherine. (2013). better defense: examining the united states' new norms-based approach to cyber deterrence. Georgetown Journal of International Affairs, 14(3), 75-88.\n\n## Chicago 17th ed.\n\nCatherine Lotrionte, \"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence,\" Georgetown Journal of International Affairs 14, no. 3 (2013): 75-88\n\n## McGill Guide 10th ed.\n\nCatherine Lotrionte, \"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence\" (2013) 14:3 Geo J Int'l Aff 75.\n\n## AGLC 4th ed.\n\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14(3) Georgetown Journal of International Affairs 75\n\n## MLA 9th ed.\n\nLotrionte, Catherine. \"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence.\" Georgetown Journal of International Affairs, vol. 14, no. 3, 2013, pp. 75-88. HeinOnline.\n\n## OSCOLA 4th ed.\n\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14 Geo J Int'l Aff 75 Please note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\n-- To obtain permission to use this article beyond the scope of your license, please use: Copyright Information",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1667,
              "width": 1112
            }
          },
          {
            "index": 1,
            "markdown": "# A Better Defense\n\n*Examining the United States’ New Norms-Based Approach to Cyber Deterrence*\n\n## Catherine Lotrionte\n\nSince 2010, states have sought further methods for deterring adversarial actions through the Internet and recognized the need to develop forms of cyber deterrence as a key consideration in the pursuit of national and international security. In 2010, the UN Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (GGE) recommended that any further dialogue among states and other actors on norms pertaining to state use of Information and Communication Technologies (ICTs) to reduce collective risk and protect critical national and international infrastructure include discussions on the use of ICTs in conflict.¹\n\nThis article examines how the United States has worked to develop cyber deterrence in its more recent efforts by relying on a normative approach to establish “rules of the road” for conflict in cyberspace. It argues that the U.S. norms-based approach, in conjunction with U.S. military power, can reinforce general deterrence in cyberspace, increasing global stability. The article probes links between norms, international law, and deterrence policies, identifying conditions that may increase the potential utility of a strategic norms-based approach for calculations of military-security\n\n**Catherine Lotrionte** is Director of the Institute for Law, Science, &amp; Global Security and a Visiting Assistant Professor of Government and Foreign Service at Georgetown University. Dr. Lotrionte has served as Counsel to the President’s Foreign Intelligence Advisory Board at the White House and as Assistant General Counsel at the Central Intelligence Agency. She is the Director and Founder of the Cyber Project at Georgetown University and a Life Member of the Council on Foreign Relations.\n\n[75]",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          },
          {
            "index": 2,
            "markdown": "A BETTER DEFENSE\n\npolicy in the cyber domain. It argues that by embedding cyber deterrence practice in a set of norms, the deterrence strategy will be more likely to stabilize and restrain self-help behavior of states in the cyber domain. In other words, international norms can serve as a structure to increase the chances of deterrence success.\n\nThe article notes the potential limitations of cyber deterrence as examined by many others, but maintains that a synergy exists between recent developments in international engagement on cyber norms and the academic literatures, pointing to new lines of norms-based research in constructivism that can aid in strengthening the potential for cyber deterrence for the future. The basic proposition of the article is that understanding norms, how and when they develop, and their potential to evolve into binding international law, is essential to the effectiveness of a cyber deterrence policy. Drawing on the work of Lawrence Freedman, the article illustrates how a norms-based approach, rather than an interest-based approach, better reflects how deter-\n\ncontext of social construction based on the interest and identity of states.\n\n## Deterrence in a Post-Cold War Era\n\nAs recent international events such as Estonia (2007),³ Georgia (2008),⁴ and Stuxnet (2010)⁵ created elevated awareness and security concerns, scholars and policymakers have turned their attention to the “cyber” issue focusing on whether deterrence theory can work in the cyber domain.⁶ Although the traditional notions of deterrence theory based on military strength have yet to mature in cyberspace,⁷ the United States has recently begun to develop a new strand of cyber strategy and policy—agreement on international norms and legal rules for cyber conflict—that I argue could deliver a positive deterrent effect. Indeed, the United States’ recent policies reflect a recognition that a normative approach could indeed provide the necessary deterrent effect with regard to certain uses of cyberspace during conflict.\n\nSome have argued that cyber deterrence as a U.S. strategic option is so discredited that it should be discarded completely.\n\nrence works in practice, “through actors internalizing a sense of appropriate limits on their actions.”² In sum, cyber weapons alone will not guarantee deterrence. If indeed cyber weapons come to be viewed as deterrent weapons it is not only because of the nature of the technology, but also through a normative\n\ncompletely.⁸ Recent scholarship has highlighted a number of challenges for cyber deterrence, illustrating the difficulty of deterrence’s translation into cyberspace and arguing, “concepts of deterrence and war may simply lack the logical foundations that they have in the nuclear and conventional realms.”⁹\n\nGeorgetown Journal of International Affairs",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          },
          {
            "index": 3,
            "markdown": "LOTRIONTE International Engagement on Cyber III\n\nSome of the barriers to cyber deterrence that have been analyzed include: limits of attribution of the adversary, difficulty in holding the adversary's assets at risk, limits to an ability to continue an attack, involvement of non-state actors, and lack of a counterforce option.¹⁰ In short, some analysts have argued, the fundamental nature of the cyber domain is different than the physical domain and requires adopting new rules for state conduct and policy.¹¹\n\nIn 2009, perhaps to signal to opponents the United States' seriousness in developing cyber capabilities for conflict, the United States established its first cyber command and has since developed significant offensive cyber capabilities. In July 2011, the then-vice chairman of the joint Chiefs of Staff General James Cartwright, spoke further about the need to develop cyber deterrence through both punitive and denial mechanisms.¹² As Cartwright noted, \"There is no penalty to attacking us now. We have to figure out how to change that.\"¹³ Recently, in seeming recognition that military action in cyberspace to punish or deny using military resources may not be the best approach to deterring adversaries, a new norms-based approach to deterrence has begun to emerge in U.S. policy discussions.\n\nIn summarizing some of the options available to bolster U.S. cyber deterrence efforts, James Lewis has drawn attention to a normative component of cyber deterrence strategy:\n\nBetter defenses could be reinforced by multilateral understandings on acceptable behavior in cyberspace—explicit norms and obligations... Just as nations feel a degree of constraint from norms and agreements on non-proliferation, establishing explicit international norms for behavior in cyberspace would affect political decisions on the potential risk and cost of cyber attack.¹⁴\n\nA norms-based approach to deterrence—as opposed to a strictly interests-based approach—is one that reinforces \"certain values to the point where it is well understood that they must not be violated.\"¹⁵ While this approach provides hope for developing effective cyber deterrence it will require the exercise of many elements of foreign policy, rather than the use or threatened use of military force alone.¹⁶ The next section describes the recent policies announced by the United States supporting international norms in cyberspace.\n\n## The Role of the United States.\n\nIn May 2011 the United States released International Strategy for Cyberspace, its first policy document promoting international norms in the context of \"applying the expectations of peaceful and just interstate conduct to cyberspace\" in order to effect \"stability,\" as exists in \"other spheres of international relations.\"¹⁷ The document recognized that \"adherence to such norms brings predictability to state conduct, helping prevent the misunderstandings that could lead to conflict.\"¹⁸ During the same year, the Department of Defense's Strategy for Operating in Cyberspace described how the department would work with international partners \"to encourage responsible behavior and oppose those who would seek to disrupt networks and systems, dissuade and deter malicious actors, and reserve the right to defend these vital national\n\n[77]",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          },
          {
            "index": 4,
            "markdown": "A BETTER DEFENSE\n\nassets as necessary and appropriate.\"¹⁹\n\nThese policies focus on regulative norms concerned with preventing inter-state conflict, or at least shaping and limiting the use of cyber attacks in\n\nof \"norm emergence,\" attention was called to the issue by the United States and like-minded states, and support was built. This began the socialization process of the norm life cycle.²² This\n\n# The United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace.\n\ncyber conflict.²⁰ As the United States promulgated its own domestic norms related to these international norms, the norms were being socialized to other states and the global cybersecurity agenda at the UN. The socialization of these norms is illustrated in states' agreeing to the 2013 GGE report. At the UN, for the first time, fifteen states, including Russia and China, agreed that the UN Charter principles and international law, in general, applies in the cyber domain. The report also upheld the principle of state responsibility for curbing or halting cyber attacks originating in their territories.²¹\n\nBased on pre-existing principles of international law, specifically *jus ad bellum*, the laws related to the recourse to the use of force, and *jus in bello*, laws related to armed conflict, the United States has campaigned for international agreement on cyber norms. To date, the United States has succeeded in persuading at least fifteen states to embrace the norms of the UN Charter and state responsibility in the context of cyberspace. As a norm entrepreneur, the United States has framed the issues in a way that challenges the appropriateness of what is generally accepted today in cyber conflict. During this stage\n\nacceptance was possible in part because of the pre-existence of similar humanitarian issues related to conflict. As constructivist theory contends, \"mutually reinforcing and consistent norms appear to strength one another.\"²³\n\nAlthough the GGE process has been an important step in the right direction, with only fifteen states in agreement, it lacks widespread international support. Only when a \"critical mass\" of states agree to a norm will the norm reach a \"tipping point,\" after which the norm gains widespread acceptance through a \"cascading\" effect.²⁴ Although it is not possible to predict exactly how many states are needed to \"tip\" the process, international law suggests that the \"tipping\" would occur once a majority of states in the international system adopt the norm.²⁵ For example, in the case of the norm of non-use of force, in the intervening years between the League of Nations in 1919, which had no mention of the norm of non-use of force, and the UN Charter in 1945, the norm achieved widespread support. It was considered so unproblematic by 1945 that at the negotiations of the UN Charter, no state felt the need to provide a public defense of Article 2(4) of the Charter. The UN Charter went\n\n[78] Georgetown Journal of International Affairs",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          },
          {
            "index": 5,
            "markdown": "LOTRIONTE International Engagement on Cyber III\n\ninto force in 1945 with about 60 states as signatories.\n\nPositive signs exist for further engagement on cyber issues. For example, there are signs that the United States is willing to engage with the Russian Federation on proposals to limit the military use of cyberspace, thereby reversing the trend of recent years.²⁶ In 2013, General Martin Dempsey, at a public forum discussing cyber threats, explained that the Chinese \"did not believe that hacking American systems violated any rules, since no rules existed.\"²⁷ He noted that American and Chinese officials had plans to meet to discuss ways \"to establish some rules of the road\" with respect to cyberattacks against U.S. companies to steal intelligence property.²⁸ In July 2011, an Organization for Security and Cooperation in Europe (OSCE) resolution to share information on cyber deployments during military conflicts was co-sponsored by the United States, Russia, and other nations.²⁹\n\nMost recently in June 2013, Russia and the United States agreed to a hotline for real-time communications during a cyber-crisis, enabling both states to avoid misunderstandings and preventing potential escalation.³⁰ This is an indication of the emergence of a set of agreements between the two states to reduce conflict by contacting each other if there is a cyber incident instead of resorting to self-defense first. The United States has also conducted war games to figure out just how these rules would apply if it had to respond to a cyber attack against its critical infrastructure, and has recently updated its classified military rules of engagement in cyberspace for the first time in seven years.³¹\n\nSuch instances of cooperative efforts can act as a mechanism for the institutionalization of the norms across states through iterated behavior and habit; frequent interactions among individuals involving joint work can ultimately create predictability, stability, and habits of trust. Expanding these efforts through informal, non-obligatory intergovernmental cooperation, confidence building measures of transparency, and the creation of internationally recognized red lines would further increase international support.³³\n\n## Finding Norms for Cyberspace.\n\nDuring the Cold War, the Soviets Union and United States were able to establish both formal and informal arrangements to minimize the potential for catastrophic war and escalation. Today, the United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace in order to avoid widespread, potentially devastating, damage in cyberspace. The U.S. efforts seeking agreement on specific norms related to international law and the use of force in the cyber domain may prove the most fruitful for international agreement. While a \"no-first use\" norm, like that which emerged during the Cold War,³⁴ is unlikely to develop for the cyber domain, a norm of \"acceptable use\" could emerge, illuminating the \"red lines\" of cyber operations.³⁵ States could agree to certain acceptable targets in cyberspace during conflict. There is international humanitarian law on the issue of legitimate targets during conflict, especially the long standing prin\n\n[79]",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          },
          {
            "index": 6,
            "markdown": "A BETTER DEFENSE\n\nciples of *jus in bello*, which requires civilian populations to be protected during conflict and that gains of a military action need to be proportionate by not causing unnecessary harm or suffering. Extending these principles to the context of cyber conflict could be instrumental in developing an understanding that during a conflict in cyberspace military installations would be legitimate targets for cyber attacks, but financial institutions would not be legitimate targets given the uncertainties or unacceptable collateral damage to civilian populations. Targets such as banks, global positioning systems, and other infrastructure used for both military and civilian purposes could, under\n\nintrusions against industrial control targets, such that any cyber operation against such targets \"would be interpreted as the prelude to an attack,\" reasoning that an intrusion against such a target could only be useful as preparation for a future attack since there is no \"intelligence value to hacking an industrial control system.\"³⁶\n\nThis approach would be helpful in the case of a state considering the use of anticipatory self-defense under circumstances when it would be difficult to identify with certainty the purpose behind a particular cyber operation. In the context of intrusions into industrial control systems, for instance, it would be challenging to distinguish a cyber\n\n# A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions.\n\nthe current interpretation of the law, be legitimate targets in cyber conflict unless states were to agree otherwise.\n\nIn exploring additional options for regulating state behavior in cyber, the scenario of intrusions against industrial control systems illustrates the need for more clarity. Numerous critical installations of states such as power plants, nuclear plants, dams, water treatment and distribution systems, oil refineries, banking systems, hospital systems, and air traffic control systems rely on supervisory control and date acquisition systems, and distributed control systems. Some have proposed that it would be beneficial to prohibit cyber\n\nintrusion of a state's air defense that is meant as an *intelligence collection operation*—theft of information—from the same technical intrusion meant to identify vulnerabilities in anticipation of a *cyber attack* with physical, destructive results. Under the current understandings of the norms related to espionage versus \"armed attack\" under the UN Charter, an implant that is meant to support a subsequent \"armed attack\" would merit, and the law would allow for, a more hostile use of force response, in contrast to the discovery of a similar implant that was meant only to support espionage. This is due to the fact that under traditional understand-\n\n[80] Georgetown Journal of International Affairs",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          },
          {
            "index": 7,
            "markdown": "LOTRIONTE International Engagement on Cyber III\n\nings of international law, espionage does not constitute a \"use of force\" for purposes of the UN Charter, and certainly not an \"armed attack.\" Therefore, the victim of such a cyber intelligence collection operation would not have the lawful right of forcible self-defense whereas the victim of a cyber attack would, under the UN Charter, have the right of a forcible self-defense response.\n\nThis traditional understanding of the law may not be acceptable to states in the cyber context where the distinction between the cyber weapons used for intelligence collection and those used for sabotage cannot easily be made. And yet there is likely not going to be an amendment to the UN Charter to accommodate this complexity especially since state practice has indicated an unwillingness to consider intelligence collection a \"use of force.\" In this case, a new understanding of acceptable behavior under such circumstances would require states to reach a new agreement given the facts specific to cyber operations.\n\nIn the case of control systems, securing states' agreement to refrain from conducting cyber attacks against such systems certainly would be useful.[37] A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions. Indeed, there is some evidence that this may be an area that states, at least some states, would be restrained. The United States, for instance, in at least two different instances decided not to conduct cyber attacks against foreign financial networks. The Bush and Clinton administrations both refused to authorize hacking into foreign financial systems because of concerns of collateral damage and possible blowback on the United States.[38] Yet, the question remains whether other states would agree to refrain from doing the same. A shared understanding among states that financial institutions ought not to be targets for a cyber attack would be useful especially for the United States since it already appears to refrain from such actions.\n\nChallenges to Application. International law will play an important role in the normative framework for cyber deterrence as it is the international legal framework of \"war\" that provides the basis for cyber operations. Over the last decade, the growing concern over increased violence and the potential for state conflict in the cyber domain has led international legal scholars to assess how to accommodate an international legal framework for warfare in cyberspace, trying to bring some clarity to how international law would apply in the context of cyber conflict.[39] In particular, the applicability of international regarding the use of force and the right of self-defense is central to any clarification of when and under what circumstances a disruptive exploit in cyberspace could be considered an armed attack, triggering a use of force in self-defense.\n\nThe most relevant international law on the issue of deterrence and the use of cyberweapons is the law relating to the use of force enshrined in the UN Charter, *jus ad bellum*, and the law applicable in armed conflict that regulates the conduct of hostilities, *jus in\n\n[81]",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          },
          {
            "index": 8,
            "markdown": "A BETTER DEFENSE\n\nbello. The UN Charter and customary law determine when cyber operations may be conducted, namely, in self-defense. While it is not necessary to fully explain the UN Charter paradigm here, it is necessary to address the issue of \"use of force\" and \"armed attack,\" two of the key terms in the Charter paradigm. The Charter prohibits \"the threat or use of force against the territorial integrity of political independence\" of a state.⁴⁰ Therefore, any cyber operation that amounts to a use of force is illegal.⁴¹ The UN Charter, however, does not allow the victim of a cyber operation that amounts to a \"use of force\" to respond in forcible self-defense.⁴² Such responses are limited to activities that equate to an armed attack pursuant to Article 51 of the Charter.⁴³\n\nBased on the interpretation of these principles by the UN Charter and the International Court of Justice (ICJ),⁴⁴ a state's ability to signal a \"strike back\" deterrent to a cyber operation in self-defense would be subject to a finding that the cyber operation was not only a use of force but also an armed attack.⁴⁵ Unfortunately, neither the Charter nor the ICJ has provided specific definitions for these terms. In addition, there has yet to be a reported cyber operation between states that has been acknowledged as a use of force, let a lone an armed attack.⁴⁶ The recent Stuxnet cyber operation against the Iranian nuclear capabilities is likely to be the closest.⁴⁷ Yet there is debate as to whether Stuxnet was a use of force or an armed attack for purposes of the UN Charter.⁴⁸\n\nRecent efforts to incorporate cyber warfare in our long-standing international legal systems prohibiting the use of force and protecting civilians from the effects of war illustrate the considerable challenges and incongruities in attempting to fit cyber into the conventional armed conflict framework. Two notable efforts have been the Tallinn Manual on the International Law Applicable to Cyber Warfare (the Manual)⁴⁹ and the International Committee of the Red Cross's (ICRC) first major article on cyber warfare published in 2012. In the ICRC article, the ICRC disagrees with the Manual's position on what would constitute an \"attack\" during armed conflict requiring physical effects. According to the majority of the experts on the Manual, \"interference with functionality qualifies as damage\" for purposes of determining if something was an \"attack\" during an armed conflict, \"if restoration of functionality requires replacement of physical components.\"⁵⁰ The ICRC, on the other hand, concludes that \"disrupting the functioning of certain systems by interfering with their underlying computer systems can amount to damage insofar as it impairs their usefulness,\" and therefore, an attack would also \"be understood to encompass such operations that disrupt the functioning of objects without physical damage or destruction, even if the disruption is temporary.\"⁵¹ Disagreement among the group of experts who drafted the Manual and the ICRC highlights the challenges in applying existing international law to the cyber domain.\n\nOvercoming the Obstacles. Over centuries, in the context of the physical realm, the international legal terms of \"use of force,\" \"armed attack,\" and \"self-defense\" have come to have mean-\n\nGeorgetown Journal of International Affairs",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          },
          {
            "index": 9,
            "markdown": "LOTRIONTE International Engagement on Cyber III\n\ning in treaties, the practice of states, and through the dispute resolution process at the UN Security Council and the International Court of Justice. Today, for such activities in cyberspace, we need new consensus about the meanings of these legal terms, how they apply in cyberspace, and the situations in which the different thresholds would be triggered based on cyber operations. It is important for states to understand what would constitute an armed attack in cyberspace that would then trigger the target state's right of self-defense. Given that most of the malicious cyber activities that have occurred to date fall below the level of the use of force and armed attack thresholds of the UN Charter and the laws of armed conflict,52 and, given the fact that even for the areas of international law addressed in the Manual there is no state consensus,53 uncertainty remains about the rules meant to constrain behavior that apply in the cyber domain.54 In order for deterrence to work and widespread agreement on cyber norms to occur, there needs to be some shared expectations between states about what is acceptable behavior and what is not acceptable behavior in the cyber domain.\n\nIn lieu of any formal international treaty defining these terms in cyber, agreeing to norms will be important to providing needed clarity for states to understand the context in which they are operating in the cyber domain. Those norms that are clear and specific, rather than ambiguous and complex,55 and those that have been around for a long period of time, surviving numerous challenges are more likely to be effective.56 Starting with those norms related to the use of force in cyber-\n\nspace, where there is legal precedent, makes sense. The next step would be to come to agreement on the meaning of the terms as used in the UN Charter. For example, the United States could seek to develop a specific domestic policy articulating when Article 51 of the UN Charter would be triggered by a cyber incident, establishing a clear threshold and share it with other states in order to seek agreement.\n\nAs deterrence theorists have argued, in order for deterrence strategy to work, states must be aware of the \"rules and logic of the [strategic] game\" which is communicated between states and which serves not only to inform their actions but also their identities.57 As part of a cyber declaratory deterrence policy, U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons. To develop such norms, threats of military action alone will not suffice. Rather, the diplomatic elements of foreign policy will need to be exercised to establish and reinforce certain values to the point where it is well understood by states that they must not be violated. Clear statements by the United States would be useful in setting forth the specifics of what those values are as envisioned in cyberspace.\n\nConclusion. These recent events support the emergence of a U.S. national cyber strategy where cyber deterrence is pursued not solely through national security capabilities (the development of offensive cyber capabilities at U.S. Cyber Command), but also through diplomatic and normative, means.\n\n[83]",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          },
          {
            "index": 10,
            "markdown": "A BETTER DEFENSE\n\nPlacing issues of cyber conflict under the auspices of the UN and the UN Charter principles makes sense. This will ultimately make the development of the norms easier for states to accept by embedding them in already existing international law and an international organization with members with conflicting identities and competing interests that plays an important role in norm innovation, cascading, institutionalization, and enforcement. Because of the lack of clarity in international law on the meaning of terms like \"armed attack,\" more work is required to identify exactly what the norm is and what constitutes violation as well as spelling out the procedures by which norm leaders coordinate disapproval and sanctions for norm breaking.\n\nThis article has argued that a norms-based approach, in conjunction with military cyber power, can deliver some cyber deterrence where military power alone is limited. Although the emergency suffering, principles which support the norms the United States is promoting through the GGE process. Second, the UN GGE process provides an organizational platform for the issues. With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\n\nThe \"rules of acceptable behavior\" that cyber deterrence scholars and recent U.S. cyber strategy documents have discussed, fit into this category of \"rules of the game\" that can take the form of consensual bilateral or multilateral declarations of principles, or even unilateral declarations and actions. The United States presently prefers non-legally binding agreements for cyber as compared to Russia that has advocated for an international treaty. The rationale for non-legally binding agreement may be that such agreements offer decision-makers opportunities to\n\n# U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons.\n\ngence of norms in cyberspace is in its early stages and it is too early to predict how these emerging norms, there are two central factors that support the potential for broader support for the norms the United States is promulgating. First, there is a tradition of international law and norms on which the cyber issues can be based that codify the principles of uses of force, self-defense, proportionality, discrimination and\n\nlearn about the social effects of particular sets of rules over time, amending them accordingly, typically with lower negotiation costs than entailed by the renegotiation of treaties.[58] States may need time to learn about the technology and to arrive at conclusions about the kinds of behavior they prefer in the new domain of cyberspace.\n\nEmbedding the new cyber norms as stated in the GGE report in pre\n\n[84] Georgetown Journal of International Affairs",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          },
          {
            "index": 11,
            "markdown": "LOTRIONTE International Engagement on Cyber III\n\nexisting and widely accepted international legal principles may alleviate the need for a separate, stand-alone treaty for cyber conflict.59 Indeed, given the political context for cybersecurity where mistrust and geopolitical rivalry among states exists, such informal norms may be more attractive given that it is easier\n\ninvolvement in the Stuxnet cyber operation against Iran's uranium facility, the United States will likely face criticism and allegations of double standards. The United States must find a way to address these concerns and not lose momentum in the socialization of cyber conflict norms.\n\n# With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\n\nto obtain agreement on them. If more formal agreement on specific norms is the ultimate goal, the intermediate goal for the United States should be to develop confidence-building measures involving transparency between states in order to build trust, laying the groundwork for future consensus on specific norms.[60] Part of these transparency efforts could include expanding the number of states involved in the discussions about the meaning of the terms used in the UN Charter specifically in the context of cyber operations.\n\nSo far, the United States has provided the leadership and momentum necessary to begin to seek broader support for the norms. Continued support for the norms by the United States and like-minded nations will be needed. In its continued efforts in support of these international norms the United States ought to keep in mind that norms are developed not only by words, but also by acts. Given the possible U.S.-Israeli\n\nUnfortunately, the study of cyber deterrence and cyber norms is hampered by its novelty and much needed work is required to understand the processes of cyber deterrence development and normative change. Deterrence specialists have begun to pay careful attention to cyber attacks and that needs to continue. Their insights into issues related to the challenges of attribution and proportionate retaliation will be needed. The important question for international relations and legal scholars will involve understanding which norms will become legally binding international law and how, exactly, compliance with those laws comes about. It is, after all, these legal rules that will guide and determine the political actors' behavior in the cyber domain. Understanding the mechanisms and the likelihood of compliance will be the key to the longevity of peace and stability in cyberspace.[61]\n\n[85]",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          },
          {
            "index": 12,
            "markdown": "A BETTER DEFENSE\n\n# NOTES\n\n1. United Nations Group of Governmental Experts on Development in the Field of Information and Telecommunications in the Context of International Security, Note by the Secretary-General, 30 July 2010, UN Doc. A/65/201, [hereinafter UN GGE 2010 Report], www.unidir.org/pdf/activities/pdf5-act483.pdf.\n\n2. Lawrence Freedman, Deterrence (Polity, 2004). p. 5.\n\n3. In April 2007 cyber attacks swamped websites of Estonian organizations, include the Estonian parliament banks, ministries, newspapers and broadcasters, amid the country's disagreement with Russia about the relocation of a bronze soldier statute in Tallinn, Estonia. \"Europe: A Cyber-Riot: Estonia and Russia,\" *The Economist* (London), Vol. 383, No. 8528, May 12, 2007, p. 42.\n\n4. During the 2008 South Ossetia war between Russia and Georgia a series of cyber attacks disabled websites of numerous South Ossetian, Russian, and Georgian organizations. John Markoff, \"Before the Gunfire, Cyberattacks,\" *The New York Times*, August 13, 2008.\n\n5. Stuxnet is a computer worm discovered in June 2010 that is believed to have been created by the US and Israel to attack Iran's nuclear facilities. \"Legal Experts: Stuxnet Attack on Iran Was Illegal \"Act of Force,\" *Wired*, March 25, 2013.\n\n6. Martin C. Libicki, *Cyberdeterrence and Cyberwar* (Santa Monica, CA: RAND Corporation, 2009); James A. Lewis, *Conflict and Negotiation in Cyberspace*, Center for Strategic and International Studies, February 2013; Richard Kugler, *'Deterrence of Cyber Attacks,'* in Franklin D. Kramer, Stuart H. Starr and Larry K. Wentz, eds., *Cyberpower and National Security* (Dulles, VA: Potomac Books, Inc., with National Defense University Press, Washington, DC, 2009), pp. 309-40; Will Goodman, *'Cyber Deterrence: Tougher in Theory than in Practice?'*, *Studies Quarterly*, Vol. 4, No. 3 (Fall 2010), pp. 102-35.\n\n7. James A. Lewis, *Conflict and Negotiation in Cyberspace*, Center for Strategic and International Studies, February 2013; Martin C. Libicki, *Cyberdeterrence and Cyberwar* (Santa Monica, CA: RAND Corporation, 2009)\n\n8. Richard J. Harknett, John P. Callaghan and Rudi Kauffman, \"Leaving Deterrence Behind: War-Fighting and National Cybersecurity,\" *Journal of Homeland Security &amp; Emergency Management*, Vol. 7, No. 1 (2010), Article 22, pp. 2-4.\n\n9. Martin Libicki, *Cyberdeterrence*, 9. See also Jeffrey W. Knopf, \"Wrestling with Deterrence: Bush Administration Strategy after 9/11,\" *Contemporary Security Policy*, Vol. 29, No. 2 (August 2008): 229-65; Ward Wilson, \"The Myth of Nuclear Deterrence,\" *Nonproliferation Review*, Vol. 15, No. 3 (November 2008): 421-39; Lawrence Freedman, Deterrence (London: Polity, 2004); Patrick M. Morgan, \"Taking the long View of Deterrence,\" *The Journal of Strategic Studies*, Vol. 28, No. 5 (October 2005): 751-63.\n\n10. Martin Libicki, *Cyberdeterrence*, 39. Martin C. Libicki, *Cyberdeterrence and Cyberwar* (Santa Monica, CA: RAND Corporation, 2009); James A. Lewis, *Conflict and Negotiation in Cyberspace*, Center for Strategic and International Studies, February 2013; see also Richard J. Harknett, *Information Warfare and Deterrence*, *Parameters* 26, No. 3 (1996): 93-107; Lior Tabansky, \"Basic Concepts in Cyber Warfare,\" *Military and Strategic Affairs* 3, No. 1 (2001): 75-92.\n\n11. D.E. Geer, Jr., \"The Physics of Digital Law: Searching for Counterintuitive Analogies,\" in J. Balkin, et al. (eds.) *Cybercrime* (NYU Press, 2007).\n\n12. Julian E. Barnes and Siobhan Gorman, \"Cyberwar Plan Has New Focus on Deterrence,\" *The Wall Street Journal* (July 15, 2011).\n\n13. Barnes and Gorman, \"Cyberwar Plan.\"\n\n14. James A. Lewis, \"Cross-Domain Deterrence and Credible Threats,\" Washington, DC, Center for Strategic and International Studies, 2010, 4 (emphasis added).\n\n15. Lawrence Freedman, Deterrence (Cambridge: Polity, 2004), 4.\n\n16. Lawrence Freedman, Deterrence, 4.\n\n17. White House, *International Strategy for Cyberspace: Prosperity, Security, and Openness in a Networked World* (Washington, DC: White House, May 2011): 9, http://www.whitehouse.gov/sites/default/files/rss_viewer/international_strategy_for_cyberspace.pdf.\n\n18. White House, *International Strategy for Cyberspace*.\n\n19. Department of Defense, *Department of Defense Strategy for Operating in Cyberspace* (Washington, DC: Department of Defense, July 2011): 10, http://www.defense.gov/news/d20110714cyber.pdf.\n\n20. National Research Council, *Proceedings of a Workshop on Deterring Cyberattacks: Informing Strategies and Developing Options for U.S. Policy* (Washington, DC: The National Academies Press, 2010).\n\n21. UN Report by the Group of Governmental Experts on Developments in the Field of International and Telecommunications In the Context of International Security (June 24, 2013), A/68/98, [hereinafter the UN GGE 2013 Report], http://www.un.org/ga/search/view_doc.asp?symbol=A/68/98. The UN group consisted of fifteen nominated by the Governments of Argentina, Australia, Belarus, Canada, China, Egypt, Estonia, France, Germany, India, Indonesia, Japan, the Russian Federation, the United Kingdom and the United States. The GGE was originally set up in 2002 by the UN Secretary-General to study existing and potential threats in the sphere of information security and how nations could cooperate to overcome them. During its initial years, the group was unable to make any concrete progress, failing to get agreement on specific norms. With strong US leadership, however,\n\n[86] Georgetown Journal of International Affairs",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          },
          {
            "index": 13,
            "markdown": "LOTRIONTE International Engagement on Cyber III\n\nthe group was able to come to important consensus on some of the \"rules of the road\" for using force in cyberspace.\n\n22 Martha Finnemore describes three stages of a norms life-cycle: (1) norm emergence; (2) norm cascade or broad norm acceptance; (3) norm institutionalization. See Martha Finnemore and Kathryn Sikkink, \"International Norm Dynamics and Political Change,\" International Organization, vol 52, no. 4, Autumn 1998, pp. 887-917.\n\n23 Martha Finnemore, The Purpose of Intervention: Changing Beliefs About the Use of Force (London: Cornell University Press, 2003), 57.\n\n24 For example, in the case of the ban on landmines, Finnemore and Sikkink argue that, \"by May of 1997 [when] the number of states supporting the ban on anti-personnel mines reached 60, or approximately one third of the total states in the system. After that point, a norm cascade occurred and 124 states ratified the Ottawa Landmine treaty in December of 1997.\" Martha Finnemore and Kathryn Sikkink, \"International Norm Dynamics and Political Change,\" International Organization 52, No. 4 (1998), 887-917, 901\n\n25 International law has had to grapple with this issue in the context of determining when a practice of states has risen to the level of establishing a customary international law. For a rule to be a customary international law there must be practice of states and the belief that the practice is legally obligatory. See ICJ, Continental Shelf case (Libyan Arab Jamahiriya v. Malta), Judgement, 3 June 1985, ICJ Reports 1985, pp. 29-30, § 27. (\"It is of course axiomatic that the material of customary international law is to be looked for primarily in the actual practice and opinio juris of States.\") The second requirement for a rule of general customary international law to come into existence is that the State practice concerned must be both extensive and representative. It does not, however, need to be universal; a \"general\" practice suffices. No precise number or percentage of States is required. One reason why it is impossible to put a precise figure on the extent of participation required is that the criterion is in a sense qualitative rather than quantitative. That is to say, it is not simply a question of how many States participate in the practice, but also which States. In the words of the International Court of Justice in the North Sea Continental Shelf cases, the practice must \"include that of States whose interests are specially affected.\" North Sea Continental Shelf Cases (FRG/Den.: FRG/Neth.), 1969 ICJ Rep. 3, 198.\n\n26 Keith B. Alexander, \"US Cybersecurity Policy and the Role of US CYBERCOM,\" Center for Strategic and International Studies, Washington, DC (June 3, 2010), www.csis.org/event/cybersecurity-discussion-general-keith-b-alexander-director-national-security-agency.\n\n27 Thom Shanker, \"Pentagon Is Updating Conflict Rules in Cyberspace,\" New York Times (28 June 2013): 6.\n\n28 Thom Shanker, \"Pentagon Is Updating.\"\n\n29 Aliya Sternstein, \"US and Russia among 22 Nations Supporting International Cyber Resolution,\" NestGov (5 July 2011).\n\n30 See Ellen Nakashima, \"U.S., Russia May Use Alert System for Cybersecurity,\" Washington Post, 27 2012, at A1; see also Shaun Waterman, \"Cold War throwback: U.S.-Russia to use nuclear 'hotline' for new cyber showdown,\" The Washington Times (18 June 2013).\n\n31 John Markoff, David E. Sanger, and Thom Shanker, \"In Digital Combat, US Finds No Easy Deterrent,\" New York Times (25 January 2010). http://www.nytimes.com/2010/01/26/world/26cyber.html.\n\n32 See Martha Finnemore and Kathryn Sikkink, \"International Norm Dynamics and Political Change,\" International Organization, vol 52, no. 4 (Autumn 1998): pp. 887-917.\n\n33 Center for Strategic and International Studies, Cybersecurity and Cyberwarfare - Preliminary Assessment of National Doctrine and Organization, UNDIR Resources Paper, 2011, http://www.unidir.org/files/publications/pdfs/cybersecurity-and-cyberwarfare-preliminary-assessment-of-national-doctrine-and-organization-380.pdf.\n\n34 The US formulation of its no-first use policy was first stated by the US at a UN Special Session on Disarmament in 1978. In 1982, the Soviets declared its pledge not to resort to the first use of nuclear weapons. However, in 1993, Russia renounced the 1982 Soviet policy of no-first use. Harold A. Feiveson and Ernst Jan Hogendoorn, \"No First Use of Nuclear Weapons,\" The Nonproliferation Review, Summer 2003, p. 2-3.\n\n35 Lewis PAGE\n\n36 James Lewis, Conflict and Negotiation, 53. For a contrary view, see Adam Segal, \"Cyber space governance: the nextsteps,\" Council on Foreign Relations, Policy Innovation Memorandum, No. 2 (November 14, 2011): 3, http://www.cfr.org/cybersecurity/cyberspace-governance-next-step/p24397.\n\n37 James Lewis, Conflict and Negotiation.\n\n38 Clarke and Knake, Cyber War, 202-203.\n\n39 Christopher Joyner and Catherine Lotrionte, \"Information Warfare as International Coercion: Elements of a Legal Framework,\" European Journal of International Law 12 (2001): 825; Michael N. Schmitt, \"Computer Network Attacks and the Use of Force in International Law: Thoughts on a Normative Framework,\" Columbia Transnational Law Journal 37(1999): 885 (advocating the benefits of fitting cyberattacks within the existing use of force framework).\n\n40 UN Charter, Art. 2, para. 4.\n\n41 Marco Roscini, \"World Wide Warfare - Jus Ad Bellum and the Use of Cyber Force,\" 14 Max Planck Y.B. United Nations L. 85, 96 (2010)(Ger.), 113.\n\n42 Matthew Waxman, Cyber-Attacks and the Use of Force: Back to the Future of Article 2(4), 36, Yale Journal of International Law, 421, 434-35 (2011). While states are not permitted to use forcible self-defense responses to a use of force, states can use countermeasures in response to\n\n[87]",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          },
          {
            "index": 14,
            "markdown": "A BETTER DEFENSE\n\nuses of force.\n43 UN Charter, Art. 51.\n44 Military and Paramilitary Activities in and Against Nicaragua (Nicar. V. U.S.), Judgment, 1986 [C] 14, paras. 191, 210 (June 27) (\"[M]easures which do not constitute an armed attack . . . may nevertheless involve a use of force.\")\n45 Roscini, at 113.\n46 Oona Hathaway, et al., The Law of Cyber-Attack, 100 Calif. L. Rev. 817, 840 (2012).\n47 Gary D. Brown, \"Why Iran Didn't Admit Stuxnet Was an Attack,\" Joint Forces Quarterly, 4th Quarter 2011, at 70, 71.\n48 Michael N. Schmitt ed., Tallinn Manual on the International Law Applicable to Cyber Warfare (Cambridge Univ. Press, 2013) [hereinafter the Manual], http://www.ccdcoe.org/249.html.\n49 Id.\n50 Michael Schmitt ed., Manual, 108.\n51 Cordula Droege, \"Get off my cloud,\" 27.\n52 Herb Lin, \"Cyber conflict and international humanitarian law,\" International Review of the Red Cross, Vol. 94, No. 886 (Summer 2012): 530. See Catherine Lotrione, \"Cyber Operations: Conflict Under International Law,\" in Georgetown Journal of International Affairs, Special Issue, International Engagement on Cyber: Establishing Norms and Improving Security (2012): 20. See also Michael Schmitt, ed., Manual, 44, 58.\n53 Michael Schmitt, Manual, 11.\n54 International Strategy for Cyberspace: Prosperity, Security, and Openness in a Networked World (Washington, DC: White House, 2011): 9.\n\n55 Abram Chayes and Antonia Handler Chayes, \"On Compliance,\" International Organization 47-2 (spring 1993), pp. 175-206.; Jeffrey W. Legro, \"Which Norms Matter? Revisiting the \"Failure\" of Internationalism,\" International Organization, Vol. 51, No. 1 (Winter, 1997), pp. 31-63; Thomas M. Franck, \"The Emerging Right to Democratic Governance,\" The American Journal of International Law, Vol. 86, No. 1, (Jan., 1992), pp. 46-91.\n56 Legro 1997; Franck 1992.\n57 Emanuel Adler, \"Complex Deterrence in the Asymmetric-Warfare Era,\" in T. V. Paul, Patrick M. Morgan and James J. Wirtz, ed., et al., Complex Deterrence: Strategy in the Global Age (Chicago, IL: University of Chicago Press, 2009), p. 88.\n58 Kenneth W. Abbott and Duncan Snidal, \"Hard and Soft Law in International Governance,\" International Organization 54 (Summer 2000): 423.\n59 Richard Price argues that the landmine norm resonates with pre-established norms of humanitarian law, providing an advantage for the norms development. This is described in the norms literature as grafting norms, embedded norm discrimination, or nesting. Richard Price, \"Reversing the Gun Sights: Transnational Civil Society Targets Land Mines,\" International Organizations Vol. 52, no. 3 (1998), 613-644, 628.\n60 James A. Lewis and Katrina Timlin, Cybersecurity and Cyberwarfare: Preliminary Assessment of National Doctrine and Organization (Geneva: UNDIR, 2011).\n\nGeorgetown Journal of International Affairs",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1950,
              "width": 1320
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 15,
          "doc_size_bytes": 2057640
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "HEINONLINE\nDATE DOWNLOADED: Thu Apr 10 17:05:47 2025\nSOURCE: Content Downloaded from HeinOnline\n## Citations:\nPlease note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n## Bluebook 21st ed.\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 GEO. J. INT'L AFF. 75 (2013).\n## ALWD 7th ed.\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 Geo. J. Int'l Aff. 75 (2013).\n## APA 7th ed.\nLotrionte, Catherine. (2013). better defense: examining the united states' new norms-based approach to cyber deterrence. Georgetown Journal of International Affairs, 14(3), 75-88.\n## Chicago 17th ed.\nCatherine Lotrionte, \"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence,\" Georgetown Journal of International Affairs 14, no. 3 (2013): 75-88\n## McGill Guide 10th ed.\nCatherine Lotrionte, \"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence\" (2013) 14:3 Geo J Int'l Aff 75.\n## AGLC 4th ed.\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14(3) Georgetown Journal of International Affairs 75\n## MLA 9th ed.\nLotrionte, Catherine. \"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence.\" Georgetown Journal of International Affairs, vol. 14, no. 3, 2013, pp. 75-88. HeinOnline.\n## OSCOLA 4th ed.\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14 Geo J Int'l Aff 75 Please note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\n-- To obtain permission to use this article beyond the scope of your license, please use: Copyright Information\n# A Better Defense\n*Examining the United States’ New Norms-Based Approach to Cyber Deterrence*\n## Catherine Lotrionte\nSince 2010, states have sought further methods for deterring adversarial actions through the Internet and recognized the need to develop forms of cyber deterrence as a key consideration in the pursuit of national and international security. In 2010, the UN Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (GGE) recommended that any further dialogue among states and other actors on norms pertaining to state use of Information and Communication Technologies (ICTs) to reduce collective risk and protect critical national and international infrastructure include discussions on the use of ICTs in conflict.¹\nThis article examines how the United States has worked to develop cyber deterrence in its more recent efforts by relying on a normative approach to establish “rules of the road” for conflict in cyberspace. It argues that the U.S. norms-based approach, in conjunction with U.S. military power, can reinforce general deterrence in cyberspace, increasing global stability. The article probes links between norms, international law, and deterrence policies, identifying conditions that may increase the potential utility of a strategic norms-based approach for calculations of military-security\n**Catherine Lotrionte** is Director of the Institute for Law, Science, &amp; Global Security and a Visiting Assistant Professor of Government and Foreign Service at Georgetown University. Dr. Lotrionte has served as Counsel to the President’s Foreign Intelligence Advisory Board at the White House and as Assistant General Counsel at the Central Intelligence Agency. She is the Director and Founder of the Cyber Project at Georgetown University and a Life Member of the Council on Foreign Relations.\n[75]\nA BETTER DEFENSE\npolicy in the cyber domain. It argues that by embedding cyber deterrence practice in a set of norms, the deterrence strategy will be more likely to stabilize and restrain self-help behavior of states in the cyber domain. In other words, international norms can serve as a structure to increase the chances of deterrence success.\nThe article notes the potential limitations of cyber deterrence as examined by many others, but maintains that a synergy exists between recent developments in international engagement on cyber norms and the academic literatures, pointing to new lines of norms-based research in constructivism that can aid in strengthening the potential for cyber deterrence for the future. The basic proposition of the article is that understanding norms, how and when they develop, and their potential to evolve into binding international law, is essential to the effectiveness of a cyber deterrence policy. Drawing on the work of Lawrence Freedman, the article illustrates how a norms-based approach, rather than an interest-based approach, better reflects how deter-\ncontext of social construction based on the interest and identity of states.\n## Deterrence in a Post-Cold War Era\nAs recent international events such as Estonia (2007),³ Georgia (2008),⁴ and Stuxnet (2010)⁵ created elevated awareness and security concerns, scholars and policymakers have turned their attention to the “cyber” issue focusing on whether deterrence theory can work in the cyber domain.⁶ Although the traditional notions of deterrence theory based on military strength have yet to mature in cyberspace,⁷ the United States has recently begun to develop a new strand of cyber strategy and policy—agreement on international norms and legal rules for cyber conflict—that I argue could deliver a positive deterrent effect. Indeed, the United States’ recent policies reflect a recognition that a normative approach could indeed provide the necessary deterrent effect with regard to certain uses of cyberspace during conflict.\nSome have argued that cyber deterrence as a U.S. strategic option is so discredited that it should be discarded completely.\nrence works in practice, “through actors internalizing a sense of appropriate limits on their actions.”² In sum, cyber weapons alone will not guarantee deterrence. If indeed cyber weapons come to be viewed as deterrent weapons it is not only because of the nature of the technology, but also through a normative\ncompletely.⁸ Recent scholarship has highlighted a number of challenges for cyber deterrence, illustrating the difficulty of deterrence’s translation into cyberspace and arguing, “concepts of deterrence and war may simply lack the logical foundations that they have in the nuclear and conventional realms.”⁹\nGeorgetown Journal of International Affairs\nLOTRIONTE International Engagement on Cyber III\nSome of the barriers to cyber deterrence that have been analyzed include: limits of attribution of the adversary, difficulty in holding the adversary's assets at risk, limits to an ability to continue an attack, involvement of non-state actors, and lack of a counterforce option.¹⁰ In short, some analysts have argued, the fundamental nature of the cyber domain is different than the physical domain and requires adopting new rules for state conduct and policy.¹¹\nIn 2009, perhaps to signal to opponents the United States' seriousness in developing cyber capabilities for conflict, the United States established its first cyber command and has since developed significant offensive cyber capabilities. In July 2011, the then-vice chairman of the joint Chiefs of Staff General James Cartwright, spoke further about the need to develop cyber deterrence through both punitive and denial mechanisms.¹² As Cartwright noted, \"There is no penalty to attacking us now. We have to figure out how to change that.\"¹³ Recently, in seeming recognition that military action in cyberspace to punish or deny using military resources may not be the best approach to deterring adversaries, a new norms-based approach to deterrence has begun to emerge in U.S. policy discussions.\nIn summarizing some of the options available to bolster U.S. cyber deterrence efforts, James Lewis has drawn attention to a normative component of cyber deterrence strategy:\nBetter defenses could be reinforced by multilateral understandings on acceptable behavior in cyberspace—explicit norms and obligations... Just as nations feel a degree of constraint from norms and agreements on non-proliferation, establishing explicit international norms for behavior in cyberspace would affect political decisions on the potential risk and cost of cyber attack.¹⁴\nA norms-based approach to deterrence—as opposed to a strictly interests-based approach—is one that reinforces \"certain values to the point where it is well understood that they must not be violated.\"¹⁵ While this approach provides hope for developing effective cyber deterrence it will require the exercise of many elements of foreign policy, rather than the use or threatened use of military force alone.¹⁶ The next section describes the recent policies announced by the United States supporting international norms in cyberspace.\n## The Role of the United States.\nIn May 2011 the United States released International Strategy for Cyberspace, its first policy document promoting international norms in the context of \"applying the expectations of peaceful and just interstate conduct to cyberspace\" in order to effect \"stability,\" as exists in \"other spheres of international relations.\"¹⁷ The document recognized that \"adherence to such norms brings predictability to state conduct, helping prevent the misunderstandings that could lead to conflict.\"¹⁸ During the same year, the Department of Defense's Strategy for Operating in Cyberspace described how the department would work with international partners \"to encourage responsible behavior and oppose those who would seek to disrupt networks and systems, dissuade and deter malicious actors, and reserve the right to defend these vital national\n[77]\nA BETTER DEFENSE\nassets as necessary and appropriate.\"¹⁹\nThese policies focus on regulative norms concerned with preventing inter-state conflict, or at least shaping and limiting the use of cyber attacks in\nof \"norm emergence,\" attention was called to the issue by the United States and like-minded states, and support was built. This began the socialization process of the norm life cycle.²² This\n# The United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace.\ncyber conflict.²⁰ As the United States promulgated its own domestic norms related to these international norms, the norms were being socialized to other states and the global cybersecurity agenda at the UN. The socialization of these norms is illustrated in states' agreeing to the 2013 GGE report. At the UN, for the first time, fifteen states, including Russia and China, agreed that the UN Charter principles and international law, in general, applies in the cyber domain. The report also upheld the principle of state responsibility for curbing or halting cyber attacks originating in their territories.²¹\nBased on pre-existing principles of international law, specifically *jus ad bellum*, the laws related to the recourse to the use of force, and *jus in bello*, laws related to armed conflict, the United States has campaigned for international agreement on cyber norms. To date, the United States has succeeded in persuading at least fifteen states to embrace the norms of the UN Charter and state responsibility in the context of cyberspace. As a norm entrepreneur, the United States has framed the issues in a way that challenges the appropriateness of what is generally accepted today in cyber conflict. During this stage\nacceptance was possible in part because of the pre-existence of similar humanitarian issues related to conflict. As constructivist theory contends, \"mutually reinforcing and consistent norms appear to strength one another.\"²³\nAlthough the GGE process has been an important step in the right direction, with only fifteen states in agreement, it lacks widespread international support. Only when a \"critical mass\" of states agree to a norm will the norm reach a \"tipping point,\" after which the norm gains widespread acceptance through a \"cascading\" effect.²⁴ Although it is not possible to predict exactly how many states are needed to \"tip\" the process, international law suggests that the \"tipping\" would occur once a majority of states in the international system adopt the norm.²⁵ For example, in the case of the norm of non-use of force, in the intervening years between the League of Nations in 1919, which had no mention of the norm of non-use of force, and the UN Charter in 1945, the norm achieved widespread support. It was considered so unproblematic by 1945 that at the negotiations of the UN Charter, no state felt the need to provide a public defense of Article 2(4) of the Charter. The UN Charter went\n[78] Georgetown Journal of International Affairs\nLOTRIONTE International Engagement on Cyber III\ninto force in 1945 with about 60 states as signatories.\nPositive signs exist for further engagement on cyber issues. For example, there are signs that the United States is willing to engage with the Russian Federation on proposals to limit the military use of cyberspace, thereby reversing the trend of recent years.²⁶ In 2013, General Martin Dempsey, at a public forum discussing cyber threats, explained that the Chinese \"did not believe that hacking American systems violated any rules, since no rules existed.\"²⁷ He noted that American and Chinese officials had plans to meet to discuss ways \"to establish some rules of the road\" with respect to cyberattacks against U.S. companies to steal intelligence property.²⁸ In July 2011, an Organization for Security and Cooperation in Europe (OSCE) resolution to share information on cyber deployments during military conflicts was co-sponsored by the United States, Russia, and other nations.²⁹\nMost recently in June 2013, Russia and the United States agreed to a hotline for real-time communications during a cyber-crisis, enabling both states to avoid misunderstandings and preventing potential escalation.³⁰ This is an indication of the emergence of a set of agreements between the two states to reduce conflict by contacting each other if there is a cyber incident instead of resorting to self-defense first. The United States has also conducted war games to figure out just how these rules would apply if it had to respond to a cyber attack against its critical infrastructure, and has recently updated its classified military rules of engagement in cyberspace for the first time in seven years.³¹\nSuch instances of cooperative efforts can act as a mechanism for the institutionalization of the norms across states through iterated behavior and habit; frequent interactions among individuals involving joint work can ultimately create predictability, stability, and habits of trust. Expanding these efforts through informal, non-obligatory intergovernmental cooperation, confidence building measures of transparency, and the creation of internationally recognized red lines would further increase international support.³³\n## Finding Norms for Cyberspace.\nDuring the Cold War, the Soviets Union and United States were able to establish both formal and informal arrangements to minimize the potential for catastrophic war and escalation. Today, the United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace in order to avoid widespread, potentially devastating, damage in cyberspace. The U.S. efforts seeking agreement on specific norms related to international law and the use of force in the cyber domain may prove the most fruitful for international agreement. While a \"no-first use\" norm, like that which emerged during the Cold War,³⁴ is unlikely to develop for the cyber domain, a norm of \"acceptable use\" could emerge, illuminating the \"red lines\" of cyber operations.³⁵ States could agree to certain acceptable targets in cyberspace during conflict. There is international humanitarian law on the issue of legitimate targets during conflict, especially the long standing prin\n[79]\nA BETTER DEFENSE\nciples of *jus in bello*, which requires civilian populations to be protected during conflict and that gains of a military action need to be proportionate by not causing unnecessary harm or suffering. Extending these principles to the context of cyber conflict could be instrumental in developing an understanding that during a conflict in cyberspace military installations would be legitimate targets for cyber attacks, but financial institutions would not be legitimate targets given the uncertainties or unacceptable collateral damage to civilian populations. Targets such as banks, global positioning systems, and other infrastructure used for both military and civilian purposes could, under\nintrusions against industrial control targets, such that any cyber operation against such targets \"would be interpreted as the prelude to an attack,\" reasoning that an intrusion against such a target could only be useful as preparation for a future attack since there is no \"intelligence value to hacking an industrial control system.\"³⁶\nThis approach would be helpful in the case of a state considering the use of anticipatory self-defense under circumstances when it would be difficult to identify with certainty the purpose behind a particular cyber operation. In the context of intrusions into industrial control systems, for instance, it would be challenging to distinguish a cyber\n# A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions.\nthe current interpretation of the law, be legitimate targets in cyber conflict unless states were to agree otherwise.\nIn exploring additional options for regulating state behavior in cyber, the scenario of intrusions against industrial control systems illustrates the need for more clarity. Numerous critical installations of states such as power plants, nuclear plants, dams, water treatment and distribution systems, oil refineries, banking systems, hospital systems, and air traffic control systems rely on supervisory control and date acquisition systems, and distributed control systems. Some have proposed that it would be beneficial to prohibit cyber\nintrusion of a state's air defense that is meant as an *intelligence collection operation*—theft of information—from the same technical intrusion meant to identify vulnerabilities in anticipation of a *cyber attack* with physical, destructive results. Under the current understandings of the norms related to espionage versus \"armed attack\" under the UN Charter, an implant that is meant to support a subsequent \"armed attack\" would merit, and the law would allow for, a more hostile use of force response, in contrast to the discovery of a similar implant that was meant only to support espionage. This is due to the fact that under traditional understand-\n[80] Georgetown Journal of International Affairs\nLOTRIONTE International Engagement on Cyber III\nings of international law, espionage does not constitute a \"use of force\" for purposes of the UN Charter, and certainly not an \"armed attack.\" Therefore, the victim of such a cyber intelligence collection operation would not have the lawful right of forcible self-defense whereas the victim of a cyber attack would, under the UN Charter, have the right of a forcible self-defense response.\nThis traditional understanding of the law may not be acceptable to states in the cyber context where the distinction between the cyber weapons used for intelligence collection and those used for sabotage cannot easily be made. And yet there is likely not going to be an amendment to the UN Charter to accommodate this complexity especially since state practice has indicated an unwillingness to consider intelligence collection a \"use of force.\" In this case, a new understanding of acceptable behavior under such circumstances would require states to reach a new agreement given the facts specific to cyber operations.\nIn the case of control systems, securing states' agreement to refrain from conducting cyber attacks against such systems certainly would be useful.[37] A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions. Indeed, there is some evidence that this may be an area that states, at least some states, would be restrained. The United States, for instance, in at least two different instances decided not to conduct cyber attacks against foreign financial networks. The Bush and Clinton administrations both refused to authorize hacking into foreign financial systems because of concerns of collateral damage and possible blowback on the United States.[38] Yet, the question remains whether other states would agree to refrain from doing the same. A shared understanding among states that financial institutions ought not to be targets for a cyber attack would be useful especially for the United States since it already appears to refrain from such actions.\nChallenges to Application. International law will play an important role in the normative framework for cyber deterrence as it is the international legal framework of \"war\" that provides the basis for cyber operations. Over the last decade, the growing concern over increased violence and the potential for state conflict in the cyber domain has led international legal scholars to assess how to accommodate an international legal framework for warfare in cyberspace, trying to bring some clarity to how international law would apply in the context of cyber conflict.[39] In particular, the applicability of international regarding the use of force and the right of self-defense is central to any clarification of when and under what circumstances a disruptive exploit in cyberspace could be considered an armed attack, triggering a use of force in self-defense.\nThe most relevant international law on the issue of deterrence and the use of cyberweapons is the law relating to the use of force enshrined in the UN Charter, *jus ad bellum*, and the law applicable in armed conflict that regulates the conduct of hostilities, *jus in\n[81]\nA BETTER DEFENSE\nbello. The UN Charter and customary law determine when cyber operations may be conducted, namely, in self-defense. While it is not necessary to fully explain the UN Charter paradigm here, it is necessary to address the issue of \"use of force\" and \"armed attack,\" two of the key terms in the Charter paradigm. The Charter prohibits \"the threat or use of force against the territorial integrity of political independence\" of a state.⁴⁰ Therefore, any cyber operation that amounts to a use of force is illegal.⁴¹ The UN Charter, however, does not allow the victim of a cyber operation that amounts to a \"use of force\" to respond in forcible self-defense.⁴² Such responses are limited to activities that equate to an armed attack pursuant to Article 51 of the Charter.⁴³\nBased on the interpretation of these principles by the UN Charter and the International Court of Justice (ICJ),⁴⁴ a state's ability to signal a \"strike back\" deterrent to a cyber operation in self-defense would be subject to a finding that the cyber operation was not only a use of force but also an armed attack.⁴⁵ Unfortunately, neither the Charter nor the ICJ has provided specific definitions for these terms. In addition, there has yet to be a reported cyber operation between states that has been acknowledged as a use of force, let a lone an armed attack.⁴⁶ The recent Stuxnet cyber operation against the Iranian nuclear capabilities is likely to be the closest.⁴⁷ Yet there is debate as to whether Stuxnet was a use of force or an armed attack for purposes of the UN Charter.⁴⁸\nRecent efforts to incorporate cyber warfare in our long-standing international legal systems prohibiting the use of force and protecting civilians from the effects of war illustrate the considerable challenges and incongruities in attempting to fit cyber into the conventional armed conflict framework. Two notable efforts have been the Tallinn Manual on the International Law Applicable to Cyber Warfare (the Manual)⁴⁹ and the International Committee of the Red Cross's (ICRC) first major article on cyber warfare published in 2012. In the ICRC article, the ICRC disagrees with the Manual's position on what would constitute an \"attack\" during armed conflict requiring physical effects. According to the majority of the experts on the Manual, \"interference with functionality qualifies as damage\" for purposes of determining if something was an \"attack\" during an armed conflict, \"if restoration of functionality requires replacement of physical components.\"⁵⁰ The ICRC, on the other hand, concludes that \"disrupting the functioning of certain systems by interfering with their underlying computer systems can amount to damage insofar as it impairs their usefulness,\" and therefore, an attack would also \"be understood to encompass such operations that disrupt the functioning of objects without physical damage or destruction, even if the disruption is temporary.\"⁵¹ Disagreement among the group of experts who drafted the Manual and the ICRC highlights the challenges in applying existing international law to the cyber domain.\nOvercoming the Obstacles. Over centuries, in the context of the physical realm, the international legal terms of \"use of force,\" \"armed attack,\" and \"self-defense\" have come to have mean-\nGeorgetown Journal of International Affairs\nLOTRIONTE International Engagement on Cyber III\ning in treaties, the practice of states, and through the dispute resolution process at the UN Security Council and the International Court of Justice. Today, for such activities in cyberspace, we need new consensus about the meanings of these legal terms, how they apply in cyberspace, and the situations in which the different thresholds would be triggered based on cyber operations. It is important for states to understand what would constitute an armed attack in cyberspace that would then trigger the target state's right of self-defense. Given that most of the malicious cyber activities that have occurred to date fall below the level of the use of force and armed attack thresholds of the UN Charter and the laws of armed conflict,52 and, given the fact that even for the areas of international law addressed in the Manual there is no state consensus,53 uncertainty remains about the rules meant to constrain behavior that apply in the cyber domain.54 In order for deterrence to work and widespread agreement on cyber norms to occur, there needs to be some shared expectations between states about what is acceptable behavior and what is not acceptable behavior in the cyber domain.\nIn lieu of any formal international treaty defining these terms in cyber, agreeing to norms will be important to providing needed clarity for states to understand the context in which they are operating in the cyber domain. Those norms that are clear and specific, rather than ambiguous and complex,55 and those that have been around for a long period of time, surviving numerous challenges are more likely to be effective.56 Starting with those norms related to the use of force in cyber-\nspace, where there is legal precedent, makes sense. The next step would be to come to agreement on the meaning of the terms as used in the UN Charter. For example, the United States could seek to develop a specific domestic policy articulating when Article 51 of the UN Charter would be triggered by a cyber incident, establishing a clear threshold and share it with other states in order to seek agreement.\nAs deterrence theorists have argued, in order for deterrence strategy to work, states must be aware of the \"rules and logic of the [strategic] game\" which is communicated between states and which serves not only to inform their actions but also their identities.57 As part of a cyber declaratory deterrence policy, U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons. To develop such norms, threats of military action alone will not suffice. Rather, the diplomatic elements of foreign policy will need to be exercised to establish and reinforce certain values to the point where it is well understood by states that they must not be violated. Clear statements by the United States would be useful in setting forth the specifics of what those values are as envisioned in cyberspace.\nConclusion. These recent events support the emergence of a U.S. national cyber strategy where cyber deterrence is pursued not solely through national security capabilities (the development of offensive cyber capabilities at U.S. Cyber Command), but also through diplomatic and normative, means.\n[83]\nA BETTER DEFENSE\nPlacing issues of cyber conflict under the auspices of the UN and the UN Charter principles makes sense. This will ultimately make the development of the norms easier for states to accept by embedding them in already existing international law and an international organization with members with conflicting identities and competing interests that plays an important role in norm innovation, cascading, institutionalization, and enforcement. Because of the lack of clarity in international law on the meaning of terms like \"armed attack,\" more work is required to identify exactly what the norm is and what constitutes violation as well as spelling out the procedures by which norm leaders coordinate disapproval and sanctions for norm breaking.\nThis article has argued that a norms-based approach, in conjunction with military cyber power, can deliver some cyber deterrence where military power alone is limited. Although the emergency suffering, principles which support the norms the United States is promoting through the GGE process. Second, the UN GGE process provides an organizational platform for the issues. With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\nThe \"rules of acceptable behavior\" that cyber deterrence scholars and recent U.S. cyber strategy documents have discussed, fit into this category of \"rules of the game\" that can take the form of consensual bilateral or multilateral declarations of principles, or even unilateral declarations and actions. The United States presently prefers non-legally binding agreements for cyber as compared to Russia that has advocated for an international treaty. The rationale for non-legally binding agreement may be that such agreements offer decision-makers opportunities to\n# U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons.\ngence of norms in cyberspace is in its early stages and it is too early to predict how these emerging norms, there are two central factors that support the potential for broader support for the norms the United States is promulgating. First, there is a tradition of international law and norms on which the cyber issues can be based that codify the principles of uses of force, self-defense, proportionality, discrimination and\nlearn about the social effects of particular sets of rules over time, amending them accordingly, typically with lower negotiation costs than entailed by the renegotiation of treaties.[58] States may need time to learn about the technology and to arrive at conclusions about the kinds of behavior they prefer in the new domain of cyberspace.\nEmbedding the new cyber norms as stated in the GGE report in pre\n[84] Georgetown Journal of International Affairs\nLOTRIONTE International Engagement on Cyber III\nexisting and widely accepted international legal principles may alleviate the need for a separate, stand-alone treaty for cyber conflict.59 Indeed, given the political context for cybersecurity where mistrust and geopolitical rivalry among states exists, such informal norms may be more attractive given that it is easier\ninvolvement in the Stuxnet cyber operation against Iran's uranium facility, the United States will likely face criticism and allegations of double standards. The United States must find a way to address these concerns and not lose momentum in the socialization of cyber conflict norms.\n# With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\nto obtain agreement on them. If more formal agreement on specific norms is the ultimate goal, the intermediate goal for the United States should be to develop confidence-building measures involving transparency between states in order to build trust, laying the groundwork for future consensus on specific norms.[60] Part of these transparency efforts could include expanding the number of states involved in the discussions about the meaning of the terms used in the UN Charter specifically in the context of cyber operations.\nSo far, the United States has provided the leadership and momentum necessary to begin to seek broader support for the norms. Continued support for the norms by the United States and like-minded nations will be needed. In its continued efforts in support of these international norms the United States ought to keep in mind that norms are developed not only by words, but also by acts. Given the possible U.S.-Israeli\nUnfortunately, the study of cyber deterrence and cyber norms is hampered by its novelty and much needed work is required to understand the processes of cyber deterrence development and normative change. Deterrence specialists have begun to pay careful attention to cyber attacks and that needs to continue. Their insights into issues related to the challenges of attribution and proportionate retaliation will be needed. The important question for international relations and legal scholars will involve understanding which norms will become legally binding international law and how, exactly, compliance with those laws comes about. It is, after all, these legal rules that will guide and determine the political actors' behavior in the cyber domain. Understanding the mechanisms and the likelihood of compliance will be the key to the longevity of peace and stability in cyberspace.[61]\n[85]\nA BETTER DEFENSE",
  "references": [
    "# NOTES\n1. United Nations Group of Governmental Experts on Development in the Field of Information and Telecommunications in the Context of International Security, Note by the Secretary-General, 30 July 2010, UN Doc. A/65/201, [hereinafter UN GGE 2010 Report], www.unidir.org/pdf/activities/pdf5-act483.pdf.\n2. Lawrence Freedman, Deterrence (Polity, 2004). p. 5.\n3. In April 2007 cyber attacks swamped websites of Estonian organizations, include the Estonian parliament banks, ministries, newspapers and broadcasters, amid the country's disagreement with Russia about the relocation of a bronze soldier statute in Tallinn, Estonia. \"Europe: A Cyber-Riot: Estonia and Russia,\" *The Economist* (London), Vol. 383, No. 8528, May 12, 2007, p. 42.\n4. During the 2008 South Ossetia war between Russia and Georgia a series of cyber attacks disabled websites of numerous South Ossetian, Russian, and Georgian organizations. John Markoff, \"Before the Gunfire, Cyberattacks,\" *The New York Times*, August 13, 2008.\n5. Stuxnet is a computer worm discovered in June 2010 that is believed to have been created by the US and Israel to attack Iran's nuclear facilities. \"Legal Experts: Stuxnet Attack on Iran Was Illegal \"Act of Force,\" *Wired*, March 25, 2013.\n6. Martin C. Libicki, *Cyberdeterrence and Cyberwar* (Santa Monica, CA: RAND Corporation, 2009); James A. Lewis, *Conflict and Negotiation in Cyberspace*, Center for Strategic and International Studies, February 2013; Richard Kugler, *'Deterrence of Cyber Attacks,'* in Franklin D. Kramer, Stuart H. Starr and Larry K. Wentz, eds., *Cyberpower and National Security* (Dulles, VA: Potomac Books, Inc., with National Defense University Press, Washington, DC, 2009), pp. 309-40; Will Goodman, *'Cyber Deterrence: Tougher in Theory than in Practice?'*, *Studies Quarterly*, Vol. 4, No. 3 (Fall 2010), pp. 102-35.\n7. James A. Lewis, *Conflict and Negotiation in Cyberspace*, Center for Strategic and International Studies, February 2013; Martin C. Libicki, *Cyberdeterrence and Cyberwar* (Santa Monica, CA: RAND Corporation, 2009)\n8. Richard J. Harknett, John P. Callaghan and Rudi Kauffman, \"Leaving Deterrence Behind: War-Fighting and National Cybersecurity,\" *Journal of Homeland Security &amp; Emergency Management*, Vol. 7, No. 1 (2010), Article 22, pp. 2-4.\n9. Martin Libicki, *Cyberdeterrence*, 9. See also Jeffrey W. Knopf, \"Wrestling with Deterrence: Bush Administration Strategy after 9/11,\" *Contemporary Security Policy*, Vol. 29, No. 2 (August 2008): 229-65; Ward Wilson, \"The Myth of Nuclear Deterrence,\" *Nonproliferation Review*, Vol. 15, No. 3 (November 2008): 421-39; Lawrence Freedman, Deterrence (London: Polity, 2004); Patrick M. Morgan, \"Taking the long View of Deterrence,\" *The Journal of Strategic Studies*, Vol. 28, No. 5 (October 2005): 751-63.\n10. Martin Libicki, *Cyberdeterrence*, 39. Martin C. Libicki, *Cyberdeterrence and Cyberwar* (Santa Monica, CA: RAND Corporation, 2009); James A. Lewis, *Conflict and Negotiation in Cyberspace*, Center for Strategic and International Studies, February 2013; see also Richard J. Harknett, *Information Warfare and Deterrence*, *Parameters* 26, No. 3 (1996): 93-107; Lior Tabansky, \"Basic Concepts in Cyber Warfare,\" *Military and Strategic Affairs* 3, No. 1 (2001): 75-92.\n11. D.E. Geer, Jr., \"The Physics of Digital Law: Searching for Counterintuitive Analogies,\" in J. Balkin, et al. (eds.) *Cybercrime* (NYU Press, 2007).\n12. Julian E. Barnes and Siobhan Gorman, \"Cyberwar Plan Has New Focus on Deterrence,\" *The Wall Street Journal* (July 15, 2011).\n13. Barnes and Gorman, \"Cyberwar Plan.\"\n14. James A. Lewis, \"Cross-Domain Deterrence and Credible Threats,\" Washington, DC, Center for Strategic and International Studies, 2010, 4 (emphasis added).\n15. Lawrence Freedman, Deterrence (Cambridge: Polity, 2004), 4.\n16. Lawrence Freedman, Deterrence, 4.\n17. White House, *International Strategy for Cyberspace: Prosperity, Security, and Openness in a Networked World* (Washington, DC: White House, May 2011): 9, http://www.whitehouse.gov/sites/default/files/rss_viewer/international_strategy_for_cyberspace.pdf.\n18. White House, *International Strategy for Cyberspace*.\n19. Department of Defense, *Department of Defense Strategy for Operating in Cyberspace* (Washington, DC: Department of Defense, July 2011): 10, http://www.defense.gov/news/d20110714cyber.pdf.\n20. National Research Council, *Proceedings of a Workshop on Deterring Cyberattacks: Informing Strategies and Developing Options for U.S. Policy* (Washington, DC: The National Academies Press, 2010).\n21. UN Report by the Group of Governmental Experts on Developments in the Field of International and Telecommunications In the Context of International Security (June 24, 2013), A/68/98, [hereinafter the UN GGE 2013 Report], http://www.un.org/ga/search/view_doc.asp?symbol=A/68/98. The UN group consisted of fifteen nominated by the Governments of Argentina, Australia, Belarus, Canada, China, Egypt, Estonia, France, Germany, India, Indonesia, Japan, the Russian Federation, the United Kingdom and the United States. The GGE was originally set up in 2002 by the UN Secretary-General to study existing and potential threats in the sphere of information security and how nations could cooperate to overcome them. During its initial years, the group was unable to make any concrete progress, failing to get agreement on specific norms. With strong US leadership, however,\n[86] Georgetown Journal of International Affairs\nLOTRIONTE International Engagement on Cyber III\nthe group was able to come to important consensus on some of the \"rules of the road\" for using force in cyberspace.\n22 Martha Finnemore describes three stages of a norms life-cycle: (1) norm emergence; (2) norm cascade or broad norm acceptance; (3) norm institutionalization. See Martha Finnemore and Kathryn Sikkink, \"International Norm Dynamics and Political Change,\" International Organization, vol 52, no. 4, Autumn 1998, pp. 887-917.\n23 Martha Finnemore, The Purpose of Intervention: Changing Beliefs About the Use of Force (London: Cornell University Press, 2003), 57.\n24 For example, in the case of the ban on landmines, Finnemore and Sikkink argue that, \"by May of 1997 [when] the number of states supporting the ban on anti-personnel mines reached 60, or approximately one third of the total states in the system. After that point, a norm cascade occurred and 124 states ratified the Ottawa Landmine treaty in December of 1997.\" Martha Finnemore and Kathryn Sikkink, \"International Norm Dynamics and Political Change,\" International Organization 52, No. 4 (1998), 887-917, 901\n25 International law has had to grapple with this issue in the context of determining when a practice of states has risen to the level of establishing a customary international law. For a rule to be a customary international law there must be practice of states and the belief that the practice is legally obligatory. See ICJ, Continental Shelf case (Libyan Arab Jamahiriya v. Malta), Judgement, 3 June 1985, ICJ Reports 1985, pp. 29-30, § 27. (\"It is of course axiomatic that the material of customary international law is to be looked for primarily in the actual practice and opinio juris of States.\") The second requirement for a rule of general customary international law to come into existence is that the State practice concerned must be both extensive and representative. It does not, however, need to be universal; a \"general\" practice suffices. No precise number or percentage of States is required. One reason why it is impossible to put a precise figure on the extent of participation required is that the criterion is in a sense qualitative rather than quantitative. That is to say, it is not simply a question of how many States participate in the practice, but also which States. In the words of the International Court of Justice in the North Sea Continental Shelf cases, the practice must \"include that of States whose interests are specially affected.\" North Sea Continental Shelf Cases (FRG/Den.: FRG/Neth.), 1969 ICJ Rep. 3, 198.\n26 Keith B. Alexander, \"US Cybersecurity Policy and the Role of US CYBERCOM,\" Center for Strategic and International Studies, Washington, DC (June 3, 2010), www.csis.org/event/cybersecurity-discussion-general-keith-b-alexander-director-national-security-agency.\n27 Thom Shanker, \"Pentagon Is Updating Conflict Rules in Cyberspace,\" New York Times (28 June 2013): 6.\n28 Thom Shanker, \"Pentagon Is Updating.\"\n29 Aliya Sternstein, \"US and Russia among 22 Nations Supporting International Cyber Resolution,\" NestGov (5 July 2011).\n30 See Ellen Nakashima, \"U.S., Russia May Use Alert System for Cybersecurity,\" Washington Post, 27 2012, at A1; see also Shaun Waterman, \"Cold War throwback: U.S.-Russia to use nuclear 'hotline' for new cyber showdown,\" The Washington Times (18 June 2013).\n31 John Markoff, David E. Sanger, and Thom Shanker, \"In Digital Combat, US Finds No Easy Deterrent,\" New York Times (25 January 2010). http://www.nytimes.com/2010/01/26/world/26cyber.html.\n32 See Martha Finnemore and Kathryn Sikkink, \"International Norm Dynamics and Political Change,\" International Organization, vol 52, no. 4 (Autumn 1998): pp. 887-917.\n33 Center for Strategic and International Studies, Cybersecurity and Cyberwarfare - Preliminary Assessment of National Doctrine and Organization, UNDIR Resources Paper, 2011, http://www.unidir.org/files/publications/pdfs/cybersecurity-and-cyberwarfare-preliminary-assessment-of-national-doctrine-and-organization-380.pdf.\n34 The US formulation of its no-first use policy was first stated by the US at a UN Special Session on Disarmament in 1978. In 1982, the Soviets declared its pledge not to resort to the first use of nuclear weapons. However, in 1993, Russia renounced the 1982 Soviet policy of no-first use. Harold A. Feiveson and Ernst Jan Hogendoorn, \"No First Use of Nuclear Weapons,\" The Nonproliferation Review, Summer 2003, p. 2-3.\n35 Lewis PAGE\n36 James Lewis, Conflict and Negotiation, 53. For a contrary view, see Adam Segal, \"Cyber space governance: the nextsteps,\" Council on Foreign Relations, Policy Innovation Memorandum, No. 2 (November 14, 2011): 3, http://www.cfr.org/cybersecurity/cyberspace-governance-next-step/p24397.\n37 James Lewis, Conflict and Negotiation.\n38 Clarke and Knake, Cyber War, 202-203.\n39 Christopher Joyner and Catherine Lotrionte, \"Information Warfare as International Coercion: Elements of a Legal Framework,\" European Journal of International Law 12 (2001): 825; Michael N. Schmitt, \"Computer Network Attacks and the Use of Force in International Law: Thoughts on a Normative Framework,\" Columbia Transnational Law Journal 37(1999): 885 (advocating the benefits of fitting cyberattacks within the existing use of force framework).\n40 UN Charter, Art. 2, para. 4.\n41 Marco Roscini, \"World Wide Warfare - Jus Ad Bellum and the Use of Cyber Force,\" 14 Max Planck Y.B. United Nations L. 85, 96 (2010)(Ger.), 113.\n42 Matthew Waxman, Cyber-Attacks and the Use of Force: Back to the Future of Article 2(4), 36, Yale Journal of International Law, 421, 434-35 (2011). While states are not permitted to use forcible self-defense responses to a use of force, states can use countermeasures in response to\n[87]\nA BETTER DEFENSE\nuses of force.\n43 UN Charter, Art. 51.\n44 Military and Paramilitary Activities in and Against Nicaragua (Nicar. V. U.S.), Judgment, 1986 [C] 14, paras. 191, 210 (June 27) (\"[M]easures which do not constitute an armed attack . . . may nevertheless involve a use of force.\")\n45 Roscini, at 113.\n46 Oona Hathaway, et al., The Law of Cyber-Attack, 100 Calif. L. Rev. 817, 840 (2012).\n47 Gary D. Brown, \"Why Iran Didn't Admit Stuxnet Was an Attack,\" Joint Forces Quarterly, 4th Quarter 2011, at 70, 71.\n48 Michael N. Schmitt ed., Tallinn Manual on the International Law Applicable to Cyber Warfare (Cambridge Univ. Press, 2013) [hereinafter the Manual], http://www.ccdcoe.org/249.html.\n49 Id.\n50 Michael Schmitt ed., Manual, 108.\n51 Cordula Droege, \"Get off my cloud,\" 27.\n52 Herb Lin, \"Cyber conflict and international humanitarian law,\" International Review of the Red Cross, Vol. 94, No. 886 (Summer 2012): 530. See Catherine Lotrione, \"Cyber Operations: Conflict Under International Law,\" in Georgetown Journal of International Affairs, Special Issue, International Engagement on Cyber: Establishing Norms and Improving Security (2012): 20. See also Michael Schmitt, ed., Manual, 44, 58.\n53 Michael Schmitt, Manual, 11.\n54 International Strategy for Cyberspace: Prosperity, Security, and Openness in a Networked World (Washington, DC: White House, 2011): 9.\n55 Abram Chayes and Antonia Handler Chayes, \"On Compliance,\" International Organization 47-2 (spring 1993), pp. 175-206.; Jeffrey W. Legro, \"Which Norms Matter? Revisiting the \"Failure\" of Internationalism,\" International Organization, Vol. 51, No. 1 (Winter, 1997), pp. 31-63; Thomas M. Franck, \"The Emerging Right to Democratic Governance,\" The American Journal of International Law, Vol. 86, No. 1, (Jan., 1992), pp. 46-91.\n56 Legro 1997; Franck 1992.\n57 Emanuel Adler, \"Complex Deterrence in the Asymmetric-Warfare Era,\" in T. V. Paul, Patrick M. Morgan and James J. Wirtz, ed., et al., Complex Deterrence: Strategy in the Global Age (Chicago, IL: University of Chicago Press, 2009), p. 88.\n58 Kenneth W. Abbott and Duncan Snidal, \"Hard and Soft Law in International Governance,\" International Organization 54 (Summer 2000): 423.\n59 Richard Price argues that the landmine norm resonates with pre-established norms of humanitarian law, providing an advantage for the norms development. This is described in the norms literature as grafting norms, embedded norm discrimination, or nesting. Richard Price, \"Reversing the Gun Sights: Transnational Civil Society Targets Land Mines,\" International Organizations Vol. 52, no. 3 (1998), 613-644, 628.\n60 James A. Lewis and Katrina Timlin, Cybersecurity and Cyberwarfare: Preliminary Assessment of National Doctrine and Organization (Geneva: UNDIR, 2011).\nGeorgetown Journal of International Affairs"
  ],
  "flat_text": "HEINONLINE DATE DOWNLOADED: Thu Apr 10 17:05:47 2025 SOURCE: Content Downloaded from HeinOnline ## Citations: Please note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n## Bluebook 21st ed.\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 GEO. J. INT'L AFF. 75 (2013).\n## ALWD 7th ed.\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 Geo. J. Int'l Aff. 75 (2013).\n## APA 7th ed.\nLotrionte, Catherine. (2013). better defense: examining the united states' new norms-based approach to cyber deterrence. Georgetown Journal of International Affairs, 14(3), 75-88.\n## Chicago 17th ed.\nCatherine Lotrionte,\"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence,\"Georgetown Journal of International Affairs 14, no. 3 (2013): 75-88 ## McGill Guide 10th ed.\nCatherine Lotrionte,\"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence\"(2013) 14:3 Geo J Int'l Aff 75.\n## AGLC 4th ed.\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14(3) Georgetown Journal of International Affairs 75 ## MLA 9th ed.\nLotrionte, Catherine.\"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence.\"Georgetown Journal of International Affairs, vol. 14, no. 3, 2013, pp. 75-88. HeinOnline.\n## OSCOLA 4th ed.\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14 Geo J Int'l Aff 75 Please note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License -- The search text of this PDF is generated from uncorrected OCR text.\n-- To obtain permission to use this article beyond the scope of your license, please use: Copyright Information # A Better Defense *Examining the United States’ New Norms-Based Approach to Cyber Deterrence* ## Catherine Lotrionte Since 2010, states have sought further methods for deterring adversarial actions through the Internet and recognized the need to develop forms of cyber deterrence as a key consideration in the pursuit of national and international security. In 2010, the UN Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (GGE) recommended that any further dialogue among states and other actors on norms pertaining to state use of Information and Communication Technologies (ICTs) to reduce collective risk and protect critical national and international infrastructure include discussions on the use of ICTs in conflict.¹ This article examines how the United States has worked to develop cyber deterrence in its more recent efforts by relying on a normative approach to establish “rules of the road” for conflict in cyberspace. It argues that the U.S. norms-based approach, in conjunction with U.S. military power, can reinforce general deterrence in cyberspace, increasing global stability. The article probes links between norms, international law, and deterrence policies, identifying conditions that may increase the potential utility of a strategic norms-based approach for calculations of military-security **Catherine Lotrionte** is Director of the Institute for Law, Science, &amp; Global Security and a Visiting Assistant Professor of Government and Foreign Service at Georgetown University. Dr. Lotrionte has served as Counsel to the President’s Foreign Intelligence Advisory Board at the White House and as Assistant General Counsel at the Central Intelligence Agency. She is the Director and Founder of the Cyber Project at Georgetown University and a Life Member of the Council on Foreign Relations.\n[75] A BETTER DEFENSE policy in the cyber domain. It argues that by embedding cyber deterrence practice in a set of norms, the deterrence strategy will be more likely to stabilize and restrain self-help behavior of states in the cyber domain. In other words, international norms can serve as a structure to increase the chances of deterrence success.\nThe article notes the potential limitations of cyber deterrence as examined by many others, but maintains that a synergy exists between recent developments in international engagement on cyber norms and the academic literatures, pointing to new lines of norms-based research in constructivism that can aid in strengthening the potential for cyber deterrence for the future. The basic proposition of the article is that understanding norms, how and when they develop, and their potential to evolve into binding international law, is essential to the effectiveness of a cyber deterrence policy. Drawing on the work of Lawrence Freedman, the article illustrates how a norms-based approach, rather than an interest-based approach, better reflects how detercontext of social construction based on the interest and identity of states.\n## Deterrence in a Post-Cold War Era As recent international events such as Estonia (2007),³ Georgia (2008),⁴ and Stuxnet (2010)⁵ created elevated awareness and security concerns, scholars and policymakers have turned their attention to the “cyber” issue focusing on whether deterrence theory can work in the cyber domain.⁶ Although the traditional notions of deterrence theory based on military strength have yet to mature in cyberspace,⁷ the United States has recently begun to develop a new strand of cyber strategy and policy—agreement on international norms and legal rules for cyber conflict—that I argue could deliver a positive deterrent effect. Indeed, the United States’ recent policies reflect a recognition that a normative approach could indeed provide the necessary deterrent effect with regard to certain uses of cyberspace during conflict.\nSome have argued that cyber deterrence as a U.S. strategic option is so discredited that it should be discarded completely.\nrence works in practice, “through actors internalizing a sense of appropriate limits on their actions.”² In sum, cyber weapons alone will not guarantee deterrence. If indeed cyber weapons come to be viewed as deterrent weapons it is not only because of the nature of the technology, but also through a normative completely.⁸ Recent scholarship has highlighted a number of challenges for cyber deterrence, illustrating the difficulty of deterrence’s translation into cyberspace and arguing, “concepts of deterrence and war may simply lack the logical foundations that they have in the nuclear and conventional realms.”⁹ Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III Some of the barriers to cyber deterrence that have been analyzed include: limits of attribution of the adversary, difficulty in holding the adversary's assets at risk, limits to an ability to continue an attack, involvement of non-state actors, and lack of a counterforce option.¹⁰ In short, some analysts have argued, the fundamental nature of the cyber domain is different than the physical domain and requires adopting new rules for state conduct and policy.¹¹ In 2009, perhaps to signal to opponents the United States' seriousness in developing cyber capabilities for conflict, the United States established its first cyber command and has since developed significant offensive cyber capabilities. In July 2011, the then-vice chairman of the joint Chiefs of Staff General James Cartwright, spoke further about the need to develop cyber deterrence through both punitive and denial mechanisms.¹² As Cartwright noted,\"There is no penalty to attacking us now. We have to figure out how to change that.\"¹³ Recently, in seeming recognition that military action in cyberspace to punish or deny using military resources may not be the best approach to deterring adversaries, a new norms-based approach to deterrence has begun to emerge in U.S. policy discussions.\nIn summarizing some of the options available to bolster U.S. cyber deterrence efforts, James Lewis has drawn attention to a normative component of cyber deterrence strategy: Better defenses could be reinforced by multilateral understandings on acceptable behavior in cyberspace—explicit norms and obligations... Just as nations feel a degree of constraint from norms and agreements on non-proliferation, establishing explicit international norms for behavior in cyberspace would affect political decisions on the potential risk and cost of cyber attack.¹⁴ A norms-based approach to deterrence—as opposed to a strictly interests-based approach—is one that reinforces\"certain values to the point where it is well understood that they must not be violated.\"¹⁵ While this approach provides hope for developing effective cyber deterrence it will require the exercise of many elements of foreign policy, rather than the use or threatened use of military force alone.¹⁶ The next section describes the recent policies announced by the United States supporting international norms in cyberspace.\n## The Role of the United States.\nIn May 2011 the United States released International Strategy for Cyberspace, its first policy document promoting international norms in the context of\"applying the expectations of peaceful and just interstate conduct to cyberspace\"in order to effect\"stability,\"as exists in\"other spheres of international relations.\"¹⁷ The document recognized that\"adherence to such norms brings predictability to state conduct, helping prevent the misunderstandings that could lead to conflict.\"¹⁸ During the same year, the Department of Defense's Strategy for Operating in Cyberspace described how the department would work with international partners\"to encourage responsible behavior and oppose those who would seek to disrupt networks and systems, dissuade and deter malicious actors, and reserve the right to defend these vital national [77] A BETTER DEFENSE assets as necessary and appropriate.\"¹⁹ These policies focus on regulative norms concerned with preventing inter-state conflict, or at least shaping and limiting the use of cyber attacks in of\"norm emergence,\"attention was called to the issue by the United States and like-minded states, and support was built. This began the socialization process of the norm life cycle.²² This # The United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace.\ncyber conflict.²⁰ As the United States promulgated its own domestic norms related to these international norms, the norms were being socialized to other states and the global cybersecurity agenda at the UN. The socialization of these norms is illustrated in states' agreeing to the 2013 GGE report. At the UN, for the first time, fifteen states, including Russia and China, agreed that the UN Charter principles and international law, in general, applies in the cyber domain. The report also upheld the principle of state responsibility for curbing or halting cyber attacks originating in their territories.²¹ Based on pre-existing principles of international law, specifically *jus ad bellum*, the laws related to the recourse to the use of force, and *jus in bello*, laws related to armed conflict, the United States has campaigned for international agreement on cyber norms. To date, the United States has succeeded in persuading at least fifteen states to embrace the norms of the UN Charter and state responsibility in the context of cyberspace. As a norm entrepreneur, the United States has framed the issues in a way that challenges the appropriateness of what is generally accepted today in cyber conflict. During this stage acceptance was possible in part because of the pre-existence of similar humanitarian issues related to conflict. As constructivist theory contends,\"mutually reinforcing and consistent norms appear to strength one another.\"²³ Although the GGE process has been an important step in the right direction, with only fifteen states in agreement, it lacks widespread international support. Only when a\"critical mass\"of states agree to a norm will the norm reach a\"tipping point,\"after which the norm gains widespread acceptance through a\"cascading\"effect.²⁴ Although it is not possible to predict exactly how many states are needed to\"tip\"the process, international law suggests that the\"tipping\"would occur once a majority of states in the international system adopt the norm.²⁵ For example, in the case of the norm of non-use of force, in the intervening years between the League of Nations in 1919, which had no mention of the norm of non-use of force, and the UN Charter in 1945, the norm achieved widespread support. It was considered so unproblematic by 1945 that at the negotiations of the UN Charter, no state felt the need to provide a public defense of Article 2(4) of the Charter. The UN Charter went [78] Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III into force in 1945 with about 60 states as signatories.\nPositive signs exist for further engagement on cyber issues. For example, there are signs that the United States is willing to engage with the Russian Federation on proposals to limit the military use of cyberspace, thereby reversing the trend of recent years.²⁶ In 2013, General Martin Dempsey, at a public forum discussing cyber threats, explained that the Chinese\"did not believe that hacking American systems violated any rules, since no rules existed.\"²⁷ He noted that American and Chinese officials had plans to meet to discuss ways\"to establish some rules of the road\"with respect to cyberattacks against U.S. companies to steal intelligence property.²⁸ In July 2011, an Organization for Security and Cooperation in Europe (OSCE) resolution to share information on cyber deployments during military conflicts was co-sponsored by the United States, Russia, and other nations.²⁹ Most recently in June 2013, Russia and the United States agreed to a hotline for real-time communications during a cyber-crisis, enabling both states to avoid misunderstandings and preventing potential escalation.³⁰ This is an indication of the emergence of a set of agreements between the two states to reduce conflict by contacting each other if there is a cyber incident instead of resorting to self-defense first. The United States has also conducted war games to figure out just how these rules would apply if it had to respond to a cyber attack against its critical infrastructure, and has recently updated its classified military rules of engagement in cyberspace for the first time in seven years.³¹ Such instances of cooperative efforts can act as a mechanism for the institutionalization of the norms across states through iterated behavior and habit; frequent interactions among individuals involving joint work can ultimately create predictability, stability, and habits of trust. Expanding these efforts through informal, non-obligatory intergovernmental cooperation, confidence building measures of transparency, and the creation of internationally recognized red lines would further increase international support.³³ ## Finding Norms for Cyberspace.\nDuring the Cold War, the Soviets Union and United States were able to establish both formal and informal arrangements to minimize the potential for catastrophic war and escalation. Today, the United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace in order to avoid widespread, potentially devastating, damage in cyberspace. The U.S. efforts seeking agreement on specific norms related to international law and the use of force in the cyber domain may prove the most fruitful for international agreement. While a\"no-first use\"norm, like that which emerged during the Cold War,³⁴ is unlikely to develop for the cyber domain, a norm of\"acceptable use\"could emerge, illuminating the\"red lines\"of cyber operations.³⁵ States could agree to certain acceptable targets in cyberspace during conflict. There is international humanitarian law on the issue of legitimate targets during conflict, especially the long standing prin [79] A BETTER DEFENSE ciples of *jus in bello*, which requires civilian populations to be protected during conflict and that gains of a military action need to be proportionate by not causing unnecessary harm or suffering. Extending these principles to the context of cyber conflict could be instrumental in developing an understanding that during a conflict in cyberspace military installations would be legitimate targets for cyber attacks, but financial institutions would not be legitimate targets given the uncertainties or unacceptable collateral damage to civilian populations. Targets such as banks, global positioning systems, and other infrastructure used for both military and civilian purposes could, under intrusions against industrial control targets, such that any cyber operation against such targets\"would be interpreted as the prelude to an attack,\"reasoning that an intrusion against such a target could only be useful as preparation for a future attack since there is no\"intelligence value to hacking an industrial control system.\"³⁶ This approach would be helpful in the case of a state considering the use of anticipatory self-defense under circumstances when it would be difficult to identify with certainty the purpose behind a particular cyber operation. In the context of intrusions into industrial control systems, for instance, it would be challenging to distinguish a cyber # A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions.\nthe current interpretation of the law, be legitimate targets in cyber conflict unless states were to agree otherwise.\nIn exploring additional options for regulating state behavior in cyber, the scenario of intrusions against industrial control systems illustrates the need for more clarity. Numerous critical installations of states such as power plants, nuclear plants, dams, water treatment and distribution systems, oil refineries, banking systems, hospital systems, and air traffic control systems rely on supervisory control and date acquisition systems, and distributed control systems. Some have proposed that it would be beneficial to prohibit cyber intrusion of a state's air defense that is meant as an *intelligence collection operation*—theft of information—from the same technical intrusion meant to identify vulnerabilities in anticipation of a *cyber attack* with physical, destructive results. Under the current understandings of the norms related to espionage versus\"armed attack\"under the UN Charter, an implant that is meant to support a subsequent\"armed attack\"would merit, and the law would allow for, a more hostile use of force response, in contrast to the discovery of a similar implant that was meant only to support espionage. This is due to the fact that under traditional understand- [80] Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III ings of international law, espionage does not constitute a\"use of force\"for purposes of the UN Charter, and certainly not an\"armed attack.\"Therefore, the victim of such a cyber intelligence collection operation would not have the lawful right of forcible self-defense whereas the victim of a cyber attack would, under the UN Charter, have the right of a forcible self-defense response.\nThis traditional understanding of the law may not be acceptable to states in the cyber context where the distinction between the cyber weapons used for intelligence collection and those used for sabotage cannot easily be made. And yet there is likely not going to be an amendment to the UN Charter to accommodate this complexity especially since state practice has indicated an unwillingness to consider intelligence collection a\"use of force.\"In this case, a new understanding of acceptable behavior under such circumstances would require states to reach a new agreement given the facts specific to cyber operations.\nIn the case of control systems, securing states' agreement to refrain from conducting cyber attacks against such systems certainly would be useful.[37] A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions. Indeed, there is some evidence that this may be an area that states, at least some states, would be restrained. The United States, for instance, in at least two different instances decided not to conduct cyber attacks against foreign financial networks. The Bush and Clinton administrations both refused to authorize hacking into foreign financial systems because of concerns of collateral damage and possible blowback on the United States.[38] Yet, the question remains whether other states would agree to refrain from doing the same. A shared understanding among states that financial institutions ought not to be targets for a cyber attack would be useful especially for the United States since it already appears to refrain from such actions.\nChallenges to Application. International law will play an important role in the normative framework for cyber deterrence as it is the international legal framework of\"war\"that provides the basis for cyber operations. Over the last decade, the growing concern over increased violence and the potential for state conflict in the cyber domain has led international legal scholars to assess how to accommodate an international legal framework for warfare in cyberspace, trying to bring some clarity to how international law would apply in the context of cyber conflict.[39] In particular, the applicability of international regarding the use of force and the right of self-defense is central to any clarification of when and under what circumstances a disruptive exploit in cyberspace could be considered an armed attack, triggering a use of force in self-defense.\nThe most relevant international law on the issue of deterrence and the use of cyberweapons is the law relating to the use of force enshrined in the UN Charter, *jus ad bellum*, and the law applicable in armed conflict that regulates the conduct of hostilities, *jus in [81] A BETTER DEFENSE bello. The UN Charter and customary law determine when cyber operations may be conducted, namely, in self-defense. While it is not necessary to fully explain the UN Charter paradigm here, it is necessary to address the issue of\"use of force\"and\"armed attack,\"two of the key terms in the Charter paradigm. The Charter prohibits\"the threat or use of force against the territorial integrity of political independence\"of a state.⁴⁰ Therefore, any cyber operation that amounts to a use of force is illegal.⁴¹ The UN Charter, however, does not allow the victim of a cyber operation that amounts to a\"use of force\"to respond in forcible self-defense.⁴² Such responses are limited to activities that equate to an armed attack pursuant to Article 51 of the Charter.⁴³ Based on the interpretation of these principles by the UN Charter and the International Court of Justice (ICJ),⁴⁴ a state's ability to signal a\"strike back\"deterrent to a cyber operation in self-defense would be subject to a finding that the cyber operation was not only a use of force but also an armed attack.⁴⁵ Unfortunately, neither the Charter nor the ICJ has provided specific definitions for these terms. In addition, there has yet to be a reported cyber operation between states that has been acknowledged as a use of force, let a lone an armed attack.⁴⁶ The recent Stuxnet cyber operation against the Iranian nuclear capabilities is likely to be the closest.⁴⁷ Yet there is debate as to whether Stuxnet was a use of force or an armed attack for purposes of the UN Charter.⁴⁸ Recent efforts to incorporate cyber warfare in our long-standing international legal systems prohibiting the use of force and protecting civilians from the effects of war illustrate the considerable challenges and incongruities in attempting to fit cyber into the conventional armed conflict framework. Two notable efforts have been the Tallinn Manual on the International Law Applicable to Cyber Warfare (the Manual)⁴⁹ and the International Committee of the Red Cross's (ICRC) first major article on cyber warfare published in 2012. In the ICRC article, the ICRC disagrees with the Manual's position on what would constitute an\"attack\"during armed conflict requiring physical effects. According to the majority of the experts on the Manual,\"interference with functionality qualifies as damage\"for purposes of determining if something was an\"attack\"during an armed conflict,\"if restoration of functionality requires replacement of physical components.\"⁵⁰ The ICRC, on the other hand, concludes that\"disrupting the functioning of certain systems by interfering with their underlying computer systems can amount to damage insofar as it impairs their usefulness,\"and therefore, an attack would also\"be understood to encompass such operations that disrupt the functioning of objects without physical damage or destruction, even if the disruption is temporary.\"⁵¹ Disagreement among the group of experts who drafted the Manual and the ICRC highlights the challenges in applying existing international law to the cyber domain.\nOvercoming the Obstacles. Over centuries, in the context of the physical realm, the international legal terms of\"use of force,\"\"armed attack,\"and\"self-defense\"have come to have mean- Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III ing in treaties, the practice of states, and through the dispute resolution process at the UN Security Council and the International Court of Justice. Today, for such activities in cyberspace, we need new consensus about the meanings of these legal terms, how they apply in cyberspace, and the situations in which the different thresholds would be triggered based on cyber operations. It is important for states to understand what would constitute an armed attack in cyberspace that would then trigger the target state's right of self-defense. Given that most of the malicious cyber activities that have occurred to date fall below the level of the use of force and armed attack thresholds of the UN Charter and the laws of armed conflict,52 and, given the fact that even for the areas of international law addressed in the Manual there is no state consensus,53 uncertainty remains about the rules meant to constrain behavior that apply in the cyber domain.54 In order for deterrence to work and widespread agreement on cyber norms to occur, there needs to be some shared expectations between states about what is acceptable behavior and what is not acceptable behavior in the cyber domain.\nIn lieu of any formal international treaty defining these terms in cyber, agreeing to norms will be important to providing needed clarity for states to understand the context in which they are operating in the cyber domain. Those norms that are clear and specific, rather than ambiguous and complex,55 and those that have been around for a long period of time, surviving numerous challenges are more likely to be effective.56 Starting with those norms related to the use of force in cyberspace, where there is legal precedent, makes sense. The next step would be to come to agreement on the meaning of the terms as used in the UN Charter. For example, the United States could seek to develop a specific domestic policy articulating when Article 51 of the UN Charter would be triggered by a cyber incident, establishing a clear threshold and share it with other states in order to seek agreement.\nAs deterrence theorists have argued, in order for deterrence strategy to work, states must be aware of the\"rules and logic of the [strategic] game\"which is communicated between states and which serves not only to inform their actions but also their identities.57 As part of a cyber declaratory deterrence policy, U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons. To develop such norms, threats of military action alone will not suffice. Rather, the diplomatic elements of foreign policy will need to be exercised to establish and reinforce certain values to the point where it is well understood by states that they must not be violated. Clear statements by the United States would be useful in setting forth the specifics of what those values are as envisioned in cyberspace.\nConclusion. These recent events support the emergence of a U.S. national cyber strategy where cyber deterrence is pursued not solely through national security capabilities (the development of offensive cyber capabilities at U.S. Cyber Command), but also through diplomatic and normative, means.\n[83] A BETTER DEFENSE Placing issues of cyber conflict under the auspices of the UN and the UN Charter principles makes sense. This will ultimately make the development of the norms easier for states to accept by embedding them in already existing international law and an international organization with members with conflicting identities and competing interests that plays an important role in norm innovation, cascading, institutionalization, and enforcement. Because of the lack of clarity in international law on the meaning of terms like\"armed attack,\"more work is required to identify exactly what the norm is and what constitutes violation as well as spelling out the procedures by which norm leaders coordinate disapproval and sanctions for norm breaking.\nThis article has argued that a norms-based approach, in conjunction with military cyber power, can deliver some cyber deterrence where military power alone is limited. Although the emergency suffering, principles which support the norms the United States is promoting through the GGE process. Second, the UN GGE process provides an organizational platform for the issues. With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\nThe\"rules of acceptable behavior\"that cyber deterrence scholars and recent U.S. cyber strategy documents have discussed, fit into this category of\"rules of the game\"that can take the form of consensual bilateral or multilateral declarations of principles, or even unilateral declarations and actions. The United States presently prefers non-legally binding agreements for cyber as compared to Russia that has advocated for an international treaty. The rationale for non-legally binding agreement may be that such agreements offer decision-makers opportunities to # U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons.\ngence of norms in cyberspace is in its early stages and it is too early to predict how these emerging norms, there are two central factors that support the potential for broader support for the norms the United States is promulgating. First, there is a tradition of international law and norms on which the cyber issues can be based that codify the principles of uses of force, self-defense, proportionality, discrimination and learn about the social effects of particular sets of rules over time, amending them accordingly, typically with lower negotiation costs than entailed by the renegotiation of treaties.[58] States may need time to learn about the technology and to arrive at conclusions about the kinds of behavior they prefer in the new domain of cyberspace.\nEmbedding the new cyber norms as stated in the GGE report in pre [84] Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III existing and widely accepted international legal principles may alleviate the need for a separate, stand-alone treaty for cyber conflict.59 Indeed, given the political context for cybersecurity where mistrust and geopolitical rivalry among states exists, such informal norms may be more attractive given that it is easier involvement in the Stuxnet cyber operation against Iran's uranium facility, the United States will likely face criticism and allegations of double standards. The United States must find a way to address these concerns and not lose momentum in the socialization of cyber conflict norms.\n# With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\nto obtain agreement on them. If more formal agreement on specific norms is the ultimate goal, the intermediate goal for the United States should be to develop confidence-building measures involving transparency between states in order to build trust, laying the groundwork for future consensus on specific norms.[60] Part of these transparency efforts could include expanding the number of states involved in the discussions about the meaning of the terms used in the UN Charter specifically in the context of cyber operations.\nSo far, the United States has provided the leadership and momentum necessary to begin to seek broader support for the norms. Continued support for the norms by the United States and like-minded nations will be needed. In its continued efforts in support of these international norms the United States ought to keep in mind that norms are developed not only by words, but also by acts. Given the possible U.S.-Israeli Unfortunately, the study of cyber deterrence and cyber norms is hampered by its novelty and much needed work is required to understand the processes of cyber deterrence development and normative change. Deterrence specialists have begun to pay careful attention to cyber attacks and that needs to continue. Their insights into issues related to the challenges of attribution and proportionate retaliation will be needed. The important question for international relations and legal scholars will involve understanding which norms will become legally binding international law and how, exactly, compliance with those laws comes about. It is, after all, these legal rules that will guide and determine the political actors' behavior in the cyber domain. Understanding the mechanisms and the likelihood of compliance will be the key to the longevity of peace and stability in cyberspace.[61] [85] A BETTER DEFENSE",
  "citations": {
    "style": "hybrid",
    "flat_text": "HEINONLINE DATE DOWNLOADED: Thu Apr 10 17:05:47 2025 SOURCE: Content Downloaded from HeinOnline ## Citations: Please note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n## Bluebook 21st ed.\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 GEO. J. INT'L AFF. 75 (2013).\n## ALWD 7th ed.\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 Geo. J. Int'l Aff. 75 (2013).\n## APA 7th ed.\nLotrionte, Catherine. (2013). better defense: examining the united states' new norms-based approach to cyber deterrence. Georgetown Journal of International Affairs, 14(3), 75-88.\n## Chicago 17th ed.\nCatherine Lotrionte,\"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence,\"Georgetown Journal of International Affairs 14, no. 3 (2013): 75-88 ## McGill Guide 10th ed.\nCatherine Lotrionte,\"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence\"(2013) 14:3 Geo J Int'l Aff 75.\n## AGLC 4th ed.\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14(3) Georgetown Journal of International Affairs 75 ## MLA 9th ed.\nLotrionte, Catherine.\"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence.\"Georgetown Journal of International Affairs, vol. 14, no. 3, 2013, pp. 75-88. HeinOnline.\n## OSCOLA 4th ed.\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14 Geo J Int'l Aff 75 Please note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License -- The search text of this PDF is generated from uncorrected OCR text.\n-- To obtain permission to use this article beyond the scope of your license, please use: Copyright Information # A Better Defense *Examining the United States’ New Norms-Based Approach to Cyber Deterrence* ## Catherine Lotrionte Since 2010, states have sought further methods for deterring adversarial actions through the Internet and recognized the need to develop forms of cyber deterrence as a key consideration in the pursuit of national and international security. In 2010, the UN Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (GGE) recommended that any further dialogue among states and other actors on norms pertaining to state use of Information and Communication Technologies (ICTs) to reduce collective risk and protect critical national and international infrastructure include discussions on the use of ICTs in conflict.¹ This article examines how the United States has worked to develop cyber deterrence in its more recent efforts by relying on a normative approach to establish “rules of the road” for conflict in cyberspace. It argues that the U.S. norms-based approach, in conjunction with U.S. military power, can reinforce general deterrence in cyberspace, increasing global stability. The article probes links between norms, international law, and deterrence policies, identifying conditions that may increase the potential utility of a strategic norms-based approach for calculations of military-security **Catherine Lotrionte** is Director of the Institute for Law, Science, &amp; Global Security and a Visiting Assistant Professor of Government and Foreign Service at Georgetown University. Dr. Lotrionte has served as Counsel to the President’s Foreign Intelligence Advisory Board at the White House and as Assistant General Counsel at the Central Intelligence Agency. She is the Director and Founder of the Cyber Project at Georgetown University and a Life Member of the Council on Foreign Relations.\n[75] A BETTER DEFENSE policy in the cyber domain. It argues that by embedding cyber deterrence practice in a set of norms, the deterrence strategy will be more likely to stabilize and restrain self-help behavior of states in the cyber domain. In other words, international norms can serve as a structure to increase the chances of deterrence success.\nThe article notes the potential limitations of cyber deterrence as examined by many others, but maintains that a synergy exists between recent developments in international engagement on cyber norms and the academic literatures, pointing to new lines of norms-based research in constructivism that can aid in strengthening the potential for cyber deterrence for the future. The basic proposition of the article is that understanding norms, how and when they develop, and their potential to evolve into binding international law, is essential to the effectiveness of a cyber deterrence policy. Drawing on the work of Lawrence Freedman, the article illustrates how a norms-based approach, rather than an interest-based approach, better reflects how detercontext of social construction based on the interest and identity of states.\n## Deterrence in a Post-Cold War Era As recent international events such as Estonia (2007),³ Georgia (2008),⁴ and Stuxnet (2010)⁵ created elevated awareness and security concerns, scholars and policymakers have turned their attention to the “cyber” issue focusing on whether deterrence theory can work in the cyber domain.⁶ Although the traditional notions of deterrence theory based on military strength have yet to mature in cyberspace,⁷ the United States has recently begun to develop a new strand of cyber strategy and policy—agreement on international norms and legal rules for cyber conflict—that I argue could deliver a positive deterrent effect. Indeed, the United States’ recent policies reflect a recognition that a normative approach could indeed provide the necessary deterrent effect with regard to certain uses of cyberspace during conflict.\nSome have argued that cyber deterrence as a U.S. strategic option is so discredited that it should be discarded completely.\nrence works in practice, “through actors internalizing a sense of appropriate limits on their actions.”² In sum, cyber weapons alone will not guarantee deterrence. If indeed cyber weapons come to be viewed as deterrent weapons it is not only because of the nature of the technology, but also through a normative completely.⁸ Recent scholarship has highlighted a number of challenges for cyber deterrence, illustrating the difficulty of deterrence’s translation into cyberspace and arguing, “concepts of deterrence and war may simply lack the logical foundations that they have in the nuclear and conventional realms.”⁹ Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III Some of the barriers to cyber deterrence that have been analyzed include: limits of attribution of the adversary, difficulty in holding the adversary's assets at risk, limits to an ability to continue an attack, involvement of non-state actors, and lack of a counterforce option.¹⁰ In short, some analysts have argued, the fundamental nature of the cyber domain is different than the physical domain and requires adopting new rules for state conduct and policy.¹¹ In 2009, perhaps to signal to opponents the United States' seriousness in developing cyber capabilities for conflict, the United States established its first cyber command and has since developed significant offensive cyber capabilities. In July 2011, the then-vice chairman of the joint Chiefs of Staff General James Cartwright, spoke further about the need to develop cyber deterrence through both punitive and denial mechanisms.¹² As Cartwright noted,\"There is no penalty to attacking us now. We have to figure out how to change that.\"¹³ Recently, in seeming recognition that military action in cyberspace to punish or deny using military resources may not be the best approach to deterring adversaries, a new norms-based approach to deterrence has begun to emerge in U.S. policy discussions.\nIn summarizing some of the options available to bolster U.S. cyber deterrence efforts, James Lewis has drawn attention to a normative component of cyber deterrence strategy: Better defenses could be reinforced by multilateral understandings on acceptable behavior in cyberspace—explicit norms and obligations... Just as nations feel a degree of constraint from norms and agreements on non-proliferation, establishing explicit international norms for behavior in cyberspace would affect political decisions on the potential risk and cost of cyber attack.¹⁴ A norms-based approach to deterrence—as opposed to a strictly interests-based approach—is one that reinforces\"certain values to the point where it is well understood that they must not be violated.\"¹⁵ While this approach provides hope for developing effective cyber deterrence it will require the exercise of many elements of foreign policy, rather than the use or threatened use of military force alone.¹⁶ The next section describes the recent policies announced by the United States supporting international norms in cyberspace.\n## The Role of the United States.\nIn May 2011 the United States released International Strategy for Cyberspace, its first policy document promoting international norms in the context of\"applying the expectations of peaceful and just interstate conduct to cyberspace\"in order to effect\"stability,\"as exists in\"other spheres of international relations.\"¹⁷ The document recognized that\"adherence to such norms brings predictability to state conduct, helping prevent the misunderstandings that could lead to conflict.\"¹⁸ During the same year, the Department of Defense's Strategy for Operating in Cyberspace described how the department would work with international partners\"to encourage responsible behavior and oppose those who would seek to disrupt networks and systems, dissuade and deter malicious actors, and reserve the right to defend these vital national [77] A BETTER DEFENSE assets as necessary and appropriate.\"¹⁹ These policies focus on regulative norms concerned with preventing inter-state conflict, or at least shaping and limiting the use of cyber attacks in of\"norm emergence,\"attention was called to the issue by the United States and like-minded states, and support was built. This began the socialization process of the norm life cycle.²² This # The United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace.\ncyber conflict.²⁰ As the United States promulgated its own domestic norms related to these international norms, the norms were being socialized to other states and the global cybersecurity agenda at the UN. The socialization of these norms is illustrated in states' agreeing to the 2013 GGE report. At the UN, for the first time, fifteen states, including Russia and China, agreed that the UN Charter principles and international law, in general, applies in the cyber domain. The report also upheld the principle of state responsibility for curbing or halting cyber attacks originating in their territories.²¹ Based on pre-existing principles of international law, specifically *jus ad bellum*, the laws related to the recourse to the use of force, and *jus in bello*, laws related to armed conflict, the United States has campaigned for international agreement on cyber norms. To date, the United States has succeeded in persuading at least fifteen states to embrace the norms of the UN Charter and state responsibility in the context of cyberspace. As a norm entrepreneur, the United States has framed the issues in a way that challenges the appropriateness of what is generally accepted today in cyber conflict. During this stage acceptance was possible in part because of the pre-existence of similar humanitarian issues related to conflict. As constructivist theory contends,\"mutually reinforcing and consistent norms appear to strength one another.\"²³ Although the GGE process has been an important step in the right direction, with only fifteen states in agreement, it lacks widespread international support. Only when a\"critical mass\"of states agree to a norm will the norm reach a\"tipping point,\"after which the norm gains widespread acceptance through a\"cascading\"effect.²⁴ Although it is not possible to predict exactly how many states are needed to\"tip\"the process, international law suggests that the\"tipping\"would occur once a majority of states in the international system adopt the norm.²⁵ For example, in the case of the norm of non-use of force, in the intervening years between the League of Nations in 1919, which had no mention of the norm of non-use of force, and the UN Charter in 1945, the norm achieved widespread support. It was considered so unproblematic by 1945 that at the negotiations of the UN Charter, no state felt the need to provide a public defense of Article 2(4) of the Charter. The UN Charter went [78] Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III into force in 1945 with about 60 states as signatories.\nPositive signs exist for further engagement on cyber issues. For example, there are signs that the United States is willing to engage with the Russian Federation on proposals to limit the military use of cyberspace, thereby reversing the trend of recent years.²⁶ In 2013, General Martin Dempsey, at a public forum discussing cyber threats, explained that the Chinese\"did not believe that hacking American systems violated any rules, since no rules existed.\"²⁷ He noted that American and Chinese officials had plans to meet to discuss ways\"to establish some rules of the road\"with respect to cyberattacks against U.S. companies to steal intelligence property.²⁸ In July 2011, an Organization for Security and Cooperation in Europe (OSCE) resolution to share information on cyber deployments during military conflicts was co-sponsored by the United States, Russia, and other nations.²⁹ Most recently in June 2013, Russia and the United States agreed to a hotline for real-time communications during a cyber-crisis, enabling both states to avoid misunderstandings and preventing potential escalation.³⁰ This is an indication of the emergence of a set of agreements between the two states to reduce conflict by contacting each other if there is a cyber incident instead of resorting to self-defense first. The United States has also conducted war games to figure out just how these rules would apply if it had to respond to a cyber attack against its critical infrastructure, and has recently updated its classified military rules of engagement in cyberspace for the first time in seven years.³¹ Such instances of cooperative efforts can act as a mechanism for the institutionalization of the norms across states through iterated behavior and habit; frequent interactions among individuals involving joint work can ultimately create predictability, stability, and habits of trust. Expanding these efforts through informal, non-obligatory intergovernmental cooperation, confidence building measures of transparency, and the creation of internationally recognized red lines would further increase international support.³³ ## Finding Norms for Cyberspace.\nDuring the Cold War, the Soviets Union and United States were able to establish both formal and informal arrangements to minimize the potential for catastrophic war and escalation. Today, the United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace in order to avoid widespread, potentially devastating, damage in cyberspace. The U.S. efforts seeking agreement on specific norms related to international law and the use of force in the cyber domain may prove the most fruitful for international agreement. While a\"no-first use\"norm, like that which emerged during the Cold War,³⁴ is unlikely to develop for the cyber domain, a norm of\"acceptable use\"could emerge, illuminating the\"red lines\"of cyber operations.³⁵ States could agree to certain acceptable targets in cyberspace during conflict. There is international humanitarian law on the issue of legitimate targets during conflict, especially the long standing prin [79] A BETTER DEFENSE ciples of *jus in bello*, which requires civilian populations to be protected during conflict and that gains of a military action need to be proportionate by not causing unnecessary harm or suffering. Extending these principles to the context of cyber conflict could be instrumental in developing an understanding that during a conflict in cyberspace military installations would be legitimate targets for cyber attacks, but financial institutions would not be legitimate targets given the uncertainties or unacceptable collateral damage to civilian populations. Targets such as banks, global positioning systems, and other infrastructure used for both military and civilian purposes could, under intrusions against industrial control targets, such that any cyber operation against such targets\"would be interpreted as the prelude to an attack,\"reasoning that an intrusion against such a target could only be useful as preparation for a future attack since there is no\"intelligence value to hacking an industrial control system.\"³⁶ This approach would be helpful in the case of a state considering the use of anticipatory self-defense under circumstances when it would be difficult to identify with certainty the purpose behind a particular cyber operation. In the context of intrusions into industrial control systems, for instance, it would be challenging to distinguish a cyber # A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions.\nthe current interpretation of the law, be legitimate targets in cyber conflict unless states were to agree otherwise.\nIn exploring additional options for regulating state behavior in cyber, the scenario of intrusions against industrial control systems illustrates the need for more clarity. Numerous critical installations of states such as power plants, nuclear plants, dams, water treatment and distribution systems, oil refineries, banking systems, hospital systems, and air traffic control systems rely on supervisory control and date acquisition systems, and distributed control systems. Some have proposed that it would be beneficial to prohibit cyber intrusion of a state's air defense that is meant as an *intelligence collection operation*—theft of information—from the same technical intrusion meant to identify vulnerabilities in anticipation of a *cyber attack* with physical, destructive results. Under the current understandings of the norms related to espionage versus\"armed attack\"under the UN Charter, an implant that is meant to support a subsequent\"armed attack\"would merit, and the law would allow for, a more hostile use of force response, in contrast to the discovery of a similar implant that was meant only to support espionage. This is due to the fact that under traditional understand- [80] Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III ings of international law, espionage does not constitute a\"use of force\"for purposes of the UN Charter, and certainly not an\"armed attack.\"Therefore, the victim of such a cyber intelligence collection operation would not have the lawful right of forcible self-defense whereas the victim of a cyber attack would, under the UN Charter, have the right of a forcible self-defense response.\nThis traditional understanding of the law may not be acceptable to states in the cyber context where the distinction between the cyber weapons used for intelligence collection and those used for sabotage cannot easily be made. And yet there is likely not going to be an amendment to the UN Charter to accommodate this complexity especially since state practice has indicated an unwillingness to consider intelligence collection a\"use of force.\"In this case, a new understanding of acceptable behavior under such circumstances would require states to reach a new agreement given the facts specific to cyber operations.\nIn the case of control systems, securing states' agreement to refrain from conducting cyber attacks against such systems certainly would be useful.[37] A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions. Indeed, there is some evidence that this may be an area that states, at least some states, would be restrained. The United States, for instance, in at least two different instances decided not to conduct cyber attacks against foreign financial networks. The Bush and Clinton administrations both refused to authorize hacking into foreign financial systems because of concerns of collateral damage and possible blowback on the United States.[38] Yet, the question remains whether other states would agree to refrain from doing the same. A shared understanding among states that financial institutions ought not to be targets for a cyber attack would be useful especially for the United States since it already appears to refrain from such actions.\nChallenges to Application. International law will play an important role in the normative framework for cyber deterrence as it is the international legal framework of\"war\"that provides the basis for cyber operations. Over the last decade, the growing concern over increased violence and the potential for state conflict in the cyber domain has led international legal scholars to assess how to accommodate an international legal framework for warfare in cyberspace, trying to bring some clarity to how international law would apply in the context of cyber conflict.[39] In particular, the applicability of international regarding the use of force and the right of self-defense is central to any clarification of when and under what circumstances a disruptive exploit in cyberspace could be considered an armed attack, triggering a use of force in self-defense.\nThe most relevant international law on the issue of deterrence and the use of cyberweapons is the law relating to the use of force enshrined in the UN Charter, *jus ad bellum*, and the law applicable in armed conflict that regulates the conduct of hostilities, *jus in [81] A BETTER DEFENSE bello. The UN Charter and customary law determine when cyber operations may be conducted, namely, in self-defense. While it is not necessary to fully explain the UN Charter paradigm here, it is necessary to address the issue of\"use of force\"and\"armed attack,\"two of the key terms in the Charter paradigm. The Charter prohibits\"the threat or use of force against the territorial integrity of political independence\"of a state.⁴⁰ Therefore, any cyber operation that amounts to a use of force is illegal.⁴¹ The UN Charter, however, does not allow the victim of a cyber operation that amounts to a\"use of force\"to respond in forcible self-defense.⁴² Such responses are limited to activities that equate to an armed attack pursuant to Article 51 of the Charter.⁴³ Based on the interpretation of these principles by the UN Charter and the International Court of Justice (ICJ),⁴⁴ a state's ability to signal a\"strike back\"deterrent to a cyber operation in self-defense would be subject to a finding that the cyber operation was not only a use of force but also an armed attack.⁴⁵ Unfortunately, neither the Charter nor the ICJ has provided specific definitions for these terms. In addition, there has yet to be a reported cyber operation between states that has been acknowledged as a use of force, let a lone an armed attack.⁴⁶ The recent Stuxnet cyber operation against the Iranian nuclear capabilities is likely to be the closest.⁴⁷ Yet there is debate as to whether Stuxnet was a use of force or an armed attack for purposes of the UN Charter.⁴⁸ Recent efforts to incorporate cyber warfare in our long-standing international legal systems prohibiting the use of force and protecting civilians from the effects of war illustrate the considerable challenges and incongruities in attempting to fit cyber into the conventional armed conflict framework. Two notable efforts have been the Tallinn Manual on the International Law Applicable to Cyber Warfare (the Manual)⁴⁹ and the International Committee of the Red Cross's (ICRC) first major article on cyber warfare published in 2012. In the ICRC article, the ICRC disagrees with the Manual's position on what would constitute an\"attack\"during armed conflict requiring physical effects. According to the majority of the experts on the Manual,\"interference with functionality qualifies as damage\"for purposes of determining if something was an\"attack\"during an armed conflict,\"if restoration of functionality requires replacement of physical components.\"⁵⁰ The ICRC, on the other hand, concludes that\"disrupting the functioning of certain systems by interfering with their underlying computer systems can amount to damage insofar as it impairs their usefulness,\"and therefore, an attack would also\"be understood to encompass such operations that disrupt the functioning of objects without physical damage or destruction, even if the disruption is temporary.\"⁵¹ Disagreement among the group of experts who drafted the Manual and the ICRC highlights the challenges in applying existing international law to the cyber domain.\nOvercoming the Obstacles. Over centuries, in the context of the physical realm, the international legal terms of\"use of force,\"\"armed attack,\"and\"self-defense\"have come to have mean- Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III ing in treaties, the practice of states, and through the dispute resolution process at the UN Security Council and the International Court of Justice. Today, for such activities in cyberspace, we need new consensus about the meanings of these legal terms, how they apply in cyberspace, and the situations in which the different thresholds would be triggered based on cyber operations. It is important for states to understand what would constitute an armed attack in cyberspace that would then trigger the target state's right of self-defense. Given that most of the malicious cyber activities that have occurred to date fall below the level of the use of force and armed attack thresholds of the UN Charter and the laws of armed conflict,52 and, given the fact that even for the areas of international law addressed in the Manual there is no state consensus,53 uncertainty remains about the rules meant to constrain behavior that apply in the cyber domain.54 In order for deterrence to work and widespread agreement on cyber norms to occur, there needs to be some shared expectations between states about what is acceptable behavior and what is not acceptable behavior in the cyber domain.\nIn lieu of any formal international treaty defining these terms in cyber, agreeing to norms will be important to providing needed clarity for states to understand the context in which they are operating in the cyber domain. Those norms that are clear and specific, rather than ambiguous and complex,55 and those that have been around for a long period of time, surviving numerous challenges are more likely to be effective.56 Starting with those norms related to the use of force in cyberspace, where there is legal precedent, makes sense. The next step would be to come to agreement on the meaning of the terms as used in the UN Charter. For example, the United States could seek to develop a specific domestic policy articulating when Article 51 of the UN Charter would be triggered by a cyber incident, establishing a clear threshold and share it with other states in order to seek agreement.\nAs deterrence theorists have argued, in order for deterrence strategy to work, states must be aware of the\"rules and logic of the [strategic] game\"which is communicated between states and which serves not only to inform their actions but also their identities.57 As part of a cyber declaratory deterrence policy, U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons. To develop such norms, threats of military action alone will not suffice. Rather, the diplomatic elements of foreign policy will need to be exercised to establish and reinforce certain values to the point where it is well understood by states that they must not be violated. Clear statements by the United States would be useful in setting forth the specifics of what those values are as envisioned in cyberspace.\nConclusion. These recent events support the emergence of a U.S. national cyber strategy where cyber deterrence is pursued not solely through national security capabilities (the development of offensive cyber capabilities at U.S. Cyber Command), but also through diplomatic and normative, means.\n[83] A BETTER DEFENSE Placing issues of cyber conflict under the auspices of the UN and the UN Charter principles makes sense. This will ultimately make the development of the norms easier for states to accept by embedding them in already existing international law and an international organization with members with conflicting identities and competing interests that plays an important role in norm innovation, cascading, institutionalization, and enforcement. Because of the lack of clarity in international law on the meaning of terms like\"armed attack,\"more work is required to identify exactly what the norm is and what constitutes violation as well as spelling out the procedures by which norm leaders coordinate disapproval and sanctions for norm breaking.\nThis article has argued that a norms-based approach, in conjunction with military cyber power, can deliver some cyber deterrence where military power alone is limited. Although the emergency suffering, principles which support the norms the United States is promoting through the GGE process. Second, the UN GGE process provides an organizational platform for the issues. With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\nThe\"rules of acceptable behavior\"that cyber deterrence scholars and recent U.S. cyber strategy documents have discussed, fit into this category of\"rules of the game\"that can take the form of consensual bilateral or multilateral declarations of principles, or even unilateral declarations and actions. The United States presently prefers non-legally binding agreements for cyber as compared to Russia that has advocated for an international treaty. The rationale for non-legally binding agreement may be that such agreements offer decision-makers opportunities to # U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons.\ngence of norms in cyberspace is in its early stages and it is too early to predict how these emerging norms, there are two central factors that support the potential for broader support for the norms the United States is promulgating. First, there is a tradition of international law and norms on which the cyber issues can be based that codify the principles of uses of force, self-defense, proportionality, discrimination and learn about the social effects of particular sets of rules over time, amending them accordingly, typically with lower negotiation costs than entailed by the renegotiation of treaties.[58] States may need time to learn about the technology and to arrive at conclusions about the kinds of behavior they prefer in the new domain of cyberspace.\nEmbedding the new cyber norms as stated in the GGE report in pre [84] Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III existing and widely accepted international legal principles may alleviate the need for a separate, stand-alone treaty for cyber conflict.59 Indeed, given the political context for cybersecurity where mistrust and geopolitical rivalry among states exists, such informal norms may be more attractive given that it is easier involvement in the Stuxnet cyber operation against Iran's uranium facility, the United States will likely face criticism and allegations of double standards. The United States must find a way to address these concerns and not lose momentum in the socialization of cyber conflict norms.\n# With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\nto obtain agreement on them. If more formal agreement on specific norms is the ultimate goal, the intermediate goal for the United States should be to develop confidence-building measures involving transparency between states in order to build trust, laying the groundwork for future consensus on specific norms.[60] Part of these transparency efforts could include expanding the number of states involved in the discussions about the meaning of the terms used in the UN Charter specifically in the context of cyber operations.\nSo far, the United States has provided the leadership and momentum necessary to begin to seek broader support for the norms. Continued support for the norms by the United States and like-minded nations will be needed. In its continued efforts in support of these international norms the United States ought to keep in mind that norms are developed not only by words, but also by acts. Given the possible U.S.-Israeli Unfortunately, the study of cyber deterrence and cyber norms is hampered by its novelty and much needed work is required to understand the processes of cyber deterrence development and normative change. Deterrence specialists have begun to pay careful attention to cyber attacks and that needs to continue. Their insights into issues related to the challenges of attribution and proportionate retaliation will be needed. The important question for international relations and legal scholars will involve understanding which norms will become legally binding international law and how, exactly, compliance with those laws comes about. It is, after all, these legal rules that will guide and determine the political actors' behavior in the cyber domain. Understanding the mechanisms and the likelihood of compliance will be the key to the longevity of peace and stability in cyberspace.[61] [85] A BETTER DEFENSE",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 12,
        "success_occurrences": 12,
        "success_unique": 12,
        "bib_unique_total": 120,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.1,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 48,
        "missing_intext_indices": [
          1,
          2,
          3,
          4,
          5,
          6,
          7,
          8,
          9,
          10,
          11,
          12,
          13,
          14,
          15,
          16,
          17,
          18,
          19,
          20,
          21,
          22,
          23,
          24,
          25,
          26,
          27,
          28,
          29,
          30,
          31,
          32,
          33,
          34,
          35,
          36,
          40,
          41,
          42,
          43,
          44,
          45,
          46,
          47,
          48,
          49,
          50,
          51
        ],
        "highest_intext_index": 60,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 48,
        "uncited_footnote_indices": [
          1,
          2,
          3,
          4,
          5,
          6,
          7,
          8,
          9,
          10,
          11,
          12,
          13,
          14,
          15,
          16,
          17,
          18,
          19,
          20,
          21,
          22,
          23,
          24,
          25,
          26,
          27,
          28,
          29,
          30,
          31,
          32,
          33,
          34,
          35,
          36,
          40,
          41,
          42,
          43,
          44,
          45,
          46,
          47,
          48,
          49,
          50,
          51
        ],
        "style": "hybrid"
      },
      "results": [
        {
          "index": "37",
          "intext_citation": "useful.[37]",
          "preceding_text": "In the case of control systems, securing states' agreement to refrain from conducting cyber attacks against such systems certainly would be",
          "footnote": "James Lewis, Conflict and Negotiation."
        },
        {
          "index": "38",
          "intext_citation": "States.[38]",
          "preceding_text": "The Bush and Clinton administrations both refused to authorize hacking into foreign financial systems because of concerns of collateral damage and possible blowback on the United",
          "footnote": "Clarke and Knake, Cyber War, 202-203."
        },
        {
          "index": "39",
          "intext_citation": "conflict.[39]",
          "preceding_text": "iolence and the potential for state conflict in the cyber domain has led international legal scholars to assess how to accommodate an international legal framework for warfare in cyberspace, trying to bring some clarity to how international law would apply in the context of cyber",
          "footnote": "Christopher Joyner and Catherine Lotrionte, \"Information Warfare as International Coercion: Elements of a Legal Framework,\" European Journal of International Law 12 (2001): 825; Michael N. Schmitt, \"Computer Network Attacks and the Use of Force in International Law: Thoughts on a Normative Framework,\" Columbia Transnational Law Journal 37(1999): 885 (advocating the benefits of fitting cyberattacks within the existing use of force framework)."
        },
        {
          "index": "58",
          "intext_citation": "treaties.[58]",
          "preceding_text": "an be based that codify the principles of uses of force, self-defense, proportionality, discrimination and learn about the social effects of particular sets of rules over time, amending them accordingly, typically with lower negotiation costs than entailed by the renegotiation of",
          "footnote": "Kenneth W. Abbott and Duncan Snidal, \"Hard and Soft Law in International Governance,\" International Organization 54 (Summer 2000): 423."
        },
        {
          "index": "60",
          "intext_citation": "norms.[60]",
          "preceding_text": "If more formal agreement on specific norms is the ultimate goal, the intermediate goal for the United States should be to develop confidence-building measures involving transparency between states in order to build trust, laying the groundwork for future consensus on specific",
          "footnote": "James A. Lewis and Katrina Timlin, Cybersecurity and Cyberwarfare: Preliminary Assessment of National Doctrine and Organization (Geneva: UNDIR, 2011)."
        },
        {
          "index": "52",
          "intext_citation": "conflict,52",
          "preceding_text": "Given that most of the malicious cyber activities that have occurred to date fall below the level of the use of force and armed attack thresholds of the UN Charter and the laws of armed",
          "footnote": "Herb Lin, \"Cyber conflict and international humanitarian law,\" International Review of the Red Cross, Vol. 94, No. 886 (Summer 2012): 530. See Catherine Lotrione, \"Cyber Operations: Conflict Under International Law,\" in Georgetown Journal of International Affairs, Special Issue, International Engagement on Cyber: Establishing Norms and Improving Security (2012): 20. See also Michael Schmitt, ed., Manual, 44, 58."
        },
        {
          "index": "53",
          "intext_citation": "consensus,53",
          "preceding_text": "alicious cyber activities that have occurred to date fall below the level of the use of force and armed attack thresholds of the UN Charter and the laws of armed conflict,52 and, given the fact that even for the areas of international law addressed in the Manual there is no state",
          "footnote": "Michael Schmitt, Manual, 11."
        },
        {
          "index": "54",
          "intext_citation": "domain.54",
          "preceding_text": "ed attack thresholds of the UN Charter and the laws of armed conflict,52 and, given the fact that even for the areas of international law addressed in the Manual there is no state consensus,53 uncertainty remains about the rules meant to constrain behavior that apply in the cyber",
          "footnote": "International Strategy for Cyberspace: Prosperity, Security, and Openness in a Networked World (Washington, DC: White House, 2011): 9."
        },
        {
          "index": "55",
          "intext_citation": "complex,55",
          "preceding_text": "Those norms that are clear and specific, rather than ambiguous and",
          "footnote": "Abram Chayes and Antonia Handler Chayes, \"On Compliance,\" International Organization 47-2 (spring 1993), pp. 175-206.; Jeffrey W. Legro, \"Which Norms Matter? Revisiting the \"Failure\" of Internationalism,\" International Organization, Vol. 51, No. 1 (Winter, 1997), pp. 31-63; Thomas M. Franck, \"The Emerging Right to Democratic Governance,\" The American Journal of International Law, Vol. 86, No. 1, (Jan., 1992), pp. 46-91."
        },
        {
          "index": "56",
          "intext_citation": "effective.56",
          "preceding_text": "Those norms that are clear and specific, rather than ambiguous and complex,55 and those that have been around for a long period of time, surviving numerous challenges are more likely to be",
          "footnote": "Legro 1997; Franck 1992."
        },
        {
          "index": "57",
          "intext_citation": "identities.57",
          "preceding_text": "As deterrence theorists have argued, in order for deterrence strategy to work, states must be aware of the \"rules and logic of the [strategic] game\" which is communicated between states and which serves not only to inform their actions but also their",
          "footnote": "Emanuel Adler, \"Complex Deterrence in the Asymmetric-Warfare Era,\" in T. V. Paul, Patrick M. Morgan and James J. Wirtz, ed., et al., Complex Deterrence: Strategy in the Global Age (Chicago, IL: University of Chicago Press, 2009), p. 88."
        },
        {
          "index": "59",
          "intext_citation": "conflict.59",
          "preceding_text": " the new cyber norms as stated in the GGE report in pre [84] Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III existing and widely accepted international legal principles may alleviate the need for a separate, stand-alone treaty for cyber",
          "footnote": "Richard Price argues that the landmine norm resonates with pre-established norms of humanitarian law, providing an advantage for the norms development. This is described in the norms literature as grafting norms, embedded norm discrimination, or nesting. Richard Price, \"Reversing the Gun Sights: Transnational Civil Society Targets Land Mines,\" International Organizations Vol. 52, no. 3 (1998), 613-644, 628."
        }
      ],
      "flat_text": "HEINONLINE DATE DOWNLOADED: Thu Apr 10 17:05:47 2025 SOURCE: Content Downloaded from HeinOnline ## Citations: Please note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n## Bluebook 21st ed.\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 GEO. J. INT'L AFF. 75 (2013).\n## ALWD 7th ed.\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 Geo. J. Int'l Aff. 75 (2013).\n## APA 7th ed.\nLotrionte, Catherine. (2013). better defense: examining the united states' new norms-based approach to cyber deterrence. Georgetown Journal of International Affairs, 14(3), 75-88.\n## Chicago 17th ed.\nCatherine Lotrionte,\"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence,\"Georgetown Journal of International Affairs 14, no. 3 (2013): 75-88 ## McGill Guide 10th ed.\nCatherine Lotrionte,\"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence\"(2013) 14:3 Geo J Int'l Aff 75.\n## AGLC 4th ed.\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14(3) Georgetown Journal of International Affairs 75 ## MLA 9th ed.\nLotrionte, Catherine.\"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence.\"Georgetown Journal of International Affairs, vol. 14, no. 3, 2013, pp. 75-88. HeinOnline.\n## OSCOLA 4th ed.\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14 Geo J Int'l Aff 75 Please note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License -- The search text of this PDF is generated from uncorrected OCR text.\n-- To obtain permission to use this article beyond the scope of your license, please use: Copyright Information # A Better Defense *Examining the United States’ New Norms-Based Approach to Cyber Deterrence* ## Catherine Lotrionte Since 2010, states have sought further methods for deterring adversarial actions through the Internet and recognized the need to develop forms of cyber deterrence as a key consideration in the pursuit of national and international security. In 2010, the UN Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (GGE) recommended that any further dialogue among states and other actors on norms pertaining to state use of Information and Communication Technologies (ICTs) to reduce collective risk and protect critical national and international infrastructure include discussions on the use of ICTs in conflict.¹ This article examines how the United States has worked to develop cyber deterrence in its more recent efforts by relying on a normative approach to establish “rules of the road” for conflict in cyberspace. It argues that the U.S. norms-based approach, in conjunction with U.S. military power, can reinforce general deterrence in cyberspace, increasing global stability. The article probes links between norms, international law, and deterrence policies, identifying conditions that may increase the potential utility of a strategic norms-based approach for calculations of military-security **Catherine Lotrionte** is Director of the Institute for Law, Science, &amp; Global Security and a Visiting Assistant Professor of Government and Foreign Service at Georgetown University. Dr. Lotrionte has served as Counsel to the President’s Foreign Intelligence Advisory Board at the White House and as Assistant General Counsel at the Central Intelligence Agency. She is the Director and Founder of the Cyber Project at Georgetown University and a Life Member of the Council on Foreign Relations.\n[75] A BETTER DEFENSE policy in the cyber domain. It argues that by embedding cyber deterrence practice in a set of norms, the deterrence strategy will be more likely to stabilize and restrain self-help behavior of states in the cyber domain. In other words, international norms can serve as a structure to increase the chances of deterrence success.\nThe article notes the potential limitations of cyber deterrence as examined by many others, but maintains that a synergy exists between recent developments in international engagement on cyber norms and the academic literatures, pointing to new lines of norms-based research in constructivism that can aid in strengthening the potential for cyber deterrence for the future. The basic proposition of the article is that understanding norms, how and when they develop, and their potential to evolve into binding international law, is essential to the effectiveness of a cyber deterrence policy. Drawing on the work of Lawrence Freedman, the article illustrates how a norms-based approach, rather than an interest-based approach, better reflects how detercontext of social construction based on the interest and identity of states.\n## Deterrence in a Post-Cold War Era As recent international events such as Estonia (2007),³ Georgia (2008),⁴ and Stuxnet (2010)⁵ created elevated awareness and security concerns, scholars and policymakers have turned their attention to the “cyber” issue focusing on whether deterrence theory can work in the cyber domain.⁶ Although the traditional notions of deterrence theory based on military strength have yet to mature in cyberspace,⁷ the United States has recently begun to develop a new strand of cyber strategy and policy—agreement on international norms and legal rules for cyber conflict—that I argue could deliver a positive deterrent effect. Indeed, the United States’ recent policies reflect a recognition that a normative approach could indeed provide the necessary deterrent effect with regard to certain uses of cyberspace during conflict.\nSome have argued that cyber deterrence as a U.S. strategic option is so discredited that it should be discarded completely.\nrence works in practice, “through actors internalizing a sense of appropriate limits on their actions.”² In sum, cyber weapons alone will not guarantee deterrence. If indeed cyber weapons come to be viewed as deterrent weapons it is not only because of the nature of the technology, but also through a normative completely.⁸ Recent scholarship has highlighted a number of challenges for cyber deterrence, illustrating the difficulty of deterrence’s translation into cyberspace and arguing, “concepts of deterrence and war may simply lack the logical foundations that they have in the nuclear and conventional realms.”⁹ Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III Some of the barriers to cyber deterrence that have been analyzed include: limits of attribution of the adversary, difficulty in holding the adversary's assets at risk, limits to an ability to continue an attack, involvement of non-state actors, and lack of a counterforce option.¹⁰ In short, some analysts have argued, the fundamental nature of the cyber domain is different than the physical domain and requires adopting new rules for state conduct and policy.¹¹ In 2009, perhaps to signal to opponents the United States' seriousness in developing cyber capabilities for conflict, the United States established its first cyber command and has since developed significant offensive cyber capabilities. In July 2011, the then-vice chairman of the joint Chiefs of Staff General James Cartwright, spoke further about the need to develop cyber deterrence through both punitive and denial mechanisms.¹² As Cartwright noted,\"There is no penalty to attacking us now. We have to figure out how to change that.\"¹³ Recently, in seeming recognition that military action in cyberspace to punish or deny using military resources may not be the best approach to deterring adversaries, a new norms-based approach to deterrence has begun to emerge in U.S. policy discussions.\nIn summarizing some of the options available to bolster U.S. cyber deterrence efforts, James Lewis has drawn attention to a normative component of cyber deterrence strategy: Better defenses could be reinforced by multilateral understandings on acceptable behavior in cyberspace—explicit norms and obligations... Just as nations feel a degree of constraint from norms and agreements on non-proliferation, establishing explicit international norms for behavior in cyberspace would affect political decisions on the potential risk and cost of cyber attack.¹⁴ A norms-based approach to deterrence—as opposed to a strictly interests-based approach—is one that reinforces\"certain values to the point where it is well understood that they must not be violated.\"¹⁵ While this approach provides hope for developing effective cyber deterrence it will require the exercise of many elements of foreign policy, rather than the use or threatened use of military force alone.¹⁶ The next section describes the recent policies announced by the United States supporting international norms in cyberspace.\n## The Role of the United States.\nIn May 2011 the United States released International Strategy for Cyberspace, its first policy document promoting international norms in the context of\"applying the expectations of peaceful and just interstate conduct to cyberspace\"in order to effect\"stability,\"as exists in\"other spheres of international relations.\"¹⁷ The document recognized that\"adherence to such norms brings predictability to state conduct, helping prevent the misunderstandings that could lead to conflict.\"¹⁸ During the same year, the Department of Defense's Strategy for Operating in Cyberspace described how the department would work with international partners\"to encourage responsible behavior and oppose those who would seek to disrupt networks and systems, dissuade and deter malicious actors, and reserve the right to defend these vital national [77] A BETTER DEFENSE assets as necessary and appropriate.\"¹⁹ These policies focus on regulative norms concerned with preventing inter-state conflict, or at least shaping and limiting the use of cyber attacks in of\"norm emergence,\"attention was called to the issue by the United States and like-minded states, and support was built. This began the socialization process of the norm life cycle.²² This # The United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace.\ncyber conflict.²⁰ As the United States promulgated its own domestic norms related to these international norms, the norms were being socialized to other states and the global cybersecurity agenda at the UN. The socialization of these norms is illustrated in states' agreeing to the 2013 GGE report. At the UN, for the first time, fifteen states, including Russia and China, agreed that the UN Charter principles and international law, in general, applies in the cyber domain. The report also upheld the principle of state responsibility for curbing or halting cyber attacks originating in their territories.²¹ Based on pre-existing principles of international law, specifically *jus ad bellum*, the laws related to the recourse to the use of force, and *jus in bello*, laws related to armed conflict, the United States has campaigned for international agreement on cyber norms. To date, the United States has succeeded in persuading at least fifteen states to embrace the norms of the UN Charter and state responsibility in the context of cyberspace. As a norm entrepreneur, the United States has framed the issues in a way that challenges the appropriateness of what is generally accepted today in cyber conflict. During this stage acceptance was possible in part because of the pre-existence of similar humanitarian issues related to conflict. As constructivist theory contends,\"mutually reinforcing and consistent norms appear to strength one another.\"²³ Although the GGE process has been an important step in the right direction, with only fifteen states in agreement, it lacks widespread international support. Only when a\"critical mass\"of states agree to a norm will the norm reach a\"tipping point,\"after which the norm gains widespread acceptance through a\"cascading\"effect.²⁴ Although it is not possible to predict exactly how many states are needed to\"tip\"the process, international law suggests that the\"tipping\"would occur once a majority of states in the international system adopt the norm.²⁵ For example, in the case of the norm of non-use of force, in the intervening years between the League of Nations in 1919, which had no mention of the norm of non-use of force, and the UN Charter in 1945, the norm achieved widespread support. It was considered so unproblematic by 1945 that at the negotiations of the UN Charter, no state felt the need to provide a public defense of Article 2(4) of the Charter. The UN Charter went [78] Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III into force in 1945 with about 60 states as signatories.\nPositive signs exist for further engagement on cyber issues. For example, there are signs that the United States is willing to engage with the Russian Federation on proposals to limit the military use of cyberspace, thereby reversing the trend of recent years.²⁶ In 2013, General Martin Dempsey, at a public forum discussing cyber threats, explained that the Chinese\"did not believe that hacking American systems violated any rules, since no rules existed.\"²⁷ He noted that American and Chinese officials had plans to meet to discuss ways\"to establish some rules of the road\"with respect to cyberattacks against U.S. companies to steal intelligence property.²⁸ In July 2011, an Organization for Security and Cooperation in Europe (OSCE) resolution to share information on cyber deployments during military conflicts was co-sponsored by the United States, Russia, and other nations.²⁹ Most recently in June 2013, Russia and the United States agreed to a hotline for real-time communications during a cyber-crisis, enabling both states to avoid misunderstandings and preventing potential escalation.³⁰ This is an indication of the emergence of a set of agreements between the two states to reduce conflict by contacting each other if there is a cyber incident instead of resorting to self-defense first. The United States has also conducted war games to figure out just how these rules would apply if it had to respond to a cyber attack against its critical infrastructure, and has recently updated its classified military rules of engagement in cyberspace for the first time in seven years.³¹ Such instances of cooperative efforts can act as a mechanism for the institutionalization of the norms across states through iterated behavior and habit; frequent interactions among individuals involving joint work can ultimately create predictability, stability, and habits of trust. Expanding these efforts through informal, non-obligatory intergovernmental cooperation, confidence building measures of transparency, and the creation of internationally recognized red lines would further increase international support.³³ ## Finding Norms for Cyberspace.\nDuring the Cold War, the Soviets Union and United States were able to establish both formal and informal arrangements to minimize the potential for catastrophic war and escalation. Today, the United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace in order to avoid widespread, potentially devastating, damage in cyberspace. The U.S. efforts seeking agreement on specific norms related to international law and the use of force in the cyber domain may prove the most fruitful for international agreement. While a\"no-first use\"norm, like that which emerged during the Cold War,³⁴ is unlikely to develop for the cyber domain, a norm of\"acceptable use\"could emerge, illuminating the\"red lines\"of cyber operations.³⁵ States could agree to certain acceptable targets in cyberspace during conflict. There is international humanitarian law on the issue of legitimate targets during conflict, especially the long standing prin [79] A BETTER DEFENSE ciples of *jus in bello*, which requires civilian populations to be protected during conflict and that gains of a military action need to be proportionate by not causing unnecessary harm or suffering. Extending these principles to the context of cyber conflict could be instrumental in developing an understanding that during a conflict in cyberspace military installations would be legitimate targets for cyber attacks, but financial institutions would not be legitimate targets given the uncertainties or unacceptable collateral damage to civilian populations. Targets such as banks, global positioning systems, and other infrastructure used for both military and civilian purposes could, under intrusions against industrial control targets, such that any cyber operation against such targets\"would be interpreted as the prelude to an attack,\"reasoning that an intrusion against such a target could only be useful as preparation for a future attack since there is no\"intelligence value to hacking an industrial control system.\"³⁶ This approach would be helpful in the case of a state considering the use of anticipatory self-defense under circumstances when it would be difficult to identify with certainty the purpose behind a particular cyber operation. In the context of intrusions into industrial control systems, for instance, it would be challenging to distinguish a cyber # A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions.\nthe current interpretation of the law, be legitimate targets in cyber conflict unless states were to agree otherwise.\nIn exploring additional options for regulating state behavior in cyber, the scenario of intrusions against industrial control systems illustrates the need for more clarity. Numerous critical installations of states such as power plants, nuclear plants, dams, water treatment and distribution systems, oil refineries, banking systems, hospital systems, and air traffic control systems rely on supervisory control and date acquisition systems, and distributed control systems. Some have proposed that it would be beneficial to prohibit cyber intrusion of a state's air defense that is meant as an *intelligence collection operation*—theft of information—from the same technical intrusion meant to identify vulnerabilities in anticipation of a *cyber attack* with physical, destructive results. Under the current understandings of the norms related to espionage versus\"armed attack\"under the UN Charter, an implant that is meant to support a subsequent\"armed attack\"would merit, and the law would allow for, a more hostile use of force response, in contrast to the discovery of a similar implant that was meant only to support espionage. This is due to the fact that under traditional understand- [80] Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III ings of international law, espionage does not constitute a\"use of force\"for purposes of the UN Charter, and certainly not an\"armed attack.\"Therefore, the victim of such a cyber intelligence collection operation would not have the lawful right of forcible self-defense whereas the victim of a cyber attack would, under the UN Charter, have the right of a forcible self-defense response.\nThis traditional understanding of the law may not be acceptable to states in the cyber context where the distinction between the cyber weapons used for intelligence collection and those used for sabotage cannot easily be made. And yet there is likely not going to be an amendment to the UN Charter to accommodate this complexity especially since state practice has indicated an unwillingness to consider intelligence collection a\"use of force.\"In this case, a new understanding of acceptable behavior under such circumstances would require states to reach a new agreement given the facts specific to cyber operations.\nIn the case of control systems, securing states' agreement to refrain from conducting cyber attacks against such systems certainly would be useful.[37] A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions. Indeed, there is some evidence that this may be an area that states, at least some states, would be restrained. The United States, for instance, in at least two different instances decided not to conduct cyber attacks against foreign financial networks. The Bush and Clinton administrations both refused to authorize hacking into foreign financial systems because of concerns of collateral damage and possible blowback on the United States.[38] Yet, the question remains whether other states would agree to refrain from doing the same. A shared understanding among states that financial institutions ought not to be targets for a cyber attack would be useful especially for the United States since it already appears to refrain from such actions.\nChallenges to Application. International law will play an important role in the normative framework for cyber deterrence as it is the international legal framework of\"war\"that provides the basis for cyber operations. Over the last decade, the growing concern over increased violence and the potential for state conflict in the cyber domain has led international legal scholars to assess how to accommodate an international legal framework for warfare in cyberspace, trying to bring some clarity to how international law would apply in the context of cyber conflict.[39] In particular, the applicability of international regarding the use of force and the right of self-defense is central to any clarification of when and under what circumstances a disruptive exploit in cyberspace could be considered an armed attack, triggering a use of force in self-defense.\nThe most relevant international law on the issue of deterrence and the use of cyberweapons is the law relating to the use of force enshrined in the UN Charter, *jus ad bellum*, and the law applicable in armed conflict that regulates the conduct of hostilities, *jus in [81] A BETTER DEFENSE bello. The UN Charter and customary law determine when cyber operations may be conducted, namely, in self-defense. While it is not necessary to fully explain the UN Charter paradigm here, it is necessary to address the issue of\"use of force\"and\"armed attack,\"two of the key terms in the Charter paradigm. The Charter prohibits\"the threat or use of force against the territorial integrity of political independence\"of a state.⁴⁰ Therefore, any cyber operation that amounts to a use of force is illegal.⁴¹ The UN Charter, however, does not allow the victim of a cyber operation that amounts to a\"use of force\"to respond in forcible self-defense.⁴² Such responses are limited to activities that equate to an armed attack pursuant to Article 51 of the Charter.⁴³ Based on the interpretation of these principles by the UN Charter and the International Court of Justice (ICJ),⁴⁴ a state's ability to signal a\"strike back\"deterrent to a cyber operation in self-defense would be subject to a finding that the cyber operation was not only a use of force but also an armed attack.⁴⁵ Unfortunately, neither the Charter nor the ICJ has provided specific definitions for these terms. In addition, there has yet to be a reported cyber operation between states that has been acknowledged as a use of force, let a lone an armed attack.⁴⁶ The recent Stuxnet cyber operation against the Iranian nuclear capabilities is likely to be the closest.⁴⁷ Yet there is debate as to whether Stuxnet was a use of force or an armed attack for purposes of the UN Charter.⁴⁸ Recent efforts to incorporate cyber warfare in our long-standing international legal systems prohibiting the use of force and protecting civilians from the effects of war illustrate the considerable challenges and incongruities in attempting to fit cyber into the conventional armed conflict framework. Two notable efforts have been the Tallinn Manual on the International Law Applicable to Cyber Warfare (the Manual)⁴⁹ and the International Committee of the Red Cross's (ICRC) first major article on cyber warfare published in 2012. In the ICRC article, the ICRC disagrees with the Manual's position on what would constitute an\"attack\"during armed conflict requiring physical effects. According to the majority of the experts on the Manual,\"interference with functionality qualifies as damage\"for purposes of determining if something was an\"attack\"during an armed conflict,\"if restoration of functionality requires replacement of physical components.\"⁵⁰ The ICRC, on the other hand, concludes that\"disrupting the functioning of certain systems by interfering with their underlying computer systems can amount to damage insofar as it impairs their usefulness,\"and therefore, an attack would also\"be understood to encompass such operations that disrupt the functioning of objects without physical damage or destruction, even if the disruption is temporary.\"⁵¹ Disagreement among the group of experts who drafted the Manual and the ICRC highlights the challenges in applying existing international law to the cyber domain.\nOvercoming the Obstacles. Over centuries, in the context of the physical realm, the international legal terms of\"use of force,\"\"armed attack,\"and\"self-defense\"have come to have mean- Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III ing in treaties, the practice of states, and through the dispute resolution process at the UN Security Council and the International Court of Justice. Today, for such activities in cyberspace, we need new consensus about the meanings of these legal terms, how they apply in cyberspace, and the situations in which the different thresholds would be triggered based on cyber operations. It is important for states to understand what would constitute an armed attack in cyberspace that would then trigger the target state's right of self-defense. Given that most of the malicious cyber activities that have occurred to date fall below the level of the use of force and armed attack thresholds of the UN Charter and the laws of armed conflict,52 and, given the fact that even for the areas of international law addressed in the Manual there is no state consensus,53 uncertainty remains about the rules meant to constrain behavior that apply in the cyber domain.54 In order for deterrence to work and widespread agreement on cyber norms to occur, there needs to be some shared expectations between states about what is acceptable behavior and what is not acceptable behavior in the cyber domain.\nIn lieu of any formal international treaty defining these terms in cyber, agreeing to norms will be important to providing needed clarity for states to understand the context in which they are operating in the cyber domain. Those norms that are clear and specific, rather than ambiguous and complex,55 and those that have been around for a long period of time, surviving numerous challenges are more likely to be effective.56 Starting with those norms related to the use of force in cyberspace, where there is legal precedent, makes sense. The next step would be to come to agreement on the meaning of the terms as used in the UN Charter. For example, the United States could seek to develop a specific domestic policy articulating when Article 51 of the UN Charter would be triggered by a cyber incident, establishing a clear threshold and share it with other states in order to seek agreement.\nAs deterrence theorists have argued, in order for deterrence strategy to work, states must be aware of the\"rules and logic of the [strategic] game\"which is communicated between states and which serves not only to inform their actions but also their identities.57 As part of a cyber declaratory deterrence policy, U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons. To develop such norms, threats of military action alone will not suffice. Rather, the diplomatic elements of foreign policy will need to be exercised to establish and reinforce certain values to the point where it is well understood by states that they must not be violated. Clear statements by the United States would be useful in setting forth the specifics of what those values are as envisioned in cyberspace.\nConclusion. These recent events support the emergence of a U.S. national cyber strategy where cyber deterrence is pursued not solely through national security capabilities (the development of offensive cyber capabilities at U.S. Cyber Command), but also through diplomatic and normative, means.\n[83] A BETTER DEFENSE Placing issues of cyber conflict under the auspices of the UN and the UN Charter principles makes sense. This will ultimately make the development of the norms easier for states to accept by embedding them in already existing international law and an international organization with members with conflicting identities and competing interests that plays an important role in norm innovation, cascading, institutionalization, and enforcement. Because of the lack of clarity in international law on the meaning of terms like\"armed attack,\"more work is required to identify exactly what the norm is and what constitutes violation as well as spelling out the procedures by which norm leaders coordinate disapproval and sanctions for norm breaking.\nThis article has argued that a norms-based approach, in conjunction with military cyber power, can deliver some cyber deterrence where military power alone is limited. Although the emergency suffering, principles which support the norms the United States is promoting through the GGE process. Second, the UN GGE process provides an organizational platform for the issues. With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\nThe\"rules of acceptable behavior\"that cyber deterrence scholars and recent U.S. cyber strategy documents have discussed, fit into this category of\"rules of the game\"that can take the form of consensual bilateral or multilateral declarations of principles, or even unilateral declarations and actions. The United States presently prefers non-legally binding agreements for cyber as compared to Russia that has advocated for an international treaty. The rationale for non-legally binding agreement may be that such agreements offer decision-makers opportunities to # U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons.\ngence of norms in cyberspace is in its early stages and it is too early to predict how these emerging norms, there are two central factors that support the potential for broader support for the norms the United States is promulgating. First, there is a tradition of international law and norms on which the cyber issues can be based that codify the principles of uses of force, self-defense, proportionality, discrimination and learn about the social effects of particular sets of rules over time, amending them accordingly, typically with lower negotiation costs than entailed by the renegotiation of treaties.[58] States may need time to learn about the technology and to arrive at conclusions about the kinds of behavior they prefer in the new domain of cyberspace.\nEmbedding the new cyber norms as stated in the GGE report in pre [84] Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III existing and widely accepted international legal principles may alleviate the need for a separate, stand-alone treaty for cyber conflict.59 Indeed, given the political context for cybersecurity where mistrust and geopolitical rivalry among states exists, such informal norms may be more attractive given that it is easier involvement in the Stuxnet cyber operation against Iran's uranium facility, the United States will likely face criticism and allegations of double standards. The United States must find a way to address these concerns and not lose momentum in the socialization of cyber conflict norms.\n# With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\nto obtain agreement on them. If more formal agreement on specific norms is the ultimate goal, the intermediate goal for the United States should be to develop confidence-building measures involving transparency between states in order to build trust, laying the groundwork for future consensus on specific norms.[60] Part of these transparency efforts could include expanding the number of states involved in the discussions about the meaning of the terms used in the UN Charter specifically in the context of cyber operations.\nSo far, the United States has provided the leadership and momentum necessary to begin to seek broader support for the norms. Continued support for the norms by the United States and like-minded nations will be needed. In its continued efforts in support of these international norms the United States ought to keep in mind that norms are developed not only by words, but also by acts. Given the possible U.S.-Israeli Unfortunately, the study of cyber deterrence and cyber norms is hampered by its novelty and much needed work is required to understand the processes of cyber deterrence development and normative change. Deterrence specialists have begun to pay careful attention to cyber attacks and that needs to continue. Their insights into issues related to the challenges of attribution and proportionate retaliation will be needed. The important question for international relations and legal scholars will involve understanding which norms will become legally binding international law and how, exactly, compliance with those laws comes about. It is, after all, these legal rules that will guide and determine the political actors' behavior in the cyber domain. Understanding the mechanisms and the likelihood of compliance will be the key to the longevity of peace and stability in cyberspace.[61] [85] A BETTER DEFENSE"
    },
    "numeric": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 2,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "HEINONLINE\nDATE DOWNLOADED: Thu Apr 10 17:05:47 2025\nSOURCE: Content Downloaded from HeinOnline\n## Citations:\nPlease note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n## Bluebook 21st ed.\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 GEO. J. INT'L AFF. 75 (2013).\n## ALWD 7th ed.\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 Geo. J. Int'l Aff. 75 (2013).\n## APA 7th ed.\nLotrionte, Catherine. (2013). better defense: examining the united states' new norms-based approach to cyber deterrence. Georgetown Journal of International Affairs, 14(3), 75-88.\n## Chicago 17th ed.\nCatherine Lotrionte, \"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence,\" Georgetown Journal of International Affairs 14, no. 3 (2013): 75-88\n## McGill Guide 10th ed.\nCatherine Lotrionte, \"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence\" (2013) 14:3 Geo J Int'l Aff 75.\n## AGLC 4th ed.\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14(3) Georgetown Journal of International Affairs 75\n## MLA 9th ed.\nLotrionte, Catherine. \"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence.\" Georgetown Journal of International Affairs, vol. 14, no. 3, 2013, pp. 75-88. HeinOnline.\n## OSCOLA 4th ed.\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14 Geo J Int'l Aff 75 Please note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\n-- To obtain permission to use this article beyond the scope of your license, please use: Copyright Information\n# A Better Defense\n*Examining the United States’ New Norms-Based Approach to Cyber Deterrence*\n## Catherine Lotrionte\nSince 2010, states have sought further methods for deterring adversarial actions through the Internet and recognized the need to develop forms of cyber deterrence as a key consideration in the pursuit of national and international security. In 2010, the UN Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (GGE) recommended that any further dialogue among states and other actors on norms pertaining to state use of Information and Communication Technologies (ICTs) to reduce collective risk and protect critical national and international infrastructure include discussions on the use of ICTs in conflict.¹\nThis article examines how the United States has worked to develop cyber deterrence in its more recent efforts by relying on a normative approach to establish “rules of the road” for conflict in cyberspace. It argues that the U.S. norms-based approach, in conjunction with U.S. military power, can reinforce general deterrence in cyberspace, increasing global stability. The article probes links between norms, international law, and deterrence policies, identifying conditions that may increase the potential utility of a strategic norms-based approach for calculations of military-security\n**Catherine Lotrionte** is Director of the Institute for Law, Science, &amp; Global Security and a Visiting Assistant Professor of Government and Foreign Service at Georgetown University. Dr. Lotrionte has served as Counsel to the President’s Foreign Intelligence Advisory Board at the White House and as Assistant General Counsel at the Central Intelligence Agency. She is the Director and Founder of the Cyber Project at Georgetown University and a Life Member of the Council on Foreign Relations.\n\nA BETTER DEFENSE\npolicy in the cyber domain. It argues that by embedding cyber deterrence practice in a set of norms, the deterrence strategy will be more likely to stabilize and restrain self-help behavior of states in the cyber domain. In other words, international norms can serve as a structure to increase the chances of deterrence success.\nThe article notes the potential limitations of cyber deterrence as examined by many others, but maintains that a synergy exists between recent developments in international engagement on cyber norms and the academic literatures, pointing to new lines of norms-based research in constructivism that can aid in strengthening the potential for cyber deterrence for the future. The basic proposition of the article is that understanding norms, how and when they develop, and their potential to evolve into binding international law, is essential to the effectiveness of a cyber deterrence policy. Drawing on the work of Lawrence Freedman, the article illustrates how a norms-based approach, rather than an interest-based approach, better reflects how deter-\ncontext of social construction based on the interest and identity of states.\n## Deterrence in a Post-Cold War Era\nAs recent international events such as Estonia (2007),³ Georgia (2008),⁴ and Stuxnet (2010)⁵ created elevated awareness and security concerns, scholars and policymakers have turned their attention to the “cyber” issue focusing on whether deterrence theory can work in the cyber domain.⁶ Although the traditional notions of deterrence theory based on military strength have yet to mature in cyberspace,⁷ the United States has recently begun to develop a new strand of cyber strategy and policy—agreement on international norms and legal rules for cyber conflict—that I argue could deliver a positive deterrent effect. Indeed, the United States’ recent policies reflect a recognition that a normative approach could indeed provide the necessary deterrent effect with regard to certain uses of cyberspace during conflict.\nSome have argued that cyber deterrence as a U.S. strategic option is so discredited that it should be discarded completely.\nrence works in practice, “through actors internalizing a sense of appropriate limits on their actions.”² In sum, cyber weapons alone will not guarantee deterrence. If indeed cyber weapons come to be viewed as deterrent weapons it is not only because of the nature of the technology, but also through a normative\ncompletely.⁸ Recent scholarship has highlighted a number of challenges for cyber deterrence, illustrating the difficulty of deterrence’s translation into cyberspace and arguing, “concepts of deterrence and war may simply lack the logical foundations that they have in the nuclear and conventional realms.”⁹\nGeorgetown Journal of International Affairs\nLOTRIONTE International Engagement on Cyber III\nSome of the barriers to cyber deterrence that have been analyzed include: limits of attribution of the adversary, difficulty in holding the adversary's assets at risk, limits to an ability to continue an attack, involvement of non-state actors, and lack of a counterforce option.¹⁰ In short, some analysts have argued, the fundamental nature of the cyber domain is different than the physical domain and requires adopting new rules for state conduct and policy.¹¹\nIn 2009, perhaps to signal to opponents the United States' seriousness in developing cyber capabilities for conflict, the United States established its first cyber command and has since developed significant offensive cyber capabilities. In July 2011, the then-vice chairman of the joint Chiefs of Staff General James Cartwright, spoke further about the need to develop cyber deterrence through both punitive and denial mechanisms.¹² As Cartwright noted, \"There is no penalty to attacking us now. We have to figure out how to change that.\"¹³ Recently, in seeming recognition that military action in cyberspace to punish or deny using military resources may not be the best approach to deterring adversaries, a new norms-based approach to deterrence has begun to emerge in U.S. policy discussions.\nIn summarizing some of the options available to bolster U.S. cyber deterrence efforts, James Lewis has drawn attention to a normative component of cyber deterrence strategy:\nBetter defenses could be reinforced by multilateral understandings on acceptable behavior in cyberspace—explicit norms and obligations... Just as nations feel a degree of constraint from norms and agreements on non-proliferation, establishing explicit international norms for behavior in cyberspace would affect political decisions on the potential risk and cost of cyber attack.¹⁴\nA norms-based approach to deterrence—as opposed to a strictly interests-based approach—is one that reinforces \"certain values to the point where it is well understood that they must not be violated.\"¹⁵ While this approach provides hope for developing effective cyber deterrence it will require the exercise of many elements of foreign policy, rather than the use or threatened use of military force alone.¹⁶ The next section describes the recent policies announced by the United States supporting international norms in cyberspace.\n## The Role of the United States.\nIn May 2011 the United States released International Strategy for Cyberspace, its first policy document promoting international norms in the context of \"applying the expectations of peaceful and just interstate conduct to cyberspace\" in order to effect \"stability,\" as exists in \"other spheres of international relations.\"¹⁷ The document recognized that \"adherence to such norms brings predictability to state conduct, helping prevent the misunderstandings that could lead to conflict.\"¹⁸ During the same year, the Department of Defense's Strategy for Operating in Cyberspace described how the department would work with international partners \"to encourage responsible behavior and oppose those who would seek to disrupt networks and systems, dissuade and deter malicious actors, and reserve the right to defend these vital national\n\nA BETTER DEFENSE\nassets as necessary and appropriate.\"¹⁹\nThese policies focus on regulative norms concerned with preventing inter-state conflict, or at least shaping and limiting the use of cyber attacks in\nof \"norm emergence,\" attention was called to the issue by the United States and like-minded states, and support was built. This began the socialization process of the norm life cycle.²² This\n# The United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace.\ncyber conflict.²⁰ As the United States promulgated its own domestic norms related to these international norms, the norms were being socialized to other states and the global cybersecurity agenda at the UN. The socialization of these norms is illustrated in states' agreeing to the 2013 GGE report. At the UN, for the first time, fifteen states, including Russia and China, agreed that the UN Charter principles and international law, in general, applies in the cyber domain. The report also upheld the principle of state responsibility for curbing or halting cyber attacks originating in their territories.²¹\nBased on pre-existing principles of international law, specifically *jus ad bellum*, the laws related to the recourse to the use of force, and *jus in bello*, laws related to armed conflict, the United States has campaigned for international agreement on cyber norms. To date, the United States has succeeded in persuading at least fifteen states to embrace the norms of the UN Charter and state responsibility in the context of cyberspace. As a norm entrepreneur, the United States has framed the issues in a way that challenges the appropriateness of what is generally accepted today in cyber conflict. During this stage\nacceptance was possible in part because of the pre-existence of similar humanitarian issues related to conflict. As constructivist theory contends, \"mutually reinforcing and consistent norms appear to strength one another.\"²³\nAlthough the GGE process has been an important step in the right direction, with only fifteen states in agreement, it lacks widespread international support. Only when a \"critical mass\" of states agree to a norm will the norm reach a \"tipping point,\" after which the norm gains widespread acceptance through a \"cascading\" effect.²⁴ Although it is not possible to predict exactly how many states are needed to \"tip\" the process, international law suggests that the \"tipping\" would occur once a majority of states in the international system adopt the norm.²⁵ For example, in the case of the norm of non-use of force, in the intervening years between the League of Nations in 1919, which had no mention of the norm of non-use of force, and the UN Charter in 1945, the norm achieved widespread support. It was considered so unproblematic by 1945 that at the negotiations of the UN Charter, no state felt the need to provide a public defense of Article 2(4) of the Charter. The UN Charter went\n Georgetown Journal of International Affairs\nLOTRIONTE International Engagement on Cyber III\ninto force in 1945 with about 60 states as signatories.\nPositive signs exist for further engagement on cyber issues. For example, there are signs that the United States is willing to engage with the Russian Federation on proposals to limit the military use of cyberspace, thereby reversing the trend of recent years.²⁶ In 2013, General Martin Dempsey, at a public forum discussing cyber threats, explained that the Chinese \"did not believe that hacking American systems violated any rules, since no rules existed.\"²⁷ He noted that American and Chinese officials had plans to meet to discuss ways \"to establish some rules of the road\" with respect to cyberattacks against U.S. companies to steal intelligence property.²⁸ In July 2011, an Organization for Security and Cooperation in Europe (OSCE) resolution to share information on cyber deployments during military conflicts was co-sponsored by the United States, Russia, and other nations.²⁹\nMost recently in June 2013, Russia and the United States agreed to a hotline for real-time communications during a cyber-crisis, enabling both states to avoid misunderstandings and preventing potential escalation.³⁰ This is an indication of the emergence of a set of agreements between the two states to reduce conflict by contacting each other if there is a cyber incident instead of resorting to self-defense first. The United States has also conducted war games to figure out just how these rules would apply if it had to respond to a cyber attack against its critical infrastructure, and has recently updated its classified military rules of engagement in cyberspace for the first time in seven years.³¹\nSuch instances of cooperative efforts can act as a mechanism for the institutionalization of the norms across states through iterated behavior and habit; frequent interactions among individuals involving joint work can ultimately create predictability, stability, and habits of trust. Expanding these efforts through informal, non-obligatory intergovernmental cooperation, confidence building measures of transparency, and the creation of internationally recognized red lines would further increase international support.³³\n## Finding Norms for Cyberspace.\nDuring the Cold War, the Soviets Union and United States were able to establish both formal and informal arrangements to minimize the potential for catastrophic war and escalation. Today, the United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace in order to avoid widespread, potentially devastating, damage in cyberspace. The U.S. efforts seeking agreement on specific norms related to international law and the use of force in the cyber domain may prove the most fruitful for international agreement. While a \"no-first use\" norm, like that which emerged during the Cold War,³⁴ is unlikely to develop for the cyber domain, a norm of \"acceptable use\" could emerge, illuminating the \"red lines\" of cyber operations.³⁵ States could agree to certain acceptable targets in cyberspace during conflict. There is international humanitarian law on the issue of legitimate targets during conflict, especially the long standing prin\n\nA BETTER DEFENSE\nciples of *jus in bello*, which requires civilian populations to be protected during conflict and that gains of a military action need to be proportionate by not causing unnecessary harm or suffering. Extending these principles to the context of cyber conflict could be instrumental in developing an understanding that during a conflict in cyberspace military installations would be legitimate targets for cyber attacks, but financial institutions would not be legitimate targets given the uncertainties or unacceptable collateral damage to civilian populations. Targets such as banks, global positioning systems, and other infrastructure used for both military and civilian purposes could, under\nintrusions against industrial control targets, such that any cyber operation against such targets \"would be interpreted as the prelude to an attack,\" reasoning that an intrusion against such a target could only be useful as preparation for a future attack since there is no \"intelligence value to hacking an industrial control system.\"³⁶\nThis approach would be helpful in the case of a state considering the use of anticipatory self-defense under circumstances when it would be difficult to identify with certainty the purpose behind a particular cyber operation. In the context of intrusions into industrial control systems, for instance, it would be challenging to distinguish a cyber\n# A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions.\nthe current interpretation of the law, be legitimate targets in cyber conflict unless states were to agree otherwise.\nIn exploring additional options for regulating state behavior in cyber, the scenario of intrusions against industrial control systems illustrates the need for more clarity. Numerous critical installations of states such as power plants, nuclear plants, dams, water treatment and distribution systems, oil refineries, banking systems, hospital systems, and air traffic control systems rely on supervisory control and date acquisition systems, and distributed control systems. Some have proposed that it would be beneficial to prohibit cyber\nintrusion of a state's air defense that is meant as an *intelligence collection operation*—theft of information—from the same technical intrusion meant to identify vulnerabilities in anticipation of a *cyber attack* with physical, destructive results. Under the current understandings of the norms related to espionage versus \"armed attack\" under the UN Charter, an implant that is meant to support a subsequent \"armed attack\" would merit, and the law would allow for, a more hostile use of force response, in contrast to the discovery of a similar implant that was meant only to support espionage. This is due to the fact that under traditional understand-\n Georgetown Journal of International Affairs\nLOTRIONTE International Engagement on Cyber III\nings of international law, espionage does not constitute a \"use of force\" for purposes of the UN Charter, and certainly not an \"armed attack.\" Therefore, the victim of such a cyber intelligence collection operation would not have the lawful right of forcible self-defense whereas the victim of a cyber attack would, under the UN Charter, have the right of a forcible self-defense response.\nThis traditional understanding of the law may not be acceptable to states in the cyber context where the distinction between the cyber weapons used for intelligence collection and those used for sabotage cannot easily be made. And yet there is likely not going to be an amendment to the UN Charter to accommodate this complexity especially since state practice has indicated an unwillingness to consider intelligence collection a \"use of force.\" In this case, a new understanding of acceptable behavior under such circumstances would require states to reach a new agreement given the facts specific to cyber operations.\nIn the case of control systems, securing states' agreement to refrain from conducting cyber attacks against such systems certainly would be useful. A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions. Indeed, there is some evidence that this may be an area that states, at least some states, would be restrained. The United States, for instance, in at least two different instances decided not to conduct cyber attacks against foreign financial networks. The Bush and Clinton administrations both refused to authorize hacking into foreign financial systems because of concerns of collateral damage and possible blowback on the United States. Yet, the question remains whether other states would agree to refrain from doing the same. A shared understanding among states that financial institutions ought not to be targets for a cyber attack would be useful especially for the United States since it already appears to refrain from such actions.\nChallenges to Application. International law will play an important role in the normative framework for cyber deterrence as it is the international legal framework of \"war\" that provides the basis for cyber operations. Over the last decade, the growing concern over increased violence and the potential for state conflict in the cyber domain has led international legal scholars to assess how to accommodate an international legal framework for warfare in cyberspace, trying to bring some clarity to how international law would apply in the context of cyber conflict. In particular, the applicability of international regarding the use of force and the right of self-defense is central to any clarification of when and under what circumstances a disruptive exploit in cyberspace could be considered an armed attack, triggering a use of force in self-defense.\nThe most relevant international law on the issue of deterrence and the use of cyberweapons is the law relating to the use of force enshrined in the UN Charter, *jus ad bellum*, and the law applicable in armed conflict that regulates the conduct of hostilities, *jus in\n\nA BETTER DEFENSE\nbello. The UN Charter and customary law determine when cyber operations may be conducted, namely, in self-defense. While it is not necessary to fully explain the UN Charter paradigm here, it is necessary to address the issue of \"use of force\" and \"armed attack,\" two of the key terms in the Charter paradigm. The Charter prohibits \"the threat or use of force against the territorial integrity of political independence\" of a state.⁴⁰ Therefore, any cyber operation that amounts to a use of force is illegal.⁴¹ The UN Charter, however, does not allow the victim of a cyber operation that amounts to a \"use of force\" to respond in forcible self-defense.⁴² Such responses are limited to activities that equate to an armed attack pursuant to Article 51 of the Charter.⁴³\nBased on the interpretation of these principles by the UN Charter and the International Court of Justice (ICJ),⁴⁴ a state's ability to signal a \"strike back\" deterrent to a cyber operation in self-defense would be subject to a finding that the cyber operation was not only a use of force but also an armed attack.⁴⁵ Unfortunately, neither the Charter nor the ICJ has provided specific definitions for these terms. In addition, there has yet to be a reported cyber operation between states that has been acknowledged as a use of force, let a lone an armed attack.⁴⁶ The recent Stuxnet cyber operation against the Iranian nuclear capabilities is likely to be the closest.⁴⁷ Yet there is debate as to whether Stuxnet was a use of force or an armed attack for purposes of the UN Charter.⁴⁸\nRecent efforts to incorporate cyber warfare in our long-standing international legal systems prohibiting the use of force and protecting civilians from the effects of war illustrate the considerable challenges and incongruities in attempting to fit cyber into the conventional armed conflict framework. Two notable efforts have been the Tallinn Manual on the International Law Applicable to Cyber Warfare (the Manual)⁴⁹ and the International Committee of the Red Cross's (ICRC) first major article on cyber warfare published in 2012. In the ICRC article, the ICRC disagrees with the Manual's position on what would constitute an \"attack\" during armed conflict requiring physical effects. According to the majority of the experts on the Manual, \"interference with functionality qualifies as damage\" for purposes of determining if something was an \"attack\" during an armed conflict, \"if restoration of functionality requires replacement of physical components.\"⁵⁰ The ICRC, on the other hand, concludes that \"disrupting the functioning of certain systems by interfering with their underlying computer systems can amount to damage insofar as it impairs their usefulness,\" and therefore, an attack would also \"be understood to encompass such operations that disrupt the functioning of objects without physical damage or destruction, even if the disruption is temporary.\"⁵¹ Disagreement among the group of experts who drafted the Manual and the ICRC highlights the challenges in applying existing international law to the cyber domain.\nOvercoming the Obstacles. Over centuries, in the context of the physical realm, the international legal terms of \"use of force,\" \"armed attack,\" and \"self-defense\" have come to have mean-\nGeorgetown Journal of International Affairs\nLOTRIONTE International Engagement on Cyber III\ning in treaties, the practice of states, and through the dispute resolution process at the UN Security Council and the International Court of Justice. Today, for such activities in cyberspace, we need new consensus about the meanings of these legal terms, how they apply in cyberspace, and the situations in which the different thresholds would be triggered based on cyber operations. It is important for states to understand what would constitute an armed attack in cyberspace that would then trigger the target state's right of self-defense. Given that most of the malicious cyber activities that have occurred to date fall below the level of the use of force and armed attack thresholds of the UN Charter and the laws of armed conflict,52 and, given the fact that even for the areas of international law addressed in the Manual there is no state consensus,53 uncertainty remains about the rules meant to constrain behavior that apply in the cyber domain.54 In order for deterrence to work and widespread agreement on cyber norms to occur, there needs to be some shared expectations between states about what is acceptable behavior and what is not acceptable behavior in the cyber domain.\nIn lieu of any formal international treaty defining these terms in cyber, agreeing to norms will be important to providing needed clarity for states to understand the context in which they are operating in the cyber domain. Those norms that are clear and specific, rather than ambiguous and complex,55 and those that have been around for a long period of time, surviving numerous challenges are more likely to be effective.56 Starting with those norms related to the use of force in cyber-\nspace, where there is legal precedent, makes sense. The next step would be to come to agreement on the meaning of the terms as used in the UN Charter. For example, the United States could seek to develop a specific domestic policy articulating when Article 51 of the UN Charter would be triggered by a cyber incident, establishing a clear threshold and share it with other states in order to seek agreement.\nAs deterrence theorists have argued, in order for deterrence strategy to work, states must be aware of the \"rules and logic of the [strategic] game\" which is communicated between states and which serves not only to inform their actions but also their identities.57 As part of a cyber declaratory deterrence policy, U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons. To develop such norms, threats of military action alone will not suffice. Rather, the diplomatic elements of foreign policy will need to be exercised to establish and reinforce certain values to the point where it is well understood by states that they must not be violated. Clear statements by the United States would be useful in setting forth the specifics of what those values are as envisioned in cyberspace.\nConclusion. These recent events support the emergence of a U.S. national cyber strategy where cyber deterrence is pursued not solely through national security capabilities (the development of offensive cyber capabilities at U.S. Cyber Command), but also through diplomatic and normative, means.\n\nA BETTER DEFENSE\nPlacing issues of cyber conflict under the auspices of the UN and the UN Charter principles makes sense. This will ultimately make the development of the norms easier for states to accept by embedding them in already existing international law and an international organization with members with conflicting identities and competing interests that plays an important role in norm innovation, cascading, institutionalization, and enforcement. Because of the lack of clarity in international law on the meaning of terms like \"armed attack,\" more work is required to identify exactly what the norm is and what constitutes violation as well as spelling out the procedures by which norm leaders coordinate disapproval and sanctions for norm breaking.\nThis article has argued that a norms-based approach, in conjunction with military cyber power, can deliver some cyber deterrence where military power alone is limited. Although the emergency suffering, principles which support the norms the United States is promoting through the GGE process. Second, the UN GGE process provides an organizational platform for the issues. With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\nThe \"rules of acceptable behavior\" that cyber deterrence scholars and recent U.S. cyber strategy documents have discussed, fit into this category of \"rules of the game\" that can take the form of consensual bilateral or multilateral declarations of principles, or even unilateral declarations and actions. The United States presently prefers non-legally binding agreements for cyber as compared to Russia that has advocated for an international treaty. The rationale for non-legally binding agreement may be that such agreements offer decision-makers opportunities to\n# U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons.\ngence of norms in cyberspace is in its early stages and it is too early to predict how these emerging norms, there are two central factors that support the potential for broader support for the norms the United States is promulgating. First, there is a tradition of international law and norms on which the cyber issues can be based that codify the principles of uses of force, self-defense, proportionality, discrimination and\nlearn about the social effects of particular sets of rules over time, amending them accordingly, typically with lower negotiation costs than entailed by the renegotiation of treaties. States may need time to learn about the technology and to arrive at conclusions about the kinds of behavior they prefer in the new domain of cyberspace.\nEmbedding the new cyber norms as stated in the GGE report in pre\n Georgetown Journal of International Affairs\nLOTRIONTE International Engagement on Cyber III\nexisting and widely accepted international legal principles may alleviate the need for a separate, stand-alone treaty for cyber conflict.59 Indeed, given the political context for cybersecurity where mistrust and geopolitical rivalry among states exists, such informal norms may be more attractive given that it is easier\ninvolvement in the Stuxnet cyber operation against Iran's uranium facility, the United States will likely face criticism and allegations of double standards. The United States must find a way to address these concerns and not lose momentum in the socialization of cyber conflict norms.\n# With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\nto obtain agreement on them. If more formal agreement on specific norms is the ultimate goal, the intermediate goal for the United States should be to develop confidence-building measures involving transparency between states in order to build trust, laying the groundwork for future consensus on specific norms. Part of these transparency efforts could include expanding the number of states involved in the discussions about the meaning of the terms used in the UN Charter specifically in the context of cyber operations.\nSo far, the United States has provided the leadership and momentum necessary to begin to seek broader support for the norms. Continued support for the norms by the United States and like-minded nations will be needed. In its continued efforts in support of these international norms the United States ought to keep in mind that norms are developed not only by words, but also by acts. Given the possible U.S.-Israeli\nUnfortunately, the study of cyber deterrence and cyber norms is hampered by its novelty and much needed work is required to understand the processes of cyber deterrence development and normative change. Deterrence specialists have begun to pay careful attention to cyber attacks and that needs to continue. Their insights into issues related to the challenges of attribution and proportionate retaliation will be needed. The important question for international relations and legal scholars will involve understanding which norms will become legally binding international law and how, exactly, compliance with those laws comes about. It is, after all, these legal rules that will guide and determine the political actors' behavior in the cyber domain. Understanding the mechanisms and the likelihood of compliance will be the key to the longevity of peace and stability in cyberspace.\n\nA BETTER DEFENSE"
    },
    "author_year": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 168,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "author_year"
      },
      "results": [],
      "flat_text": "HEINONLINE DATE DOWNLOADED: Thu Apr 10 17:05:47 2025 SOURCE: Content Downloaded from HeinOnline ## Citations: Please note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n## Bluebook 21st ed.\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 GEO. J. INT'L AFF. 75 (2013).\n## ALWD 7th ed.\nCatherine Lotrionte, A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence, 14 Geo. J. Int'l Aff. 75 (2013).\n## APA 7th ed.\nLotrionte, Catherine. (2013). better defense: examining the united states' new norms-based approach to cyber deterrence. Georgetown Journal of International Affairs, 14(3), 75-88.\n## Chicago 17th ed.\nCatherine Lotrionte,\"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence,\"Georgetown Journal of International Affairs 14, no. 3 (2013): 75-88 ## McGill Guide 10th ed.\nCatherine Lotrionte,\"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence\"(2013) 14:3 Geo J Int'l Aff 75.\n## AGLC 4th ed.\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14(3) Georgetown Journal of International Affairs 75 ## MLA 9th ed.\nLotrionte, Catherine.\"A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence.\"Georgetown Journal of International Affairs, vol. 14, no. 3, 2013, pp. 75-88. HeinOnline.\n## OSCOLA 4th ed.\nCatherine Lotrionte, 'A Better Defense: Examining the United States' New Norms-Based Approach to Cyber Deterrence' (2013) 14 Geo J Int'l Aff 75 Please note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License -- The search text of this PDF is generated from uncorrected OCR text.\n-- To obtain permission to use this article beyond the scope of your license, please use: Copyright Information # A Better Defense *Examining the United States’ New Norms-Based Approach to Cyber Deterrence* ## Catherine Lotrionte Since 2010, states have sought further methods for deterring adversarial actions through the Internet and recognized the need to develop forms of cyber deterrence as a key consideration in the pursuit of national and international security. In 2010, the UN Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (GGE) recommended that any further dialogue among states and other actors on norms pertaining to state use of Information and Communication Technologies (ICTs) to reduce collective risk and protect critical national and international infrastructure include discussions on the use of ICTs in conflict.¹ This article examines how the United States has worked to develop cyber deterrence in its more recent efforts by relying on a normative approach to establish “rules of the road” for conflict in cyberspace. It argues that the U.S. norms-based approach, in conjunction with U.S. military power, can reinforce general deterrence in cyberspace, increasing global stability. The article probes links between norms, international law, and deterrence policies, identifying conditions that may increase the potential utility of a strategic norms-based approach for calculations of military-security **Catherine Lotrionte** is Director of the Institute for Law, Science, &amp; Global Security and a Visiting Assistant Professor of Government and Foreign Service at Georgetown University. Dr. Lotrionte has served as Counsel to the President’s Foreign Intelligence Advisory Board at the White House and as Assistant General Counsel at the Central Intelligence Agency. She is the Director and Founder of the Cyber Project at Georgetown University and a Life Member of the Council on Foreign Relations.\n[75] A BETTER DEFENSE policy in the cyber domain. It argues that by embedding cyber deterrence practice in a set of norms, the deterrence strategy will be more likely to stabilize and restrain self-help behavior of states in the cyber domain. In other words, international norms can serve as a structure to increase the chances of deterrence success.\nThe article notes the potential limitations of cyber deterrence as examined by many others, but maintains that a synergy exists between recent developments in international engagement on cyber norms and the academic literatures, pointing to new lines of norms-based research in constructivism that can aid in strengthening the potential for cyber deterrence for the future. The basic proposition of the article is that understanding norms, how and when they develop, and their potential to evolve into binding international law, is essential to the effectiveness of a cyber deterrence policy. Drawing on the work of Lawrence Freedman, the article illustrates how a norms-based approach, rather than an interest-based approach, better reflects how detercontext of social construction based on the interest and identity of states.\n## Deterrence in a Post-Cold War Era As recent international events such as Estonia (2007),³ Georgia (2008),⁴ and Stuxnet (2010)⁵ created elevated awareness and security concerns, scholars and policymakers have turned their attention to the “cyber” issue focusing on whether deterrence theory can work in the cyber domain.⁶ Although the traditional notions of deterrence theory based on military strength have yet to mature in cyberspace,⁷ the United States has recently begun to develop a new strand of cyber strategy and policy—agreement on international norms and legal rules for cyber conflict—that I argue could deliver a positive deterrent effect. Indeed, the United States’ recent policies reflect a recognition that a normative approach could indeed provide the necessary deterrent effect with regard to certain uses of cyberspace during conflict.\nSome have argued that cyber deterrence as a U.S. strategic option is so discredited that it should be discarded completely.\nrence works in practice, “through actors internalizing a sense of appropriate limits on their actions.”² In sum, cyber weapons alone will not guarantee deterrence. If indeed cyber weapons come to be viewed as deterrent weapons it is not only because of the nature of the technology, but also through a normative completely.⁸ Recent scholarship has highlighted a number of challenges for cyber deterrence, illustrating the difficulty of deterrence’s translation into cyberspace and arguing, “concepts of deterrence and war may simply lack the logical foundations that they have in the nuclear and conventional realms.”⁹ Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III Some of the barriers to cyber deterrence that have been analyzed include: limits of attribution of the adversary, difficulty in holding the adversary's assets at risk, limits to an ability to continue an attack, involvement of non-state actors, and lack of a counterforce option.¹⁰ In short, some analysts have argued, the fundamental nature of the cyber domain is different than the physical domain and requires adopting new rules for state conduct and policy.¹¹ In 2009, perhaps to signal to opponents the United States' seriousness in developing cyber capabilities for conflict, the United States established its first cyber command and has since developed significant offensive cyber capabilities. In July 2011, the then-vice chairman of the joint Chiefs of Staff General James Cartwright, spoke further about the need to develop cyber deterrence through both punitive and denial mechanisms.¹² As Cartwright noted,\"There is no penalty to attacking us now. We have to figure out how to change that.\"¹³ Recently, in seeming recognition that military action in cyberspace to punish or deny using military resources may not be the best approach to deterring adversaries, a new norms-based approach to deterrence has begun to emerge in U.S. policy discussions.\nIn summarizing some of the options available to bolster U.S. cyber deterrence efforts, James Lewis has drawn attention to a normative component of cyber deterrence strategy: Better defenses could be reinforced by multilateral understandings on acceptable behavior in cyberspace—explicit norms and obligations... Just as nations feel a degree of constraint from norms and agreements on non-proliferation, establishing explicit international norms for behavior in cyberspace would affect political decisions on the potential risk and cost of cyber attack.¹⁴ A norms-based approach to deterrence—as opposed to a strictly interests-based approach—is one that reinforces\"certain values to the point where it is well understood that they must not be violated.\"¹⁵ While this approach provides hope for developing effective cyber deterrence it will require the exercise of many elements of foreign policy, rather than the use or threatened use of military force alone.¹⁶ The next section describes the recent policies announced by the United States supporting international norms in cyberspace.\n## The Role of the United States.\nIn May 2011 the United States released International Strategy for Cyberspace, its first policy document promoting international norms in the context of\"applying the expectations of peaceful and just interstate conduct to cyberspace\"in order to effect\"stability,\"as exists in\"other spheres of international relations.\"¹⁷ The document recognized that\"adherence to such norms brings predictability to state conduct, helping prevent the misunderstandings that could lead to conflict.\"¹⁸ During the same year, the Department of Defense's Strategy for Operating in Cyberspace described how the department would work with international partners\"to encourage responsible behavior and oppose those who would seek to disrupt networks and systems, dissuade and deter malicious actors, and reserve the right to defend these vital national [77] A BETTER DEFENSE assets as necessary and appropriate.\"¹⁹ These policies focus on regulative norms concerned with preventing inter-state conflict, or at least shaping and limiting the use of cyber attacks in of\"norm emergence,\"attention was called to the issue by the United States and like-minded states, and support was built. This began the socialization process of the norm life cycle.²² This # The United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace.\ncyber conflict.²⁰ As the United States promulgated its own domestic norms related to these international norms, the norms were being socialized to other states and the global cybersecurity agenda at the UN. The socialization of these norms is illustrated in states' agreeing to the 2013 GGE report. At the UN, for the first time, fifteen states, including Russia and China, agreed that the UN Charter principles and international law, in general, applies in the cyber domain. The report also upheld the principle of state responsibility for curbing or halting cyber attacks originating in their territories.²¹ Based on pre-existing principles of international law, specifically *jus ad bellum*, the laws related to the recourse to the use of force, and *jus in bello*, laws related to armed conflict, the United States has campaigned for international agreement on cyber norms. To date, the United States has succeeded in persuading at least fifteen states to embrace the norms of the UN Charter and state responsibility in the context of cyberspace. As a norm entrepreneur, the United States has framed the issues in a way that challenges the appropriateness of what is generally accepted today in cyber conflict. During this stage acceptance was possible in part because of the pre-existence of similar humanitarian issues related to conflict. As constructivist theory contends,\"mutually reinforcing and consistent norms appear to strength one another.\"²³ Although the GGE process has been an important step in the right direction, with only fifteen states in agreement, it lacks widespread international support. Only when a\"critical mass\"of states agree to a norm will the norm reach a\"tipping point,\"after which the norm gains widespread acceptance through a\"cascading\"effect.²⁴ Although it is not possible to predict exactly how many states are needed to\"tip\"the process, international law suggests that the\"tipping\"would occur once a majority of states in the international system adopt the norm.²⁵ For example, in the case of the norm of non-use of force, in the intervening years between the League of Nations in 1919, which had no mention of the norm of non-use of force, and the UN Charter in 1945, the norm achieved widespread support. It was considered so unproblematic by 1945 that at the negotiations of the UN Charter, no state felt the need to provide a public defense of Article 2(4) of the Charter. The UN Charter went [78] Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III into force in 1945 with about 60 states as signatories.\nPositive signs exist for further engagement on cyber issues. For example, there are signs that the United States is willing to engage with the Russian Federation on proposals to limit the military use of cyberspace, thereby reversing the trend of recent years.²⁶ In 2013, General Martin Dempsey, at a public forum discussing cyber threats, explained that the Chinese\"did not believe that hacking American systems violated any rules, since no rules existed.\"²⁷ He noted that American and Chinese officials had plans to meet to discuss ways\"to establish some rules of the road\"with respect to cyberattacks against U.S. companies to steal intelligence property.²⁸ In July 2011, an Organization for Security and Cooperation in Europe (OSCE) resolution to share information on cyber deployments during military conflicts was co-sponsored by the United States, Russia, and other nations.²⁹ Most recently in June 2013, Russia and the United States agreed to a hotline for real-time communications during a cyber-crisis, enabling both states to avoid misunderstandings and preventing potential escalation.³⁰ This is an indication of the emergence of a set of agreements between the two states to reduce conflict by contacting each other if there is a cyber incident instead of resorting to self-defense first. The United States has also conducted war games to figure out just how these rules would apply if it had to respond to a cyber attack against its critical infrastructure, and has recently updated its classified military rules of engagement in cyberspace for the first time in seven years.³¹ Such instances of cooperative efforts can act as a mechanism for the institutionalization of the norms across states through iterated behavior and habit; frequent interactions among individuals involving joint work can ultimately create predictability, stability, and habits of trust. Expanding these efforts through informal, non-obligatory intergovernmental cooperation, confidence building measures of transparency, and the creation of internationally recognized red lines would further increase international support.³³ ## Finding Norms for Cyberspace.\nDuring the Cold War, the Soviets Union and United States were able to establish both formal and informal arrangements to minimize the potential for catastrophic war and escalation. Today, the United States and other states have an opportunity to reach a consensus on the appropriate boundaries for state activities in cyberspace in order to avoid widespread, potentially devastating, damage in cyberspace. The U.S. efforts seeking agreement on specific norms related to international law and the use of force in the cyber domain may prove the most fruitful for international agreement. While a\"no-first use\"norm, like that which emerged during the Cold War,³⁴ is unlikely to develop for the cyber domain, a norm of\"acceptable use\"could emerge, illuminating the\"red lines\"of cyber operations.³⁵ States could agree to certain acceptable targets in cyberspace during conflict. There is international humanitarian law on the issue of legitimate targets during conflict, especially the long standing prin [79] A BETTER DEFENSE ciples of *jus in bello*, which requires civilian populations to be protected during conflict and that gains of a military action need to be proportionate by not causing unnecessary harm or suffering. Extending these principles to the context of cyber conflict could be instrumental in developing an understanding that during a conflict in cyberspace military installations would be legitimate targets for cyber attacks, but financial institutions would not be legitimate targets given the uncertainties or unacceptable collateral damage to civilian populations. Targets such as banks, global positioning systems, and other infrastructure used for both military and civilian purposes could, under intrusions against industrial control targets, such that any cyber operation against such targets\"would be interpreted as the prelude to an attack,\"reasoning that an intrusion against such a target could only be useful as preparation for a future attack since there is no\"intelligence value to hacking an industrial control system.\"³⁶ This approach would be helpful in the case of a state considering the use of anticipatory self-defense under circumstances when it would be difficult to identify with certainty the purpose behind a particular cyber operation. In the context of intrusions into industrial control systems, for instance, it would be challenging to distinguish a cyber # A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions.\nthe current interpretation of the law, be legitimate targets in cyber conflict unless states were to agree otherwise.\nIn exploring additional options for regulating state behavior in cyber, the scenario of intrusions against industrial control systems illustrates the need for more clarity. Numerous critical installations of states such as power plants, nuclear plants, dams, water treatment and distribution systems, oil refineries, banking systems, hospital systems, and air traffic control systems rely on supervisory control and date acquisition systems, and distributed control systems. Some have proposed that it would be beneficial to prohibit cyber intrusion of a state's air defense that is meant as an *intelligence collection operation*—theft of information—from the same technical intrusion meant to identify vulnerabilities in anticipation of a *cyber attack* with physical, destructive results. Under the current understandings of the norms related to espionage versus\"armed attack\"under the UN Charter, an implant that is meant to support a subsequent\"armed attack\"would merit, and the law would allow for, a more hostile use of force response, in contrast to the discovery of a similar implant that was meant only to support espionage. This is due to the fact that under traditional understand- [80] Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III ings of international law, espionage does not constitute a\"use of force\"for purposes of the UN Charter, and certainly not an\"armed attack.\"Therefore, the victim of such a cyber intelligence collection operation would not have the lawful right of forcible self-defense whereas the victim of a cyber attack would, under the UN Charter, have the right of a forcible self-defense response.\nThis traditional understanding of the law may not be acceptable to states in the cyber context where the distinction between the cyber weapons used for intelligence collection and those used for sabotage cannot easily be made. And yet there is likely not going to be an amendment to the UN Charter to accommodate this complexity especially since state practice has indicated an unwillingness to consider intelligence collection a\"use of force.\"In this case, a new understanding of acceptable behavior under such circumstances would require states to reach a new agreement given the facts specific to cyber operations.\nIn the case of control systems, securing states' agreement to refrain from conducting cyber attacks against such systems certainly would be useful.[37] A shared understanding about the negative ramifications for all states of such actions could be effective in constraining state behavior even without a treaty prohibiting such actions. Indeed, there is some evidence that this may be an area that states, at least some states, would be restrained. The United States, for instance, in at least two different instances decided not to conduct cyber attacks against foreign financial networks. The Bush and Clinton administrations both refused to authorize hacking into foreign financial systems because of concerns of collateral damage and possible blowback on the United States.[38] Yet, the question remains whether other states would agree to refrain from doing the same. A shared understanding among states that financial institutions ought not to be targets for a cyber attack would be useful especially for the United States since it already appears to refrain from such actions.\nChallenges to Application. International law will play an important role in the normative framework for cyber deterrence as it is the international legal framework of\"war\"that provides the basis for cyber operations. Over the last decade, the growing concern over increased violence and the potential for state conflict in the cyber domain has led international legal scholars to assess how to accommodate an international legal framework for warfare in cyberspace, trying to bring some clarity to how international law would apply in the context of cyber conflict.[39] In particular, the applicability of international regarding the use of force and the right of self-defense is central to any clarification of when and under what circumstances a disruptive exploit in cyberspace could be considered an armed attack, triggering a use of force in self-defense.\nThe most relevant international law on the issue of deterrence and the use of cyberweapons is the law relating to the use of force enshrined in the UN Charter, *jus ad bellum*, and the law applicable in armed conflict that regulates the conduct of hostilities, *jus in [81] A BETTER DEFENSE bello. The UN Charter and customary law determine when cyber operations may be conducted, namely, in self-defense. While it is not necessary to fully explain the UN Charter paradigm here, it is necessary to address the issue of\"use of force\"and\"armed attack,\"two of the key terms in the Charter paradigm. The Charter prohibits\"the threat or use of force against the territorial integrity of political independence\"of a state.⁴⁰ Therefore, any cyber operation that amounts to a use of force is illegal.⁴¹ The UN Charter, however, does not allow the victim of a cyber operation that amounts to a\"use of force\"to respond in forcible self-defense.⁴² Such responses are limited to activities that equate to an armed attack pursuant to Article 51 of the Charter.⁴³ Based on the interpretation of these principles by the UN Charter and the International Court of Justice (ICJ),⁴⁴ a state's ability to signal a\"strike back\"deterrent to a cyber operation in self-defense would be subject to a finding that the cyber operation was not only a use of force but also an armed attack.⁴⁵ Unfortunately, neither the Charter nor the ICJ has provided specific definitions for these terms. In addition, there has yet to be a reported cyber operation between states that has been acknowledged as a use of force, let a lone an armed attack.⁴⁶ The recent Stuxnet cyber operation against the Iranian nuclear capabilities is likely to be the closest.⁴⁷ Yet there is debate as to whether Stuxnet was a use of force or an armed attack for purposes of the UN Charter.⁴⁸ Recent efforts to incorporate cyber warfare in our long-standing international legal systems prohibiting the use of force and protecting civilians from the effects of war illustrate the considerable challenges and incongruities in attempting to fit cyber into the conventional armed conflict framework. Two notable efforts have been the Tallinn Manual on the International Law Applicable to Cyber Warfare (the Manual)⁴⁹ and the International Committee of the Red Cross's (ICRC) first major article on cyber warfare published in 2012. In the ICRC article, the ICRC disagrees with the Manual's position on what would constitute an\"attack\"during armed conflict requiring physical effects. According to the majority of the experts on the Manual,\"interference with functionality qualifies as damage\"for purposes of determining if something was an\"attack\"during an armed conflict,\"if restoration of functionality requires replacement of physical components.\"⁵⁰ The ICRC, on the other hand, concludes that\"disrupting the functioning of certain systems by interfering with their underlying computer systems can amount to damage insofar as it impairs their usefulness,\"and therefore, an attack would also\"be understood to encompass such operations that disrupt the functioning of objects without physical damage or destruction, even if the disruption is temporary.\"⁵¹ Disagreement among the group of experts who drafted the Manual and the ICRC highlights the challenges in applying existing international law to the cyber domain.\nOvercoming the Obstacles. Over centuries, in the context of the physical realm, the international legal terms of\"use of force,\"\"armed attack,\"and\"self-defense\"have come to have mean- Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III ing in treaties, the practice of states, and through the dispute resolution process at the UN Security Council and the International Court of Justice. Today, for such activities in cyberspace, we need new consensus about the meanings of these legal terms, how they apply in cyberspace, and the situations in which the different thresholds would be triggered based on cyber operations. It is important for states to understand what would constitute an armed attack in cyberspace that would then trigger the target state's right of self-defense. Given that most of the malicious cyber activities that have occurred to date fall below the level of the use of force and armed attack thresholds of the UN Charter and the laws of armed conflict,52 and, given the fact that even for the areas of international law addressed in the Manual there is no state consensus,53 uncertainty remains about the rules meant to constrain behavior that apply in the cyber domain.54 In order for deterrence to work and widespread agreement on cyber norms to occur, there needs to be some shared expectations between states about what is acceptable behavior and what is not acceptable behavior in the cyber domain.\nIn lieu of any formal international treaty defining these terms in cyber, agreeing to norms will be important to providing needed clarity for states to understand the context in which they are operating in the cyber domain. Those norms that are clear and specific, rather than ambiguous and complex,55 and those that have been around for a long period of time, surviving numerous challenges are more likely to be effective.56 Starting with those norms related to the use of force in cyberspace, where there is legal precedent, makes sense. The next step would be to come to agreement on the meaning of the terms as used in the UN Charter. For example, the United States could seek to develop a specific domestic policy articulating when Article 51 of the UN Charter would be triggered by a cyber incident, establishing a clear threshold and share it with other states in order to seek agreement.\nAs deterrence theorists have argued, in order for deterrence strategy to work, states must be aware of the\"rules and logic of the [strategic] game\"which is communicated between states and which serves not only to inform their actions but also their identities.57 As part of a cyber declaratory deterrence policy, U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons. To develop such norms, threats of military action alone will not suffice. Rather, the diplomatic elements of foreign policy will need to be exercised to establish and reinforce certain values to the point where it is well understood by states that they must not be violated. Clear statements by the United States would be useful in setting forth the specifics of what those values are as envisioned in cyberspace.\nConclusion. These recent events support the emergence of a U.S. national cyber strategy where cyber deterrence is pursued not solely through national security capabilities (the development of offensive cyber capabilities at U.S. Cyber Command), but also through diplomatic and normative, means.\n[83] A BETTER DEFENSE Placing issues of cyber conflict under the auspices of the UN and the UN Charter principles makes sense. This will ultimately make the development of the norms easier for states to accept by embedding them in already existing international law and an international organization with members with conflicting identities and competing interests that plays an important role in norm innovation, cascading, institutionalization, and enforcement. Because of the lack of clarity in international law on the meaning of terms like\"armed attack,\"more work is required to identify exactly what the norm is and what constitutes violation as well as spelling out the procedures by which norm leaders coordinate disapproval and sanctions for norm breaking.\nThis article has argued that a norms-based approach, in conjunction with military cyber power, can deliver some cyber deterrence where military power alone is limited. Although the emergency suffering, principles which support the norms the United States is promoting through the GGE process. Second, the UN GGE process provides an organizational platform for the issues. With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\nThe\"rules of acceptable behavior\"that cyber deterrence scholars and recent U.S. cyber strategy documents have discussed, fit into this category of\"rules of the game\"that can take the form of consensual bilateral or multilateral declarations of principles, or even unilateral declarations and actions. The United States presently prefers non-legally binding agreements for cyber as compared to Russia that has advocated for an international treaty. The rationale for non-legally binding agreement may be that such agreements offer decision-makers opportunities to # U.S. statements about doctrine can influence both the likelihood and consequences of cyber attacks by helping shape global norms about reasonable and legitimate potential use of cyber weapons.\ngence of norms in cyberspace is in its early stages and it is too early to predict how these emerging norms, there are two central factors that support the potential for broader support for the norms the United States is promulgating. First, there is a tradition of international law and norms on which the cyber issues can be based that codify the principles of uses of force, self-defense, proportionality, discrimination and learn about the social effects of particular sets of rules over time, amending them accordingly, typically with lower negotiation costs than entailed by the renegotiation of treaties.[58] States may need time to learn about the technology and to arrive at conclusions about the kinds of behavior they prefer in the new domain of cyberspace.\nEmbedding the new cyber norms as stated in the GGE report in pre [84] Georgetown Journal of International Affairs LOTRIONTE International Engagement on Cyber III existing and widely accepted international legal principles may alleviate the need for a separate, stand-alone treaty for cyber conflict.59 Indeed, given the political context for cybersecurity where mistrust and geopolitical rivalry among states exists, such informal norms may be more attractive given that it is easier involvement in the Stuxnet cyber operation against Iran's uranium facility, the United States will likely face criticism and allegations of double standards. The United States must find a way to address these concerns and not lose momentum in the socialization of cyber conflict norms.\n# With a platform like the UN, the United States and other states can act as norm entrepreneurs to bring the issue to the forefront of international public awareness.\nto obtain agreement on them. If more formal agreement on specific norms is the ultimate goal, the intermediate goal for the United States should be to develop confidence-building measures involving transparency between states in order to build trust, laying the groundwork for future consensus on specific norms.[60] Part of these transparency efforts could include expanding the number of states involved in the discussions about the meaning of the terms used in the UN Charter specifically in the context of cyber operations.\nSo far, the United States has provided the leadership and momentum necessary to begin to seek broader support for the norms. Continued support for the norms by the United States and like-minded nations will be needed. In its continued efforts in support of these international norms the United States ought to keep in mind that norms are developed not only by words, but also by acts. Given the possible U.S.-Israeli Unfortunately, the study of cyber deterrence and cyber norms is hampered by its novelty and much needed work is required to understand the processes of cyber deterrence development and normative change. Deterrence specialists have begun to pay careful attention to cyber attacks and that needs to continue. Their insights into issues related to the challenges of attribution and proportionate retaliation will be needed. The important question for international relations and legal scholars will involve understanding which norms will become legally binding international law and how, exactly, compliance with those laws comes about. It is, after all, these legal rules that will guide and determine the political actors' behavior in the cyber domain. Understanding the mechanisms and the likelihood of compliance will be the key to the longevity of peace and stability in cyberspace.[61] [85] A BETTER DEFENSE"
    }
  },
  "citation_summary": {
    "style": "hybrid",
    "dominant_bucket": "tex",
    "dominant": {
      "intext_total": 12.0,
      "success_occurrences": 12.0,
      "success_unique": 12.0,
      "bib_unique_total": 120.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 0.1,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 48.0,
      "highest_intext_index": 60.0,
      "missing_footnotes_for_seen_total": 0.0,
      "uncited_footnote_total": 48.0,
      "style": "hybrid"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 12.0,
        "success_occurrences": 12.0,
        "success_unique": 12.0,
        "bib_unique_total": 120.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.1,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 48.0,
        "highest_intext_index": 60.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 48.0,
        "style": "hybrid"
      },
      "numeric": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 2.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 168.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "-- The search text of this PDF is generated from uncorrected OCR text.",
    "subtitle": "Examining the United States’ New Norms-Based Approach to Cyber Deterrence",
    "document_type": "journal_article",
    "venue": "Lotrionte, Catherine. (2013). better defense: examining the united states' new norms-based approach to cyber deterrence. Georgetown Journal of International Affairs, 14(3), 75-88.",
    "publication_year": 2010,
    "authors": [
      "A Better Defense",
      "Catherine Lotrionte"
    ],
    "affiliations": [],
    "emails": [],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "",
    "keywords": [],
    "publication_dates": {},
    "identifiers": {
      "doi": [],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "https://heinonline.org/HOL/License"
      ]
    },
    "references_block_count": 1,
    "references_entries_estimated": 61,
    "heading_count": 19,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "no_abstract",
        "no_identifier"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 12,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 1.0,
      "footnote_coverage": 1.0,
      "unique_index_count": 12
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "hybrid",
      "recommended_style": "numeric",
      "aligned": true,
      "signals": {
        "superscript_hits": 47,
        "superscript_definition_lines": 0,
        "numeric_bracket_hits": 15,
        "numeric_endnote_lines": 0,
        "author_year_hits": 0
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 120.0,
      "dominant_bib_coverage_rate": 0.1,
      "dominant_link_target": "footnotes",
      "dominant_unresolved_flag": "unresolved_footnote_links"
    },
    "heading_validation": {
      "heading_count": 19,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": true,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": false,
        "emails": false,
        "orcids": false,
        "abstract": false,
        "keywords": false,
        "venue": true,
        "persistent_identifier": false,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 2,
        "affiliations": 0,
        "emails": 0,
        "orcids": 0,
        "keywords": 0,
        "doi": 0,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 1
      },
      "coverage": {
        "core_coverage": 0.5,
        "email_author_link_rate": 0.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "no_abstract",
          "no_identifier"
        ],
        "toc_dot_lines": 0
      },
      "flags": [
        "meta_missing_abstract_and_keywords",
        "meta_missing_persistent_identifier"
      ]
    },
    "flags": [
      "low_bib_coverage",
      "meta_missing_abstract_and_keywords",
      "meta_missing_persistent_identifier"
    ]
  },
  "updated_at_utc": "2026-02-14T08:27:20.379462+00:00"
}