{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\9ZK4P5JF\\Bannelier et al. - 2019 - MULTIPLE MOONS Cyber sanctions and the role of the private sector.pdf",
  "custom_id": "142",
  "response": {
    "id": "batch-b6235e9e-143-54807c8c-aac4-4fa0-8bdf-b62c02f87d14",
    "custom_id": "142",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "European Union Institute for Security Studies (EUISS)\n\nReport Part Title: MULTIPLE MOONS\n\nReport Title: GUARDIAN OF THE GALAXY\n\nReport Subtitle: EU cyber sanctions and norms in cyberspace\n\nEuropean Union Institute for Security Studies (EUISS) (2019)\n\nStable URL: http://www.jstor.com/stable/resrep21136.11\n\nJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\n\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms\n\nJSTOR\n\nEuropean Union Institute for Security Studies (EUISS) is collaborating with JSTOR to digitize, preserve and extend access to this content.\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2450,
              "width": 1653
            }
          },
          {
            "index": 1,
            "markdown": "CHAPTER 7\n\n# MULTIPLE MOONS\n\nCyber sanctions and the role of the private sector\n\n## INTRODUCTION\n\nCyber diplomacy is not only the business of government. It also involves numerous other stakeholders, in particular from the private sector, that circle governments like multiple moons attracted by various gravitational forces. As stated in the opening chapters of this *Chailot Paper*, the effective use of cyber sanctioning mechanisms (e.g. travel bans and asset freezes) to coerce, constrain and/or signal behaviour in cyberspace often relies on good cooperation with industry and private actors, in particular when such technology belongs to or is operated by the private sector. The following sections discuss the different ways in which private sector actors orbit around governments and consequently play an important role in sanctions implementation, including for attribution, operational cooperation and norms development.\n\nIn addition to the potential impact of sanctions on how businesses operate (as discussed earlier on in this volume) – an aspect that has already been addressed in the literature on sanctions – it is important to highlight two alternative ways of thinking about ‘cyber sanctions’ as a tool used for the enforcement of norms in general. For instance, rather than targeting individuals, firms, government agencies or even sectors of economic activity in retaliation for cyberattacks, states may increasingly resort to cyber operations as a potentially less costly alternative to traditional sanctioning instruments. Some EU member states have openly admitted to conducting offensive cyber operations, such as the UK’s efforts to ‘take down’ websites used\n\n![img-0.jpeg](img-0.jpeg)\nConstellation of issues in this chapter\n\nfor recruitment of terrorists or the dissemination of information about bomb-making designs. There have been instances in which the UN Security Council has taken action to designate individuals for web-hosting activities as a part of its counterterrorism efforts.\n\n## PRIVATE SECTOR AND ATTRIBUTION\n\nAn area where private actors, in particular private cybersecurity companies, have played a critical role is in the attribution of malicious cyber activities. With access to sophisticated computer forensic capabilities, private companies offer invaluable contributions by providing relevant and timely threat intelligence to\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [
              {
                "id": "img-0.jpeg",
                "top_left_x": 752,
                "top_left_y": 805,
                "bottom_right_x": 1169,
                "bottom_right_y": 1092,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 2159,
              "width": 1418
            }
          },
          {
            "index": 2,
            "markdown": "CHAPTER 7 | Multiple moons\n71\n\ndecision-makers. Such information is usually delivered either as open source material or through more exclusive and secretive arrangements. Some of the most influential reports linking malicious cyber operations to governments and non-state actors have been released by private companies. Symantec was among the first companies to publicly disclose information about the Stuxnet malware that affected Iran's Natanz nuclear facility in 2010. In 2015, Kaspersky Lab documented the tools, techniques and procedures behind a hacking team called 'Equation Group' which is believed to be linked to the US National Security Agency (NSA). The same year, ThreatConnect, a US-based cyberintelligence firm, published the report 'Project CameraShy', in which it attributed cyber espionage activity associated with the 'Naikon' Advanced Persistent Threat (APT) group to a specific unit of the Chinese People's Liberation Army (PLA). The report demonstrated, inter alia, how Unit 78020 conducted cyber espionage against military, diplomatic, and economic targets in Cambodia, Indonesia, Laos, Malaysia, Myanmar, Nepal, the Philippines, Singapore, Thailand and Vietnam as well as international bodies such as the United Nations Development Programme (UNDP) and the Association of Southeast Asian Nations (ASEAN). In 2018, Kaspersky research exposed a US-led counterterrorism cyber-espionage operation targeting Daesh and al-Qaeda members. Such publicly available threat intelligence and forensics reports released regularly by cybersecurity companies provide useful open source evidence that might be used in the future to justify placing an individual or an entity on the EU's cyber sanctions list.\n\nPolitical risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies.\n\nThat also affects the standing of these companies vis-à-vis state intelligence agencies which oftentimes lag behind and heavily rely on the forensic evidence provided by private cyberintelligence agencies, consequently breaking the state's monopoly on pointing fingers at potential threats. There is, however, one clear difference in motivation for such extensive cooperation. Whereas state agencies are interested in knowing where the threat originates from in order to prepare adequate policy responses, for the private cybersecurity companies the primary concern is to protect their businesses and the interests of their clients, including in the member states (e.g. critical infrastructure). The potential trust issues typical for such cooperation have been partly overcome thanks to more structured and formalised partnerships with the government agencies. Through their membership in the advisory bodies, many of them have established permanent channels for engagement with the EU agencies, such as the Advisory Groups on Financial Services, Internet Security and Communication Providers with the Europol's European Cybercrime Centre (EC3) or the Advisory Group of the EU's Cybersecurity Agency (ENISA). The Industry 100 initiative by the UK's National Cyber Security Centre (NCSC) is another illustration of a more integrationist approach. Through the initiative, industry secondees work across a wide range of short-term placements at the NCSC, usually on a part-time basis.\n\nIn recent years, the private sector has been active in attributing malicious cyber operations to non-state actors associated with Russia, Iran, China, North Korea and the United States. While this has proven to be a growing business,\n\n1. ThreatConnect and Defense Group Inc, Project Camerashy. Closing the Aperture on China's Unit 78020 (Arlington, VA: ThreatConnect, 2015).\n2. Chris Bing and Patrick Howell O'Neill, \"Kaspersky's 'Slingshot' report burned an ISIS-focused intelligence operation\", Cyberscoop, March 20, 2018.\n3. Sasha Romanosky, \"Private-Sector Attribution of Cyber Attacks: A Growing Concern for the U.S. Government?\", Lawfare, December 21, 2017.\n\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2159,
              "width": 1418
            }
          },
          {
            "index": 3,
            "markdown": "Guardian of the Galaxy | EU cyber sanctions and norms in cyberspace\n\nmany companies also point out that technical evidence provides insufficient grounds for political attribution and refrain from this type of activity. Furthermore, cybersecurity companies point out the fact that the growing accessibility and impact of cyber operations means that an increasing number of countries may embrace newly-available tools and techniques in the future. Such a politically powerful instrument needs to be handled with care. Political risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies. Therefore, governments need to be cautious and maintain a certain distance from such reports in order to avoid potential destabilisation and conflict with third countries. At the same time, some countries have expressed scepticism towards such reports due to the fear that given the location of tech companies in the US or Europe, some of them might deliberately do the governments' bidding.\n\nTo mitigate such risks, different initiatives have been launched to investigate the feasibility of establishing an international consortium that could enforce a standardised framework for threat actor-naming conventions and bring more transparency into reporting mechanisms, including indicators of compromise (IoCs). There is also an initiative underway among university-based centres and laboratories located in different countries, for a neutral, third-party attribution network that could combine technical knowledge of cyberattacks with political and institutional analysis of the motivations of potential attackers.\n\n# PRIVATE SECTOR AND NORM ENTREPRENEURSHIP\n\nIn addition to state-led processes, several non-state initiatives spearheaded by the private sector have emerged as an important avenue for establishing norms of responsible behaviour in cyberspace, resulting in new relationships and dependencies for private-public relations. While seemingly insignificant, such initiatives might in the longer term establish the foundations of a new normative framework for state behaviour in cyberspace – one that might also rely on sanctions for its enforcement.\n\nThere are many reasons why private companies, whose primary focus is on profit and rewarding stakeholders, might be involved in such undertakings. Most see it as a way of creating a more favourable environment for conducting their business. Businesses thrive in stable regulatory environments, and the use of cyberspace for interstate conflict could undermine the overall trust in the digital environment and consequently affect the operations of companies. Similarly, the limited trust between governments and uncertainty about their intentions towards one another might have a negative impact on businesses by making their operations more difficult and costly.\n\nPrivate sector-led initiatives such as the Cybersecurity Tech Accord, the Charter of Trust, or the Global Transparency Initiative (spearheaded by Microsoft, Siemens, and Kaspersky respectively), have been regarded by governments as valuable self-regulatory initiatives, albeit resulting in little change in how states behave in cyberspace. The Tech Accord promotes a safer online environment 'by fostering collaboration among global technology companies committed to protecting their customers\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2159,
              "width": 1418
            }
          },
          {
            "index": 4,
            "markdown": "CHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n73\n\n# Norms in cyberspace\n\nTimeline of key initiatives\n\n![img-1.jpeg](img-1.jpeg)\n\nand users and helping them defend against malicious threats'. This position has emerged from an increasing conviction among Microsoft leaders and other companies that states are no longer only their counterparts in policymaking or regulators working for the benefit of their societies through the use of new technologies, but are also increasingly responsible for causing damage to internet users – and their clients – around the world. In that sense, while acknowledging the responsibilities of the private sector, the Tech Accord assigns a fair amount of blame for instability in cyberspace to state actors.6 In this new environment, private companies like Microsoft take on the traditional role reserved for governments, including the commitment\n\nto 'do more to protect and defend ... customers around the world' and calling on world leaders to 'implement international rules to protect the civilian use of the internet'.7\n\nIt is exactly this expansionist agenda, with private sector actors acceding to new functions traditionally reserved to governments, that has caused uneasiness among political leaders. A similar initiative, albeit more focused on self-regulation and promoting closer public-private cooperation, was launched by Siemens with the Charter of Trust. The initiative calls for binding rules and standards to build trust in cybersecurity and further advance digitalisation. To achieve these objectives it\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [
              {
                "id": "img-1.jpeg",
                "top_left_x": 157,
                "top_left_y": 313,
                "bottom_right_x": 1257,
                "bottom_right_y": 1122,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 2159,
              "width": 1418
            }
          },
          {
            "index": 5,
            "markdown": "Guardian of the Galaxy | EU cyber sanctions and norms in cyberspace\n\nproposed ten principles, including ownership of cyber and IT security, responsibility throughout the digital supply chain, certification for critical infrastructure and solutions, security by default, and user-centricity.\n\nThis type of norms entrepreneurship has evolved relatively quickly towards more hybrid formats that have led the private sector to work together with governments and civil society representatives. The best illustration of this kind of multi-stakeholder normative undertaking is the Paris Call for Trust and Security in Cyberspace launched at the Internet Governance Forum in 2018. Spearheaded by Microsoft and the French government, the Paris Call has over 500 signatories and has been endorsed by the European Commission. The text of the Paris Call – the outcome of negotiations between different groups – is a mix of normative commitments based on UN-driven processes and bottom-up driven commitments. Supporters of the Paris Call have agreed, inter alia, to increase prevention against and resilience to malicious online activity; protect the accessibility and integrity of the internet; cooperate in order to prevent interference in electoral processes; prevent the proliferation of malicious online programmes and techniques; and clamp down on online mercenary activities and offensive action by non-state actors.\n\nSome private sector companies have also invested heavily in initiatives aiming to protect their own reputation by promoting the norm of transparency. Microsoft was among the first companies to launch the Government Security Program (GSP) – an initiative with a global scope that provides national governments with controlled access to Microsoft Windows source code and other technical information they need in order to be confident in the enhanced security features of the Windows platform. As a Russia-based company with a global presence, Kaspersky Lab has often been accused of having too close ties with the Kremlin and portrayed as presenting a 'grave threat' to US national security. As a consequence, in 2017 President Trump signed into law legislation that bans the use of Kaspersky Lab products and services in federal agencies.⁸ In an unprecedented move towards regaining its reputation and international credibility, the company launched the Global Transparency Initiative aimed at engaging the broader information security community and other stakeholders in validating and verifying the trustworthiness of its products, internal processes, and business operations. It has also established three Transparency Centres in Switzerland, Spain and Malaysia that provide the opportunity to review the company's code, software updates, threat detection rules and other technical and business processes.⁹ To dismiss some of the concerns about the company's use of personal data, Kaspersky also decided to relocate its data storage and user data processing facilities from some regions as well as its software development infrastructure from Moscow to Switzerland. A similar approach was adopted by the Chinese company Huawei amidst the debate linked to its 5G service. In May 2019, Huawei decided to open a Cyber Security Transparency Centre in Brussels to showcase Huawei's end-to-end cybersecurity practices, to facilitate communication between Huawei and key stakeholders on cybersecurity strategies and end-to-end cyber security and privacy protection practices, as well as to provide a product security testing and verification platform. This initiative complements the Huawei Cyber Security Evaluation Centre, operating since November 2010 under a set of arrangements\n\n⁸ In 2018, Kaspersky filed lawsuits challenging the ban on its products in US government systems as stipulated by a Binding Operational Directive from the Department of Homeland Security and the 2018 National Defense Authorization Act.\n\n⁹ As of 3 October 2019.\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2159,
              "width": 1418
            }
          },
          {
            "index": 6,
            "markdown": "CHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n75\n\nbetween Huawei and the UK to mitigate any perceived risks arising from the involvement of Huawei in parts of the UK's critical national infrastructure.¹⁰\n\n# PRIVATE SECTOR AND CYBER-ENABLED SANCTIONS\n\nAnother form of active intervention is undertaken not by states and international organisations, but by major private firms, often in cooperation with law enforcement agencies or on the basis of government regulation. These are not (yet) considered traditional types of sanctions as incarnated in the sanctions regime adopted by the EU – even though they have a sanction-like effect. In such cases, companies may opt to use some of the tools and instruments at their disposal to deny or limit access to their services and products to users who violate their contractual obligations or other norms of responsible behaviour. Such actions could eventually take the form of what might be classified as cyber-enabled sanctions. Examples of such activities include Microsoft's takedown of botnets and Facebook's stepped-up efforts to block the access of users engaged in electoral interference and the proliferation of hate speech. Mentioning these instruments and understanding their functioning is important as they might in the future become as relevant as asset freezes and travel bans. This will require implementing additional legal and technological solutions but is not impossible.\n\n# Fight against cybercrime\n\nBotnets – networks of computers infected with malware – are one of the most common methods used by cyber criminals to execute phishing and ransomware attacks (e.g. Avalanche) or to distribute spam (e.g. Srizbi, Rustock). Malware allows criminals to take control of multiple infected computers at a distance and perform attacks using one or more command and control (C&amp;C) servers, making them capable of launching malicious attacks on a massive scale. The private sector plays a key role in helping take the botnets down, which from the technological point of view is a sanctioning mechanism (i.e. a restrictive measure imposed for a political goal or purpose). In 2015, Europol’s Cybercrime Centre (EC3) led an international campaign against the Ramit botnet whose primary goal was to harvest credentials such as online banking log-ins, passwords and personal files. Microsoft’s Digital Crime Unit took part in the takedown, alongside other industry partners Symantec and AnubisNetworks, by assisting Europol and national investigators from Germany, Italy, the Netherlands and the UK with shutting down the C&amp;C servers and redirecting 300 internet domain addresses used by the botnet’s operators.\n\nThere are also ‘hack backs’ undertaken by governments, as in the case of the government of the Netherlands intruding into the systems of cyber criminals. In one specific case, the Dutch National High Technology Crime Unit discerned the use of cryptographic software in a money laundering investigation, and identified an undisclosed issue with the service that allowed them to decrypt the criminal’s communications.¹¹ In another widely reported case in 2018, the Dutch AIVD intelligence service gained access to systems operated by a Russian hacking group which was widely considered to be state supported,¹² and maintained this level of access\n\n¹⁰ Cabinet Office, “Huawei cyber security evaluation centre oversight board: annual report 2019”, March 28, 2019, https://www.gov.uk/government/publications/huawei-cyber-security-evaluation-centre-oversight-board-annual-report-2019.\n\n¹¹ Lisa Vaas, “258,000 encrypted IronChat phone messages cracked by police”, November 9, 2018, https://nakedsecurity.sophos.com/2018/11/09/258000-encrypted-ironchat-phone-messages-cracked-by-police/\n\n¹² Rick Noack, “The Dutch were a secret U.S. ally in war against Russian hackers, local media reveal”, Washington Post, January 26, 2018.\n\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2159,
              "width": 1418
            }
          },
          {
            "index": 7,
            "markdown": "Guardian of the Galaxy | EU cyber sanctions and norms in cyberspace\n\nfor at least one year. The use of ‘hack backs’ as a self-help mechanism¹³ by private companies has caused a lot of controversy, with government officials taking a clear stand against such practices as ‘negatively affecting the already unclear rules of engagement in cyberspace’.¹⁴\n\n## Fight against terrorism\n\nThe private sector plays a relevant role also in the context of fighting terrorism. The UN’s 1267 Sanctions Committee concerning Daesh, al-Qaeda, and associated individuals and groups has adopted designation criteria for individuals providing web-hosting services under the rubric of ‘material support for the commitment of acts of terrorism or incitement to commit acts of terrorism.’ Internet hosting or cyber support has been included in 36 statements of case (designations of individuals where internet hosting was cited) as of February 2017, but significantly, it has never been the sole criterion for a listing. There is some reluctance (typically on the part of the US, due to first amendment concerns) to make this the principal basis for a designation, something that according to some observers can lead to gaps in enforcement, limiting the capacity of the committee to act in some instances. In theory, individual websites could be designated, but this has civil liberties implications and has thus far been avoided due to a significant potential for abuses by governments who might take advantage of such a development to silence political opponents.\n\nDesignations are made on the basis of prioritising those members of Daesh or al-Qaeda who are most likely to be exposed to the effects of sanctions. To date, the UN Security Council sanctions committee has been focused primarily on individuals engaged in incitement to violence, but online military training is also prohibited under arms embargoes applied by the committee. Large-scale cyberattacks emanating from Daesh were a possibility in the past, when the group controlled large amounts of territory and had access to substantial material resources. Today, counter-terrorism specialists at the UN anticipate that Daesh’s media presence will increase in the wake of their military defeat. This has strategic implications and Daesh may expand its presence in cyberspace, hence the prospect of more proactive engagement by the UN in the future. Daesh apparently still has access to financial assets, but the funds have been laundered into real estate and other concrete investments. Nonetheless, the use of malicious activities such as ransomware attacks to generate additional funds could become a serious problem in the future.\n\nThe surge in terrorist attacks and hate crimes by radical right-wing organisations in the US has brought the role of the private sector to the fore. While most of the measures aimed at limiting access to online platforms – such as the suspension of Twitter or Facebook accounts – are based on the violation of the terms and conditions of use, we have recently seen unprecedented steps taken by the private sector. Following the mass shooting in El Paso in August 2019, the discussion about access and use by radical right groups of online services such as anonymous message boards or communication platforms has intensified. As a consequence, 8chan – one such platform which\n\n---\n\n¹³ ‘Hack backs’ could be used as exploratory measures, to access services for attribution purposes, as preventive measures, to prevent an actor from doing harm, and as retaliatory measures for revenge. The last aspect is the most debated one.\n\n¹⁴ Jacqueline Thomsen, “Pentagon cyber official warns U.S. companies against ‘hacking back’”, The Hill, November 13, 2018. See also: Wyatt Hoffman and Steven Nyikos, “Governing Private Sector Self-Help in Cyberspace: Analogies from the Physical World”, Working Paper, Carnegie Endowment for International Peace, December 2018, https://carnegieendowment.org/files/Hoffman_Nyikos_Self_Help_FINAL_WEB_bio_edit.pdf; Sven Herpig, “Hackback ist nicht gleich Hackback”, SNV Impuls, July 24, 2018, https://www.stiftung-nv.de/de/publikation/hackback-ist-nicht-gleich-hackback.\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2159,
              "width": 1418
            }
          },
          {
            "index": 8,
            "markdown": "CHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n77\n\nhosted the anti-immigration manifesto of the man accused of the shooting – was taken down by the security company Cloudfare, which decided to no longer provide its services. Tocows, a company that helped register the website, has also withdrawn its support, leaving the message board without a functioning web address.¹⁵ Because websites like 8chan rely on a complex network of internet infrastructure companies, any of such small companies providing essential services (e.g. web addresses, cloud computing power, etc.) can play a critical role in enforcing a regime of cyber-enabled sanctions or de facto contribute to establishing such a regime through its self-regulatory practices.\n\nIn addition, organisations such as Tech Against Terrorism were created to prevent tech companies whose technology and products are exploited for terrorist activities incurring potential reputational damage. In a similar vein, to curb the spread of terrorist content online, Facebook, Microsoft, Twitter, and YouTube announced in 2017 the formation of the Global Internet Forum to Counter Terrorism. All these companies report significant progress in removing violent extremist content. For instance, between July 2017 and December 2017, a total of 274,460 Twitter accounts were permanently suspended for violations related to the promotion of terrorism. Facebook manages to detect 99% of Daesh and al-Qaeda-related terror content which is removed even before anyone in the forum or community concerned has flagged it. The terrorist attack in New Zealand in 2019 and the announcement of the Christchurch Call to eliminate terrorist and violent extremist content online have further reinforced the norm that the internet should remain a free, open and secure space for all and should not be abused as an arena for malicious cyber activities. Together with the growing focus on election interference, these two objectives might reinvigorate the discussion about cyber sanctions at the UN. Meanwhile, in the absence of progress in the sanctions discussion, some countries have taken unilateral measures. For instance, the UK conducted offensive cyber operations against\n\nDaesh terrorists in the Middle East designed to disrupt their ability to carry out attacks, protect British and coalition forces, and cripple Daesh’s online propaganda machine.\n\n# CONCLUSIONS\n\nSanctions are a political tool in the hands of governments. But they carry implications – often quite significant – for other actors, in particular in the private sector which needs to ensure compliance with the limitations imposed by governments. In that sense, the cyber sanctions regime put in place by the EU does not bring any new elements as it simply asks the private sector to comply with travel bans and implement asset freezes. However, the role of the private sector, when it comes to cyber sanctions, goes beyond the traditional private-public sector relationship whereby companies and businesses are simply required to comply with the provisions of the regulations. As a matter of fact, in the case of cyber sanctions – as adopted by the EU – this relationship and attendant dependencies are reversed. As this chapter has demonstrated, governments rely on the private sector for forensic and strategic information, thereby turning the security companies into quasi-intelligence services.\n\nIn addition to the operational cooperation, private sector actors have taken it upon themselves to shape the normative discussion about responsible behaviour in cyberspace. This move – even though not directly linked to the EU’s sanctions regime – might have broad implications for its application. As argued in earlier chapters, sanctions also play a signalling role in relation to the norms that they aim to promote and strengthen. The proliferation of normative initiatives by the private sector provides an additional dimension to the conversation and creates a new context within which sanctions may be implemented, especially if some of these new norms gain universal recognition.\n\n¹⁵ Kate Conger and Nathaniel Popper, “Behind the Scenes, 8chan Scrambles to Get Back Online”, New York Times, August 5, 2019.\n\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2159,
              "width": 1418
            }
          },
          {
            "index": 9,
            "markdown": "Guardian of the Galaxy | EU cyber sanctions and norms in cyberspace\n\nFinally, the private sector already plays the role of a sanctioning power in cyberspace. IT companies and social networks have the power to block access or disconnect individuals and entities who do not comply with their terms of reference or other accepted norms. The examples of the fight against cybercrime and terrorist use of the internet illustrate this point.\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2159,
              "width": 1418
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 10,
          "doc_size_bytes": 586199
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "European Union Institute for Security Studies (EUISS)\nReport Part Title: MULTIPLE MOONS\nReport Title: GUARDIAN OF THE GALAXY\nReport Subtitle: EU cyber sanctions and norms in cyberspace\nEuropean Union Institute for Security Studies (EUISS) (2019)\nStable URL: http://www.jstor.com/stable/resrep21136.11\nJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms\nJSTOR\nEuropean Union Institute for Security Studies (EUISS) is collaborating with JSTOR to digitize, preserve and extend access to this content.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7\n# MULTIPLE MOONS\nCyber sanctions and the role of the private sector\n## INTRODUCTION\nCyber diplomacy is not only the business of government. It also involves numerous other stakeholders, in particular from the private sector, that circle governments like multiple moons attracted by various gravitational forces. As stated in the opening chapters of this *Chailot Paper*, the effective use of cyber sanctioning mechanisms (e.g. travel bans and asset freezes) to coerce, constrain and/or signal behaviour in cyberspace often relies on good cooperation with industry and private actors, in particular when such technology belongs to or is operated by the private sector. The following sections discuss the different ways in which private sector actors orbit around governments and consequently play an important role in sanctions implementation, including for attribution, operational cooperation and norms development.\nIn addition to the potential impact of sanctions on how businesses operate (as discussed earlier on in this volume) – an aspect that has already been addressed in the literature on sanctions – it is important to highlight two alternative ways of thinking about ‘cyber sanctions’ as a tool used for the enforcement of norms in general. For instance, rather than targeting individuals, firms, government agencies or even sectors of economic activity in retaliation for cyberattacks, states may increasingly resort to cyber operations as a potentially less costly alternative to traditional sanctioning instruments. Some EU member states have openly admitted to conducting offensive cyber operations, such as the UK’s efforts to ‘take down’ websites used\nConstellation of issues in this chapter\nfor recruitment of terrorists or the dissemination of information about bomb-making designs. There have been instances in which the UN Security Council has taken action to designate individuals for web-hosting activities as a part of its counterterrorism efforts.\n## PRIVATE SECTOR AND ATTRIBUTION\nAn area where private actors, in particular private cybersecurity companies, have played a critical role is in the attribution of malicious cyber activities. With access to sophisticated computer forensic capabilities, private companies offer invaluable contributions by providing relevant and timely threat intelligence to\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons\n71\ndecision-makers. Such information is usually delivered either as open source material or through more exclusive and secretive arrangements. Some of the most influential reports linking malicious cyber operations to governments and non-state actors have been released by private companies. Symantec was among the first companies to publicly disclose information about the Stuxnet malware that affected Iran's Natanz nuclear facility in 2010. In 2015, Kaspersky Lab documented the tools, techniques and procedures behind a hacking team called 'Equation Group' which is believed to be linked to the US National Security Agency (NSA). The same year, ThreatConnect, a US-based cyberintelligence firm, published the report 'Project CameraShy', in which it attributed cyber espionage activity associated with the 'Naikon' Advanced Persistent Threat (APT) group to a specific unit of the Chinese People's Liberation Army (PLA). The report demonstrated, inter alia, how Unit 78020 conducted cyber espionage against military, diplomatic, and economic targets in Cambodia, Indonesia, Laos, Malaysia, Myanmar, Nepal, the Philippines, Singapore, Thailand and Vietnam as well as international bodies such as the United Nations Development Programme (UNDP) and the Association of Southeast Asian Nations (ASEAN). In 2018, Kaspersky research exposed a US-led counterterrorism cyber-espionage operation targeting Daesh and al-Qaeda members. Such publicly available threat intelligence and forensics reports released regularly by cybersecurity companies provide useful open source evidence that might be used in the future to justify placing an individual or an entity on the EU's cyber sanctions list.\nPolitical risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies.\nThat also affects the standing of these companies vis-à-vis state intelligence agencies which oftentimes lag behind and heavily rely on the forensic evidence provided by private cyberintelligence agencies, consequently breaking the state's monopoly on pointing fingers at potential threats. There is, however, one clear difference in motivation for such extensive cooperation. Whereas state agencies are interested in knowing where the threat originates from in order to prepare adequate policy responses, for the private cybersecurity companies the primary concern is to protect their businesses and the interests of their clients, including in the member states (e.g. critical infrastructure). The potential trust issues typical for such cooperation have been partly overcome thanks to more structured and formalised partnerships with the government agencies. Through their membership in the advisory bodies, many of them have established permanent channels for engagement with the EU agencies, such as the Advisory Groups on Financial Services, Internet Security and Communication Providers with the Europol's European Cybercrime Centre (EC3) or the Advisory Group of the EU's Cybersecurity Agency (ENISA). The Industry 100 initiative by the UK's National Cyber Security Centre (NCSC) is another illustration of a more integrationist approach. Through the initiative, industry secondees work across a wide range of short-term placements at the NCSC, usually on a part-time basis.\nIn recent years, the private sector has been active in attributing malicious cyber operations to non-state actors associated with Russia, Iran, China, North Korea and the United States. While this has proven to be a growing business,\n1. ThreatConnect and Defense Group Inc, Project Camerashy. Closing the Aperture on China's Unit 78020 (Arlington, VA: ThreatConnect, 2015).\n2. Chris Bing and Patrick Howell O'Neill, \"Kaspersky's 'Slingshot' report burned an ISIS-focused intelligence operation\", Cyberscoop, March 20, 2018.\n3. Sasha Romanosky, \"Private-Sector Attribution of Cyber Attacks: A Growing Concern for the U.S. Government?\", Lawfare, December 21, 2017.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nmany companies also point out that technical evidence provides insufficient grounds for political attribution and refrain from this type of activity. Furthermore, cybersecurity companies point out the fact that the growing accessibility and impact of cyber operations means that an increasing number of countries may embrace newly-available tools and techniques in the future. Such a politically powerful instrument needs to be handled with care. Political risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies. Therefore, governments need to be cautious and maintain a certain distance from such reports in order to avoid potential destabilisation and conflict with third countries. At the same time, some countries have expressed scepticism towards such reports due to the fear that given the location of tech companies in the US or Europe, some of them might deliberately do the governments' bidding.\nTo mitigate such risks, different initiatives have been launched to investigate the feasibility of establishing an international consortium that could enforce a standardised framework for threat actor-naming conventions and bring more transparency into reporting mechanisms, including indicators of compromise (IoCs). There is also an initiative underway among university-based centres and laboratories located in different countries, for a neutral, third-party attribution network that could combine technical knowledge of cyberattacks with political and institutional analysis of the motivations of potential attackers.\n# PRIVATE SECTOR AND NORM ENTREPRENEURSHIP\nIn addition to state-led processes, several non-state initiatives spearheaded by the private sector have emerged as an important avenue for establishing norms of responsible behaviour in cyberspace, resulting in new relationships and dependencies for private-public relations. While seemingly insignificant, such initiatives might in the longer term establish the foundations of a new normative framework for state behaviour in cyberspace – one that might also rely on sanctions for its enforcement.\nThere are many reasons why private companies, whose primary focus is on profit and rewarding stakeholders, might be involved in such undertakings. Most see it as a way of creating a more favourable environment for conducting their business. Businesses thrive in stable regulatory environments, and the use of cyberspace for interstate conflict could undermine the overall trust in the digital environment and consequently affect the operations of companies. Similarly, the limited trust between governments and uncertainty about their intentions towards one another might have a negative impact on businesses by making their operations more difficult and costly.\nPrivate sector-led initiatives such as the Cybersecurity Tech Accord, the Charter of Trust, or the Global Transparency Initiative (spearheaded by Microsoft, Siemens, and Kaspersky respectively), have been regarded by governments as valuable self-regulatory initiatives, albeit resulting in little change in how states behave in cyberspace. The Tech Accord promotes a safer online environment 'by fostering collaboration among global technology companies committed to protecting their customers\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n73\n# Norms in cyberspace\nTimeline of key initiatives\nand users and helping them defend against malicious threats'. This position has emerged from an increasing conviction among Microsoft leaders and other companies that states are no longer only their counterparts in policymaking or regulators working for the benefit of their societies through the use of new technologies, but are also increasingly responsible for causing damage to internet users – and their clients – around the world. In that sense, while acknowledging the responsibilities of the private sector, the Tech Accord assigns a fair amount of blame for instability in cyberspace to state actors.6 In this new environment, private companies like Microsoft take on the traditional role reserved for governments, including the commitment\nto 'do more to protect and defend ... customers around the world' and calling on world leaders to 'implement international rules to protect the civilian use of the internet'.7\nIt is exactly this expansionist agenda, with private sector actors acceding to new functions traditionally reserved to governments, that has caused uneasiness among political leaders. A similar initiative, albeit more focused on self-regulation and promoting closer public-private cooperation, was launched by Siemens with the Charter of Trust. The initiative calls for binding rules and standards to build trust in cybersecurity and further advance digitalisation. To achieve these objectives it\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nproposed ten principles, including ownership of cyber and IT security, responsibility throughout the digital supply chain, certification for critical infrastructure and solutions, security by default, and user-centricity.\nThis type of norms entrepreneurship has evolved relatively quickly towards more hybrid formats that have led the private sector to work together with governments and civil society representatives. The best illustration of this kind of multi-stakeholder normative undertaking is the Paris Call for Trust and Security in Cyberspace launched at the Internet Governance Forum in 2018. Spearheaded by Microsoft and the French government, the Paris Call has over 500 signatories and has been endorsed by the European Commission. The text of the Paris Call – the outcome of negotiations between different groups – is a mix of normative commitments based on UN-driven processes and bottom-up driven commitments. Supporters of the Paris Call have agreed, inter alia, to increase prevention against and resilience to malicious online activity; protect the accessibility and integrity of the internet; cooperate in order to prevent interference in electoral processes; prevent the proliferation of malicious online programmes and techniques; and clamp down on online mercenary activities and offensive action by non-state actors.\nSome private sector companies have also invested heavily in initiatives aiming to protect their own reputation by promoting the norm of transparency. Microsoft was among the first companies to launch the Government Security Program (GSP) – an initiative with a global scope that provides national governments with controlled access to Microsoft Windows source code and other technical information they need in order to be confident in the enhanced security features of the Windows platform. As a Russia-based company with a global presence, Kaspersky Lab has often been accused of having too close ties with the Kremlin and portrayed as presenting a 'grave threat' to US national security. As a consequence, in 2017 President Trump signed into law legislation that bans the use of Kaspersky Lab products and services in federal agencies.⁸ In an unprecedented move towards regaining its reputation and international credibility, the company launched the Global Transparency Initiative aimed at engaging the broader information security community and other stakeholders in validating and verifying the trustworthiness of its products, internal processes, and business operations. It has also established three Transparency Centres in Switzerland, Spain and Malaysia that provide the opportunity to review the company's code, software updates, threat detection rules and other technical and business processes.⁹ To dismiss some of the concerns about the company's use of personal data, Kaspersky also decided to relocate its data storage and user data processing facilities from some regions as well as its software development infrastructure from Moscow to Switzerland. A similar approach was adopted by the Chinese company Huawei amidst the debate linked to its 5G service. In May 2019, Huawei decided to open a Cyber Security Transparency Centre in Brussels to showcase Huawei's end-to-end cybersecurity practices, to facilitate communication between Huawei and key stakeholders on cybersecurity strategies and end-to-end cyber security and privacy protection practices, as well as to provide a product security testing and verification platform. This initiative complements the Huawei Cyber Security Evaluation Centre, operating since November 2010 under a set of arrangements\n⁸ In 2018, Kaspersky filed lawsuits challenging the ban on its products in US government systems as stipulated by a Binding Operational Directive from the Department of Homeland Security and the 2018 National Defense Authorization Act.\n⁹ As of 3 October 2019.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n75\nbetween Huawei and the UK to mitigate any perceived risks arising from the involvement of Huawei in parts of the UK's critical national infrastructure.¹⁰\n# PRIVATE SECTOR AND CYBER-ENABLED SANCTIONS\nAnother form of active intervention is undertaken not by states and international organisations, but by major private firms, often in cooperation with law enforcement agencies or on the basis of government regulation. These are not (yet) considered traditional types of sanctions as incarnated in the sanctions regime adopted by the EU – even though they have a sanction-like effect. In such cases, companies may opt to use some of the tools and instruments at their disposal to deny or limit access to their services and products to users who violate their contractual obligations or other norms of responsible behaviour. Such actions could eventually take the form of what might be classified as cyber-enabled sanctions. Examples of such activities include Microsoft's takedown of botnets and Facebook's stepped-up efforts to block the access of users engaged in electoral interference and the proliferation of hate speech. Mentioning these instruments and understanding their functioning is important as they might in the future become as relevant as asset freezes and travel bans. This will require implementing additional legal and technological solutions but is not impossible.\n# Fight against cybercrime\nBotnets – networks of computers infected with malware – are one of the most common methods used by cyber criminals to execute phishing and ransomware attacks (e.g. Avalanche) or to distribute spam (e.g. Srizbi, Rustock). Malware allows criminals to take control of multiple infected computers at a distance and perform attacks using one or more command and control (C&amp;C) servers, making them capable of launching malicious attacks on a massive scale. The private sector plays a key role in helping take the botnets down, which from the technological point of view is a sanctioning mechanism (i.e. a restrictive measure imposed for a political goal or purpose). In 2015, Europol’s Cybercrime Centre (EC3) led an international campaign against the Ramit botnet whose primary goal was to harvest credentials such as online banking log-ins, passwords and personal files. Microsoft’s Digital Crime Unit took part in the takedown, alongside other industry partners Symantec and AnubisNetworks, by assisting Europol and national investigators from Germany, Italy, the Netherlands and the UK with shutting down the C&amp;C servers and redirecting 300 internet domain addresses used by the botnet’s operators.\nThere are also ‘hack backs’ undertaken by governments, as in the case of the government of the Netherlands intruding into the systems of cyber criminals. In one specific case, the Dutch National High Technology Crime Unit discerned the use of cryptographic software in a money laundering investigation, and identified an undisclosed issue with the service that allowed them to decrypt the criminal’s communications.¹¹ In another widely reported case in 2018, the Dutch AIVD intelligence service gained access to systems operated by a Russian hacking group which was widely considered to be state supported,¹² and maintained this level of access\n¹⁰ Cabinet Office, “Huawei cyber security evaluation centre oversight board: annual report 2019”, March 28, 2019, https://www.gov.uk/government/publications/huawei-cyber-security-evaluation-centre-oversight-board-annual-report-2019.\n¹¹ Lisa Vaas, “258,000 encrypted IronChat phone messages cracked by police”, November 9, 2018, https://nakedsecurity.sophos.com/2018/11/09/258000-encrypted-ironchat-phone-messages-cracked-by-police/\n¹² Rick Noack, “The Dutch were a secret U.S. ally in war against Russian hackers, local media reveal”, Washington Post, January 26, 2018.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nfor at least one year. The use of ‘hack backs’ as a self-help mechanism¹³ by private companies has caused a lot of controversy, with government officials taking a clear stand against such practices as ‘negatively affecting the already unclear rules of engagement in cyberspace’.¹⁴\n## Fight against terrorism\nThe private sector plays a relevant role also in the context of fighting terrorism. The UN’s 1267 Sanctions Committee concerning Daesh, al-Qaeda, and associated individuals and groups has adopted designation criteria for individuals providing web-hosting services under the rubric of ‘material support for the commitment of acts of terrorism or incitement to commit acts of terrorism.’ Internet hosting or cyber support has been included in 36 statements of case (designations of individuals where internet hosting was cited) as of February 2017, but significantly, it has never been the sole criterion for a listing. There is some reluctance (typically on the part of the US, due to first amendment concerns) to make this the principal basis for a designation, something that according to some observers can lead to gaps in enforcement, limiting the capacity of the committee to act in some instances. In theory, individual websites could be designated, but this has civil liberties implications and has thus far been avoided due to a significant potential for abuses by governments who might take advantage of such a development to silence political opponents.\nDesignations are made on the basis of prioritising those members of Daesh or al-Qaeda who are most likely to be exposed to the effects of sanctions. To date, the UN Security Council sanctions committee has been focused primarily on individuals engaged in incitement to violence, but online military training is also prohibited under arms embargoes applied by the committee. Large-scale cyberattacks emanating from Daesh were a possibility in the past, when the group controlled large amounts of territory and had access to substantial material resources. Today, counter-terrorism specialists at the UN anticipate that Daesh’s media presence will increase in the wake of their military defeat. This has strategic implications and Daesh may expand its presence in cyberspace, hence the prospect of more proactive engagement by the UN in the future. Daesh apparently still has access to financial assets, but the funds have been laundered into real estate and other concrete investments. Nonetheless, the use of malicious activities such as ransomware attacks to generate additional funds could become a serious problem in the future.\nThe surge in terrorist attacks and hate crimes by radical right-wing organisations in the US has brought the role of the private sector to the fore. While most of the measures aimed at limiting access to online platforms – such as the suspension of Twitter or Facebook accounts – are based on the violation of the terms and conditions of use, we have recently seen unprecedented steps taken by the private sector. Following the mass shooting in El Paso in August 2019, the discussion about access and use by radical right groups of online services such as anonymous message boards or communication platforms has intensified. As a consequence, 8chan – one such platform which\n---\n¹³ ‘Hack backs’ could be used as exploratory measures, to access services for attribution purposes, as preventive measures, to prevent an actor from doing harm, and as retaliatory measures for revenge. The last aspect is the most debated one.\n¹⁴ Jacqueline Thomsen, “Pentagon cyber official warns U.S. companies against ‘hacking back’”, The Hill, November 13, 2018. See also: Wyatt Hoffman and Steven Nyikos, “Governing Private Sector Self-Help in Cyberspace: Analogies from the Physical World”, Working Paper, Carnegie Endowment for International Peace, December 2018, https://carnegieendowment.org/files/Hoffman_Nyikos_Self_Help_FINAL_WEB_bio_edit.pdf; Sven Herpig, “Hackback ist nicht gleich Hackback”, SNV Impuls, July 24, 2018, https://www.stiftung-nv.de/de/publikation/hackback-ist-nicht-gleich-hackback.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n77\nhosted the anti-immigration manifesto of the man accused of the shooting – was taken down by the security company Cloudfare, which decided to no longer provide its services. Tocows, a company that helped register the website, has also withdrawn its support, leaving the message board without a functioning web address.¹⁵ Because websites like 8chan rely on a complex network of internet infrastructure companies, any of such small companies providing essential services (e.g. web addresses, cloud computing power, etc.) can play a critical role in enforcing a regime of cyber-enabled sanctions or de facto contribute to establishing such a regime through its self-regulatory practices.\nIn addition, organisations such as Tech Against Terrorism were created to prevent tech companies whose technology and products are exploited for terrorist activities incurring potential reputational damage. In a similar vein, to curb the spread of terrorist content online, Facebook, Microsoft, Twitter, and YouTube announced in 2017 the formation of the Global Internet Forum to Counter Terrorism. All these companies report significant progress in removing violent extremist content. For instance, between July 2017 and December 2017, a total of 274,460 Twitter accounts were permanently suspended for violations related to the promotion of terrorism. Facebook manages to detect 99% of Daesh and al-Qaeda-related terror content which is removed even before anyone in the forum or community concerned has flagged it. The terrorist attack in New Zealand in 2019 and the announcement of the Christchurch Call to eliminate terrorist and violent extremist content online have further reinforced the norm that the internet should remain a free, open and secure space for all and should not be abused as an arena for malicious cyber activities. Together with the growing focus on election interference, these two objectives might reinvigorate the discussion about cyber sanctions at the UN. Meanwhile, in the absence of progress in the sanctions discussion, some countries have taken unilateral measures. For instance, the UK conducted offensive cyber operations against\nDaesh terrorists in the Middle East designed to disrupt their ability to carry out attacks, protect British and coalition forces, and cripple Daesh’s online propaganda machine.\n# CONCLUSIONS\nSanctions are a political tool in the hands of governments. But they carry implications – often quite significant – for other actors, in particular in the private sector which needs to ensure compliance with the limitations imposed by governments. In that sense, the cyber sanctions regime put in place by the EU does not bring any new elements as it simply asks the private sector to comply with travel bans and implement asset freezes. However, the role of the private sector, when it comes to cyber sanctions, goes beyond the traditional private-public sector relationship whereby companies and businesses are simply required to comply with the provisions of the regulations. As a matter of fact, in the case of cyber sanctions – as adopted by the EU – this relationship and attendant dependencies are reversed. As this chapter has demonstrated, governments rely on the private sector for forensic and strategic information, thereby turning the security companies into quasi-intelligence services.\nIn addition to the operational cooperation, private sector actors have taken it upon themselves to shape the normative discussion about responsible behaviour in cyberspace. This move – even though not directly linked to the EU’s sanctions regime – might have broad implications for its application. As argued in earlier chapters, sanctions also play a signalling role in relation to the norms that they aim to promote and strengthen. The proliferation of normative initiatives by the private sector provides an additional dimension to the conversation and creates a new context within which sanctions may be implemented, especially if some of these new norms gain universal recognition.\n¹⁵ Kate Conger and Nathaniel Popper, “Behind the Scenes, 8chan Scrambles to Get Back Online”, New York Times, August 5, 2019.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nFinally, the private sector already plays the role of a sanctioning power in cyberspace. IT companies and social networks have the power to block access or disconnect individuals and entities who do not comply with their terms of reference or other accepted norms. The examples of the fight against cybercrime and terrorist use of the internet illustrate this point.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms",
  "references": [],
  "flat_text": "European Union Institute for Security Studies (EUISS)\nReport Part Title: MULTIPLE MOONS\nReport Title: GUARDIAN OF THE GALAXY\nReport Subtitle: EU cyber sanctions and norms in cyberspace\nEuropean Union Institute for Security Studies (EUISS) (2019)\nStable URL: http://www.jstor.com/stable/resrep21136.11\nJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms\nJSTOR\nEuropean Union Institute for Security Studies (EUISS) is collaborating with JSTOR to digitize, preserve and extend access to this content.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7\n# MULTIPLE MOONS\nCyber sanctions and the role of the private sector\n## INTRODUCTION\nCyber diplomacy is not only the business of government. It also involves numerous other stakeholders, in particular from the private sector, that circle governments like multiple moons attracted by various gravitational forces. As stated in the opening chapters of this *Chailot Paper*, the effective use of cyber sanctioning mechanisms (e.g. travel bans and asset freezes) to coerce, constrain and/or signal behaviour in cyberspace often relies on good cooperation with industry and private actors, in particular when such technology belongs to or is operated by the private sector. The following sections discuss the different ways in which private sector actors orbit around governments and consequently play an important role in sanctions implementation, including for attribution, operational cooperation and norms development.\nIn addition to the potential impact of sanctions on how businesses operate (as discussed earlier on in this volume) – an aspect that has already been addressed in the literature on sanctions – it is important to highlight two alternative ways of thinking about ‘cyber sanctions’ as a tool used for the enforcement of norms in general. For instance, rather than targeting individuals, firms, government agencies or even sectors of economic activity in retaliation for cyberattacks, states may increasingly resort to cyber operations as a potentially less costly alternative to traditional sanctioning instruments. Some EU member states have openly admitted to conducting offensive cyber operations, such as the UK’s efforts to ‘take down’ websites used\nConstellation of issues in this chapter\nfor recruitment of terrorists or the dissemination of information about bomb-making designs. There have been instances in which the UN Security Council has taken action to designate individuals for web-hosting activities as a part of its counterterrorism efforts.\n## PRIVATE SECTOR AND ATTRIBUTION\nAn area where private actors, in particular private cybersecurity companies, have played a critical role is in the attribution of malicious cyber activities. With access to sophisticated computer forensic capabilities, private companies offer invaluable contributions by providing relevant and timely threat intelligence to\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons\n\nPolitical risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies.\nThat also affects the standing of these companies vis-à-vis state intelligence agencies which oftentimes lag behind and heavily rely on the forensic evidence provided by private cyberintelligence agencies, consequently breaking the state's monopoly on pointing fingers at potential threats. There is, however, one clear difference in motivation for such extensive cooperation. Whereas state agencies are interested in knowing where the threat originates from in order to prepare adequate policy responses, for the private cybersecurity companies the primary concern is to protect their businesses and the interests of their clients, including in the member states (e.g. critical infrastructure). The potential trust issues typical for such cooperation have been partly overcome thanks to more structured and formalised partnerships with the government agencies. Through their membership in the advisory bodies, many of them have established permanent channels for engagement with the EU agencies, such as the Advisory Groups on Financial Services, Internet Security and Communication Providers with the Europol's European Cybercrime Centre (EC3) or the Advisory Group of the EU's Cybersecurity Agency (ENISA). The Industry 100 initiative by the UK's National Cyber Security Centre (NCSC) is another illustration of a more integrationist approach. Through the initiative, industry secondees work across a wide range of short-term placements at the NCSC, usually on a part-time basis.\nIn recent years, the private sector has been active in attributing malicious cyber operations to non-state actors associated with Russia, Iran, China, North Korea and the United States. While this has proven to be a growing business,\n1. ThreatConnect and Defense Group Inc, Project Camerashy. Closing the Aperture on China's Unit 78020 (Arlington, VA: ThreatConnect, 2015).\n2. Chris Bing and Patrick Howell O'Neill, \"Kaspersky's 'Slingshot' report burned an ISIS-focused intelligence operation\", Cyberscoop, March 20, 2018.\n3. Sasha Romanosky, \"Private-Sector Attribution of Cyber Attacks: A Growing Concern for the U.S. Government?\", Lawfare, December 21, 2017.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nmany companies also point out that technical evidence provides insufficient grounds for political attribution and refrain from this type of activity. Furthermore, cybersecurity companies point out the fact that the growing accessibility and impact of cyber operations means that an increasing number of countries may embrace newly-available tools and techniques in the future. Such a politically powerful instrument needs to be handled with care. Political risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies. Therefore, governments need to be cautious and maintain a certain distance from such reports in order to avoid potential destabilisation and conflict with third countries. At the same time, some countries have expressed scepticism towards such reports due to the fear that given the location of tech companies in the US or Europe, some of them might deliberately do the governments' bidding.\nTo mitigate such risks, different initiatives have been launched to investigate the feasibility of establishing an international consortium that could enforce a standardised framework for threat actor-naming conventions and bring more transparency into reporting mechanisms, including indicators of compromise (IoCs). There is also an initiative underway among university-based centres and laboratories located in different countries, for a neutral, third-party attribution network that could combine technical knowledge of cyberattacks with political and institutional analysis of the motivations of potential attackers.\n# PRIVATE SECTOR AND NORM ENTREPRENEURSHIP\nIn addition to state-led processes, several non-state initiatives spearheaded by the private sector have emerged as an important avenue for establishing norms of responsible behaviour in cyberspace, resulting in new relationships and dependencies for private-public relations. While seemingly insignificant, such initiatives might in the longer term establish the foundations of a new normative framework for state behaviour in cyberspace – one that might also rely on sanctions for its enforcement.\nThere are many reasons why private companies, whose primary focus is on profit and rewarding stakeholders, might be involved in such undertakings. Most see it as a way of creating a more favourable environment for conducting their business. Businesses thrive in stable regulatory environments, and the use of cyberspace for interstate conflict could undermine the overall trust in the digital environment and consequently affect the operations of companies. Similarly, the limited trust between governments and uncertainty about their intentions towards one another might have a negative impact on businesses by making their operations more difficult and costly.\nPrivate sector-led initiatives such as the Cybersecurity Tech Accord, the Charter of Trust, or the Global Transparency Initiative (spearheaded by Microsoft, Siemens, and Kaspersky respectively), have been regarded by governments as valuable self-regulatory initiatives, albeit resulting in little change in how states behave in cyberspace. The Tech Accord promotes a safer online environment 'by fostering collaboration among global technology companies committed to protecting their customers\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n\nTimeline of key initiatives\nand users and helping them defend against malicious threats'. This position has emerged from an increasing conviction among Microsoft leaders and other companies that states are no longer only their counterparts in policymaking or regulators working for the benefit of their societies through the use of new technologies, but are also increasingly responsible for causing damage to internet users – and their clients – around the world. In that sense, while acknowledging the responsibilities of the private sector, the Tech Accord assigns a fair amount of blame for instability in cyberspace to state actors.6 In this new environment, private companies like Microsoft take on the traditional role reserved for governments, including the commitment\nto 'do more to protect and defend ... customers around the world' and calling on world leaders to 'implement international rules to protect the civilian use of the internet'.7\nIt is exactly this expansionist agenda, with private sector actors acceding to new functions traditionally reserved to governments, that has caused uneasiness among political leaders. A similar initiative, albeit more focused on self-regulation and promoting closer public-private cooperation, was launched by Siemens with the Charter of Trust. The initiative calls for binding rules and standards to build trust in cybersecurity and further advance digitalisation. To achieve these objectives it\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nproposed ten principles, including ownership of cyber and IT security, responsibility throughout the digital supply chain, certification for critical infrastructure and solutions, security by default, and user-centricity.\nThis type of norms entrepreneurship has evolved relatively quickly towards more hybrid formats that have led the private sector to work together with governments and civil society representatives. The best illustration of this kind of multi-stakeholder normative undertaking is the Paris Call for Trust and Security in Cyberspace launched at the Internet Governance Forum in 2018. Spearheaded by Microsoft and the French government, the Paris Call has over 500 signatories and has been endorsed by the European Commission. The text of the Paris Call – the outcome of negotiations between different groups – is a mix of normative commitments based on UN-driven processes and bottom-up driven commitments. Supporters of the Paris Call have agreed, inter alia, to increase prevention against and resilience to malicious online activity; protect the accessibility and integrity of the internet; cooperate in order to prevent interference in electoral processes; prevent the proliferation of malicious online programmes and techniques; and clamp down on online mercenary activities and offensive action by non-state actors.\nSome private sector companies have also invested heavily in initiatives aiming to protect their own reputation by promoting the norm of transparency. Microsoft was among the first companies to launch the Government Security Program (GSP) – an initiative with a global scope that provides national governments with controlled access to Microsoft Windows source code and other technical information they need in order to be confident in the enhanced security features of the Windows platform. As a Russia-based company with a global presence, Kaspersky Lab has often been accused of having too close ties with the Kremlin and portrayed as presenting a 'grave threat' to US national security. As a consequence, in 2017 President Trump signed into law legislation that bans the use of Kaspersky Lab products and services in federal agencies. In an unprecedented move towards regaining its reputation and international credibility, the company launched the Global Transparency Initiative aimed at engaging the broader information security community and other stakeholders in validating and verifying the trustworthiness of its products, internal processes, and business operations. It has also established three Transparency Centres in Switzerland, Spain and Malaysia that provide the opportunity to review the company's code, software updates, threat detection rules and other technical and business processes. To dismiss some of the concerns about the company's use of personal data, Kaspersky also decided to relocate its data storage and user data processing facilities from some regions as well as its software development infrastructure from Moscow to Switzerland. A similar approach was adopted by the Chinese company Huawei amidst the debate linked to its 5G service. In May 2019, Huawei decided to open a Cyber Security Transparency Centre in Brussels to showcase Huawei's end-to-end cybersecurity practices, to facilitate communication between Huawei and key stakeholders on cybersecurity strategies and end-to-end cyber security and privacy protection practices, as well as to provide a product security testing and verification platform. This initiative complements the Huawei Cyber Security Evaluation Centre, operating since November 2010 under a set of arrangements\n In 2018, Kaspersky filed lawsuits challenging the ban on its products in US government systems as stipulated by a Binding Operational Directive from the Department of Homeland Security and the 2018 National Defense Authorization Act.\n As of 3 October 2019.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n\n# PRIVATE SECTOR AND CYBER-ENABLED SANCTIONS\nAnother form of active intervention is undertaken not by states and international organisations, but by major private firms, often in cooperation with law enforcement agencies or on the basis of government regulation. These are not (yet) considered traditional types of sanctions as incarnated in the sanctions regime adopted by the EU – even though they have a sanction-like effect. In such cases, companies may opt to use some of the tools and instruments at their disposal to deny or limit access to their services and products to users who violate their contractual obligations or other norms of responsible behaviour. Such actions could eventually take the form of what might be classified as cyber-enabled sanctions. Examples of such activities include Microsoft's takedown of botnets and Facebook's stepped-up efforts to block the access of users engaged in electoral interference and the proliferation of hate speech. Mentioning these instruments and understanding their functioning is important as they might in the future become as relevant as asset freezes and travel bans. This will require implementing additional legal and technological solutions but is not impossible.\n# Fight against cybercrime\nBotnets – networks of computers infected with malware – are one of the most common methods used by cyber criminals to execute phishing and ransomware attacks (e.g. Avalanche) or to distribute spam (e.g. Srizbi, Rustock). Malware allows criminals to take control of multiple infected computers at a distance and perform attacks using one or more command and control (C&amp;C) servers, making them capable of launching malicious attacks on a massive scale. The private sector plays a key role in helping take the botnets down, which from the technological point of view is a sanctioning mechanism (i.e. a restrictive measure imposed for a political goal or purpose). In 2015, Europol’s Cybercrime Centre (EC3) led an international campaign against the Ramit botnet whose primary goal was to harvest credentials such as online banking log-ins, passwords and personal files. Microsoft’s Digital Crime Unit took part in the takedown, alongside other industry partners Symantec and AnubisNetworks, by assisting Europol and national investigators from Germany, Italy, the Netherlands and the UK with shutting down the C&amp;C servers and redirecting 300 internet domain addresses used by the botnet’s operators.\nThere are also ‘hack backs’ undertaken by governments, as in the case of the government of the Netherlands intruding into the systems of cyber criminals. In one specific case, the Dutch National High Technology Crime Unit discerned the use of cryptographic software in a money laundering investigation, and identified an undisclosed issue with the service that allowed them to decrypt the criminal’s communications. In another widely reported case in 2018, the Dutch AIVD intelligence service gained access to systems operated by a Russian hacking group which was widely considered to be state supported, and maintained this level of access\n Cabinet Office, “Huawei cyber security evaluation centre oversight board: annual report 2019”, March 28, 2019, https://www.gov.uk/government/publications/huawei-cyber-security-evaluation-centre-oversight-board-annual-report-2019.\n Lisa Vaas, “258,000 encrypted IronChat phone messages cracked by police”, November 9, 2018, https://nakedsecurity.sophos.com/2018/11/09/258000-encrypted-ironchat-phone-messages-cracked-by-police/\n Rick Noack, “The Dutch were a secret U.S. ally in war against Russian hackers, local media reveal”, Washington Post, January 26, 2018.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nfor at least one year. The use of ‘hack backs’ as a self-help mechanism by private companies has caused a lot of controversy, with government officials taking a clear stand against such practices as ‘negatively affecting the already unclear rules of engagement in cyberspace’.\n## Fight against terrorism\nThe private sector plays a relevant role also in the context of fighting terrorism. The UN’s 1267 Sanctions Committee concerning Daesh, al-Qaeda, and associated individuals and groups has adopted designation criteria for individuals providing web-hosting services under the rubric of ‘material support for the commitment of acts of terrorism or incitement to commit acts of terrorism.’ Internet hosting or cyber support has been included in 36 statements of case (designations of individuals where internet hosting was cited) as of February 2017, but significantly, it has never been the sole criterion for a listing. There is some reluctance (typically on the part of the US, due to first amendment concerns) to make this the principal basis for a designation, something that according to some observers can lead to gaps in enforcement, limiting the capacity of the committee to act in some instances. In theory, individual websites could be designated, but this has civil liberties implications and has thus far been avoided due to a significant potential for abuses by governments who might take advantage of such a development to silence political opponents.\nDesignations are made on the basis of prioritising those members of Daesh or al-Qaeda who are most likely to be exposed to the effects of sanctions. To date, the UN Security Council sanctions committee has been focused primarily on individuals engaged in incitement to violence, but online military training is also prohibited under arms embargoes applied by the committee. Large-scale cyberattacks emanating from Daesh were a possibility in the past, when the group controlled large amounts of territory and had access to substantial material resources. Today, counter-terrorism specialists at the UN anticipate that Daesh’s media presence will increase in the wake of their military defeat. This has strategic implications and Daesh may expand its presence in cyberspace, hence the prospect of more proactive engagement by the UN in the future. Daesh apparently still has access to financial assets, but the funds have been laundered into real estate and other concrete investments. Nonetheless, the use of malicious activities such as ransomware attacks to generate additional funds could become a serious problem in the future.\nThe surge in terrorist attacks and hate crimes by radical right-wing organisations in the US has brought the role of the private sector to the fore. While most of the measures aimed at limiting access to online platforms – such as the suspension of Twitter or Facebook accounts – are based on the violation of the terms and conditions of use, we have recently seen unprecedented steps taken by the private sector. Following the mass shooting in El Paso in August 2019, the discussion about access and use by radical right groups of online services such as anonymous message boards or communication platforms has intensified. As a consequence, 8chan – one such platform which\n---\n ‘Hack backs’ could be used as exploratory measures, to access services for attribution purposes, as preventive measures, to prevent an actor from doing harm, and as retaliatory measures for revenge. The last aspect is the most debated one.\n Jacqueline Thomsen, “Pentagon cyber official warns U.S. companies against ‘hacking back’”, The Hill, November 13, 2018. See also: Wyatt Hoffman and Steven Nyikos, “Governing Private Sector Self-Help in Cyberspace: Analogies from the Physical World”, Working Paper, Carnegie Endowment for International Peace, December 2018, https://carnegieendowment.org/files/Hoffman_Nyikos_Self_Help_FINAL_WEB_bio_edit.pdf; Sven Herpig, “Hackback ist nicht gleich Hackback”, SNV Impuls, July 24, 2018, https://www.stiftung-nv.de/de/publikation/hackback-ist-nicht-gleich-hackback.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n\nIn addition, organisations such as Tech Against Terrorism were created to prevent tech companies whose technology and products are exploited for terrorist activities incurring potential reputational damage. In a similar vein, to curb the spread of terrorist content online, Facebook, Microsoft, Twitter, and YouTube announced in 2017 the formation of the Global Internet Forum to Counter Terrorism. All these companies report significant progress in removing violent extremist content. For instance, between July 2017 and December 2017, a total of 274,460 Twitter accounts were permanently suspended for violations related to the promotion of terrorism. Facebook manages to detect 99% of Daesh and al-Qaeda-related terror content which is removed even before anyone in the forum or community concerned has flagged it. The terrorist attack in New Zealand in 2019 and the announcement of the Christchurch Call to eliminate terrorist and violent extremist content online have further reinforced the norm that the internet should remain a free, open and secure space for all and should not be abused as an arena for malicious cyber activities. Together with the growing focus on election interference, these two objectives might reinvigorate the discussion about cyber sanctions at the UN. Meanwhile, in the absence of progress in the sanctions discussion, some countries have taken unilateral measures. For instance, the UK conducted offensive cyber operations against\nDaesh terrorists in the Middle East designed to disrupt their ability to carry out attacks, protect British and coalition forces, and cripple Daesh’s online propaganda machine.\n# CONCLUSIONS\nSanctions are a political tool in the hands of governments. But they carry implications – often quite significant – for other actors, in particular in the private sector which needs to ensure compliance with the limitations imposed by governments. In that sense, the cyber sanctions regime put in place by the EU does not bring any new elements as it simply asks the private sector to comply with travel bans and implement asset freezes. However, the role of the private sector, when it comes to cyber sanctions, goes beyond the traditional private-public sector relationship whereby companies and businesses are simply required to comply with the provisions of the regulations. As a matter of fact, in the case of cyber sanctions – as adopted by the EU – this relationship and attendant dependencies are reversed. As this chapter has demonstrated, governments rely on the private sector for forensic and strategic information, thereby turning the security companies into quasi-intelligence services.\nIn addition to the operational cooperation, private sector actors have taken it upon themselves to shape the normative discussion about responsible behaviour in cyberspace. This move – even though not directly linked to the EU’s sanctions regime – might have broad implications for its application. As argued in earlier chapters, sanctions also play a signalling role in relation to the norms that they aim to promote and strengthen. The proliferation of normative initiatives by the private sector provides an additional dimension to the conversation and creates a new context within which sanctions may be implemented, especially if some of these new norms gain universal recognition.\n Kate Conger and Nathaniel Popper, “Behind the Scenes, 8chan Scrambles to Get Back Online”, New York Times, August 5, 2019.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nFinally, the private sector already plays the role of a sanctioning power in cyberspace. IT companies and social networks have the power to block access or disconnect individuals and entities who do not comply with their terms of reference or other accepted norms. The examples of the fight against cybercrime and terrorist use of the internet illustrate this point.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms",
  "citations": {
    "style": "superscript",
    "flat_text": "European Union Institute for Security Studies (EUISS)\nReport Part Title: MULTIPLE MOONS\nReport Title: GUARDIAN OF THE GALAXY\nReport Subtitle: EU cyber sanctions and norms in cyberspace\nEuropean Union Institute for Security Studies (EUISS) (2019)\nStable URL: http://www.jstor.com/stable/resrep21136.11\nJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms\nJSTOR\nEuropean Union Institute for Security Studies (EUISS) is collaborating with JSTOR to digitize, preserve and extend access to this content.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7\n# MULTIPLE MOONS\nCyber sanctions and the role of the private sector\n## INTRODUCTION\nCyber diplomacy is not only the business of government. It also involves numerous other stakeholders, in particular from the private sector, that circle governments like multiple moons attracted by various gravitational forces. As stated in the opening chapters of this *Chailot Paper*, the effective use of cyber sanctioning mechanisms (e.g. travel bans and asset freezes) to coerce, constrain and/or signal behaviour in cyberspace often relies on good cooperation with industry and private actors, in particular when such technology belongs to or is operated by the private sector. The following sections discuss the different ways in which private sector actors orbit around governments and consequently play an important role in sanctions implementation, including for attribution, operational cooperation and norms development.\nIn addition to the potential impact of sanctions on how businesses operate (as discussed earlier on in this volume) – an aspect that has already been addressed in the literature on sanctions – it is important to highlight two alternative ways of thinking about ‘cyber sanctions’ as a tool used for the enforcement of norms in general. For instance, rather than targeting individuals, firms, government agencies or even sectors of economic activity in retaliation for cyberattacks, states may increasingly resort to cyber operations as a potentially less costly alternative to traditional sanctioning instruments. Some EU member states have openly admitted to conducting offensive cyber operations, such as the UK’s efforts to ‘take down’ websites used\nConstellation of issues in this chapter\nfor recruitment of terrorists or the dissemination of information about bomb-making designs. There have been instances in which the UN Security Council has taken action to designate individuals for web-hosting activities as a part of its counterterrorism efforts.\n## PRIVATE SECTOR AND ATTRIBUTION\nAn area where private actors, in particular private cybersecurity companies, have played a critical role is in the attribution of malicious cyber activities. With access to sophisticated computer forensic capabilities, private companies offer invaluable contributions by providing relevant and timely threat intelligence to\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons\n\nPolitical risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies.\nThat also affects the standing of these companies vis-à-vis state intelligence agencies which oftentimes lag behind and heavily rely on the forensic evidence provided by private cyberintelligence agencies, consequently breaking the state's monopoly on pointing fingers at potential threats. There is, however, one clear difference in motivation for such extensive cooperation. Whereas state agencies are interested in knowing where the threat originates from in order to prepare adequate policy responses, for the private cybersecurity companies the primary concern is to protect their businesses and the interests of their clients, including in the member states (e.g. critical infrastructure). The potential trust issues typical for such cooperation have been partly overcome thanks to more structured and formalised partnerships with the government agencies. Through their membership in the advisory bodies, many of them have established permanent channels for engagement with the EU agencies, such as the Advisory Groups on Financial Services, Internet Security and Communication Providers with the Europol's European Cybercrime Centre (EC3) or the Advisory Group of the EU's Cybersecurity Agency (ENISA). The Industry 100 initiative by the UK's National Cyber Security Centre (NCSC) is another illustration of a more integrationist approach. Through the initiative, industry secondees work across a wide range of short-term placements at the NCSC, usually on a part-time basis.\nIn recent years, the private sector has been active in attributing malicious cyber operations to non-state actors associated with Russia, Iran, China, North Korea and the United States. While this has proven to be a growing business,\n1. ThreatConnect and Defense Group Inc, Project Camerashy. Closing the Aperture on China's Unit 78020 (Arlington, VA: ThreatConnect, 2015).\n2. Chris Bing and Patrick Howell O'Neill, \"Kaspersky's 'Slingshot' report burned an ISIS-focused intelligence operation\", Cyberscoop, March 20, 2018.\n3. Sasha Romanosky, \"Private-Sector Attribution of Cyber Attacks: A Growing Concern for the U.S. Government?\", Lawfare, December 21, 2017.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nmany companies also point out that technical evidence provides insufficient grounds for political attribution and refrain from this type of activity. Furthermore, cybersecurity companies point out the fact that the growing accessibility and impact of cyber operations means that an increasing number of countries may embrace newly-available tools and techniques in the future. Such a politically powerful instrument needs to be handled with care. Political risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies. Therefore, governments need to be cautious and maintain a certain distance from such reports in order to avoid potential destabilisation and conflict with third countries. At the same time, some countries have expressed scepticism towards such reports due to the fear that given the location of tech companies in the US or Europe, some of them might deliberately do the governments' bidding.\nTo mitigate such risks, different initiatives have been launched to investigate the feasibility of establishing an international consortium that could enforce a standardised framework for threat actor-naming conventions and bring more transparency into reporting mechanisms, including indicators of compromise (IoCs). There is also an initiative underway among university-based centres and laboratories located in different countries, for a neutral, third-party attribution network that could combine technical knowledge of cyberattacks with political and institutional analysis of the motivations of potential attackers.\n# PRIVATE SECTOR AND NORM ENTREPRENEURSHIP\nIn addition to state-led processes, several non-state initiatives spearheaded by the private sector have emerged as an important avenue for establishing norms of responsible behaviour in cyberspace, resulting in new relationships and dependencies for private-public relations. While seemingly insignificant, such initiatives might in the longer term establish the foundations of a new normative framework for state behaviour in cyberspace – one that might also rely on sanctions for its enforcement.\nThere are many reasons why private companies, whose primary focus is on profit and rewarding stakeholders, might be involved in such undertakings. Most see it as a way of creating a more favourable environment for conducting their business. Businesses thrive in stable regulatory environments, and the use of cyberspace for interstate conflict could undermine the overall trust in the digital environment and consequently affect the operations of companies. Similarly, the limited trust between governments and uncertainty about their intentions towards one another might have a negative impact on businesses by making their operations more difficult and costly.\nPrivate sector-led initiatives such as the Cybersecurity Tech Accord, the Charter of Trust, or the Global Transparency Initiative (spearheaded by Microsoft, Siemens, and Kaspersky respectively), have been regarded by governments as valuable self-regulatory initiatives, albeit resulting in little change in how states behave in cyberspace. The Tech Accord promotes a safer online environment 'by fostering collaboration among global technology companies committed to protecting their customers\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n\nTimeline of key initiatives\nand users and helping them defend against malicious threats'. This position has emerged from an increasing conviction among Microsoft leaders and other companies that states are no longer only their counterparts in policymaking or regulators working for the benefit of their societies through the use of new technologies, but are also increasingly responsible for causing damage to internet users – and their clients – around the world. In that sense, while acknowledging the responsibilities of the private sector, the Tech Accord assigns a fair amount of blame for instability in cyberspace to state actors.6 In this new environment, private companies like Microsoft take on the traditional role reserved for governments, including the commitment\nto 'do more to protect and defend ... customers around the world' and calling on world leaders to 'implement international rules to protect the civilian use of the internet'.7\nIt is exactly this expansionist agenda, with private sector actors acceding to new functions traditionally reserved to governments, that has caused uneasiness among political leaders. A similar initiative, albeit more focused on self-regulation and promoting closer public-private cooperation, was launched by Siemens with the Charter of Trust. The initiative calls for binding rules and standards to build trust in cybersecurity and further advance digitalisation. To achieve these objectives it\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nproposed ten principles, including ownership of cyber and IT security, responsibility throughout the digital supply chain, certification for critical infrastructure and solutions, security by default, and user-centricity.\nThis type of norms entrepreneurship has evolved relatively quickly towards more hybrid formats that have led the private sector to work together with governments and civil society representatives. The best illustration of this kind of multi-stakeholder normative undertaking is the Paris Call for Trust and Security in Cyberspace launched at the Internet Governance Forum in 2018. Spearheaded by Microsoft and the French government, the Paris Call has over 500 signatories and has been endorsed by the European Commission. The text of the Paris Call – the outcome of negotiations between different groups – is a mix of normative commitments based on UN-driven processes and bottom-up driven commitments. Supporters of the Paris Call have agreed, inter alia, to increase prevention against and resilience to malicious online activity; protect the accessibility and integrity of the internet; cooperate in order to prevent interference in electoral processes; prevent the proliferation of malicious online programmes and techniques; and clamp down on online mercenary activities and offensive action by non-state actors.\nSome private sector companies have also invested heavily in initiatives aiming to protect their own reputation by promoting the norm of transparency. Microsoft was among the first companies to launch the Government Security Program (GSP) – an initiative with a global scope that provides national governments with controlled access to Microsoft Windows source code and other technical information they need in order to be confident in the enhanced security features of the Windows platform. As a Russia-based company with a global presence, Kaspersky Lab has often been accused of having too close ties with the Kremlin and portrayed as presenting a 'grave threat' to US national security. As a consequence, in 2017 President Trump signed into law legislation that bans the use of Kaspersky Lab products and services in federal agencies. In an unprecedented move towards regaining its reputation and international credibility, the company launched the Global Transparency Initiative aimed at engaging the broader information security community and other stakeholders in validating and verifying the trustworthiness of its products, internal processes, and business operations. It has also established three Transparency Centres in Switzerland, Spain and Malaysia that provide the opportunity to review the company's code, software updates, threat detection rules and other technical and business processes. To dismiss some of the concerns about the company's use of personal data, Kaspersky also decided to relocate its data storage and user data processing facilities from some regions as well as its software development infrastructure from Moscow to Switzerland. A similar approach was adopted by the Chinese company Huawei amidst the debate linked to its 5G service. In May 2019, Huawei decided to open a Cyber Security Transparency Centre in Brussels to showcase Huawei's end-to-end cybersecurity practices, to facilitate communication between Huawei and key stakeholders on cybersecurity strategies and end-to-end cyber security and privacy protection practices, as well as to provide a product security testing and verification platform. This initiative complements the Huawei Cyber Security Evaluation Centre, operating since November 2010 under a set of arrangements\n In 2018, Kaspersky filed lawsuits challenging the ban on its products in US government systems as stipulated by a Binding Operational Directive from the Department of Homeland Security and the 2018 National Defense Authorization Act.\n As of 3 October 2019.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n\n# PRIVATE SECTOR AND CYBER-ENABLED SANCTIONS\nAnother form of active intervention is undertaken not by states and international organisations, but by major private firms, often in cooperation with law enforcement agencies or on the basis of government regulation. These are not (yet) considered traditional types of sanctions as incarnated in the sanctions regime adopted by the EU – even though they have a sanction-like effect. In such cases, companies may opt to use some of the tools and instruments at their disposal to deny or limit access to their services and products to users who violate their contractual obligations or other norms of responsible behaviour. Such actions could eventually take the form of what might be classified as cyber-enabled sanctions. Examples of such activities include Microsoft's takedown of botnets and Facebook's stepped-up efforts to block the access of users engaged in electoral interference and the proliferation of hate speech. Mentioning these instruments and understanding their functioning is important as they might in the future become as relevant as asset freezes and travel bans. This will require implementing additional legal and technological solutions but is not impossible.\n# Fight against cybercrime\nBotnets – networks of computers infected with malware – are one of the most common methods used by cyber criminals to execute phishing and ransomware attacks (e.g. Avalanche) or to distribute spam (e.g. Srizbi, Rustock). Malware allows criminals to take control of multiple infected computers at a distance and perform attacks using one or more command and control (C&amp;C) servers, making them capable of launching malicious attacks on a massive scale. The private sector plays a key role in helping take the botnets down, which from the technological point of view is a sanctioning mechanism (i.e. a restrictive measure imposed for a political goal or purpose). In 2015, Europol’s Cybercrime Centre (EC3) led an international campaign against the Ramit botnet whose primary goal was to harvest credentials such as online banking log-ins, passwords and personal files. Microsoft’s Digital Crime Unit took part in the takedown, alongside other industry partners Symantec and AnubisNetworks, by assisting Europol and national investigators from Germany, Italy, the Netherlands and the UK with shutting down the C&amp;C servers and redirecting 300 internet domain addresses used by the botnet’s operators.\nThere are also ‘hack backs’ undertaken by governments, as in the case of the government of the Netherlands intruding into the systems of cyber criminals. In one specific case, the Dutch National High Technology Crime Unit discerned the use of cryptographic software in a money laundering investigation, and identified an undisclosed issue with the service that allowed them to decrypt the criminal’s communications. In another widely reported case in 2018, the Dutch AIVD intelligence service gained access to systems operated by a Russian hacking group which was widely considered to be state supported, and maintained this level of access\n Cabinet Office, “Huawei cyber security evaluation centre oversight board: annual report 2019”, March 28, 2019, https://www.gov.uk/government/publications/huawei-cyber-security-evaluation-centre-oversight-board-annual-report-2019.\n Lisa Vaas, “258,000 encrypted IronChat phone messages cracked by police”, November 9, 2018, https://nakedsecurity.sophos.com/2018/11/09/258000-encrypted-ironchat-phone-messages-cracked-by-police/\n Rick Noack, “The Dutch were a secret U.S. ally in war against Russian hackers, local media reveal”, Washington Post, January 26, 2018.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nfor at least one year. The use of ‘hack backs’ as a self-help mechanism by private companies has caused a lot of controversy, with government officials taking a clear stand against such practices as ‘negatively affecting the already unclear rules of engagement in cyberspace’.\n## Fight against terrorism\nThe private sector plays a relevant role also in the context of fighting terrorism. The UN’s 1267 Sanctions Committee concerning Daesh, al-Qaeda, and associated individuals and groups has adopted designation criteria for individuals providing web-hosting services under the rubric of ‘material support for the commitment of acts of terrorism or incitement to commit acts of terrorism.’ Internet hosting or cyber support has been included in 36 statements of case (designations of individuals where internet hosting was cited) as of February 2017, but significantly, it has never been the sole criterion for a listing. There is some reluctance (typically on the part of the US, due to first amendment concerns) to make this the principal basis for a designation, something that according to some observers can lead to gaps in enforcement, limiting the capacity of the committee to act in some instances. In theory, individual websites could be designated, but this has civil liberties implications and has thus far been avoided due to a significant potential for abuses by governments who might take advantage of such a development to silence political opponents.\nDesignations are made on the basis of prioritising those members of Daesh or al-Qaeda who are most likely to be exposed to the effects of sanctions. To date, the UN Security Council sanctions committee has been focused primarily on individuals engaged in incitement to violence, but online military training is also prohibited under arms embargoes applied by the committee. Large-scale cyberattacks emanating from Daesh were a possibility in the past, when the group controlled large amounts of territory and had access to substantial material resources. Today, counter-terrorism specialists at the UN anticipate that Daesh’s media presence will increase in the wake of their military defeat. This has strategic implications and Daesh may expand its presence in cyberspace, hence the prospect of more proactive engagement by the UN in the future. Daesh apparently still has access to financial assets, but the funds have been laundered into real estate and other concrete investments. Nonetheless, the use of malicious activities such as ransomware attacks to generate additional funds could become a serious problem in the future.\nThe surge in terrorist attacks and hate crimes by radical right-wing organisations in the US has brought the role of the private sector to the fore. While most of the measures aimed at limiting access to online platforms – such as the suspension of Twitter or Facebook accounts – are based on the violation of the terms and conditions of use, we have recently seen unprecedented steps taken by the private sector. Following the mass shooting in El Paso in August 2019, the discussion about access and use by radical right groups of online services such as anonymous message boards or communication platforms has intensified. As a consequence, 8chan – one such platform which\n---\n ‘Hack backs’ could be used as exploratory measures, to access services for attribution purposes, as preventive measures, to prevent an actor from doing harm, and as retaliatory measures for revenge. The last aspect is the most debated one.\n Jacqueline Thomsen, “Pentagon cyber official warns U.S. companies against ‘hacking back’”, The Hill, November 13, 2018. See also: Wyatt Hoffman and Steven Nyikos, “Governing Private Sector Self-Help in Cyberspace: Analogies from the Physical World”, Working Paper, Carnegie Endowment for International Peace, December 2018, https://carnegieendowment.org/files/Hoffman_Nyikos_Self_Help_FINAL_WEB_bio_edit.pdf; Sven Herpig, “Hackback ist nicht gleich Hackback”, SNV Impuls, July 24, 2018, https://www.stiftung-nv.de/de/publikation/hackback-ist-nicht-gleich-hackback.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n\nIn addition, organisations such as Tech Against Terrorism were created to prevent tech companies whose technology and products are exploited for terrorist activities incurring potential reputational damage. In a similar vein, to curb the spread of terrorist content online, Facebook, Microsoft, Twitter, and YouTube announced in 2017 the formation of the Global Internet Forum to Counter Terrorism. All these companies report significant progress in removing violent extremist content. For instance, between July 2017 and December 2017, a total of 274,460 Twitter accounts were permanently suspended for violations related to the promotion of terrorism. Facebook manages to detect 99% of Daesh and al-Qaeda-related terror content which is removed even before anyone in the forum or community concerned has flagged it. The terrorist attack in New Zealand in 2019 and the announcement of the Christchurch Call to eliminate terrorist and violent extremist content online have further reinforced the norm that the internet should remain a free, open and secure space for all and should not be abused as an arena for malicious cyber activities. Together with the growing focus on election interference, these two objectives might reinvigorate the discussion about cyber sanctions at the UN. Meanwhile, in the absence of progress in the sanctions discussion, some countries have taken unilateral measures. For instance, the UK conducted offensive cyber operations against\nDaesh terrorists in the Middle East designed to disrupt their ability to carry out attacks, protect British and coalition forces, and cripple Daesh’s online propaganda machine.\n# CONCLUSIONS\nSanctions are a political tool in the hands of governments. But they carry implications – often quite significant – for other actors, in particular in the private sector which needs to ensure compliance with the limitations imposed by governments. In that sense, the cyber sanctions regime put in place by the EU does not bring any new elements as it simply asks the private sector to comply with travel bans and implement asset freezes. However, the role of the private sector, when it comes to cyber sanctions, goes beyond the traditional private-public sector relationship whereby companies and businesses are simply required to comply with the provisions of the regulations. As a matter of fact, in the case of cyber sanctions – as adopted by the EU – this relationship and attendant dependencies are reversed. As this chapter has demonstrated, governments rely on the private sector for forensic and strategic information, thereby turning the security companies into quasi-intelligence services.\nIn addition to the operational cooperation, private sector actors have taken it upon themselves to shape the normative discussion about responsible behaviour in cyberspace. This move – even though not directly linked to the EU’s sanctions regime – might have broad implications for its application. As argued in earlier chapters, sanctions also play a signalling role in relation to the norms that they aim to promote and strengthen. The proliferation of normative initiatives by the private sector provides an additional dimension to the conversation and creates a new context within which sanctions may be implemented, especially if some of these new norms gain universal recognition.\n Kate Conger and Nathaniel Popper, “Behind the Scenes, 8chan Scrambles to Get Back Online”, New York Times, August 5, 2019.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nFinally, the private sector already plays the role of a sanctioning power in cyberspace. IT companies and social networks have the power to block access or disconnect individuals and entities who do not comply with their terms of reference or other accepted norms. The examples of the fight against cybercrime and terrorist use of the internet illustrate this point.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 16,
        "success_occurrences": 16,
        "success_unique": 8,
        "bib_unique_total": 12,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.6666666666666666,
        "success_percentage": 100.0,
        "style": "superscript"
      },
      "results": [
        {
          "index": 8,
          "intext_citation": "⁸",
          "preceding_text": "",
          "footnote": "In 2018, Kaspersky filed lawsuits challenging the ban on its products in US government systems as stipulated by a Binding Operational Directive from the Department of Homeland Security and the 2018 National Defense Authorization Act.",
          "position": 15096
        },
        {
          "index": 9,
          "intext_citation": "⁹",
          "preceding_text": "",
          "footnote": "As of 3 October 2019.",
          "position": 15666
        },
        {
          "index": 8,
          "intext_citation": "⁸",
          "preceding_text": "0 under a set of arrangements\n",
          "footnote": "In 2018, Kaspersky filed lawsuits challenging the ban on its products in US government systems as stipulated by a Binding Operational Directive from the Department of Homeland Security and the 2018 National Defense Authorization Act.",
          "position": 16537
        },
        {
          "index": 9,
          "intext_citation": "⁹",
          "preceding_text": "",
          "footnote": "As of 3 October 2019.",
          "position": 16773
        },
        {
          "index": 10,
          "intext_citation": "¹⁰",
          "preceding_text": "",
          "footnote": "Cabinet Office, “Huawei cyber security evaluation centre oversight board: annual report 2019”, March 28, 2019, https://www.gov.uk/government/publications/huawei-cyber-security-evaluation-centre-oversight-board-annual-report-2019.",
          "position": 17157
        },
        {
          "index": 11,
          "intext_citation": "¹¹",
          "preceding_text": "",
          "footnote": "Lisa Vaas, “258,000 encrypted IronChat phone messages cracked by police”, November 9, 2018, https://nakedsecurity.sophos.com/2018/11/09/258000-encrypted-ironchat-phone-messages-cracked-by-police/",
          "position": 20036
        },
        {
          "index": 12,
          "intext_citation": "¹²",
          "preceding_text": "sidered to be state supported,",
          "footnote": "Rick Noack, “The Dutch were a secret U.S. ally in war against Russian hackers, local media reveal”, Washington Post, January 26, 2018.",
          "position": 20227
        },
        {
          "index": 10,
          "intext_citation": "¹⁰",
          "preceding_text": "intained this level of access\n",
          "footnote": "Cabinet Office, “Huawei cyber security evaluation centre oversight board: annual report 2019”, March 28, 2019, https://www.gov.uk/government/publications/huawei-cyber-security-evaluation-centre-oversight-board-annual-report-2019.",
          "position": 20266
        },
        {
          "index": 11,
          "intext_citation": "¹¹",
          "preceding_text": "",
          "footnote": "Lisa Vaas, “258,000 encrypted IronChat phone messages cracked by police”, November 9, 2018, https://nakedsecurity.sophos.com/2018/11/09/258000-encrypted-ironchat-phone-messages-cracked-by-police/",
          "position": 20499
        },
        {
          "index": 12,
          "intext_citation": "¹²",
          "preceding_text": "e-messages-cracked-by-police/\n",
          "footnote": "Rick Noack, “The Dutch were a secret U.S. ally in war against Russian hackers, local media reveal”, Washington Post, January 26, 2018.",
          "position": 20698
        },
        {
          "index": 13,
          "intext_citation": "¹³",
          "preceding_text": "acks’ as a self-help mechanism",
          "footnote": "‘Hack backs’ could be used as exploratory measures, to access services for attribution purposes, as preventive measures, to prevent an actor from doing harm, and as retaliatory measures for revenge. The last aspect is the most debated one.",
          "position": 21101
        },
        {
          "index": 14,
          "intext_citation": "¹⁴",
          "preceding_text": "",
          "footnote": "Jacqueline Thomsen, “Pentagon cyber official warns U.S. companies against ‘hacking back’”, The Hill, November 13, 2018. See also: Wyatt Hoffman and Steven Nyikos, “Governing Private Sector Self-Help in Cyberspace: Analogies from the Physical World”, Working Paper, Carnegie Endowment for International Peace, December 2018, https://carnegieendowment.org/files/Hoffman_Nyikos_Self_Help_FINAL_WEB_bio_edit.pdf; Sven Herpig, “Hackback ist nicht gleich Hackback”, SNV Impuls, July 24, 2018, https://www.stiftung-nv.de/de/publikation/hackback-ist-nicht-gleich-hackback.",
          "position": 21308
        },
        {
          "index": 13,
          "intext_citation": "¹³",
          "preceding_text": "– one such platform which\n---\n",
          "footnote": "‘Hack backs’ could be used as exploratory measures, to access services for attribution purposes, as preventive measures, to prevent an actor from doing harm, and as retaliatory measures for revenge. The last aspect is the most debated one.",
          "position": 24312
        },
        {
          "index": 14,
          "intext_citation": "¹⁴",
          "preceding_text": "",
          "footnote": "Jacqueline Thomsen, “Pentagon cyber official warns U.S. companies against ‘hacking back’”, The Hill, November 13, 2018. See also: Wyatt Hoffman and Steven Nyikos, “Governing Private Sector Self-Help in Cyberspace: Analogies from the Physical World”, Working Paper, Carnegie Endowment for International Peace, December 2018, https://carnegieendowment.org/files/Hoffman_Nyikos_Self_Help_FINAL_WEB_bio_edit.pdf; Sven Herpig, “Hackback ist nicht gleich Hackback”, SNV Impuls, July 24, 2018, https://www.stiftung-nv.de/de/publikation/hackback-ist-nicht-gleich-hackback.",
          "position": 24555
        },
        {
          "index": 15,
          "intext_citation": "¹⁵",
          "preceding_text": "",
          "footnote": "Kate Conger and Nathaniel Popper, “Behind the Scenes, 8chan Scrambles to Get Back Online”, New York Times, August 5, 2019.",
          "position": 25650
        },
        {
          "index": 15,
          "intext_citation": "¹⁵",
          "preceding_text": "",
          "footnote": "Kate Conger and Nathaniel Popper, “Behind the Scenes, 8chan Scrambles to Get Back Online”, New York Times, August 5, 2019.",
          "position": 29363
        }
      ],
      "flat_text": "European Union Institute for Security Studies (EUISS)\nReport Part Title: MULTIPLE MOONS\nReport Title: GUARDIAN OF THE GALAXY\nReport Subtitle: EU cyber sanctions and norms in cyberspace\nEuropean Union Institute for Security Studies (EUISS) (2019)\nStable URL: http://www.jstor.com/stable/resrep21136.11\nJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms\nJSTOR\nEuropean Union Institute for Security Studies (EUISS) is collaborating with JSTOR to digitize, preserve and extend access to this content.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7\n# MULTIPLE MOONS\nCyber sanctions and the role of the private sector\n## INTRODUCTION\nCyber diplomacy is not only the business of government. It also involves numerous other stakeholders, in particular from the private sector, that circle governments like multiple moons attracted by various gravitational forces. As stated in the opening chapters of this *Chailot Paper*, the effective use of cyber sanctioning mechanisms (e.g. travel bans and asset freezes) to coerce, constrain and/or signal behaviour in cyberspace often relies on good cooperation with industry and private actors, in particular when such technology belongs to or is operated by the private sector. The following sections discuss the different ways in which private sector actors orbit around governments and consequently play an important role in sanctions implementation, including for attribution, operational cooperation and norms development.\nIn addition to the potential impact of sanctions on how businesses operate (as discussed earlier on in this volume) – an aspect that has already been addressed in the literature on sanctions – it is important to highlight two alternative ways of thinking about ‘cyber sanctions’ as a tool used for the enforcement of norms in general. For instance, rather than targeting individuals, firms, government agencies or even sectors of economic activity in retaliation for cyberattacks, states may increasingly resort to cyber operations as a potentially less costly alternative to traditional sanctioning instruments. Some EU member states have openly admitted to conducting offensive cyber operations, such as the UK’s efforts to ‘take down’ websites used\nConstellation of issues in this chapter\nfor recruitment of terrorists or the dissemination of information about bomb-making designs. There have been instances in which the UN Security Council has taken action to designate individuals for web-hosting activities as a part of its counterterrorism efforts.\n## PRIVATE SECTOR AND ATTRIBUTION\nAn area where private actors, in particular private cybersecurity companies, have played a critical role is in the attribution of malicious cyber activities. With access to sophisticated computer forensic capabilities, private companies offer invaluable contributions by providing relevant and timely threat intelligence to\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons\n\nPolitical risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies.\nThat also affects the standing of these companies vis-à-vis state intelligence agencies which oftentimes lag behind and heavily rely on the forensic evidence provided by private cyberintelligence agencies, consequently breaking the state's monopoly on pointing fingers at potential threats. There is, however, one clear difference in motivation for such extensive cooperation. Whereas state agencies are interested in knowing where the threat originates from in order to prepare adequate policy responses, for the private cybersecurity companies the primary concern is to protect their businesses and the interests of their clients, including in the member states (e.g. critical infrastructure). The potential trust issues typical for such cooperation have been partly overcome thanks to more structured and formalised partnerships with the government agencies. Through their membership in the advisory bodies, many of them have established permanent channels for engagement with the EU agencies, such as the Advisory Groups on Financial Services, Internet Security and Communication Providers with the Europol's European Cybercrime Centre (EC3) or the Advisory Group of the EU's Cybersecurity Agency (ENISA). The Industry 100 initiative by the UK's National Cyber Security Centre (NCSC) is another illustration of a more integrationist approach. Through the initiative, industry secondees work across a wide range of short-term placements at the NCSC, usually on a part-time basis.\nIn recent years, the private sector has been active in attributing malicious cyber operations to non-state actors associated with Russia, Iran, China, North Korea and the United States. While this has proven to be a growing business,\n1. ThreatConnect and Defense Group Inc, Project Camerashy. Closing the Aperture on China's Unit 78020 (Arlington, VA: ThreatConnect, 2015).\n2. Chris Bing and Patrick Howell O'Neill, \"Kaspersky's 'Slingshot' report burned an ISIS-focused intelligence operation\", Cyberscoop, March 20, 2018.\n3. Sasha Romanosky, \"Private-Sector Attribution of Cyber Attacks: A Growing Concern for the U.S. Government?\", Lawfare, December 21, 2017.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nmany companies also point out that technical evidence provides insufficient grounds for political attribution and refrain from this type of activity. Furthermore, cybersecurity companies point out the fact that the growing accessibility and impact of cyber operations means that an increasing number of countries may embrace newly-available tools and techniques in the future. Such a politically powerful instrument needs to be handled with care. Political risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies. Therefore, governments need to be cautious and maintain a certain distance from such reports in order to avoid potential destabilisation and conflict with third countries. At the same time, some countries have expressed scepticism towards such reports due to the fear that given the location of tech companies in the US or Europe, some of them might deliberately do the governments' bidding.\nTo mitigate such risks, different initiatives have been launched to investigate the feasibility of establishing an international consortium that could enforce a standardised framework for threat actor-naming conventions and bring more transparency into reporting mechanisms, including indicators of compromise (IoCs). There is also an initiative underway among university-based centres and laboratories located in different countries, for a neutral, third-party attribution network that could combine technical knowledge of cyberattacks with political and institutional analysis of the motivations of potential attackers.\n# PRIVATE SECTOR AND NORM ENTREPRENEURSHIP\nIn addition to state-led processes, several non-state initiatives spearheaded by the private sector have emerged as an important avenue for establishing norms of responsible behaviour in cyberspace, resulting in new relationships and dependencies for private-public relations. While seemingly insignificant, such initiatives might in the longer term establish the foundations of a new normative framework for state behaviour in cyberspace – one that might also rely on sanctions for its enforcement.\nThere are many reasons why private companies, whose primary focus is on profit and rewarding stakeholders, might be involved in such undertakings. Most see it as a way of creating a more favourable environment for conducting their business. Businesses thrive in stable regulatory environments, and the use of cyberspace for interstate conflict could undermine the overall trust in the digital environment and consequently affect the operations of companies. Similarly, the limited trust between governments and uncertainty about their intentions towards one another might have a negative impact on businesses by making their operations more difficult and costly.\nPrivate sector-led initiatives such as the Cybersecurity Tech Accord, the Charter of Trust, or the Global Transparency Initiative (spearheaded by Microsoft, Siemens, and Kaspersky respectively), have been regarded by governments as valuable self-regulatory initiatives, albeit resulting in little change in how states behave in cyberspace. The Tech Accord promotes a safer online environment 'by fostering collaboration among global technology companies committed to protecting their customers\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n\nTimeline of key initiatives\nand users and helping them defend against malicious threats'. This position has emerged from an increasing conviction among Microsoft leaders and other companies that states are no longer only their counterparts in policymaking or regulators working for the benefit of their societies through the use of new technologies, but are also increasingly responsible for causing damage to internet users – and their clients – around the world. In that sense, while acknowledging the responsibilities of the private sector, the Tech Accord assigns a fair amount of blame for instability in cyberspace to state actors.6 In this new environment, private companies like Microsoft take on the traditional role reserved for governments, including the commitment\nto 'do more to protect and defend ... customers around the world' and calling on world leaders to 'implement international rules to protect the civilian use of the internet'.7\nIt is exactly this expansionist agenda, with private sector actors acceding to new functions traditionally reserved to governments, that has caused uneasiness among political leaders. A similar initiative, albeit more focused on self-regulation and promoting closer public-private cooperation, was launched by Siemens with the Charter of Trust. The initiative calls for binding rules and standards to build trust in cybersecurity and further advance digitalisation. To achieve these objectives it\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nproposed ten principles, including ownership of cyber and IT security, responsibility throughout the digital supply chain, certification for critical infrastructure and solutions, security by default, and user-centricity.\nThis type of norms entrepreneurship has evolved relatively quickly towards more hybrid formats that have led the private sector to work together with governments and civil society representatives. The best illustration of this kind of multi-stakeholder normative undertaking is the Paris Call for Trust and Security in Cyberspace launched at the Internet Governance Forum in 2018. Spearheaded by Microsoft and the French government, the Paris Call has over 500 signatories and has been endorsed by the European Commission. The text of the Paris Call – the outcome of negotiations between different groups – is a mix of normative commitments based on UN-driven processes and bottom-up driven commitments. Supporters of the Paris Call have agreed, inter alia, to increase prevention against and resilience to malicious online activity; protect the accessibility and integrity of the internet; cooperate in order to prevent interference in electoral processes; prevent the proliferation of malicious online programmes and techniques; and clamp down on online mercenary activities and offensive action by non-state actors.\nSome private sector companies have also invested heavily in initiatives aiming to protect their own reputation by promoting the norm of transparency. Microsoft was among the first companies to launch the Government Security Program (GSP) – an initiative with a global scope that provides national governments with controlled access to Microsoft Windows source code and other technical information they need in order to be confident in the enhanced security features of the Windows platform. As a Russia-based company with a global presence, Kaspersky Lab has often been accused of having too close ties with the Kremlin and portrayed as presenting a 'grave threat' to US national security. As a consequence, in 2017 President Trump signed into law legislation that bans the use of Kaspersky Lab products and services in federal agencies. In an unprecedented move towards regaining its reputation and international credibility, the company launched the Global Transparency Initiative aimed at engaging the broader information security community and other stakeholders in validating and verifying the trustworthiness of its products, internal processes, and business operations. It has also established three Transparency Centres in Switzerland, Spain and Malaysia that provide the opportunity to review the company's code, software updates, threat detection rules and other technical and business processes. To dismiss some of the concerns about the company's use of personal data, Kaspersky also decided to relocate its data storage and user data processing facilities from some regions as well as its software development infrastructure from Moscow to Switzerland. A similar approach was adopted by the Chinese company Huawei amidst the debate linked to its 5G service. In May 2019, Huawei decided to open a Cyber Security Transparency Centre in Brussels to showcase Huawei's end-to-end cybersecurity practices, to facilitate communication between Huawei and key stakeholders on cybersecurity strategies and end-to-end cyber security and privacy protection practices, as well as to provide a product security testing and verification platform. This initiative complements the Huawei Cyber Security Evaluation Centre, operating since November 2010 under a set of arrangements\n In 2018, Kaspersky filed lawsuits challenging the ban on its products in US government systems as stipulated by a Binding Operational Directive from the Department of Homeland Security and the 2018 National Defense Authorization Act.\n As of 3 October 2019.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n\n# PRIVATE SECTOR AND CYBER-ENABLED SANCTIONS\nAnother form of active intervention is undertaken not by states and international organisations, but by major private firms, often in cooperation with law enforcement agencies or on the basis of government regulation. These are not (yet) considered traditional types of sanctions as incarnated in the sanctions regime adopted by the EU – even though they have a sanction-like effect. In such cases, companies may opt to use some of the tools and instruments at their disposal to deny or limit access to their services and products to users who violate their contractual obligations or other norms of responsible behaviour. Such actions could eventually take the form of what might be classified as cyber-enabled sanctions. Examples of such activities include Microsoft's takedown of botnets and Facebook's stepped-up efforts to block the access of users engaged in electoral interference and the proliferation of hate speech. Mentioning these instruments and understanding their functioning is important as they might in the future become as relevant as asset freezes and travel bans. This will require implementing additional legal and technological solutions but is not impossible.\n# Fight against cybercrime\nBotnets – networks of computers infected with malware – are one of the most common methods used by cyber criminals to execute phishing and ransomware attacks (e.g. Avalanche) or to distribute spam (e.g. Srizbi, Rustock). Malware allows criminals to take control of multiple infected computers at a distance and perform attacks using one or more command and control (C&amp;C) servers, making them capable of launching malicious attacks on a massive scale. The private sector plays a key role in helping take the botnets down, which from the technological point of view is a sanctioning mechanism (i.e. a restrictive measure imposed for a political goal or purpose). In 2015, Europol’s Cybercrime Centre (EC3) led an international campaign against the Ramit botnet whose primary goal was to harvest credentials such as online banking log-ins, passwords and personal files. Microsoft’s Digital Crime Unit took part in the takedown, alongside other industry partners Symantec and AnubisNetworks, by assisting Europol and national investigators from Germany, Italy, the Netherlands and the UK with shutting down the C&amp;C servers and redirecting 300 internet domain addresses used by the botnet’s operators.\nThere are also ‘hack backs’ undertaken by governments, as in the case of the government of the Netherlands intruding into the systems of cyber criminals. In one specific case, the Dutch National High Technology Crime Unit discerned the use of cryptographic software in a money laundering investigation, and identified an undisclosed issue with the service that allowed them to decrypt the criminal’s communications. In another widely reported case in 2018, the Dutch AIVD intelligence service gained access to systems operated by a Russian hacking group which was widely considered to be state supported, and maintained this level of access\n Cabinet Office, “Huawei cyber security evaluation centre oversight board: annual report 2019”, March 28, 2019, https://www.gov.uk/government/publications/huawei-cyber-security-evaluation-centre-oversight-board-annual-report-2019.\n Lisa Vaas, “258,000 encrypted IronChat phone messages cracked by police”, November 9, 2018, https://nakedsecurity.sophos.com/2018/11/09/258000-encrypted-ironchat-phone-messages-cracked-by-police/\n Rick Noack, “The Dutch were a secret U.S. ally in war against Russian hackers, local media reveal”, Washington Post, January 26, 2018.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nfor at least one year. The use of ‘hack backs’ as a self-help mechanism by private companies has caused a lot of controversy, with government officials taking a clear stand against such practices as ‘negatively affecting the already unclear rules of engagement in cyberspace’.\n## Fight against terrorism\nThe private sector plays a relevant role also in the context of fighting terrorism. The UN’s 1267 Sanctions Committee concerning Daesh, al-Qaeda, and associated individuals and groups has adopted designation criteria for individuals providing web-hosting services under the rubric of ‘material support for the commitment of acts of terrorism or incitement to commit acts of terrorism.’ Internet hosting or cyber support has been included in 36 statements of case (designations of individuals where internet hosting was cited) as of February 2017, but significantly, it has never been the sole criterion for a listing. There is some reluctance (typically on the part of the US, due to first amendment concerns) to make this the principal basis for a designation, something that according to some observers can lead to gaps in enforcement, limiting the capacity of the committee to act in some instances. In theory, individual websites could be designated, but this has civil liberties implications and has thus far been avoided due to a significant potential for abuses by governments who might take advantage of such a development to silence political opponents.\nDesignations are made on the basis of prioritising those members of Daesh or al-Qaeda who are most likely to be exposed to the effects of sanctions. To date, the UN Security Council sanctions committee has been focused primarily on individuals engaged in incitement to violence, but online military training is also prohibited under arms embargoes applied by the committee. Large-scale cyberattacks emanating from Daesh were a possibility in the past, when the group controlled large amounts of territory and had access to substantial material resources. Today, counter-terrorism specialists at the UN anticipate that Daesh’s media presence will increase in the wake of their military defeat. This has strategic implications and Daesh may expand its presence in cyberspace, hence the prospect of more proactive engagement by the UN in the future. Daesh apparently still has access to financial assets, but the funds have been laundered into real estate and other concrete investments. Nonetheless, the use of malicious activities such as ransomware attacks to generate additional funds could become a serious problem in the future.\nThe surge in terrorist attacks and hate crimes by radical right-wing organisations in the US has brought the role of the private sector to the fore. While most of the measures aimed at limiting access to online platforms – such as the suspension of Twitter or Facebook accounts – are based on the violation of the terms and conditions of use, we have recently seen unprecedented steps taken by the private sector. Following the mass shooting in El Paso in August 2019, the discussion about access and use by radical right groups of online services such as anonymous message boards or communication platforms has intensified. As a consequence, 8chan – one such platform which\n---\n ‘Hack backs’ could be used as exploratory measures, to access services for attribution purposes, as preventive measures, to prevent an actor from doing harm, and as retaliatory measures for revenge. The last aspect is the most debated one.\n Jacqueline Thomsen, “Pentagon cyber official warns U.S. companies against ‘hacking back’”, The Hill, November 13, 2018. See also: Wyatt Hoffman and Steven Nyikos, “Governing Private Sector Self-Help in Cyberspace: Analogies from the Physical World”, Working Paper, Carnegie Endowment for International Peace, December 2018, https://carnegieendowment.org/files/Hoffman_Nyikos_Self_Help_FINAL_WEB_bio_edit.pdf; Sven Herpig, “Hackback ist nicht gleich Hackback”, SNV Impuls, July 24, 2018, https://www.stiftung-nv.de/de/publikation/hackback-ist-nicht-gleich-hackback.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n\nIn addition, organisations such as Tech Against Terrorism were created to prevent tech companies whose technology and products are exploited for terrorist activities incurring potential reputational damage. In a similar vein, to curb the spread of terrorist content online, Facebook, Microsoft, Twitter, and YouTube announced in 2017 the formation of the Global Internet Forum to Counter Terrorism. All these companies report significant progress in removing violent extremist content. For instance, between July 2017 and December 2017, a total of 274,460 Twitter accounts were permanently suspended for violations related to the promotion of terrorism. Facebook manages to detect 99% of Daesh and al-Qaeda-related terror content which is removed even before anyone in the forum or community concerned has flagged it. The terrorist attack in New Zealand in 2019 and the announcement of the Christchurch Call to eliminate terrorist and violent extremist content online have further reinforced the norm that the internet should remain a free, open and secure space for all and should not be abused as an arena for malicious cyber activities. Together with the growing focus on election interference, these two objectives might reinvigorate the discussion about cyber sanctions at the UN. Meanwhile, in the absence of progress in the sanctions discussion, some countries have taken unilateral measures. For instance, the UK conducted offensive cyber operations against\nDaesh terrorists in the Middle East designed to disrupt their ability to carry out attacks, protect British and coalition forces, and cripple Daesh’s online propaganda machine.\n# CONCLUSIONS\nSanctions are a political tool in the hands of governments. But they carry implications – often quite significant – for other actors, in particular in the private sector which needs to ensure compliance with the limitations imposed by governments. In that sense, the cyber sanctions regime put in place by the EU does not bring any new elements as it simply asks the private sector to comply with travel bans and implement asset freezes. However, the role of the private sector, when it comes to cyber sanctions, goes beyond the traditional private-public sector relationship whereby companies and businesses are simply required to comply with the provisions of the regulations. As a matter of fact, in the case of cyber sanctions – as adopted by the EU – this relationship and attendant dependencies are reversed. As this chapter has demonstrated, governments rely on the private sector for forensic and strategic information, thereby turning the security companies into quasi-intelligence services.\nIn addition to the operational cooperation, private sector actors have taken it upon themselves to shape the normative discussion about responsible behaviour in cyberspace. This move – even though not directly linked to the EU’s sanctions regime – might have broad implications for its application. As argued in earlier chapters, sanctions also play a signalling role in relation to the norms that they aim to promote and strengthen. The proliferation of normative initiatives by the private sector provides an additional dimension to the conversation and creates a new context within which sanctions may be implemented, especially if some of these new norms gain universal recognition.\n Kate Conger and Nathaniel Popper, “Behind the Scenes, 8chan Scrambles to Get Back Online”, New York Times, August 5, 2019.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nFinally, the private sector already plays the role of a sanctioning power in cyberspace. IT companies and social networks have the power to block access or disconnect individuals and entities who do not comply with their terms of reference or other accepted norms. The examples of the fight against cybercrime and terrorist use of the internet illustrate this point.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms"
    },
    "numeric": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "European Union Institute for Security Studies (EUISS)\nReport Part Title: MULTIPLE MOONS\nReport Title: GUARDIAN OF THE GALAXY\nReport Subtitle: EU cyber sanctions and norms in cyberspace\nEuropean Union Institute for Security Studies (EUISS) (2019)\nStable URL: http://www.jstor.com/stable/resrep21136.11\nJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms\nJSTOR\nEuropean Union Institute for Security Studies (EUISS) is collaborating with JSTOR to digitize, preserve and extend access to this content.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7\n# MULTIPLE MOONS\nCyber sanctions and the role of the private sector\n## INTRODUCTION\nCyber diplomacy is not only the business of government. It also involves numerous other stakeholders, in particular from the private sector, that circle governments like multiple moons attracted by various gravitational forces. As stated in the opening chapters of this *Chailot Paper*, the effective use of cyber sanctioning mechanisms (e.g. travel bans and asset freezes) to coerce, constrain and/or signal behaviour in cyberspace often relies on good cooperation with industry and private actors, in particular when such technology belongs to or is operated by the private sector. The following sections discuss the different ways in which private sector actors orbit around governments and consequently play an important role in sanctions implementation, including for attribution, operational cooperation and norms development.\nIn addition to the potential impact of sanctions on how businesses operate (as discussed earlier on in this volume) – an aspect that has already been addressed in the literature on sanctions – it is important to highlight two alternative ways of thinking about ‘cyber sanctions’ as a tool used for the enforcement of norms in general. For instance, rather than targeting individuals, firms, government agencies or even sectors of economic activity in retaliation for cyberattacks, states may increasingly resort to cyber operations as a potentially less costly alternative to traditional sanctioning instruments. Some EU member states have openly admitted to conducting offensive cyber operations, such as the UK’s efforts to ‘take down’ websites used\nConstellation of issues in this chapter\nfor recruitment of terrorists or the dissemination of information about bomb-making designs. There have been instances in which the UN Security Council has taken action to designate individuals for web-hosting activities as a part of its counterterrorism efforts.\n## PRIVATE SECTOR AND ATTRIBUTION\nAn area where private actors, in particular private cybersecurity companies, have played a critical role is in the attribution of malicious cyber activities. With access to sophisticated computer forensic capabilities, private companies offer invaluable contributions by providing relevant and timely threat intelligence to\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons\n71\ndecision-makers. Such information is usually delivered either as open source material or through more exclusive and secretive arrangements. Some of the most influential reports linking malicious cyber operations to governments and non-state actors have been released by private companies. Symantec was among the first companies to publicly disclose information about the Stuxnet malware that affected Iran's Natanz nuclear facility in 2010. In 2015, Kaspersky Lab documented the tools, techniques and procedures behind a hacking team called 'Equation Group' which is believed to be linked to the US National Security Agency (NSA). The same year, ThreatConnect, a US-based cyberintelligence firm, published the report 'Project CameraShy', in which it attributed cyber espionage activity associated with the 'Naikon' Advanced Persistent Threat (APT) group to a specific unit of the Chinese People's Liberation Army (PLA). The report demonstrated, inter alia, how Unit 78020 conducted cyber espionage against military, diplomatic, and economic targets in Cambodia, Indonesia, Laos, Malaysia, Myanmar, Nepal, the Philippines, Singapore, Thailand and Vietnam as well as international bodies such as the United Nations Development Programme (UNDP) and the Association of Southeast Asian Nations (ASEAN). In 2018, Kaspersky research exposed a US-led counterterrorism cyber-espionage operation targeting Daesh and al-Qaeda members. Such publicly available threat intelligence and forensics reports released regularly by cybersecurity companies provide useful open source evidence that might be used in the future to justify placing an individual or an entity on the EU's cyber sanctions list.\nPolitical risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies.\nThat also affects the standing of these companies vis-à-vis state intelligence agencies which oftentimes lag behind and heavily rely on the forensic evidence provided by private cyberintelligence agencies, consequently breaking the state's monopoly on pointing fingers at potential threats. There is, however, one clear difference in motivation for such extensive cooperation. Whereas state agencies are interested in knowing where the threat originates from in order to prepare adequate policy responses, for the private cybersecurity companies the primary concern is to protect their businesses and the interests of their clients, including in the member states (e.g. critical infrastructure). The potential trust issues typical for such cooperation have been partly overcome thanks to more structured and formalised partnerships with the government agencies. Through their membership in the advisory bodies, many of them have established permanent channels for engagement with the EU agencies, such as the Advisory Groups on Financial Services, Internet Security and Communication Providers with the Europol's European Cybercrime Centre (EC3) or the Advisory Group of the EU's Cybersecurity Agency (ENISA). The Industry 100 initiative by the UK's National Cyber Security Centre (NCSC) is another illustration of a more integrationist approach. Through the initiative, industry secondees work across a wide range of short-term placements at the NCSC, usually on a part-time basis.\nIn recent years, the private sector has been active in attributing malicious cyber operations to non-state actors associated with Russia, Iran, China, North Korea and the United States. While this has proven to be a growing business,\n1. ThreatConnect and Defense Group Inc, Project Camerashy. Closing the Aperture on China's Unit 78020 (Arlington, VA: ThreatConnect, 2015).\n2. Chris Bing and Patrick Howell O'Neill, \"Kaspersky's 'Slingshot' report burned an ISIS-focused intelligence operation\", Cyberscoop, March 20, 2018.\n3. Sasha Romanosky, \"Private-Sector Attribution of Cyber Attacks: A Growing Concern for the U.S. Government?\", Lawfare, December 21, 2017.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nmany companies also point out that technical evidence provides insufficient grounds for political attribution and refrain from this type of activity. Furthermore, cybersecurity companies point out the fact that the growing accessibility and impact of cyber operations means that an increasing number of countries may embrace newly-available tools and techniques in the future. Such a politically powerful instrument needs to be handled with care. Political risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies. Therefore, governments need to be cautious and maintain a certain distance from such reports in order to avoid potential destabilisation and conflict with third countries. At the same time, some countries have expressed scepticism towards such reports due to the fear that given the location of tech companies in the US or Europe, some of them might deliberately do the governments' bidding.\nTo mitigate such risks, different initiatives have been launched to investigate the feasibility of establishing an international consortium that could enforce a standardised framework for threat actor-naming conventions and bring more transparency into reporting mechanisms, including indicators of compromise (IoCs). There is also an initiative underway among university-based centres and laboratories located in different countries, for a neutral, third-party attribution network that could combine technical knowledge of cyberattacks with political and institutional analysis of the motivations of potential attackers.\n# PRIVATE SECTOR AND NORM ENTREPRENEURSHIP\nIn addition to state-led processes, several non-state initiatives spearheaded by the private sector have emerged as an important avenue for establishing norms of responsible behaviour in cyberspace, resulting in new relationships and dependencies for private-public relations. While seemingly insignificant, such initiatives might in the longer term establish the foundations of a new normative framework for state behaviour in cyberspace – one that might also rely on sanctions for its enforcement.\nThere are many reasons why private companies, whose primary focus is on profit and rewarding stakeholders, might be involved in such undertakings. Most see it as a way of creating a more favourable environment for conducting their business. Businesses thrive in stable regulatory environments, and the use of cyberspace for interstate conflict could undermine the overall trust in the digital environment and consequently affect the operations of companies. Similarly, the limited trust between governments and uncertainty about their intentions towards one another might have a negative impact on businesses by making their operations more difficult and costly.\nPrivate sector-led initiatives such as the Cybersecurity Tech Accord, the Charter of Trust, or the Global Transparency Initiative (spearheaded by Microsoft, Siemens, and Kaspersky respectively), have been regarded by governments as valuable self-regulatory initiatives, albeit resulting in little change in how states behave in cyberspace. The Tech Accord promotes a safer online environment 'by fostering collaboration among global technology companies committed to protecting their customers\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n73\n# Norms in cyberspace\nTimeline of key initiatives\nand users and helping them defend against malicious threats'. This position has emerged from an increasing conviction among Microsoft leaders and other companies that states are no longer only their counterparts in policymaking or regulators working for the benefit of their societies through the use of new technologies, but are also increasingly responsible for causing damage to internet users – and their clients – around the world. In that sense, while acknowledging the responsibilities of the private sector, the Tech Accord assigns a fair amount of blame for instability in cyberspace to state actors.6 In this new environment, private companies like Microsoft take on the traditional role reserved for governments, including the commitment\nto 'do more to protect and defend ... customers around the world' and calling on world leaders to 'implement international rules to protect the civilian use of the internet'.7\nIt is exactly this expansionist agenda, with private sector actors acceding to new functions traditionally reserved to governments, that has caused uneasiness among political leaders. A similar initiative, albeit more focused on self-regulation and promoting closer public-private cooperation, was launched by Siemens with the Charter of Trust. The initiative calls for binding rules and standards to build trust in cybersecurity and further advance digitalisation. To achieve these objectives it\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nproposed ten principles, including ownership of cyber and IT security, responsibility throughout the digital supply chain, certification for critical infrastructure and solutions, security by default, and user-centricity.\nThis type of norms entrepreneurship has evolved relatively quickly towards more hybrid formats that have led the private sector to work together with governments and civil society representatives. The best illustration of this kind of multi-stakeholder normative undertaking is the Paris Call for Trust and Security in Cyberspace launched at the Internet Governance Forum in 2018. Spearheaded by Microsoft and the French government, the Paris Call has over 500 signatories and has been endorsed by the European Commission. The text of the Paris Call – the outcome of negotiations between different groups – is a mix of normative commitments based on UN-driven processes and bottom-up driven commitments. Supporters of the Paris Call have agreed, inter alia, to increase prevention against and resilience to malicious online activity; protect the accessibility and integrity of the internet; cooperate in order to prevent interference in electoral processes; prevent the proliferation of malicious online programmes and techniques; and clamp down on online mercenary activities and offensive action by non-state actors.\nSome private sector companies have also invested heavily in initiatives aiming to protect their own reputation by promoting the norm of transparency. Microsoft was among the first companies to launch the Government Security Program (GSP) – an initiative with a global scope that provides national governments with controlled access to Microsoft Windows source code and other technical information they need in order to be confident in the enhanced security features of the Windows platform. As a Russia-based company with a global presence, Kaspersky Lab has often been accused of having too close ties with the Kremlin and portrayed as presenting a 'grave threat' to US national security. As a consequence, in 2017 President Trump signed into law legislation that bans the use of Kaspersky Lab products and services in federal agencies.⁸ In an unprecedented move towards regaining its reputation and international credibility, the company launched the Global Transparency Initiative aimed at engaging the broader information security community and other stakeholders in validating and verifying the trustworthiness of its products, internal processes, and business operations. It has also established three Transparency Centres in Switzerland, Spain and Malaysia that provide the opportunity to review the company's code, software updates, threat detection rules and other technical and business processes.⁹ To dismiss some of the concerns about the company's use of personal data, Kaspersky also decided to relocate its data storage and user data processing facilities from some regions as well as its software development infrastructure from Moscow to Switzerland. A similar approach was adopted by the Chinese company Huawei amidst the debate linked to its 5G service. In May 2019, Huawei decided to open a Cyber Security Transparency Centre in Brussels to showcase Huawei's end-to-end cybersecurity practices, to facilitate communication between Huawei and key stakeholders on cybersecurity strategies and end-to-end cyber security and privacy protection practices, as well as to provide a product security testing and verification platform. This initiative complements the Huawei Cyber Security Evaluation Centre, operating since November 2010 under a set of arrangements\n⁸ In 2018, Kaspersky filed lawsuits challenging the ban on its products in US government systems as stipulated by a Binding Operational Directive from the Department of Homeland Security and the 2018 National Defense Authorization Act.\n⁹ As of 3 October 2019.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n75\nbetween Huawei and the UK to mitigate any perceived risks arising from the involvement of Huawei in parts of the UK's critical national infrastructure.¹⁰\n# PRIVATE SECTOR AND CYBER-ENABLED SANCTIONS\nAnother form of active intervention is undertaken not by states and international organisations, but by major private firms, often in cooperation with law enforcement agencies or on the basis of government regulation. These are not (yet) considered traditional types of sanctions as incarnated in the sanctions regime adopted by the EU – even though they have a sanction-like effect. In such cases, companies may opt to use some of the tools and instruments at their disposal to deny or limit access to their services and products to users who violate their contractual obligations or other norms of responsible behaviour. Such actions could eventually take the form of what might be classified as cyber-enabled sanctions. Examples of such activities include Microsoft's takedown of botnets and Facebook's stepped-up efforts to block the access of users engaged in electoral interference and the proliferation of hate speech. Mentioning these instruments and understanding their functioning is important as they might in the future become as relevant as asset freezes and travel bans. This will require implementing additional legal and technological solutions but is not impossible.\n# Fight against cybercrime\nBotnets – networks of computers infected with malware – are one of the most common methods used by cyber criminals to execute phishing and ransomware attacks (e.g. Avalanche) or to distribute spam (e.g. Srizbi, Rustock). Malware allows criminals to take control of multiple infected computers at a distance and perform attacks using one or more command and control (C&amp;C) servers, making them capable of launching malicious attacks on a massive scale. The private sector plays a key role in helping take the botnets down, which from the technological point of view is a sanctioning mechanism (i.e. a restrictive measure imposed for a political goal or purpose). In 2015, Europol’s Cybercrime Centre (EC3) led an international campaign against the Ramit botnet whose primary goal was to harvest credentials such as online banking log-ins, passwords and personal files. Microsoft’s Digital Crime Unit took part in the takedown, alongside other industry partners Symantec and AnubisNetworks, by assisting Europol and national investigators from Germany, Italy, the Netherlands and the UK with shutting down the C&amp;C servers and redirecting 300 internet domain addresses used by the botnet’s operators.\nThere are also ‘hack backs’ undertaken by governments, as in the case of the government of the Netherlands intruding into the systems of cyber criminals. In one specific case, the Dutch National High Technology Crime Unit discerned the use of cryptographic software in a money laundering investigation, and identified an undisclosed issue with the service that allowed them to decrypt the criminal’s communications.¹¹ In another widely reported case in 2018, the Dutch AIVD intelligence service gained access to systems operated by a Russian hacking group which was widely considered to be state supported,¹² and maintained this level of access\n¹⁰ Cabinet Office, “Huawei cyber security evaluation centre oversight board: annual report 2019”, March 28, 2019, https://www.gov.uk/government/publications/huawei-cyber-security-evaluation-centre-oversight-board-annual-report-2019.\n¹¹ Lisa Vaas, “258,000 encrypted IronChat phone messages cracked by police”, November 9, 2018, https://nakedsecurity.sophos.com/2018/11/09/258000-encrypted-ironchat-phone-messages-cracked-by-police/\n¹² Rick Noack, “The Dutch were a secret U.S. ally in war against Russian hackers, local media reveal”, Washington Post, January 26, 2018.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nfor at least one year. The use of ‘hack backs’ as a self-help mechanism¹³ by private companies has caused a lot of controversy, with government officials taking a clear stand against such practices as ‘negatively affecting the already unclear rules of engagement in cyberspace’.¹⁴\n## Fight against terrorism\nThe private sector plays a relevant role also in the context of fighting terrorism. The UN’s 1267 Sanctions Committee concerning Daesh, al-Qaeda, and associated individuals and groups has adopted designation criteria for individuals providing web-hosting services under the rubric of ‘material support for the commitment of acts of terrorism or incitement to commit acts of terrorism.’ Internet hosting or cyber support has been included in 36 statements of case (designations of individuals where internet hosting was cited) as of February 2017, but significantly, it has never been the sole criterion for a listing. There is some reluctance (typically on the part of the US, due to first amendment concerns) to make this the principal basis for a designation, something that according to some observers can lead to gaps in enforcement, limiting the capacity of the committee to act in some instances. In theory, individual websites could be designated, but this has civil liberties implications and has thus far been avoided due to a significant potential for abuses by governments who might take advantage of such a development to silence political opponents.\nDesignations are made on the basis of prioritising those members of Daesh or al-Qaeda who are most likely to be exposed to the effects of sanctions. To date, the UN Security Council sanctions committee has been focused primarily on individuals engaged in incitement to violence, but online military training is also prohibited under arms embargoes applied by the committee. Large-scale cyberattacks emanating from Daesh were a possibility in the past, when the group controlled large amounts of territory and had access to substantial material resources. Today, counter-terrorism specialists at the UN anticipate that Daesh’s media presence will increase in the wake of their military defeat. This has strategic implications and Daesh may expand its presence in cyberspace, hence the prospect of more proactive engagement by the UN in the future. Daesh apparently still has access to financial assets, but the funds have been laundered into real estate and other concrete investments. Nonetheless, the use of malicious activities such as ransomware attacks to generate additional funds could become a serious problem in the future.\nThe surge in terrorist attacks and hate crimes by radical right-wing organisations in the US has brought the role of the private sector to the fore. While most of the measures aimed at limiting access to online platforms – such as the suspension of Twitter or Facebook accounts – are based on the violation of the terms and conditions of use, we have recently seen unprecedented steps taken by the private sector. Following the mass shooting in El Paso in August 2019, the discussion about access and use by radical right groups of online services such as anonymous message boards or communication platforms has intensified. As a consequence, 8chan – one such platform which\n---\n¹³ ‘Hack backs’ could be used as exploratory measures, to access services for attribution purposes, as preventive measures, to prevent an actor from doing harm, and as retaliatory measures for revenge. The last aspect is the most debated one.\n¹⁴ Jacqueline Thomsen, “Pentagon cyber official warns U.S. companies against ‘hacking back’”, The Hill, November 13, 2018. See also: Wyatt Hoffman and Steven Nyikos, “Governing Private Sector Self-Help in Cyberspace: Analogies from the Physical World”, Working Paper, Carnegie Endowment for International Peace, December 2018, https://carnegieendowment.org/files/Hoffman_Nyikos_Self_Help_FINAL_WEB_bio_edit.pdf; Sven Herpig, “Hackback ist nicht gleich Hackback”, SNV Impuls, July 24, 2018, https://www.stiftung-nv.de/de/publikation/hackback-ist-nicht-gleich-hackback.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n77\nhosted the anti-immigration manifesto of the man accused of the shooting – was taken down by the security company Cloudfare, which decided to no longer provide its services. Tocows, a company that helped register the website, has also withdrawn its support, leaving the message board without a functioning web address.¹⁵ Because websites like 8chan rely on a complex network of internet infrastructure companies, any of such small companies providing essential services (e.g. web addresses, cloud computing power, etc.) can play a critical role in enforcing a regime of cyber-enabled sanctions or de facto contribute to establishing such a regime through its self-regulatory practices.\nIn addition, organisations such as Tech Against Terrorism were created to prevent tech companies whose technology and products are exploited for terrorist activities incurring potential reputational damage. In a similar vein, to curb the spread of terrorist content online, Facebook, Microsoft, Twitter, and YouTube announced in 2017 the formation of the Global Internet Forum to Counter Terrorism. All these companies report significant progress in removing violent extremist content. For instance, between July 2017 and December 2017, a total of 274,460 Twitter accounts were permanently suspended for violations related to the promotion of terrorism. Facebook manages to detect 99% of Daesh and al-Qaeda-related terror content which is removed even before anyone in the forum or community concerned has flagged it. The terrorist attack in New Zealand in 2019 and the announcement of the Christchurch Call to eliminate terrorist and violent extremist content online have further reinforced the norm that the internet should remain a free, open and secure space for all and should not be abused as an arena for malicious cyber activities. Together with the growing focus on election interference, these two objectives might reinvigorate the discussion about cyber sanctions at the UN. Meanwhile, in the absence of progress in the sanctions discussion, some countries have taken unilateral measures. For instance, the UK conducted offensive cyber operations against\nDaesh terrorists in the Middle East designed to disrupt their ability to carry out attacks, protect British and coalition forces, and cripple Daesh’s online propaganda machine.\n# CONCLUSIONS\nSanctions are a political tool in the hands of governments. But they carry implications – often quite significant – for other actors, in particular in the private sector which needs to ensure compliance with the limitations imposed by governments. In that sense, the cyber sanctions regime put in place by the EU does not bring any new elements as it simply asks the private sector to comply with travel bans and implement asset freezes. However, the role of the private sector, when it comes to cyber sanctions, goes beyond the traditional private-public sector relationship whereby companies and businesses are simply required to comply with the provisions of the regulations. As a matter of fact, in the case of cyber sanctions – as adopted by the EU – this relationship and attendant dependencies are reversed. As this chapter has demonstrated, governments rely on the private sector for forensic and strategic information, thereby turning the security companies into quasi-intelligence services.\nIn addition to the operational cooperation, private sector actors have taken it upon themselves to shape the normative discussion about responsible behaviour in cyberspace. This move – even though not directly linked to the EU’s sanctions regime – might have broad implications for its application. As argued in earlier chapters, sanctions also play a signalling role in relation to the norms that they aim to promote and strengthen. The proliferation of normative initiatives by the private sector provides an additional dimension to the conversation and creates a new context within which sanctions may be implemented, especially if some of these new norms gain universal recognition.\n¹⁵ Kate Conger and Nathaniel Popper, “Behind the Scenes, 8chan Scrambles to Get Back Online”, New York Times, August 5, 2019.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nFinally, the private sector already plays the role of a sanctioning power in cyberspace. IT companies and social networks have the power to block access or disconnect individuals and entities who do not comply with their terms of reference or other accepted norms. The examples of the fight against cybercrime and terrorist use of the internet illustrate this point.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms"
    },
    "author_year": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "author_year"
      },
      "results": [],
      "flat_text": "European Union Institute for Security Studies (EUISS) Report Part Title: MULTIPLE MOONS Report Title: GUARDIAN OF THE GALAXY Report Subtitle: EU cyber sanctions and norms in cyberspace European Union Institute for Security Studies (EUISS) (2019) Stable URL: http://www.jstor.com/stable/resrep21136.11 JSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms JSTOR European Union Institute for Security Studies (EUISS) is collaborating with JSTOR to digitize, preserve and extend access to this content.\nThis content downloaded from 144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC All use subject to https://about.jstor.org/terms CHAPTER 7 # MULTIPLE MOONS Cyber sanctions and the role of the private sector ## INTRODUCTION Cyber diplomacy is not only the business of government. It also involves numerous other stakeholders, in particular from the private sector, that circle governments like multiple moons attracted by various gravitational forces. As stated in the opening chapters of this *Chailot Paper*, the effective use of cyber sanctioning mechanisms (e.g. travel bans and asset freezes) to coerce, constrain and/or signal behaviour in cyberspace often relies on good cooperation with industry and private actors, in particular when such technology belongs to or is operated by the private sector. The following sections discuss the different ways in which private sector actors orbit around governments and consequently play an important role in sanctions implementation, including for attribution, operational cooperation and norms development.\nIn addition to the potential impact of sanctions on how businesses operate (as discussed earlier on in this volume) – an aspect that has already been addressed in the literature on sanctions – it is important to highlight two alternative ways of thinking about ‘cyber sanctions’ as a tool used for the enforcement of norms in general. For instance, rather than targeting individuals, firms, government agencies or even sectors of economic activity in retaliation for cyberattacks, states may increasingly resort to cyber operations as a potentially less costly alternative to traditional sanctioning instruments. Some EU member states have openly admitted to conducting offensive cyber operations, such as the UK’s efforts to ‘take down’ websites used Constellation of issues in this chapter for recruitment of terrorists or the dissemination of information about bomb-making designs. There have been instances in which the UN Security Council has taken action to designate individuals for web-hosting activities as a part of its counterterrorism efforts.\n## PRIVATE SECTOR AND ATTRIBUTION An area where private actors, in particular private cybersecurity companies, have played a critical role is in the attribution of malicious cyber activities. With access to sophisticated computer forensic capabilities, private companies offer invaluable contributions by providing relevant and timely threat intelligence to This content downloaded from 144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC All use subject to https://about.jstor.org/terms CHAPTER 7 | Multiple moons Political risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies.\nThat also affects the standing of these companies vis-à-vis state intelligence agencies which oftentimes lag behind and heavily rely on the forensic evidence provided by private cyberintelligence agencies, consequently breaking the state's monopoly on pointing fingers at potential threats. There is, however, one clear difference in motivation for such extensive cooperation. Whereas state agencies are interested in knowing where the threat originates from in order to prepare adequate policy responses, for the private cybersecurity companies the primary concern is to protect their businesses and the interests of their clients, including in the member states (e.g. critical infrastructure). The potential trust issues typical for such cooperation have been partly overcome thanks to more structured and formalised partnerships with the government agencies. Through their membership in the advisory bodies, many of them have established permanent channels for engagement with the EU agencies, such as the Advisory Groups on Financial Services, Internet Security and Communication Providers with the Europol's European Cybercrime Centre (EC3) or the Advisory Group of the EU's Cybersecurity Agency (ENISA). The Industry 100 initiative by the UK's National Cyber Security Centre (NCSC) is another illustration of a more integrationist approach. Through the initiative, industry secondees work across a wide range of short-term placements at the NCSC, usually on a part-time basis.\nIn recent years, the private sector has been active in attributing malicious cyber operations to non-state actors associated with Russia, Iran, China, North Korea and the United States. While this has proven to be a growing business, This content downloaded from 144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC All use subject to https://about.jstor.org/terms Guardian of the Galaxy | EU cyber sanctions and norms in cyberspace many companies also point out that technical evidence provides insufficient grounds for political attribution and refrain from this type of activity. Furthermore, cybersecurity companies point out the fact that the growing accessibility and impact of cyber operations means that an increasing number of countries may embrace newly-available tools and techniques in the future. Such a politically powerful instrument needs to be handled with care. Political risks associated with a premature and potentially mistaken attribution are much higher for government agencies than for private sector companies. Therefore, governments need to be cautious and maintain a certain distance from such reports in order to avoid potential destabilisation and conflict with third countries. At the same time, some countries have expressed scepticism towards such reports due to the fear that given the location of tech companies in the US or Europe, some of them might deliberately do the governments' bidding.\nTo mitigate such risks, different initiatives have been launched to investigate the feasibility of establishing an international consortium that could enforce a standardised framework for threat actor-naming conventions and bring more transparency into reporting mechanisms, including indicators of compromise (IoCs). There is also an initiative underway among university-based centres and laboratories located in different countries, for a neutral, third-party attribution network that could combine technical knowledge of cyberattacks with political and institutional analysis of the motivations of potential attackers.\n# PRIVATE SECTOR AND NORM ENTREPRENEURSHIP In addition to state-led processes, several non-state initiatives spearheaded by the private sector have emerged as an important avenue for establishing norms of responsible behaviour in cyberspace, resulting in new relationships and dependencies for private-public relations. While seemingly insignificant, such initiatives might in the longer term establish the foundations of a new normative framework for state behaviour in cyberspace – one that might also rely on sanctions for its enforcement.\nThere are many reasons why private companies, whose primary focus is on profit and rewarding stakeholders, might be involved in such undertakings. Most see it as a way of creating a more favourable environment for conducting their business. Businesses thrive in stable regulatory environments, and the use of cyberspace for interstate conflict could undermine the overall trust in the digital environment and consequently affect the operations of companies. Similarly, the limited trust between governments and uncertainty about their intentions towards one another might have a negative impact on businesses by making their operations more difficult and costly.\nPrivate sector-led initiatives such as the Cybersecurity Tech Accord, the Charter of Trust, or the Global Transparency Initiative (spearheaded by Microsoft, Siemens, and Kaspersky respectively), have been regarded by governments as valuable self-regulatory initiatives, albeit resulting in little change in how states behave in cyberspace. The Tech Accord promotes a safer online environment 'by fostering collaboration among global technology companies committed to protecting their customers This content downloaded from 144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC All use subject to https://about.jstor.org/terms CHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector Timeline of key initiatives and users and helping them defend against malicious threats'. This position has emerged from an increasing conviction among Microsoft leaders and other companies that states are no longer only their counterparts in policymaking or regulators working for the benefit of their societies through the use of new technologies, but are also increasingly responsible for causing damage to internet users – and their clients – around the world. In that sense, while acknowledging the responsibilities of the private sector, the Tech Accord assigns a fair amount of blame for instability in cyberspace to state actors.6 In this new environment, private companies like Microsoft take on the traditional role reserved for governments, including the commitment to 'do more to protect and defend... customers around the world' and calling on world leaders to 'implement international rules to protect the civilian use of the internet'.7 It is exactly this expansionist agenda, with private sector actors acceding to new functions traditionally reserved to governments, that has caused uneasiness among political leaders. A similar initiative, albeit more focused on self-regulation and promoting closer public-private cooperation, was launched by Siemens with the Charter of Trust. The initiative calls for binding rules and standards to build trust in cybersecurity and further advance digitalisation. To achieve these objectives it This content downloaded from 144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC All use subject to https://about.jstor.org/terms Guardian of the Galaxy | EU cyber sanctions and norms in cyberspace proposed ten principles, including ownership of cyber and IT security, responsibility throughout the digital supply chain, certification for critical infrastructure and solutions, security by default, and user-centricity.\nThis type of norms entrepreneurship has evolved relatively quickly towards more hybrid formats that have led the private sector to work together with governments and civil society representatives. The best illustration of this kind of multi-stakeholder normative undertaking is the Paris Call for Trust and Security in Cyberspace launched at the Internet Governance Forum in 2018. Spearheaded by Microsoft and the French government, the Paris Call has over 500 signatories and has been endorsed by the European Commission. The text of the Paris Call – the outcome of negotiations between different groups – is a mix of normative commitments based on UN-driven processes and bottom-up driven commitments. Supporters of the Paris Call have agreed, inter alia, to increase prevention against and resilience to malicious online activity; protect the accessibility and integrity of the internet; cooperate in order to prevent interference in electoral processes; prevent the proliferation of malicious online programmes and techniques; and clamp down on online mercenary activities and offensive action by non-state actors.\nSome private sector companies have also invested heavily in initiatives aiming to protect their own reputation by promoting the norm of transparency. Microsoft was among the first companies to launch the Government Security Program (GSP) – an initiative with a global scope that provides national governments with controlled access to Microsoft Windows source code and other technical information they need in order to be confident in the enhanced security features of the Windows platform. As a Russia-based company with a global presence, Kaspersky Lab has often been accused of having too close ties with the Kremlin and portrayed as presenting a 'grave threat' to US national security. As a consequence, in 2017 President Trump signed into law legislation that bans the use of Kaspersky Lab products and services in federal agencies.⁸ In an unprecedented move towards regaining its reputation and international credibility, the company launched the Global Transparency Initiative aimed at engaging the broader information security community and other stakeholders in validating and verifying the trustworthiness of its products, internal processes, and business operations. It has also established three Transparency Centres in Switzerland, Spain and Malaysia that provide the opportunity to review the company's code, software updates, threat detection rules and other technical and business processes.⁹ To dismiss some of the concerns about the company's use of personal data, Kaspersky also decided to relocate its data storage and user data processing facilities from some regions as well as its software development infrastructure from Moscow to Switzerland. A similar approach was adopted by the Chinese company Huawei amidst the debate linked to its 5G service. In May 2019, Huawei decided to open a Cyber Security Transparency Centre in Brussels to showcase Huawei's end-to-end cybersecurity practices, to facilitate communication between Huawei and key stakeholders on cybersecurity strategies and end-to-end cyber security and privacy protection practices, as well as to provide a product security testing and verification platform. This initiative complements the Huawei Cyber Security Evaluation Centre, operating since November 2010 under a set of arrangements ⁸ In 2018, Kaspersky filed lawsuits challenging the ban on its products in US government systems as stipulated by a Binding Operational Directive from the Department of Homeland Security and the 2018 National Defense Authorization Act.\n⁹ As of 3 October 2019.\nThis content downloaded from 144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC All use subject to https://about.jstor.org/terms CHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n\n# PRIVATE SECTOR AND CYBER-ENABLED SANCTIONS\nAnother form of active intervention is undertaken not by states and international organisations, but by major private firms, often in cooperation with law enforcement agencies or on the basis of government regulation. These are not (yet) considered traditional types of sanctions as incarnated in the sanctions regime adopted by the EU – even though they have a sanction-like effect. In such cases, companies may opt to use some of the tools and instruments at their disposal to deny or limit access to their services and products to users who violate their contractual obligations or other norms of responsible behaviour. Such actions could eventually take the form of what might be classified as cyber-enabled sanctions. Examples of such activities include Microsoft's takedown of botnets and Facebook's stepped-up efforts to block the access of users engaged in electoral interference and the proliferation of hate speech. Mentioning these instruments and understanding their functioning is important as they might in the future become as relevant as asset freezes and travel bans. This will require implementing additional legal and technological solutions but is not impossible.\n# Fight against cybercrime\nBotnets – networks of computers infected with malware – are one of the most common methods used by cyber criminals to execute phishing and ransomware attacks (e.g. Avalanche) or to distribute spam (e.g. Srizbi, Rustock). Malware allows criminals to take control of multiple infected computers at a distance and perform attacks using one or more command and control (C&amp;C) servers, making them capable of launching malicious attacks on a massive scale. The private sector plays a key role in helping take the botnets down, which from the technological point of view is a sanctioning mechanism (i.e. a restrictive measure imposed for a political goal or purpose). In 2015, Europol’s Cybercrime Centre (EC3) led an international campaign against the Ramit botnet whose primary goal was to harvest credentials such as online banking log-ins, passwords and personal files. Microsoft’s Digital Crime Unit took part in the takedown, alongside other industry partners Symantec and AnubisNetworks, by assisting Europol and national investigators from Germany, Italy, the Netherlands and the UK with shutting down the C&amp;C servers and redirecting 300 internet domain addresses used by the botnet’s operators.\nThere are also ‘hack backs’ undertaken by governments, as in the case of the government of the Netherlands intruding into the systems of cyber criminals. In one specific case, the Dutch National High Technology Crime Unit discerned the use of cryptographic software in a money laundering investigation, and identified an undisclosed issue with the service that allowed them to decrypt the criminal’s communications.¹¹ In another widely reported case in 2018, the Dutch AIVD intelligence service gained access to systems operated by a Russian hacking group which was widely considered to be state supported,¹² and maintained this level of access\n¹⁰ Cabinet Office, “Huawei cyber security evaluation centre oversight board: annual report 2019”, March 28, 2019, https://www.gov.uk/government/publications/huawei-cyber-security-evaluation-centre-oversight-board-annual-report-2019.\n¹¹ Lisa Vaas, “258,000 encrypted IronChat phone messages cracked by police”, November 9, 2018, https://nakedsecurity.sophos.com/2018/11/09/258000-encrypted-ironchat-phone-messages-cracked-by-police/\n¹² Rick Noack, “The Dutch were a secret U.S. ally in war against Russian hackers, local media reveal”, Washington Post, January 26, 2018.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nGuardian of the Galaxy | EU cyber sanctions and norms in cyberspace\nfor at least one year. The use of ‘hack backs’ as a self-help mechanism¹³ by private companies has caused a lot of controversy, with government officials taking a clear stand against such practices as ‘negatively affecting the already unclear rules of engagement in cyberspace’.¹⁴\n## Fight against terrorism\nThe private sector plays a relevant role also in the context of fighting terrorism. The UN’s 1267 Sanctions Committee concerning Daesh, al-Qaeda, and associated individuals and groups has adopted designation criteria for individuals providing web-hosting services under the rubric of ‘material support for the commitment of acts of terrorism or incitement to commit acts of terrorism.’ Internet hosting or cyber support has been included in 36 statements of case (designations of individuals where internet hosting was cited) as of February 2017, but significantly, it has never been the sole criterion for a listing. There is some reluctance (typically on the part of the US, due to first amendment concerns) to make this the principal basis for a designation, something that according to some observers can lead to gaps in enforcement, limiting the capacity of the committee to act in some instances. In theory, individual websites could be designated, but this has civil liberties implications and has thus far been avoided due to a significant potential for abuses by governments who might take advantage of such a development to silence political opponents.\nDesignations are made on the basis of prioritising those members of Daesh or al-Qaeda who are most likely to be exposed to the effects of sanctions. To date, the UN Security Council sanctions committee has been focused primarily on individuals engaged in incitement to violence, but online military training is also prohibited under arms embargoes applied by the committee. Large-scale cyberattacks emanating from Daesh were a possibility in the past, when the group controlled large amounts of territory and had access to substantial material resources. Today, counter-terrorism specialists at the UN anticipate that Daesh’s media presence will increase in the wake of their military defeat. This has strategic implications and Daesh may expand its presence in cyberspace, hence the prospect of more proactive engagement by the UN in the future. Daesh apparently still has access to financial assets, but the funds have been laundered into real estate and other concrete investments. Nonetheless, the use of malicious activities such as ransomware attacks to generate additional funds could become a serious problem in the future.\nThe surge in terrorist attacks and hate crimes by radical right-wing organisations in the US has brought the role of the private sector to the fore. While most of the measures aimed at limiting access to online platforms – such as the suspension of Twitter or Facebook accounts – are based on the violation of the terms and conditions of use, we have recently seen unprecedented steps taken by the private sector. Following the mass shooting in El Paso in August 2019, the discussion about access and use by radical right groups of online services such as anonymous message boards or communication platforms has intensified. As a consequence, 8chan – one such platform which\n---\n¹³ ‘Hack backs’ could be used as exploratory measures, to access services for attribution purposes, as preventive measures, to prevent an actor from doing harm, and as retaliatory measures for revenge. The last aspect is the most debated one.\n¹⁴ Jacqueline Thomsen, “Pentagon cyber official warns U.S. companies against ‘hacking back’”, The Hill, November 13, 2018. See also: Wyatt Hoffman and Steven Nyikos, “Governing Private Sector Self-Help in Cyberspace: Analogies from the Physical World”, Working Paper, Carnegie Endowment for International Peace, December 2018, https://carnegieendowment.org/files/Hoffman_Nyikos_Self_Help_FINAL_WEB_bio_edit.pdf; Sven Herpig, “Hackback ist nicht gleich Hackback”, SNV Impuls, July 24, 2018, https://www.stiftung-nv.de/de/publikation/hackback-ist-nicht-gleich-hackback.\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC\nAll use subject to https://about.jstor.org/terms\nCHAPTER 7 | Multiple moons | Cyber sanctions and the role of the private sector\n\nIn addition, organisations such as Tech Against Terrorism were created to prevent tech companies whose technology and products are exploited for terrorist activities incurring potential reputational damage. In a similar vein, to curb the spread of terrorist content online, Facebook, Microsoft, Twitter, and YouTube announced in 2017 the formation of the Global Internet Forum to Counter Terrorism. All these companies report significant progress in removing violent extremist content. For instance, between July 2017 and December 2017, a total of 274,460 Twitter accounts were permanently suspended for violations related to the promotion of terrorism. Facebook manages to detect 99% of Daesh and al-Qaeda-related terror content which is removed even before anyone in the forum or community concerned has flagged it. The terrorist attack in New Zealand in 2019 and the announcement of the Christchurch Call to eliminate terrorist and violent extremist content online have further reinforced the norm that the internet should remain a free, open and secure space for all and should not be abused as an arena for malicious cyber activities. Together with the growing focus on election interference, these two objectives might reinvigorate the discussion about cyber sanctions at the UN. Meanwhile, in the absence of progress in the sanctions discussion, some countries have taken unilateral measures. For instance, the UK conducted offensive cyber operations against Daesh terrorists in the Middle East designed to disrupt their ability to carry out attacks, protect British and coalition forces, and cripple Daesh’s online propaganda machine.\n# CONCLUSIONS Sanctions are a political tool in the hands of governments. But they carry implications – often quite significant – for other actors, in particular in the private sector which needs to ensure compliance with the limitations imposed by governments. In that sense, the cyber sanctions regime put in place by the EU does not bring any new elements as it simply asks the private sector to comply with travel bans and implement asset freezes. However, the role of the private sector, when it comes to cyber sanctions, goes beyond the traditional private-public sector relationship whereby companies and businesses are simply required to comply with the provisions of the regulations. As a matter of fact, in the case of cyber sanctions – as adopted by the EU – this relationship and attendant dependencies are reversed. As this chapter has demonstrated, governments rely on the private sector for forensic and strategic information, thereby turning the security companies into quasi-intelligence services.\nIn addition to the operational cooperation, private sector actors have taken it upon themselves to shape the normative discussion about responsible behaviour in cyberspace. This move – even though not directly linked to the EU’s sanctions regime – might have broad implications for its application. As argued in earlier chapters, sanctions also play a signalling role in relation to the norms that they aim to promote and strengthen. The proliferation of normative initiatives by the private sector provides an additional dimension to the conversation and creates a new context within which sanctions may be implemented, especially if some of these new norms gain universal recognition.\n¹⁵ Kate Conger and Nathaniel Popper, “Behind the Scenes, 8chan Scrambles to Get Back Online”, New York Times, August 5, 2019.\nThis content downloaded from 144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC All use subject to https://about.jstor.org/terms Guardian of the Galaxy | EU cyber sanctions and norms in cyberspace Finally, the private sector already plays the role of a sanctioning power in cyberspace. IT companies and social networks have the power to block access or disconnect individuals and entities who do not comply with their terms of reference or other accepted norms. The examples of the fight against cybercrime and terrorist use of the internet illustrate this point.\nThis content downloaded from 144.82.114.237 on Wed, 23 Apr 2025 13:14:58 UTC All use subject to https://about.jstor.org/terms"
    }
  },
  "citation_summary": {
    "style": "superscript",
    "dominant_bucket": "tex",
    "dominant": {
      "intext_total": 16.0,
      "success_occurrences": 16.0,
      "success_unique": 8.0,
      "bib_unique_total": 12.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 0.6666666666666666,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "superscript"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 16.0,
        "success_occurrences": 16.0,
        "success_unique": 8.0,
        "bib_unique_total": 12.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.6666666666666666,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "superscript"
      },
      "numeric": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "All use subject to https://about.jstor.org/terms",
    "subtitle": "Cyber sanctions and the role of the private sector",
    "document_type": "book_chapter",
    "venue": "",
    "publication_year": 2019,
    "authors": [
      "MULTIPLE MOONS"
    ],
    "affiliations": [
      "European Union Institute for Security Studies (EUISS)",
      "European Union Institute for Security Studies (EUISS) (2019)",
      "European Union Institute for Security Studies (EUISS) is collaborating with JSTOR to digitize, preserve and extend access to this content."
    ],
    "emails": [
      "support@jstor.org"
    ],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "",
    "keywords": [],
    "publication_dates": {},
    "identifiers": {
      "doi": [],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "http://www.jstor.com/stable/resrep21136.11",
        "https://about.jstor.org/terms",
        "https://www.gov.uk/government/publications/huawei-cyber-security-evaluation-centre-oversight-board-annual-report-2019",
        "https://nakedsecurity.sophos.com/2018/11/09/258000-encrypted-ironchat-phone-messages-cracked-by-police",
        "https://carnegieendowment.org/files/Hoffman_Nyikos_Self_Help_FINAL_WEB_bio_edit.pdf",
        "https://www.stiftung-nv.de/de/publikation/hackback-ist-nicht-gleich-hackback"
      ]
    },
    "references_block_count": 0,
    "references_entries_estimated": 0,
    "heading_count": 9,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "no_abstract",
        "no_identifier"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 16,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 0.375,
      "footnote_coverage": 1.0,
      "unique_index_count": 8
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "superscript",
      "recommended_style": "superscript",
      "aligned": true,
      "signals": {
        "superscript_hits": 16,
        "superscript_definition_lines": 8,
        "numeric_bracket_hits": 0,
        "numeric_endnote_lines": 3,
        "author_year_hits": 0
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 12.0,
      "dominant_bib_coverage_rate": 0.6666666666666666,
      "dominant_link_target": "footnotes",
      "dominant_unresolved_flag": "unresolved_footnote_links"
    },
    "heading_validation": {
      "heading_count": 9,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": false,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": true,
        "emails": true,
        "orcids": false,
        "abstract": false,
        "keywords": false,
        "venue": false,
        "persistent_identifier": false,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 1,
        "affiliations": 3,
        "emails": 1,
        "orcids": 0,
        "keywords": 0,
        "doi": 0,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 6
      },
      "coverage": {
        "core_coverage": 0.6666666666666666,
        "email_author_link_rate": 0.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "no_abstract",
          "no_identifier"
        ],
        "toc_dot_lines": 0
      },
      "flags": [
        "meta_missing_abstract_and_keywords",
        "meta_missing_persistent_identifier",
        "meta_low_email_author_link_rate"
      ]
    },
    "flags": [
      "missing_preceding_text",
      "missing_reference_heading",
      "meta_missing_abstract_and_keywords",
      "meta_missing_persistent_identifier",
      "meta_low_email_author_link_rate"
    ]
  },
  "updated_at_utc": "2026-02-14T08:27:26.836300+00:00"
}