{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\3RKB6HUX\\DSMZEC52.pdf",
  "custom_id": "29",
  "response": {
    "id": "batch-b6235e9e-30-e3906595-523b-46be-aa76-edacb0710985",
    "custom_id": "29",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "198\n\n# A Vulnerability-Based Model of Cyber Weapons and its Implications for Cyber Conflict\n\nKarlis Podins and Christian Czosseck\nCooperative Cyber Defence Centre of Excellence, Tallinn, Estonia\nkarlis.podins@ccdcoe.org\nChristian.czosseck@ccdcoe.org\n\nAbstract: Throughout history, mankind has developed and employed novel weapons systems and equally novel countermeasures. Naturally, both offensive and defensive systems are limited by the laws of nature. Consequently, military concepts and doctrines were designed by implicitly taking into account those same limitations. The digital age has introduced a new class of weaponry that poses an initial challenge to our common understanding of conflict and warfare as for their different characteristics: cyber weapons. Cyber weapons and other terms like hacking are used frequently, commonly without giving clear definitions in the given context. We propose a restricted definition of cyber weapons as consisting primarily of data and knowledge, presenting themselves in the form of prepared and executed computer codes on or a sequence of user interactions with a vulnerable system. This article explores the crucial differences between the conventional weapons and cyber weapons domains, starting a debate on to which extent classical concepts and doctrines are applicable to cyber space and cyber conflict. This motivates a discussion on the role of vulnerabilities in IT systems and their impact to IT security and cyber attacks. The authors describe a vulnerability-based model for cyber weapons and for cyber defense. This model is then applied to describe the relationship between cyber-capable actors (e.g. nation-states). The proposed model clarifies important implications for cyber coalition-building, and disarmament. Furthermore, it presents a general solution for the problem of the destruction of cyber weapons, i.e. in the context of cyber arms control.\n\nKeywords: cyber weapons, cyber defense, disarmament, coalition, vulnerabilities\n\n# 1. Introduction\n\nAs conflicts have moved into cyberspace (and vice versa), a clear understanding of cyber weapon becomes a necessity. The development of weapons was always part of mankind's history. Weapons evolved to suit the tactics, but from time to time new weapons revolutionized the tactics and strategies of warfare. The developments of artillery, gunpowder, aviation or weapons of mass destruction are just some examples from recent history. They all caused dramatic changes on the face of the battlefield. But all those weapons developed so far have similar kinetic and/or thermal properties due to the shared physical domain.\n\nIn the cyber attacks on Estonia in 2007, a campaign of massive distributed denial of service (DDoS) attacks against government websites, paired with hacking attempts against valuable targets like ISP backbone routers, a new type of conflict became a reality (Evron, 2008). Many more politically motivated DDoS attacks followed (Nazario, 2009). It drew strong and inconsistent media attention, up to being termed the first cyber war in history, as discussed by (Farivar, 2009). While Article 5 of the North Atlantic Treaty, governing mutual support among NATO nations in case of an armed attack was not invoked, national security leadership around the world received a wakeup call. However, several years later we still have not seen a commonly agreed definition of cyber weapons or cyber warfare (Ottis &amp; Lorents, 2010).\n\nIn first section we are going to define basic terms and give short overview about special properties of cyber domain and cyber weapons. The concepts and terminology initially used were based on our understanding of conventional weapons or weapons of mass destruction (Sharma, 2009). Unfortunately, cyber weapons, being data and knowledge, follow other rules than their conventional counterparts. Thus the effects of cyber weapons on their target are different. In 2007 a direct, destructive cyber attack on a power generator was proven possible in a real life experiment (Herold, 2007). Latest prominent case, the Stuxnet virus, which is assumed to have sabotaged the Iran nuclear program starting from 2009, shows how powerful a cyber weapon in a real world setting can be (Falliere, Murchu, &amp; Chien, 2010; Langner, 2011). Some research states that conventional weapons framework is ineffective, is not applicable or has left a big gap between our assumptions about cyber weapons and reality (Sulek &amp; Moran, 2009). We do not want to get involved in this controversial discussion, but rather explicitly show some surprising aspects of cyber domain.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 1,
            "markdown": "199\n\nKarlis Podins and Christian Czosseck\n\nSection 2 of the paper introduces a vulnerability-based model of cyber conflict. We argue that knowledge about vulnerabilities is key element in understanding both cyber offense and cyber defense, and build a simplified model of cyber conflict around this idea.\n\nIn section 3 we will apply the vulnerability-based model on selected aspects of cyber conflicts. By using the proposed model to describe relationship and interactions between cyber-capable actors we demonstrate applications of proposed approach.\n\n2. The cyber domain and its weapons\n\nIn recent years, the prefix „Cyber“ has become quite common and was added to many existing terms with the intention of extending its meaning into cyberspace (Ottis &amp; Lorents, 2010). While terms like cyber war (warfare), cyber defense or cyber weapons are widely used, there is a lack of commonly accepted definition, and authors often use terms without precisely describing their meaning.\n\nIn the context of this paper we would like to offer the following definitions.\n\nDefinition 1: Cyber Weapon and Cyber Attack.\n\nA cyber weapon is data and knowledge that is capable of, designed to and executed with the intention to affect the integrity, availability and/or confidentiality of an IT system (target) without its owner's approval. The target's defense is overcome by abusing existing vulnerabilities in the target.\n\nApplication of cyber weapon shall be named a Cyber Attack.\n\nDefinition 2: Vulnerability.\n\nA vulnerability is an exploitable flaw in an IT system, which allows an attacker to usurp privileges or trust, access data or execute commands, he normally would not be allowed or expected to. This includes mis- or known default configuration but excludes social engineering means. Possible examples are: taking control of a system, reading or modifying information stored or processed or adding functionality.\n\nWhen starting discussions on conflicts in cyberspace, one should clearly understand the cyber domain and its special properties. Cyberspace differs from conventional weapons domains, some differences being minor while some are of the utmost importance. We believe that ignoring these differences and straight-forward application of established concepts especially on weapons has caused some of the confusion around the cyber domain. In the following an overview of key differences between the cyber domain and the domain of conventional arms is provided. As for space reasons, an analogy to the domains of nuclear, biological and chemical (NBC) weapons is not made.\n\nThe confusion can be easily explained just by looking at the definitions. While established concept assumes weapon to be a physical object, cyber weapon under proposed definition is knowledge and data derived from it.\n\nThe extent and severity of cyber attacks can vary as recent history has shown, from local (loss of email confidentiality due to loss of password) to nation-wide (Ottis, 2008). As for the time being, cyber attacks do not directly kill living beings, but can cause abuse of, malfunctions or the destruction of equipment. That, as a  $2^{\\text{nd}}$  or higher order result, can lead to a lethal effect or further destruction (Ziolkowski, 2010).\n\nThe distance between attacker and target is irrelevant for conducting the attack as long as there is connectivity between them. By connectivity we mean possibility to communicate between the attacker and the target, including not only wired or wireless media, but alsomethods to transfer information between air-gapped networks (see e.g. Falliere et al., 2010; Langner, 2011). Considering the Internet as the global network, all connected computers, smart phones, cars, industrial control systems (SCADA), or Internet enabled household electronics are just some of the possible targets. As of the very nature of the Internet a cyber attack can be initiated from any (connected) place on this planet to reach almost everywhere.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 2,
            "markdown": "Karlis Podins and Christian Czosseck\n\nLaunched attacks hit their target nearly instantly. While preparing a cyber attack might demand time consuming preparations, some of the effects could manifest itself in the blink of an eye. With this the defensive aspect of time, which can be used in conventional warfare to start a countermeasure against an attack, becomes less relevant.\n\nThere is no border or neutral area. National territory or borders on the Internet are only considered by legal departments, e.g. (Kelsey, 2008), but so far those concepts have almost no everyday practical meaning. While it is possible to cut or limit nation's connectivity to Internet, the consequences for any modern nation state are too bizarre to consider it a long term solution.\n\nThe attribution of an attack to a cyber attacker is, with technical means, nearly impossible (Hunker &amp; Hutchinson, 2008). While attribution might be possible by also considering information from other sources and by analyzing the behavior and beneficial outcome for other parties (Ottis, 2008), this is not guaranteed. The Conficker worm so far has not been attributed to any party, although considerable public and security community attention was focused to it, as well as USD 250,000 bounty was offered by Microsoft(\"Microsoft Collaborates With Industry to Disrupt Conficker Worm,\" 2009). If an attacker plots his attacks with enough care, he could even maintain a steady attack on his adversary without being identified (Lemay, Fernandez, &amp; Knight, 2010). But having, to a reasonable extent, a confirmed source is a common requirement for the attacked party to take active countermeasures, especially if they are of violent nature (Ziolkowski, 2010).\n\nCyber weapons do not have a physical nature, they are knowledge and data as defined above. To conduct a cyber attack, the attacker has to send data to the victim. Most can be made persistent, e.g. by writing a script or program and storing this on an IT system. Like ordinary files, those cyber weapons can then be copied without noteworthy costs so the number of copies of a cyber weapon is usually irrelevant. Storage and transportation of cyber weapons also seem easier than for physical counterparts, one party could even decide to keep a copy or even the whole cyber weapon arsenal outside its own borders, hiding it in different places all over the Internet.\n\nCyber weapons production costs are mainly human resources related. While we recognize the initial investment in R&amp;D as necessary, success of lone hackers and loose groups (Anonymous, LulzSec) shows that a lot can be achieved with limited funds. We believe that especially for a nation-state it is a minor expense compared to development of advanced conventional weapons. The production of conventional weapons depends mostly on the costs of fabrication, which often is a combination of labor costs, materials, machines and infrastructure. In contradiction to this, cyber weapons are constructed mainly by human knowledge on relatively cheap IT equipment. Their skills and knowledge in areas like software development, exploit development and penetration testing are the essence of the attack. Hiring the right personnel and keeping or extending their skills is the major investment needed to maintain or extend a cyber weapons arsenal (Miller, 2010).\n\nThe knowledge of a target's vulnerabilities and how to exploit them is of central importance to the attacker. On the other side, this knowledge is also the most important piece of information needed by the target of the attack to set up an efficient defense.\n\nThis leads us to the 1st paradox of cyber weapons: they are subject to time-decay. If a cyber weapon is exploiting a vulnerability, it is effective as long as the target IT system has this vulnerability. Vulnerabilities get discovered and patched, and target systems can change their software/hardware at their will, so the period of effectiveness for a cyber weapon is undefined, but likely to decrease the longer the vulnerability is known. This aspect is also discussed in (Moore, Friedman, &amp; Procaccia, 2010).\n\nThe  $2^{nd}$  paradox is that of cyber weapons usage may lead to the target enhancing its defense in a very short time. As soon as a cyber attack is executed, the target might have means in place to detect that an attack occurred and how it was conducted. While the initial attack might have been successful, the likelihood that a proper defense can be built after it is reasonably high, rendering the used cyber weapon useless against the same target and even against others in cases of existing cooperation or disclosure. An example is specially crafted malware. As soon as samples of a particular new malware get collected and analyzed, appropriate antivirus, IDS and software patching could be done rather fast. Still this is ultimately decided by the capabilities for the actors.\n\n200",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 3,
            "markdown": "Karlis Podins and Christian Czosseck\n\nThis has consequences for one's ability to test the effectiveness of cyber weapons. As soon as a certain cyber weapon is tested in the wild or even against the target itself, the likelihood is reasonably high to believe that security-aware targets will find a way to enhance their defense against the attack. (It is recognized that techniques are available to the attacker to re-launch the same attack using changed code, and that the target can only learn from an attack if he recognizes it in the first place.) But testing those attacks in a closed test environment will not always guarantee their successful later deployment, as it will be hard for the attacker to build a reasonably complete testing environment with the true attributes of the real target. Nevertheless, it has to be pointed out, that it is quite common to use commercial off-the-shelf hardware and software, which can also be easily acquired by the attacker in order to test his defenses.\n\nThe given unique attributes and examples support our opinion, that conventional arms and the ways we use them, are different from cyber weapons. This is why in the following section we propose a model to describe cyber domain and conflicts within.\n\n## 3. A vulnerability based view on cyber weapons\n\nThe actors (parties) of cyber incidents might be individuals, groups of individuals, companies or nation-states. All possible combinations of parties attacking each other with cyber weapons reflect different scenarios, which, depending on effects, we would call criminal acts, industrial espionage, terrorism, conflicts or even (cyber) war. While a discussion on mapping these terms in the cyber landscape might be reasonable, we would like to state that the proposed model is generic enough to be applicable to all of them, because it focuses on the underlying mechanics. Considering the scope of this paper, we will use the term cyber conflict for all those mentioned combinations.\n\n## 3.1 Vulnerabilities\n\nVulnerabilities, the knowledge about and the skills to exploit them, are of utter importance in any form of cyber conflict. It is quite clear that without exploitable vulnerabilities, cyber attacks would be pretty much limited to (D)DoS attacks (as they do not rely on a flaw in the target, but limit their targets' accessibility by exhausting bandwidth, CPU or other limited resource) or attempts to manipulate users through social engineering to get access to the target's system. To reflect that, we propose to take vulnerability as a basic entity and analyze cyber weapons and conflict by looking at them from a vulnerability point of view.\n\nVulnerabilities differ in their severity. Some of them enable an adversary to conduct a cyber attack against a target (e.g. root access), while some are likely not to be of any use to an attacker. The internationally recognized Common Vulnerability Scoring System introduces an open framework enabling one to score and compare the severity of a vulnerability based on its intrinsic qualities, its behavior over time and its environmental uniqueness (Mell, Scarfone, &amp; Romanosky, 2007). While comparing individual vulnerabilities, it makes a difference how severe every single one of them is. However, we will save a detailed examination of this issue for future research. For the moment, it might be safe to only consider those potentially leading to a complete violation of availability, confidentiality or integrity of an attacked IT system.\n\nThe dynamic nature of IT implies that the set of vulnerabilities changes over time. When new code gets installed, new vulnerabilities are added and/or other vulnerabilities get removed. There is a considerable amount of vulnerabilities publicly disclosed every day (e.g. at the National Vulnerability Database (Security, 2010)) but some vulnerabilities remain unpatched although known to the public for decades (Oiaga, 2010).\n\nNaturally, there exists a set of all vulnerabilities that are in the software installed somewhere. This is not constant and changes every time new software is installed, removed or configured. Each party has knowledge about some of the vulnerabilities. There are vulnerabilities unknown to all parties. As such the union of all parties known vulnerabilities still might not give all existing vulnerabilities.\n\n## 3.2 Cyber defense\n\nApparently a system without vulnerabilities is well defended against majority of cyber attack (apart from DoS based attacks). The defender of a target system has three options to render a vulnerability-based cyber weapon w useless.\n\n201",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 4,
            "markdown": "202\n\n# Karlis Podins and Christian Czosseck\n\nBy knowing about vulnerabilities exploited by $w$ and having own infrastructure immune against $w$ by patching its own systems accordingly;\n\nBy putting in place means to effectively make an existing, unpatched vulnerability not exposed to the attacker (e.g. by using firewalls hiding a service to the Internet or signature-based attack detection). This would also apply to vulnerabilities unknown to the defender but coincidentally covered;\n\nBy putting in place means to detect and mitigate cyber attacks before their effect manifests itself.\n\nOne could assume that cyber security aware parties have full control over and knowledge about their own IT assets, making sure not to be vulnerable to attacks they known by themselves (as they ultimately relay on vulnerabilities). Realty shows us that this does not hold true all the time, but nevertheless we keep this assumption for the sake of simplicity, assuming the target to be capable and willing for defending his cyber frontline.\n\n## 3.3 Cyber weapons development\n\nCyber Weapons are produced based on knowledge of target's vulnerabilities. It should be clear that before developing any weapon $w$, a party must have knowledge about the vulnerabilities the weapon will exploit and for any given weapon $w$ it is possible to find respective vulnerabilities.\n\nMore formally speaking, there exists a natural mapping $e$ from cyber weapons to vulnerabilities they exploit. For any given weapon $w$, the set $e(w)$ is either empty (in the case of a DoS attack or cases of social engineering) or it contains at least one vulnerability.\n\nSometimes, successfully attacked IT Systems can be used for manual or automated creation of (new) cyber weapons for further attacks, e.g. sending infected emails to all persons in contact list or probing the local network for other vulnerable machines.\n\nTo effectively enlarge one's weapons arsenal with new weapons, a party is required to find an additional vulnerability.\n\nAs time passes, other parties discover vulnerabilities in a non-deterministic manner. When a party discovers a vulnerability $v$, we can assume that their defenses are upgraded, making weapons exploiting vulnerability $v$ ineffective against party $p$. Research by Moore et al. (Moore et al., 2010) propose a similar vulnerability-based look but assumes the opposite, that own infrastructure is not patched not to warn the opposing parties of discovered vulnerabilities, coming to noteworthy conclusions.\n\nAdditionally, it seems reasonable to assume that the target party $t$ has adequate logging and attack detection systems in place and will be capable of identifying exploited vulnerabilities at least after they have been used by a cyber weapon, leading to improved cyber defense.\n\nThis stresses again the overlap between cyber attacks and defenses and vulnerability discovery plays a central role both for attackers and defenders.\n\n## 4. Implications on party relationships\n\nIn following section we will test vulnerability-based thinking by applying it to model cyber disarmament, coalitions, collective defense, pacifism and arms control.\n\n## 4.1 Cyber disarmament\n\nIn contrast to vague cyber disarmament discussion (Gjelten, 2010) the proposed model offers an effective method of cyber weapon disarmament, as asked for by (Cahill &amp; Rozinov, 2003). Disarmament of cyberspace could be achieved by public vulnerability disclosure. If a party wants to verifiably dismantle some of its cyber weapons, it could publicly disclose all the vulnerabilities used by them. Unlike in real-world disarmament, which affects only the disarming party, cyber disarmament is global. After other parties have adequately reacted to disclosed information, all cyber weapons using disclosed vulnerabilities are rendered useless. This is regardless if they are in the possession of the disarming party or by another party.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 5,
            "markdown": "Karlis Podins and Christian Czosseck\n\nBut there are further peculiarities. Unlike in the conventional weapons domain, if a party $p$ dismantles a set of cyber weapons by disclosing the respective vulnerabilities, defense of $p$ is not affected. Following our assumption that a party always tries to be protected against all known vulnerabilities, $p$ does not disclose a new attack vector against itself, leaving its adversaries without an advantage by this action.\n\n$P$'s offensive capabilities are decreased by an unknown factor, depending on how many other parties had the disclosed vulnerabilities in their IT systems.\n\n## 4.2 Cyber coalitions\n\nIf two or more parties would mutually agree on cyber disarmament, public vulnerability disclosure can be used with the consequences as described before. But an interesting approach would be a mutual vulnerability disclosure; it effectively means that cyber weapons involved in the mutual disarmament would be ineffective against other parties involved in the disarmament agreement, but still potentially effective against $3^{\\text{rd}}$ parties.\n\nBy exchanging information on vulnerabilities between each other one enables the other to build new weapons based on the newly learned vulnerabilities. But at the same moment both become immune to cyber attacks based on the exchanged vulnerabilities, as soon as they have implemented the necessary changes in their defense. Their offensive capabilities to attack each other decreases or remains the same.\n\nLet $c$ be any other $3^{\\text{rd}}$ party not part of the treaty or coalition between $a$ and $b$. With the newly won knowledge both parties $a$ and $b$ might have gain additional knowledge to build a cyber weapon $c$ is vulnerable to, enhancing their offensive capabilities against $c$ or at least remaining the same.\n\n## 4.3 Cooperative cyber defense\n\nBased on the definition of cyber defense given above, cooperation in cyber defense between two or more parties can manifest by exchanging of vulnerability information and/or attack detection procedures, if it provides tangible benefits to each party.\n\nBut in the case of vulnerability information exchange, there is no difference from the aforementioned cyber coalition. This leads to the observation that it is possible for cooperative cyber defense to be indistinguishable from a cyber coalition.\n\nTo arrange a cooperative cyber defense that is purely defensive in nature, the cooperation between the parties would be limited to the exchange of signatures and other attack detection information without sharing vulnerabilities per se. If knowledge about vulnerabilities shall also be shared without giving an offensive advantage to the parties, it must be done by public disclose with the consequences as described under cyber disarmament.\n\n## 4.4 Cyber pacifism\n\nPacific movement is usually limited to protest when in conventional weapons domain. But this could change in the cyber space.\n\nApart from voicing concerns about cyber weapons as discussed in (Rowe, 2007), a more active strategy could be to actively search for vulnerabilities and publicly disclose them as soon as possible. As in the case of cyber disarmament, it would universally destroy the corresponding cyber weapons, hitting the weapons arsenals of many parties simultaneously.\n\nAssuming enough resources are present, the cyber pacifist can have a significant impact on the cyber weapons arsenals of other nation-states without committing any aggressive actions. This again shows how different the cyber weapons world is, leading to new possibilities, but also new limitations.\n\n## 4.5 Cyber arms control\n\nA problem of what to do with cyber weapons found during an inspection as illegal under an Cyber Arms Control treaty is stated by Dorothy Denning (Denning, 2001). Within our proposed model, the",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 6,
            "markdown": "Karlis Podins and Christian Czosseck\n\nsame public disclosure procedure as for cyber disarmament could be applied, after the found cyber weapon got analyzed to identify the vulnerability exploited by it. Wherever other copies of discovered cyber weapon are stored, they all rely on the same vulnerability (or same set of vulnerabilities), by disclosing those vulnerabilities one can effectively neutralize each and every of those copies at the same time.\n\n## 5. Conclusion\n\nCyber weapons are a new type of armament that follows different rules than the established rules of conventional weapons or weapons of mass destruction. The revolutionary nature of cyber weapons as a means and method of warfare demands the creation of a new conflict model.\n\nThis article proposes a highly-simplified, vulnerabilities-based model that defines and describes cyber weapons and cyber defense. The authors analyzed the relationships between hypothetical parties who would develop and employ cyber weapons. The model revealed a number of important findings, such as the fact that a defensive alliance, in which the parties exchanged their knowledge of cyber vulnerabilities, would lead to an enhanced offensive capability by every member of the alliance. Further, the authors proposed a strategy for cyber attack deterrence based on the introduced model. The restricted definition of cyber weapons together with vulnerability-based model has been shown useful for solving cyber arms control problem, and we hope that the model will show useful in other problems as well.\n\nThe examples used in this article primarily highlight the typical roles expected of nation-states, but the authors believe that the model's principles will apply in the corporate world as well.\n\nDisclaimer: The opinions expressed here are those of the authors and should not be considered as the official policy of the NATO Cooperative Cyber Defence Centre of Excellence or NATO.\n\n## Acknowledgements\n\nBoth authors contributed equally. The opinions shared in this article are those of the authors and do not represent the views of NATO or its member states. The authors would like to thank Mr. Kenneth Geers and Prof. Peeter Lorents who gave us valuable feedback while writing this article.\n\n## References\n\nCahill, T., &amp; Rozinov, K. (2003). Cyber warfare peacekeeping. *Assurance Workshop*, 2003., (June).\nDenning, D. (2001). Obstacles and Options for Cyber Arms Control. *Arms Control in Cyberspace*, Heinrich Böll Foundation, Berlin, Germany, 1-13. Retrieved from http://faculty.nps.edu/dedennin/publications/berlin.pdf\nEvron, G. (2008). Battling botnets and online mobs: Estonia's defense efforts during the internet war. *Georgetown Journal of International Affairs*, 9(1), 121–126.\nFalliere, N., Murchu, L. O., &amp; Chien, E. (2010). W32. Stuxnet Dossier. *Symantec Security Response*, 3(November), 1-64. Symantec.\nFarivar, C. (2009). A Brief Examination of Media Coverage of Cyberattacks (2007 - Present). In C. Czosseck &amp; K. Geers (Eds.), *The Virtual Battlefield: Perspectives on Cyber Warfare* (p. 183). Amsterdam: IOS Press.\nGjelten, T. (2010). Debating Cyber Disarmament. *World Affairs*. Retrieved March 1, 2012, from http://www.worldaffairsjournal.org/article/shadow-wars-debating-cyber-disarmament\nHerold, R. (2007). DHS Exploding Generator Shows Dire Need For Better Computer Security. *Realtime IT Compliance*. www.realtime-itcompliance.com. Retrieved August 17, 2010, from http://www.realtime-itcompliance.com/information_security/2007/09/dhs_exploding_generator_shows.htm\nHunker, J., &amp; Hutchinson, B. (2008). Role and Challenges for Sufficient Cyber-Attack Attribution. Institute for Information Infrastructure Protection. Retrieved from http://www.thei3p.org/docs/publications/whitepaper-attribution.pdf\nKelsey, J. T. G. (2008). Hacking into International Humanitarian Law: The Principles of Distinction and Neutrality in the Age of Cyber Warfare. *Michigan Law Review*, (May), 1427-1452.\nLangner, R. (2011). Keynote speech on Stuxnet @ ICCC 2011. Tallinn: CCD COE Publications. Retrieved January 1, 2012, from http://www.ccdcoe.org/280.html\nLemay, A., Fernandez, J. M., &amp; Knight, S. (2010). Pinprick attacks, a lesser included case? In C. Czosseck &amp; K. Podins (Eds.), *Conference on Cyber Conflict Proceedings* (pp. 183 - 194). Tallinn: CCD COE Publications.\nMell, P., Scarfone, K., &amp; Romanosky, S. (2007). A complete guide to the common vulnerability scoring system version 2.0. *Published by FIRST-Forum of Incident Response and Security Teams* (pp. 1-23). Retrieved from http://www.first.org/cvss/cvss-guide.pdf\nMicrosoft Collaborates With Industry to Disrupt Conficker Worm. (2009). Retrieved January 3, 2012, from http://www.microsoft.com/presspass/press/2009/feb09/02-12confickerpr.mspx",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 7,
            "markdown": "Karlis Podins and Christian Czosseck\n\nMiller, C. (2010). Kim Jong-il and me: How to build a cyber army to attack the U.S. Tallinn: CCD COE Publications. Retrieved from http://www.ccdcoe.org/conference2010/agenda.html\n\nMoore, T., Friedman, A., &amp; Procaccia, A. D. (2010). Would a 'cyber warrior' protect us: exploring trade-offs between attack and defense of information systems. Proceedings of the 2010 workshop on New security paradigms (pp. 85–94). ACM. Retrieved from http://dl.acm.org/citation.cfm?id=1900559\n\nNazario, J. (2009). Politically Motivated Denial of Service Attacks. In C. Czosseck &amp; K. Geers (Eds.), The Virtual Battlefield: Perspectives on Cyber Warfare (pp. 163-181). 163-181: IOS Press.\n\nOiaga, M. (2010). Windows Blue Screens of Death After Patch for 17-Year Old Vulnerability Is Applied. Retrieved August 17, 2010, from http://news.softpedia.com/news/Windows-Blue-Screens-of-Death-after-Patch-for-17-Year-Old-Vulnerability-Is-Applied-134808.shtml\n\nOttis, R. (2008). Analysis of the 2007 Cyber Attacks Against Estonia from the Information Warfare Perspective. Proceedings of the 7th European Conference on Information Warfare (p. 163). Academic Conferences Limited.\n\nOttis, R., &amp; Lorents, P. (2010). Cyberspace: Definition and Implications. Proceedings of the 5th International Conference on Information Warfare and Security (pp. 267-270). Academic Publishing Limited.\n\nRowe, N. C. (2007). War Crimes from Cyber-weapons. Journal of Information Warfare, 6(3), 15–25. Retrieved from http://academic-conferences.org/pdfs/JIW6_3.pdf#page=21\n\nSecurity, D. O. H. (2010). National Vulnerability Database (NVD) Search Vulnerabilities. Retrieved August 17, 2010, from http://web.nvd.nist.gov/view/vuln/search?execution=e2s1\n\nSharma, A. (2009). Cyber Wars: A Paradigm Shift from Means to Ends. In C. Czosseck &amp; K. Geers (Eds.), The Virtual Battlefield: Perspectives on Cyber Warfare (Vol. 34, pp. 3-17). Amsterdam: IOS Press.\n\nSulek, D., &amp; Moran, N. (2009). What Analogies Can Tell Us About the Future of Cybersecurity. In C. Czosseck &amp; K. Geers (Eds.), The Virtual Battlefield: Perspectives on Cyber Warfare (pp. 118-131). Amsterdam: IOS Press.\n\nZiolkowski, K. (2010). Computer Network Operations and the Law of Armed Conflict. Military Law and the Law of War Review, (49), 47-94.\n\n205",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 8,
            "markdown": "nical Committee (CT 136) for information system security standards. In 1990, he was teaching at the University of Bristol, United Kingdom.\n\nDr Tim Watson is the Head of Department of Computer Technology at De Montfort University and the Director of its Centre for Secure Computing. Tim is a regular media commentator on information security and digital forensics and a member of various advisory groups, including DSTL's Cyber and Situational Awareness Information Exchange, the CESG Academic Advisory Group, the National Information Assurance Forum, the IAAC Academic Liaison Panel and the UK ISO 27000 series standards body.\n\nPeter Norris is a teacher fellow and principal lecturer at De Montfort University where he leads the security strand of the Center for Secure Computing. Originally trained as an engineer, he spent nine years in industry, before joining academia. He has advised local government on identity management, supervised research on network security, helped develop the UK input to ISO standards on both digital forensics and network security, and is currently researching the security of motor vehicle digital systems. His overarching interest is in the security consequences of the practical interaction of heterogeneous systems.\n\n# Biographies of Presenting Authors\n\nAndrew Adams is Professor of Information Ethics in the Graduate School of Business Administration and Deputy Director of the Centre for Business Information Ethics at Meiji University in Tokyo. He is the chair of ACM SIGCAS. He holds a BSc, MSC and PhD in Computing subjects and an LLM in Advanced Legal Studies.\n\nAdetunji Adebiyi is a Doctoral student with the University of East London UK. His research focuses on integrating security into software design during SDLC. He is a member of the British Computer Society. His research has led him to give talks and presentations in conferences and seminars he has attended.\n\nKari Alenius is Associate Professor in the Department of History at the University of Oulu, Finland, since 1998. He also has Adjunct Professorship at the University of Oulu (1997). His research interests include the history of propaganda and mental images, the history of Eastern Europe between the World Wars, and the history of ethnic minorities.\n\nOlga Angelopoulou is a lecturer in Digital Forensics at the University of Derby. She obtained a doctorate in Computing with the title: 'Analysis of Digital Evidence in Identity Theft Investigations'. Her research interests include Computer Forensics, Digital Evidence, Identity theft, Online fraud, Computer crime investigations and the Online Social Networking.\n\nRabia Aslanoglu got her B.S. degree from Izmir University of Economics, Department of Software Engineering in 2009. Currently, she is studying for her M.S. degree in Izmir Institute of Technology, Department of Computer Engineering, Izmir, Turkey. Her research interests are public-key cryptography and information warfare.\n\nMelanie Bernier is a Defence Scientist with the Defence Research and Development Canada's Center for Operational Research and Analysis. She has a Masters Degree in Electrical Engineering and experience in modelling and simulation, concept development and experimentation, joint C4ISR, and computer networks. She is currently leading studies in force development for the cyber environment.\n\nMatt Bishop received his Ph.D. in computer science from Purdue University in 1984. His main research areas are the analysis of vulnerabilities in computer systems, security of electronic voting systems and election processes, and data sanitization, network security, and malware analysis. His textbook, Computer Security: Art and Science, was published in 2002 by Addison-Wesley Professional.\n\nAbilio Fernando Costa Cardoso, Occupation or position held: Researcher in Cloud Computing, IT governance and computer networks, professor at Department of Innovation, Science and Technology, manager of IT area at Portucalense University. M Sc in Computer Science, 1995, B Sc in Applied Mathematics, 1987, Class teaching: Project planning and network management, Java advanced programming\n\nChristian Czosseck is scientist at the NATO CCD COE in Tallinn, Estonia. Serving in the German military for more than 14 years, he held several information assurance positions. Christian holds a M.Sc. equivalent\n\n![img-0.jpeg](img-0.jpeg)",
            "images": [
              {
                "id": "img-0.jpeg",
                "top_left_x": 1280,
                "top_left_y": 145,
                "bottom_right_x": 1490,
                "bottom_right_y": 355,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 9,
            "markdown": "in computer science and is currently PhD candidate at the Estonian BusinessSchool, Tallinn looking into cyber security and botnet related issues.\n\nMichel Dubois is teacher and researcher at the Cryptology and Operational Virology (C+V)° laboratory. Currently he is a PhD student in cryptography and works on a new approach of the cryptanalysis of the AES.\n\nTim Hartog graduated in 2005 at the Technical University of Twente, he has been active in the field of Information Security. During his work at TNO, the Dutch Organization for Applied Scientific Research, Tim has been working on topics like Trusted Computing, Trusted Operating Systems and Cross Domain Solutions.\n\nMajor Arto Hirvelä is instructor (leadership) in Research Group at the Finnish National Defence University. His research interests are information environment, strategic communication and information operations.\n\nDr. Berg P. Hyacinthe (Ph.D., Florida State University; LLD Candidate, Assas School of Law, CERSA-CNRS, en Sorbonne) is Director of the \"Centre de Recherche Scientifique et d'Études Cybernétiques\" (CRESEC) at \"l'Université d'État d'Haiti\". His research agenda is set at the intersection of law and technology, exploring legality/illegality of advanced digital technologies in armed conflicts.\n\nAnna-Marie Jansen van Vuuren began her career as a journalist in 2004. She holds a Masters degree in Journalism and Media Management from the University of Stellenbosch and currently she is pursuing a Ph.D. at the University of Pretoria. Anna-Marie is a lecturer at the University of the Witwatersrand and freelances as a broadcast journalist and producer at the South African Broadcast Corporation.\n\nJoey Jansen van Vuuren is the Research Group Leader for Cyber Defence at the CSIR South Africa. , mainly involved in research for the Defence and Government sectors.. She obtained her Masters from UNISA and her research is focussed on National Cybersecurity and the analysis of Cyber threads. She is also involved in Cyber awareness programs in South Africa\n\nSaara Jantunen has studied English language and culture in the University of Groningen, and English philology in the University of Helsinki. Currently she is writing her doctoral dissertation in the Finnish National Defence University, where she majors in leadership. Her research interests include language and identity, ideology in discourse, strategic communication and multimodal discourse. Jantunen currently works in education.\n\nRoman Jašek is the head of Department of Informatics and Artificial Intelligence, Faculty of Applied Informatics, Tomas Bata University in Zlín. His habilitation thesis focused on implementing information security paradigm into commercial organizations as well as tertiary education institutions. Professional interests include computer security auditing, knowledge protection, information systems, and informatics.\n\nEli Jellenc leads analysis of geopolitical cyber security and directs research operations in the EU and Japan for VeriSign-iDefense, where he previously created the International Cyber Intelligence unit. He holds an MA in International Security from Georgetown University, and has authored 3 cyber risk country-profiles in the \"Cybercrime and Security\" journal (Oxford University Press).\n\nJeremy Julien is an Engineering student at the ESIEA school in France. Jeremy has been responsible for the plotting of our keywords and related cables. Jeremy also assisted Nils by searching for related cables, keywords and other relevant sources.\n\nHarry Kantola is working as a teacher at the department of tactics and operational arts in Finnish National Defense University (FNDU), teaching senior staff officers. Kantola has studied (Masters of arts) in Swedish National Defense College (SNDC) and to General Staff Officer at FNDU. His thesis at these schools dealt with CNO in general.\n\nAnssi Kärkkäinen Captain, M.Sc. (Eng.) graduated from the Finnish National Defence University in 2000. He also graduated a Master of Science (Engineering) degree from Helsinki University of Technology (currently Aalto University) in 2005. Currently he is carrying out doctoral studies at the same university. His current assignment is a Staff Engineer for Defence Command Finland.\n\nWilliam Aubrey Labuschagne lectured programming, networking, and security subjects at Tshwane University of Technology (TUT) 2002-2009. Obtained Red Hat Certified Technician (RHCT - 2006) and is qualified SCRUM Master (Scrum Alliance). Qualifications consist of NDip: Computer System Engineering and\n\nix",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 10,
            "markdown": "BTech: Information Technology at Pretoria Technikon Currently completing MTech at UNISA in field of security awareness in rural areas and is technologist at CSIR.\n\nPierre Leandre is a student in his second year at ESIEA where he study informatics and electronics. At school he is part of the OCV lab (Operational Cryptology and Virology Laboratory).\n\nSylvain (Sly) Leblanc is an Assistant Professor at the Royal Military College of Canada. Sly was a Canadian Army Signals Officer for over 20 years, where he developed his interest in computer network operations. His research interests are in computer security and computer network operations.\n\nAndrew Nicholson received his Masters degree in Computer Security in 2010 at De Montfort, University in England. In 2010 Andrew began PhD research looking into attribution of cyber attacks. He is a member of the De Montfort University Cyber Security Centre (CSC) research group. Andrews main interests are network security, cyber-conflict and online anonymity.\n\nMzukisi Niven Njotini is a currently working as a lecturer in College of Law at the University of South Africa (South Africa). Njotini has an LLB and LLM (Cum Laude) degree and is currently enrolled for an LLD or PhD degree. Njotini's area of speciality is information technology law.\n\nAzah Norman BA(Hons.) in Information Science from National University of Malaysia (UKM) (2000) and Masters in Secure e-Commerce from Royal Holloway University of London, United Kingdom (2003). Research focuses on information systems security and e-commerce. Worked as a consultant in a Malaysian premier security company under Malaysia's national information &amp; communication technology corporation (over three years). Research medals for research in Halal-RFID verification and currently pursuing PhD in information systems security management.\n\nKarlis Podins has graduated University of Latvia with master degree in Computer Science, and is working for Cooperative Cyber Defence Centre of Excellence since 2008. Apart from dormant interest in Finite Automata and Natural Language Processing, his research has touched several areas related to security.\n\nDr Graeme Pye is a Lecturer with the School of Information Systems, Deakin University, Australia. His research is continuing to focus on investigating the security and resilience aspects of Australian critical infrastructure and the relationships between associated infrastructures. Furthermore, he is also interested in modelling emergency management and disaster response systems, including resilience and security management aspects.\n\nNeil Rowe is Professor of Computer Science at the U.S. Naval Postgraduate School where he has been since 1983. He has a Ph.D. in Computer Science from Stanford University (1983). His main research interests are the modeling of deception, information security, surveillance systems, image processing, and data mining.\n\nMirva Salminen (M.Soc.Sc.) is a doctoral candidate at the University of Lapland, Finland, researching on the outsourcing of the state's security related functions. She has studied International Relations and Political Science at the University of Tampere, Finland; Military History and Strategy at the Finnish National Defence University; and Security Studies at Aberystwyth University, the UK.\n\nLibor Sarga is a doctoral worker at the Department of Statistics and Quantitative Methods, Faculty of Management and Economics, Tomas Bata University in Zlín. His dissertation will be focused on computer and data security in the presence of unreliable human element as an exploitable attack vector. His personal interests include technology, hardware and software architectures.\n\nEmad Shafie PhD student at The Software Technology Research Laboratory, in De Montfort University, I have achieved a master degree in Information technology 2009 from De Montfort University and bachelor degree in computer science 2000 from King Abdul-Aziz University. I have worked as leader of programming department for five years at Umu Alqura University in Saudi Arabia.\n\nTorsti Siren Lieutenant Colonel, General Staff, Ph.D. (Pol. Sc.), B.A. (Slavonic philology) Torsti Siren is Head of Research Group in the Department of Leadership and Military Pedagogy at the Finnish National Defence University, Helsinki.\n\nIgnus Swart obtained his masters degree in computer science at Tshwane University of Technology where he studied with a full scholarship. After several years working as both a software developer and security pro\n\nx",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 11,
            "markdown": "Reproduced with permission of the copyright owner. Further reproduction prohibited without permission.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2200,
              "width": 1700
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 12,
          "doc_size_bytes": 1520942
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "198\n# A Vulnerability-Based Model of Cyber Weapons and its Implications for Cyber Conflict\nKarlis Podins and Christian Czosseck\nCooperative Cyber Defence Centre of Excellence, Tallinn, Estonia\nkarlis.podins@ccdcoe.org\nChristian.czosseck@ccdcoe.org\nAbstract: Throughout history, mankind has developed and employed novel weapons systems and equally novel countermeasures. Naturally, both offensive and defensive systems are limited by the laws of nature. Consequently, military concepts and doctrines were designed by implicitly taking into account those same limitations. The digital age has introduced a new class of weaponry that poses an initial challenge to our common understanding of conflict and warfare as for their different characteristics: cyber weapons. Cyber weapons and other terms like hacking are used frequently, commonly without giving clear definitions in the given context. We propose a restricted definition of cyber weapons as consisting primarily of data and knowledge, presenting themselves in the form of prepared and executed computer codes on or a sequence of user interactions with a vulnerable system. This article explores the crucial differences between the conventional weapons and cyber weapons domains, starting a debate on to which extent classical concepts and doctrines are applicable to cyber space and cyber conflict. This motivates a discussion on the role of vulnerabilities in IT systems and their impact to IT security and cyber attacks. The authors describe a vulnerability-based model for cyber weapons and for cyber defense. This model is then applied to describe the relationship between cyber-capable actors (e.g. nation-states). The proposed model clarifies important implications for cyber coalition-building, and disarmament. Furthermore, it presents a general solution for the problem of the destruction of cyber weapons, i.e. in the context of cyber arms control.\nKeywords: cyber weapons, cyber defense, disarmament, coalition, vulnerabilities\n# 1. Introduction\nAs conflicts have moved into cyberspace (and vice versa), a clear understanding of cyber weapon becomes a necessity. The development of weapons was always part of mankind's history. Weapons evolved to suit the tactics, but from time to time new weapons revolutionized the tactics and strategies of warfare. The developments of artillery, gunpowder, aviation or weapons of mass destruction are just some examples from recent history. They all caused dramatic changes on the face of the battlefield. But all those weapons developed so far have similar kinetic and/or thermal properties due to the shared physical domain.\nIn the cyber attacks on Estonia in 2007, a campaign of massive distributed denial of service (DDoS) attacks against government websites, paired with hacking attempts against valuable targets like ISP backbone routers, a new type of conflict became a reality (Evron, 2008). Many more politically motivated DDoS attacks followed (Nazario, 2009). It drew strong and inconsistent media attention, up to being termed the first cyber war in history, as discussed by (Farivar, 2009). While Article 5 of the North Atlantic Treaty, governing mutual support among NATO nations in case of an armed attack was not invoked, national security leadership around the world received a wakeup call. However, several years later we still have not seen a commonly agreed definition of cyber weapons or cyber warfare (Ottis &amp; Lorents, 2010).\nIn first section we are going to define basic terms and give short overview about special properties of cyber domain and cyber weapons. The concepts and terminology initially used were based on our understanding of conventional weapons or weapons of mass destruction (Sharma, 2009). Unfortunately, cyber weapons, being data and knowledge, follow other rules than their conventional counterparts. Thus the effects of cyber weapons on their target are different. In 2007 a direct, destructive cyber attack on a power generator was proven possible in a real life experiment (Herold, 2007). Latest prominent case, the Stuxnet virus, which is assumed to have sabotaged the Iran nuclear program starting from 2009, shows how powerful a cyber weapon in a real world setting can be (Falliere, Murchu, &amp; Chien, 2010; Langner, 2011). Some research states that conventional weapons framework is ineffective, is not applicable or has left a big gap between our assumptions about cyber weapons and reality (Sulek &amp; Moran, 2009). We do not want to get involved in this controversial discussion, but rather explicitly show some surprising aspects of cyber domain.\n199\nKarlis Podins and Christian Czosseck\nSection 2 of the paper introduces a vulnerability-based model of cyber conflict. We argue that knowledge about vulnerabilities is key element in understanding both cyber offense and cyber defense, and build a simplified model of cyber conflict around this idea.\nIn section 3 we will apply the vulnerability-based model on selected aspects of cyber conflicts. By using the proposed model to describe relationship and interactions between cyber-capable actors we demonstrate applications of proposed approach.\n2. The cyber domain and its weapons\nIn recent years, the prefix „Cyber“ has become quite common and was added to many existing terms with the intention of extending its meaning into cyberspace (Ottis &amp; Lorents, 2010). While terms like cyber war (warfare), cyber defense or cyber weapons are widely used, there is a lack of commonly accepted definition, and authors often use terms without precisely describing their meaning.\nIn the context of this paper we would like to offer the following definitions.\nDefinition 1: Cyber Weapon and Cyber Attack.\nA cyber weapon is data and knowledge that is capable of, designed to and executed with the intention to affect the integrity, availability and/or confidentiality of an IT system (target) without its owner's approval. The target's defense is overcome by abusing existing vulnerabilities in the target.\nApplication of cyber weapon shall be named a Cyber Attack.\nDefinition 2: Vulnerability.\nA vulnerability is an exploitable flaw in an IT system, which allows an attacker to usurp privileges or trust, access data or execute commands, he normally would not be allowed or expected to. This includes mis- or known default configuration but excludes social engineering means. Possible examples are: taking control of a system, reading or modifying information stored or processed or adding functionality.\nWhen starting discussions on conflicts in cyberspace, one should clearly understand the cyber domain and its special properties. Cyberspace differs from conventional weapons domains, some differences being minor while some are of the utmost importance. We believe that ignoring these differences and straight-forward application of established concepts especially on weapons has caused some of the confusion around the cyber domain. In the following an overview of key differences between the cyber domain and the domain of conventional arms is provided. As for space reasons, an analogy to the domains of nuclear, biological and chemical (NBC) weapons is not made.\nThe confusion can be easily explained just by looking at the definitions. While established concept assumes weapon to be a physical object, cyber weapon under proposed definition is knowledge and data derived from it.\nThe extent and severity of cyber attacks can vary as recent history has shown, from local (loss of email confidentiality due to loss of password) to nation-wide (Ottis, 2008). As for the time being, cyber attacks do not directly kill living beings, but can cause abuse of, malfunctions or the destruction of equipment. That, as a  $2^{\\text{nd}}$  or higher order result, can lead to a lethal effect or further destruction (Ziolkowski, 2010).\nThe distance between attacker and target is irrelevant for conducting the attack as long as there is connectivity between them. By connectivity we mean possibility to communicate between the attacker and the target, including not only wired or wireless media, but alsomethods to transfer information between air-gapped networks (see e.g. Falliere et al., 2010; Langner, 2011). Considering the Internet as the global network, all connected computers, smart phones, cars, industrial control systems (SCADA), or Internet enabled household electronics are just some of the possible targets. As of the very nature of the Internet a cyber attack can be initiated from any (connected) place on this planet to reach almost everywhere.\nKarlis Podins and Christian Czosseck\nLaunched attacks hit their target nearly instantly. While preparing a cyber attack might demand time consuming preparations, some of the effects could manifest itself in the blink of an eye. With this the defensive aspect of time, which can be used in conventional warfare to start a countermeasure against an attack, becomes less relevant.\nThere is no border or neutral area. National territory or borders on the Internet are only considered by legal departments, e.g. (Kelsey, 2008), but so far those concepts have almost no everyday practical meaning. While it is possible to cut or limit nation's connectivity to Internet, the consequences for any modern nation state are too bizarre to consider it a long term solution.\nThe attribution of an attack to a cyber attacker is, with technical means, nearly impossible (Hunker &amp; Hutchinson, 2008). While attribution might be possible by also considering information from other sources and by analyzing the behavior and beneficial outcome for other parties (Ottis, 2008), this is not guaranteed. The Conficker worm so far has not been attributed to any party, although considerable public and security community attention was focused to it, as well as USD 250,000 bounty was offered by Microsoft(\"Microsoft Collaborates With Industry to Disrupt Conficker Worm,\" 2009). If an attacker plots his attacks with enough care, he could even maintain a steady attack on his adversary without being identified (Lemay, Fernandez, &amp; Knight, 2010). But having, to a reasonable extent, a confirmed source is a common requirement for the attacked party to take active countermeasures, especially if they are of violent nature (Ziolkowski, 2010).\nCyber weapons do not have a physical nature, they are knowledge and data as defined above. To conduct a cyber attack, the attacker has to send data to the victim. Most can be made persistent, e.g. by writing a script or program and storing this on an IT system. Like ordinary files, those cyber weapons can then be copied without noteworthy costs so the number of copies of a cyber weapon is usually irrelevant. Storage and transportation of cyber weapons also seem easier than for physical counterparts, one party could even decide to keep a copy or even the whole cyber weapon arsenal outside its own borders, hiding it in different places all over the Internet.\nCyber weapons production costs are mainly human resources related. While we recognize the initial investment in R&amp;D as necessary, success of lone hackers and loose groups (Anonymous, LulzSec) shows that a lot can be achieved with limited funds. We believe that especially for a nation-state it is a minor expense compared to development of advanced conventional weapons. The production of conventional weapons depends mostly on the costs of fabrication, which often is a combination of labor costs, materials, machines and infrastructure. In contradiction to this, cyber weapons are constructed mainly by human knowledge on relatively cheap IT equipment. Their skills and knowledge in areas like software development, exploit development and penetration testing are the essence of the attack. Hiring the right personnel and keeping or extending their skills is the major investment needed to maintain or extend a cyber weapons arsenal (Miller, 2010).\nThe knowledge of a target's vulnerabilities and how to exploit them is of central importance to the attacker. On the other side, this knowledge is also the most important piece of information needed by the target of the attack to set up an efficient defense.\nThis leads us to the 1st paradox of cyber weapons: they are subject to time-decay. If a cyber weapon is exploiting a vulnerability, it is effective as long as the target IT system has this vulnerability. Vulnerabilities get discovered and patched, and target systems can change their software/hardware at their will, so the period of effectiveness for a cyber weapon is undefined, but likely to decrease the longer the vulnerability is known. This aspect is also discussed in (Moore, Friedman, &amp; Procaccia, 2010).\nThe  $2^{nd}$  paradox is that of cyber weapons usage may lead to the target enhancing its defense in a very short time. As soon as a cyber attack is executed, the target might have means in place to detect that an attack occurred and how it was conducted. While the initial attack might have been successful, the likelihood that a proper defense can be built after it is reasonably high, rendering the used cyber weapon useless against the same target and even against others in cases of existing cooperation or disclosure. An example is specially crafted malware. As soon as samples of a particular new malware get collected and analyzed, appropriate antivirus, IDS and software patching could be done rather fast. Still this is ultimately decided by the capabilities for the actors.\n200\nKarlis Podins and Christian Czosseck\nThis has consequences for one's ability to test the effectiveness of cyber weapons. As soon as a certain cyber weapon is tested in the wild or even against the target itself, the likelihood is reasonably high to believe that security-aware targets will find a way to enhance their defense against the attack. (It is recognized that techniques are available to the attacker to re-launch the same attack using changed code, and that the target can only learn from an attack if he recognizes it in the first place.) But testing those attacks in a closed test environment will not always guarantee their successful later deployment, as it will be hard for the attacker to build a reasonably complete testing environment with the true attributes of the real target. Nevertheless, it has to be pointed out, that it is quite common to use commercial off-the-shelf hardware and software, which can also be easily acquired by the attacker in order to test his defenses.\nThe given unique attributes and examples support our opinion, that conventional arms and the ways we use them, are different from cyber weapons. This is why in the following section we propose a model to describe cyber domain and conflicts within.\n## 3. A vulnerability based view on cyber weapons\nThe actors (parties) of cyber incidents might be individuals, groups of individuals, companies or nation-states. All possible combinations of parties attacking each other with cyber weapons reflect different scenarios, which, depending on effects, we would call criminal acts, industrial espionage, terrorism, conflicts or even (cyber) war. While a discussion on mapping these terms in the cyber landscape might be reasonable, we would like to state that the proposed model is generic enough to be applicable to all of them, because it focuses on the underlying mechanics. Considering the scope of this paper, we will use the term cyber conflict for all those mentioned combinations.\n## 3.1 Vulnerabilities\nVulnerabilities, the knowledge about and the skills to exploit them, are of utter importance in any form of cyber conflict. It is quite clear that without exploitable vulnerabilities, cyber attacks would be pretty much limited to (D)DoS attacks (as they do not rely on a flaw in the target, but limit their targets' accessibility by exhausting bandwidth, CPU or other limited resource) or attempts to manipulate users through social engineering to get access to the target's system. To reflect that, we propose to take vulnerability as a basic entity and analyze cyber weapons and conflict by looking at them from a vulnerability point of view.\nVulnerabilities differ in their severity. Some of them enable an adversary to conduct a cyber attack against a target (e.g. root access), while some are likely not to be of any use to an attacker. The internationally recognized Common Vulnerability Scoring System introduces an open framework enabling one to score and compare the severity of a vulnerability based on its intrinsic qualities, its behavior over time and its environmental uniqueness (Mell, Scarfone, &amp; Romanosky, 2007). While comparing individual vulnerabilities, it makes a difference how severe every single one of them is. However, we will save a detailed examination of this issue for future research. For the moment, it might be safe to only consider those potentially leading to a complete violation of availability, confidentiality or integrity of an attacked IT system.\nThe dynamic nature of IT implies that the set of vulnerabilities changes over time. When new code gets installed, new vulnerabilities are added and/or other vulnerabilities get removed. There is a considerable amount of vulnerabilities publicly disclosed every day (e.g. at the National Vulnerability Database (Security, 2010)) but some vulnerabilities remain unpatched although known to the public for decades (Oiaga, 2010).\nNaturally, there exists a set of all vulnerabilities that are in the software installed somewhere. This is not constant and changes every time new software is installed, removed or configured. Each party has knowledge about some of the vulnerabilities. There are vulnerabilities unknown to all parties. As such the union of all parties known vulnerabilities still might not give all existing vulnerabilities.\n## 3.2 Cyber defense\nApparently a system without vulnerabilities is well defended against majority of cyber attack (apart from DoS based attacks). The defender of a target system has three options to render a vulnerability-based cyber weapon w useless.\n201\n202\n# Karlis Podins and Christian Czosseck\nBy knowing about vulnerabilities exploited by $w$ and having own infrastructure immune against $w$ by patching its own systems accordingly;\nBy putting in place means to effectively make an existing, unpatched vulnerability not exposed to the attacker (e.g. by using firewalls hiding a service to the Internet or signature-based attack detection). This would also apply to vulnerabilities unknown to the defender but coincidentally covered;\nBy putting in place means to detect and mitigate cyber attacks before their effect manifests itself.\nOne could assume that cyber security aware parties have full control over and knowledge about their own IT assets, making sure not to be vulnerable to attacks they known by themselves (as they ultimately relay on vulnerabilities). Realty shows us that this does not hold true all the time, but nevertheless we keep this assumption for the sake of simplicity, assuming the target to be capable and willing for defending his cyber frontline.\n## 3.3 Cyber weapons development\nCyber Weapons are produced based on knowledge of target's vulnerabilities. It should be clear that before developing any weapon $w$, a party must have knowledge about the vulnerabilities the weapon will exploit and for any given weapon $w$ it is possible to find respective vulnerabilities.\nMore formally speaking, there exists a natural mapping $e$ from cyber weapons to vulnerabilities they exploit. For any given weapon $w$, the set $e(w)$ is either empty (in the case of a DoS attack or cases of social engineering) or it contains at least one vulnerability.\nSometimes, successfully attacked IT Systems can be used for manual or automated creation of (new) cyber weapons for further attacks, e.g. sending infected emails to all persons in contact list or probing the local network for other vulnerable machines.\nTo effectively enlarge one's weapons arsenal with new weapons, a party is required to find an additional vulnerability.\nAs time passes, other parties discover vulnerabilities in a non-deterministic manner. When a party discovers a vulnerability $v$, we can assume that their defenses are upgraded, making weapons exploiting vulnerability $v$ ineffective against party $p$. Research by Moore et al. (Moore et al., 2010) propose a similar vulnerability-based look but assumes the opposite, that own infrastructure is not patched not to warn the opposing parties of discovered vulnerabilities, coming to noteworthy conclusions.\nAdditionally, it seems reasonable to assume that the target party $t$ has adequate logging and attack detection systems in place and will be capable of identifying exploited vulnerabilities at least after they have been used by a cyber weapon, leading to improved cyber defense.\nThis stresses again the overlap between cyber attacks and defenses and vulnerability discovery plays a central role both for attackers and defenders.\n## 4. Implications on party relationships\nIn following section we will test vulnerability-based thinking by applying it to model cyber disarmament, coalitions, collective defense, pacifism and arms control.\n## 4.1 Cyber disarmament\nIn contrast to vague cyber disarmament discussion (Gjelten, 2010) the proposed model offers an effective method of cyber weapon disarmament, as asked for by (Cahill &amp; Rozinov, 2003). Disarmament of cyberspace could be achieved by public vulnerability disclosure. If a party wants to verifiably dismantle some of its cyber weapons, it could publicly disclose all the vulnerabilities used by them. Unlike in real-world disarmament, which affects only the disarming party, cyber disarmament is global. After other parties have adequately reacted to disclosed information, all cyber weapons using disclosed vulnerabilities are rendered useless. This is regardless if they are in the possession of the disarming party or by another party.\nKarlis Podins and Christian Czosseck\nBut there are further peculiarities. Unlike in the conventional weapons domain, if a party $p$ dismantles a set of cyber weapons by disclosing the respective vulnerabilities, defense of $p$ is not affected. Following our assumption that a party always tries to be protected against all known vulnerabilities, $p$ does not disclose a new attack vector against itself, leaving its adversaries without an advantage by this action.\n$P$'s offensive capabilities are decreased by an unknown factor, depending on how many other parties had the disclosed vulnerabilities in their IT systems.\n## 4.2 Cyber coalitions\nIf two or more parties would mutually agree on cyber disarmament, public vulnerability disclosure can be used with the consequences as described before. But an interesting approach would be a mutual vulnerability disclosure; it effectively means that cyber weapons involved in the mutual disarmament would be ineffective against other parties involved in the disarmament agreement, but still potentially effective against $3^{\\text{rd}}$ parties.\nBy exchanging information on vulnerabilities between each other one enables the other to build new weapons based on the newly learned vulnerabilities. But at the same moment both become immune to cyber attacks based on the exchanged vulnerabilities, as soon as they have implemented the necessary changes in their defense. Their offensive capabilities to attack each other decreases or remains the same.\nLet $c$ be any other $3^{\\text{rd}}$ party not part of the treaty or coalition between $a$ and $b$. With the newly won knowledge both parties $a$ and $b$ might have gain additional knowledge to build a cyber weapon $c$ is vulnerable to, enhancing their offensive capabilities against $c$ or at least remaining the same.\n## 4.3 Cooperative cyber defense\nBased on the definition of cyber defense given above, cooperation in cyber defense between two or more parties can manifest by exchanging of vulnerability information and/or attack detection procedures, if it provides tangible benefits to each party.\nBut in the case of vulnerability information exchange, there is no difference from the aforementioned cyber coalition. This leads to the observation that it is possible for cooperative cyber defense to be indistinguishable from a cyber coalition.\nTo arrange a cooperative cyber defense that is purely defensive in nature, the cooperation between the parties would be limited to the exchange of signatures and other attack detection information without sharing vulnerabilities per se. If knowledge about vulnerabilities shall also be shared without giving an offensive advantage to the parties, it must be done by public disclose with the consequences as described under cyber disarmament.\n## 4.4 Cyber pacifism\nPacific movement is usually limited to protest when in conventional weapons domain. But this could change in the cyber space.\nApart from voicing concerns about cyber weapons as discussed in (Rowe, 2007), a more active strategy could be to actively search for vulnerabilities and publicly disclose them as soon as possible. As in the case of cyber disarmament, it would universally destroy the corresponding cyber weapons, hitting the weapons arsenals of many parties simultaneously.\nAssuming enough resources are present, the cyber pacifist can have a significant impact on the cyber weapons arsenals of other nation-states without committing any aggressive actions. This again shows how different the cyber weapons world is, leading to new possibilities, but also new limitations.\n## 4.5 Cyber arms control\nA problem of what to do with cyber weapons found during an inspection as illegal under an Cyber Arms Control treaty is stated by Dorothy Denning (Denning, 2001). Within our proposed model, the\nKarlis Podins and Christian Czosseck\nsame public disclosure procedure as for cyber disarmament could be applied, after the found cyber weapon got analyzed to identify the vulnerability exploited by it. Wherever other copies of discovered cyber weapon are stored, they all rely on the same vulnerability (or same set of vulnerabilities), by disclosing those vulnerabilities one can effectively neutralize each and every of those copies at the same time.\n## 5. Conclusion\nCyber weapons are a new type of armament that follows different rules than the established rules of conventional weapons or weapons of mass destruction. The revolutionary nature of cyber weapons as a means and method of warfare demands the creation of a new conflict model.\nThis article proposes a highly-simplified, vulnerabilities-based model that defines and describes cyber weapons and cyber defense. The authors analyzed the relationships between hypothetical parties who would develop and employ cyber weapons. The model revealed a number of important findings, such as the fact that a defensive alliance, in which the parties exchanged their knowledge of cyber vulnerabilities, would lead to an enhanced offensive capability by every member of the alliance. Further, the authors proposed a strategy for cyber attack deterrence based on the introduced model. The restricted definition of cyber weapons together with vulnerability-based model has been shown useful for solving cyber arms control problem, and we hope that the model will show useful in other problems as well.\nThe examples used in this article primarily highlight the typical roles expected of nation-states, but the authors believe that the model's principles will apply in the corporate world as well.\nDisclaimer: The opinions expressed here are those of the authors and should not be considered as the official policy of the NATO Cooperative Cyber Defence Centre of Excellence or NATO.\n## Acknowledgements\nBoth authors contributed equally. The opinions shared in this article are those of the authors and do not represent the views of NATO or its member states. The authors would like to thank Mr. Kenneth Geers and Prof. Peeter Lorents who gave us valuable feedback while writing this article.",
  "references": [
    "## References\nCahill, T., &amp; Rozinov, K. (2003). Cyber warfare peacekeeping. *Assurance Workshop*, 2003., (June).\nDenning, D. (2001). Obstacles and Options for Cyber Arms Control. *Arms Control in Cyberspace*, Heinrich Böll Foundation, Berlin, Germany, 1-13. Retrieved from http://faculty.nps.edu/dedennin/publications/berlin.pdf\nEvron, G. (2008). Battling botnets and online mobs: Estonia's defense efforts during the internet war. *Georgetown Journal of International Affairs*, 9(1), 121–126.\nFalliere, N., Murchu, L. O., &amp; Chien, E. (2010). W32. Stuxnet Dossier. *Symantec Security Response*, 3(November), 1-64. Symantec.\nFarivar, C. (2009). A Brief Examination of Media Coverage of Cyberattacks (2007 - Present). In C. Czosseck &amp; K. Geers (Eds.), *The Virtual Battlefield: Perspectives on Cyber Warfare* (p. 183). Amsterdam: IOS Press.\nGjelten, T. (2010). Debating Cyber Disarmament. *World Affairs*. Retrieved March 1, 2012, from http://www.worldaffairsjournal.org/article/shadow-wars-debating-cyber-disarmament\nHerold, R. (2007). DHS Exploding Generator Shows Dire Need For Better Computer Security. *Realtime IT Compliance*. www.realtime-itcompliance.com. Retrieved August 17, 2010, from http://www.realtime-itcompliance.com/information_security/2007/09/dhs_exploding_generator_shows.htm\nHunker, J., &amp; Hutchinson, B. (2008). Role and Challenges for Sufficient Cyber-Attack Attribution. Institute for Information Infrastructure Protection. Retrieved from http://www.thei3p.org/docs/publications/whitepaper-attribution.pdf\nKelsey, J. T. G. (2008). Hacking into International Humanitarian Law: The Principles of Distinction and Neutrality in the Age of Cyber Warfare. *Michigan Law Review*, (May), 1427-1452.\nLangner, R. (2011). Keynote speech on Stuxnet @ ICCC 2011. Tallinn: CCD COE Publications. Retrieved January 1, 2012, from http://www.ccdcoe.org/280.html\nLemay, A., Fernandez, J. M., &amp; Knight, S. (2010). Pinprick attacks, a lesser included case? In C. Czosseck &amp; K. Podins (Eds.), *Conference on Cyber Conflict Proceedings* (pp. 183 - 194). Tallinn: CCD COE Publications.\nMell, P., Scarfone, K., &amp; Romanosky, S. (2007). A complete guide to the common vulnerability scoring system version 2.0. *Published by FIRST-Forum of Incident Response and Security Teams* (pp. 1-23). Retrieved from http://www.first.org/cvss/cvss-guide.pdf\nMicrosoft Collaborates With Industry to Disrupt Conficker Worm. (2009). Retrieved January 3, 2012, from http://www.microsoft.com/presspass/press/2009/feb09/02-12confickerpr.mspx\nKarlis Podins and Christian Czosseck\nMiller, C. (2010). Kim Jong-il and me: How to build a cyber army to attack the U.S. Tallinn: CCD COE Publications. Retrieved from http://www.ccdcoe.org/conference2010/agenda.html\nMoore, T., Friedman, A., &amp; Procaccia, A. D. (2010). Would a 'cyber warrior' protect us: exploring trade-offs between attack and defense of information systems. Proceedings of the 2010 workshop on New security paradigms (pp. 85–94). ACM. Retrieved from http://dl.acm.org/citation.cfm?id=1900559\nNazario, J. (2009). Politically Motivated Denial of Service Attacks. In C. Czosseck &amp; K. Geers (Eds.), The Virtual Battlefield: Perspectives on Cyber Warfare (pp. 163-181). 163-181: IOS Press.\nOiaga, M. (2010). Windows Blue Screens of Death After Patch for 17-Year Old Vulnerability Is Applied. Retrieved August 17, 2010, from http://news.softpedia.com/news/Windows-Blue-Screens-of-Death-after-Patch-for-17-Year-Old-Vulnerability-Is-Applied-134808.shtml\nOttis, R. (2008). Analysis of the 2007 Cyber Attacks Against Estonia from the Information Warfare Perspective. Proceedings of the 7th European Conference on Information Warfare (p. 163). Academic Conferences Limited.\nOttis, R., &amp; Lorents, P. (2010). Cyberspace: Definition and Implications. Proceedings of the 5th International Conference on Information Warfare and Security (pp. 267-270). Academic Publishing Limited.\nRowe, N. C. (2007). War Crimes from Cyber-weapons. Journal of Information Warfare, 6(3), 15–25. Retrieved from http://academic-conferences.org/pdfs/JIW6_3.pdf#page=21\nSecurity, D. O. H. (2010). National Vulnerability Database (NVD) Search Vulnerabilities. Retrieved August 17, 2010, from http://web.nvd.nist.gov/view/vuln/search?execution=e2s1\nSharma, A. (2009). Cyber Wars: A Paradigm Shift from Means to Ends. In C. Czosseck &amp; K. Geers (Eds.), The Virtual Battlefield: Perspectives on Cyber Warfare (Vol. 34, pp. 3-17). Amsterdam: IOS Press.\nSulek, D., &amp; Moran, N. (2009). What Analogies Can Tell Us About the Future of Cybersecurity. In C. Czosseck &amp; K. Geers (Eds.), The Virtual Battlefield: Perspectives on Cyber Warfare (pp. 118-131). Amsterdam: IOS Press.\nZiolkowski, K. (2010). Computer Network Operations and the Law of Armed Conflict. Military Law and the Law of War Review, (49), 47-94.\n205\nnical Committee (CT 136) for information system security standards. In 1990, he was teaching at the University of Bristol, United Kingdom.\nDr Tim Watson is the Head of Department of Computer Technology at De Montfort University and the Director of its Centre for Secure Computing. Tim is a regular media commentator on information security and digital forensics and a member of various advisory groups, including DSTL's Cyber and Situational Awareness Information Exchange, the CESG Academic Advisory Group, the National Information Assurance Forum, the IAAC Academic Liaison Panel and the UK ISO 27000 series standards body.\nPeter Norris is a teacher fellow and principal lecturer at De Montfort University where he leads the security strand of the Center for Secure Computing. Originally trained as an engineer, he spent nine years in industry, before joining academia. He has advised local government on identity management, supervised research on network security, helped develop the UK input to ISO standards on both digital forensics and network security, and is currently researching the security of motor vehicle digital systems. His overarching interest is in the security consequences of the practical interaction of heterogeneous systems.\n# Biographies of Presenting Authors\nAndrew Adams is Professor of Information Ethics in the Graduate School of Business Administration and Deputy Director of the Centre for Business Information Ethics at Meiji University in Tokyo. He is the chair of ACM SIGCAS. He holds a BSc, MSC and PhD in Computing subjects and an LLM in Advanced Legal Studies.\nAdetunji Adebiyi is a Doctoral student with the University of East London UK. His research focuses on integrating security into software design during SDLC. He is a member of the British Computer Society. His research has led him to give talks and presentations in conferences and seminars he has attended.\nKari Alenius is Associate Professor in the Department of History at the University of Oulu, Finland, since 1998. He also has Adjunct Professorship at the University of Oulu (1997). His research interests include the history of propaganda and mental images, the history of Eastern Europe between the World Wars, and the history of ethnic minorities.\nOlga Angelopoulou is a lecturer in Digital Forensics at the University of Derby. She obtained a doctorate in Computing with the title: 'Analysis of Digital Evidence in Identity Theft Investigations'. Her research interests include Computer Forensics, Digital Evidence, Identity theft, Online fraud, Computer crime investigations and the Online Social Networking.\nRabia Aslanoglu got her B.S. degree from Izmir University of Economics, Department of Software Engineering in 2009. Currently, she is studying for her M.S. degree in Izmir Institute of Technology, Department of Computer Engineering, Izmir, Turkey. Her research interests are public-key cryptography and information warfare.\nMelanie Bernier is a Defence Scientist with the Defence Research and Development Canada's Center for Operational Research and Analysis. She has a Masters Degree in Electrical Engineering and experience in modelling and simulation, concept development and experimentation, joint C4ISR, and computer networks. She is currently leading studies in force development for the cyber environment.\nMatt Bishop received his Ph.D. in computer science from Purdue University in 1984. His main research areas are the analysis of vulnerabilities in computer systems, security of electronic voting systems and election processes, and data sanitization, network security, and malware analysis. His textbook, Computer Security: Art and Science, was published in 2002 by Addison-Wesley Professional.\nAbilio Fernando Costa Cardoso, Occupation or position held: Researcher in Cloud Computing, IT governance and computer networks, professor at Department of Innovation, Science and Technology, manager of IT area at Portucalense University. M Sc in Computer Science, 1995, B Sc in Applied Mathematics, 1987, Class teaching: Project planning and network management, Java advanced programming\nChristian Czosseck is scientist at the NATO CCD COE in Tallinn, Estonia. Serving in the German military for more than 14 years, he held several information assurance positions. Christian holds a M.Sc. equivalent\nin computer science and is currently PhD candidate at the Estonian BusinessSchool, Tallinn looking into cyber security and botnet related issues.\nMichel Dubois is teacher and researcher at the Cryptology and Operational Virology (C+V)° laboratory. Currently he is a PhD student in cryptography and works on a new approach of the cryptanalysis of the AES.\nTim Hartog graduated in 2005 at the Technical University of Twente, he has been active in the field of Information Security. During his work at TNO, the Dutch Organization for Applied Scientific Research, Tim has been working on topics like Trusted Computing, Trusted Operating Systems and Cross Domain Solutions.\nMajor Arto Hirvelä is instructor (leadership) in Research Group at the Finnish National Defence University. His research interests are information environment, strategic communication and information operations.\nDr. Berg P. Hyacinthe (Ph.D., Florida State University; LLD Candidate, Assas School of Law, CERSA-CNRS, en Sorbonne) is Director of the \"Centre de Recherche Scientifique et d'Études Cybernétiques\" (CRESEC) at \"l'Université d'État d'Haiti\". His research agenda is set at the intersection of law and technology, exploring legality/illegality of advanced digital technologies in armed conflicts.\nAnna-Marie Jansen van Vuuren began her career as a journalist in 2004. She holds a Masters degree in Journalism and Media Management from the University of Stellenbosch and currently she is pursuing a Ph.D. at the University of Pretoria. Anna-Marie is a lecturer at the University of the Witwatersrand and freelances as a broadcast journalist and producer at the South African Broadcast Corporation.\nJoey Jansen van Vuuren is the Research Group Leader for Cyber Defence at the CSIR South Africa. , mainly involved in research for the Defence and Government sectors.. She obtained her Masters from UNISA and her research is focussed on National Cybersecurity and the analysis of Cyber threads. She is also involved in Cyber awareness programs in South Africa\nSaara Jantunen has studied English language and culture in the University of Groningen, and English philology in the University of Helsinki. Currently she is writing her doctoral dissertation in the Finnish National Defence University, where she majors in leadership. Her research interests include language and identity, ideology in discourse, strategic communication and multimodal discourse. Jantunen currently works in education.\nRoman Jašek is the head of Department of Informatics and Artificial Intelligence, Faculty of Applied Informatics, Tomas Bata University in Zlín. His habilitation thesis focused on implementing information security paradigm into commercial organizations as well as tertiary education institutions. Professional interests include computer security auditing, knowledge protection, information systems, and informatics.\nEli Jellenc leads analysis of geopolitical cyber security and directs research operations in the EU and Japan for VeriSign-iDefense, where he previously created the International Cyber Intelligence unit. He holds an MA in International Security from Georgetown University, and has authored 3 cyber risk country-profiles in the \"Cybercrime and Security\" journal (Oxford University Press).\nJeremy Julien is an Engineering student at the ESIEA school in France. Jeremy has been responsible for the plotting of our keywords and related cables. Jeremy also assisted Nils by searching for related cables, keywords and other relevant sources.\nHarry Kantola is working as a teacher at the department of tactics and operational arts in Finnish National Defense University (FNDU), teaching senior staff officers. Kantola has studied (Masters of arts) in Swedish National Defense College (SNDC) and to General Staff Officer at FNDU. His thesis at these schools dealt with CNO in general.\nAnssi Kärkkäinen Captain, M.Sc. (Eng.) graduated from the Finnish National Defence University in 2000. He also graduated a Master of Science (Engineering) degree from Helsinki University of Technology (currently Aalto University) in 2005. Currently he is carrying out doctoral studies at the same university. His current assignment is a Staff Engineer for Defence Command Finland.\nWilliam Aubrey Labuschagne lectured programming, networking, and security subjects at Tshwane University of Technology (TUT) 2002-2009. Obtained Red Hat Certified Technician (RHCT - 2006) and is qualified SCRUM Master (Scrum Alliance). Qualifications consist of NDip: Computer System Engineering and\nix\nBTech: Information Technology at Pretoria Technikon Currently completing MTech at UNISA in field of security awareness in rural areas and is technologist at CSIR.\nPierre Leandre is a student in his second year at ESIEA where he study informatics and electronics. At school he is part of the OCV lab (Operational Cryptology and Virology Laboratory).\nSylvain (Sly) Leblanc is an Assistant Professor at the Royal Military College of Canada. Sly was a Canadian Army Signals Officer for over 20 years, where he developed his interest in computer network operations. His research interests are in computer security and computer network operations.\nAndrew Nicholson received his Masters degree in Computer Security in 2010 at De Montfort, University in England. In 2010 Andrew began PhD research looking into attribution of cyber attacks. He is a member of the De Montfort University Cyber Security Centre (CSC) research group. Andrews main interests are network security, cyber-conflict and online anonymity.\nMzukisi Niven Njotini is a currently working as a lecturer in College of Law at the University of South Africa (South Africa). Njotini has an LLB and LLM (Cum Laude) degree and is currently enrolled for an LLD or PhD degree. Njotini's area of speciality is information technology law.\nAzah Norman BA(Hons.) in Information Science from National University of Malaysia (UKM) (2000) and Masters in Secure e-Commerce from Royal Holloway University of London, United Kingdom (2003). Research focuses on information systems security and e-commerce. Worked as a consultant in a Malaysian premier security company under Malaysia's national information &amp; communication technology corporation (over three years). Research medals for research in Halal-RFID verification and currently pursuing PhD in information systems security management.\nKarlis Podins has graduated University of Latvia with master degree in Computer Science, and is working for Cooperative Cyber Defence Centre of Excellence since 2008. Apart from dormant interest in Finite Automata and Natural Language Processing, his research has touched several areas related to security.\nDr Graeme Pye is a Lecturer with the School of Information Systems, Deakin University, Australia. His research is continuing to focus on investigating the security and resilience aspects of Australian critical infrastructure and the relationships between associated infrastructures. Furthermore, he is also interested in modelling emergency management and disaster response systems, including resilience and security management aspects.\nNeil Rowe is Professor of Computer Science at the U.S. Naval Postgraduate School where he has been since 1983. He has a Ph.D. in Computer Science from Stanford University (1983). His main research interests are the modeling of deception, information security, surveillance systems, image processing, and data mining.\nMirva Salminen (M.Soc.Sc.) is a doctoral candidate at the University of Lapland, Finland, researching on the outsourcing of the state's security related functions. She has studied International Relations and Political Science at the University of Tampere, Finland; Military History and Strategy at the Finnish National Defence University; and Security Studies at Aberystwyth University, the UK.\nLibor Sarga is a doctoral worker at the Department of Statistics and Quantitative Methods, Faculty of Management and Economics, Tomas Bata University in Zlín. His dissertation will be focused on computer and data security in the presence of unreliable human element as an exploitable attack vector. His personal interests include technology, hardware and software architectures.\nEmad Shafie PhD student at The Software Technology Research Laboratory, in De Montfort University, I have achieved a master degree in Information technology 2009 from De Montfort University and bachelor degree in computer science 2000 from King Abdul-Aziz University. I have worked as leader of programming department for five years at Umu Alqura University in Saudi Arabia.\nTorsti Siren Lieutenant Colonel, General Staff, Ph.D. (Pol. Sc.), B.A. (Slavonic philology) Torsti Siren is Head of Research Group in the Department of Leadership and Military Pedagogy at the Finnish National Defence University, Helsinki.\nIgnus Swart obtained his masters degree in computer science at Tshwane University of Technology where he studied with a full scholarship. After several years working as both a software developer and security pro\nx\nReproduced with permission of the copyright owner. Further reproduction prohibited without permission."
  ],
  "flat_text": "Karlis Podins and Christian Czosseck Cooperative Cyber Defence Centre of Excellence, Tallinn, Estonia karlis.podins@ccdcoe.org Christian.czosseck@ccdcoe.org Abstract: Throughout history, mankind has developed and employed novel weapons systems and equally novel countermeasures. Naturally, both offensive and defensive systems are limited by the laws of nature. Consequently, military concepts and doctrines were designed by implicitly taking into account those same limitations. The digital age has introduced a new class of weaponry that poses an initial challenge to our common understanding of conflict and warfare as for their different characteristics: cyber weapons. Cyber weapons and other terms like hacking are used frequently, commonly without giving clear definitions in the given context. We propose a restricted definition of cyber weapons as consisting primarily of data and knowledge, presenting themselves in the form of prepared and executed computer codes on or a sequence of user interactions with a vulnerable system. This article explores the crucial differences between the conventional weapons and cyber weapons domains, starting a debate on to which extent classical concepts and doctrines are applicable to cyber space and cyber conflict. This motivates a discussion on the role of vulnerabilities in IT systems and their impact to IT security and cyber attacks. The authors describe a vulnerability-based model for cyber weapons and for cyber defense. This model is then applied to describe the relationship between cyber-capable actors (e.g. nation-states). The proposed model clarifies important implications for cyber coalition-building, and disarmament. Furthermore, it presents a general solution for the problem of the destruction of cyber weapons, i.e. in the context of cyber arms control.\nKeywords: cyber weapons, cyber defense, disarmament, coalition, vulnerabilities # 1. Introduction As conflicts have moved into cyberspace (and vice versa), a clear understanding of cyber weapon becomes a necessity. The development of weapons was always part of mankind's history. Weapons evolved to suit the tactics, but from time to time new weapons revolutionized the tactics and strategies of warfare. The developments of artillery, gunpowder, aviation or weapons of mass destruction are just some examples from recent history. They all caused dramatic changes on the face of the battlefield. But all those weapons developed so far have similar kinetic and/or thermal properties due to the shared physical domain.\nIn the cyber attacks on Estonia in 2007, a campaign of massive distributed denial of service (DDoS) attacks against government websites, paired with hacking attempts against valuable targets like ISP backbone routers, a new type of conflict became a reality. Many more politically motivated DDoS attacks followed. It drew strong and inconsistent media attention, up to being termed the first cyber war in history, as discussed by. While Article 5 of the North Atlantic Treaty, governing mutual support among NATO nations in case of an armed attack was not invoked, national security leadership around the world received a wakeup call. However, several years later we still have not seen a commonly agreed definition of cyber weapons or cyber warfare (Ottis &amp; Lorents, 2010).\nIn first section we are going to define basic terms and give short overview about special properties of cyber domain and cyber weapons. The concepts and terminology initially used were based on our understanding of conventional weapons or weapons of mass destruction. Unfortunately, cyber weapons, being data and knowledge, follow other rules than their conventional counterparts. Thus the effects of cyber weapons on their target are different. In 2007 a direct, destructive cyber attack on a power generator was proven possible in a real life experiment. Latest prominent case, the Stuxnet virus, which is assumed to have sabotaged the Iran nuclear program starting from 2009, shows how powerful a cyber weapon in a real world setting can be (Falliere, Murchu, &amp; Chien, 2010; Langner, 2011). Some research states that conventional weapons framework is ineffective, is not applicable or has left a big gap between our assumptions about cyber weapons and reality (Sulek &amp; Moran, 2009). We do not want to get involved in this controversial discussion, but rather explicitly show some surprising aspects of cyber domain.\n\nSection 2 of the paper introduces a vulnerability-based model of cyber conflict. We argue that knowledge about vulnerabilities is key element in understanding both cyber offense and cyber defense, and build a simplified model of cyber conflict around this idea.\nIn section 3 we will apply the vulnerability-based model on selected aspects of cyber conflicts. By using the proposed model to describe relationship and interactions between cyber-capable actors we demonstrate applications of proposed approach.\n\nIn recent years, the prefix „Cyber “has become quite common and was added to many existing terms with the intention of extending its meaning into cyberspace (Ottis &amp; Lorents, 2010). While terms like cyber war (warfare), cyber defense or cyber weapons are widely used, there is a lack of commonly accepted definition, and authors often use terms without precisely describing their meaning.\nIn the context of this paper we would like to offer the following definitions.\nDefinition 1: Cyber Weapon and Cyber Attack.\nA cyber weapon is data and knowledge that is capable of, designed to and executed with the intention to affect the integrity, availability and/or confidentiality of an IT system (target) without its owner's approval. The target's defense is overcome by abusing existing vulnerabilities in the target.\nApplication of cyber weapon shall be named a Cyber Attack.\nDefinition 2: Vulnerability.\nA vulnerability is an exploitable flaw in an IT system, which allows an attacker to usurp privileges or trust, access data or execute commands, he normally would not be allowed or expected to. This includes mis- or known default configuration but excludes social engineering means. Possible examples are: taking control of a system, reading or modifying information stored or processed or adding functionality.\nWhen starting discussions on conflicts in cyberspace, one should clearly understand the cyber domain and its special properties. Cyberspace differs from conventional weapons domains, some differences being minor while some are of the utmost importance. We believe that ignoring these differences and straight-forward application of established concepts especially on weapons has caused some of the confusion around the cyber domain. In the following an overview of key differences between the cyber domain and the domain of conventional arms is provided. As for space reasons, an analogy to the domains of nuclear, biological and chemical (NBC) weapons is not made.\nThe confusion can be easily explained just by looking at the definitions. While established concept assumes weapon to be a physical object, cyber weapon under proposed definition is knowledge and data derived from it.\nThe extent and severity of cyber attacks can vary as recent history has shown, from local (loss of email confidentiality due to loss of password) to nation-wide. As for the time being, cyber attacks do not directly kill living beings, but can cause abuse of, malfunctions or the destruction of equipment. That, as a $2^{\\text{nd}}$ or higher order result, can lead to a lethal effect or further destruction.\nThe distance between attacker and target is irrelevant for conducting the attack as long as there is connectivity between them. By connectivity we mean possibility to communicate between the attacker and the target, including not only wired or wireless media, but alsomethods to transfer information between air-gapped networks (see e.g. Falliere et al., 2010; Langner, 2011). Considering the Internet as the global network, all connected computers, smart phones, cars, industrial control systems (SCADA), or Internet enabled household electronics are just some of the possible targets. As of the very nature of the Internet a cyber attack can be initiated from any (connected) place on this planet to reach almost everywhere.\nKarlis Podins and Christian Czosseck Launched attacks hit their target nearly instantly. While preparing a cyber attack might demand time consuming preparations, some of the effects could manifest itself in the blink of an eye. With this the defensive aspect of time, which can be used in conventional warfare to start a countermeasure against an attack, becomes less relevant.\nThere is no border or neutral area. National territory or borders on the Internet are only considered by legal departments, e.g., but so far those concepts have almost no everyday practical meaning. While it is possible to cut or limit nation's connectivity to Internet, the consequences for any modern nation state are too bizarre to consider it a long term solution.\nThe attribution of an attack to a cyber attacker is, with technical means, nearly impossible (Hunker &amp; Hutchinson, 2008). While attribution might be possible by also considering information from other sources and by analyzing the behavior and beneficial outcome for other parties, this is not guaranteed. The Conficker worm so far has not been attributed to any party, although considerable public and security community attention was focused to it, as well as USD 250,000 bounty was offered by Microsoft(\"Microsoft Collaborates With Industry to Disrupt Conficker Worm,\"2009). If an attacker plots his attacks with enough care, he could even maintain a steady attack on his adversary without being identified (Lemay, Fernandez, &amp; Knight, 2010). But having, to a reasonable extent, a confirmed source is a common requirement for the attacked party to take active countermeasures, especially if they are of violent nature.\nCyber weapons do not have a physical nature, they are knowledge and data as defined above. To conduct a cyber attack, the attacker has to send data to the victim. Most can be made persistent, e.g. by writing a script or program and storing this on an IT system. Like ordinary files, those cyber weapons can then be copied without noteworthy costs so the number of copies of a cyber weapon is usually irrelevant. Storage and transportation of cyber weapons also seem easier than for physical counterparts, one party could even decide to keep a copy or even the whole cyber weapon arsenal outside its own borders, hiding it in different places all over the Internet.\nCyber weapons production costs are mainly human resources related. While we recognize the initial investment in R&amp;D as necessary, success of lone hackers and loose groups (Anonymous, LulzSec) shows that a lot can be achieved with limited funds. We believe that especially for a nation-state it is a minor expense compared to development of advanced conventional weapons. The production of conventional weapons depends mostly on the costs of fabrication, which often is a combination of labor costs, materials, machines and infrastructure. In contradiction to this, cyber weapons are constructed mainly by human knowledge on relatively cheap IT equipment. Their skills and knowledge in areas like software development, exploit development and penetration testing are the essence of the attack. Hiring the right personnel and keeping or extending their skills is the major investment needed to maintain or extend a cyber weapons arsenal.\nThe knowledge of a target's vulnerabilities and how to exploit them is of central importance to the attacker. On the other side, this knowledge is also the most important piece of information needed by the target of the attack to set up an efficient defense.\nThis leads us to the 1st paradox of cyber weapons: they are subject to time-decay. If a cyber weapon is exploiting a vulnerability, it is effective as long as the target IT system has this vulnerability. Vulnerabilities get discovered and patched, and target systems can change their software/hardware at their will, so the period of effectiveness for a cyber weapon is undefined, but likely to decrease the longer the vulnerability is known. This aspect is also discussed in (Moore, Friedman, &amp; Procaccia, 2010).\nThe $2^{nd}$ paradox is that of cyber weapons usage may lead to the target enhancing its defense in a very short time. As soon as a cyber attack is executed, the target might have means in place to detect that an attack occurred and how it was conducted. While the initial attack might have been successful, the likelihood that a proper defense can be built after it is reasonably high, rendering the used cyber weapon useless against the same target and even against others in cases of existing cooperation or disclosure. An example is specially crafted malware. As soon as samples of a particular new malware get collected and analyzed, appropriate antivirus, IDS and software patching could be done rather fast. Still this is ultimately decided by the capabilities for the actors.\n\nThis has consequences for one's ability to test the effectiveness of cyber weapons. As soon as a certain cyber weapon is tested in the wild or even against the target itself, the likelihood is reasonably high to believe that security-aware targets will find a way to enhance their defense against the attack. (It is recognized that techniques are available to the attacker to re-launch the same attack using changed code, and that the target can only learn from an attack if he recognizes it in the first place.) But testing those attacks in a closed test environment will not always guarantee their successful later deployment, as it will be hard for the attacker to build a reasonably complete testing environment with the true attributes of the real target. Nevertheless, it has to be pointed out, that it is quite common to use commercial off-the-shelf hardware and software, which can also be easily acquired by the attacker in order to test his defenses.\nThe given unique attributes and examples support our opinion, that conventional arms and the ways we use them, are different from cyber weapons. This is why in the following section we propose a model to describe cyber domain and conflicts within.\n## 3. A vulnerability based view on cyber weapons The actors (parties) of cyber incidents might be individuals, groups of individuals, companies or nation-states. All possible combinations of parties attacking each other with cyber weapons reflect different scenarios, which, depending on effects, we would call criminal acts, industrial espionage, terrorism, conflicts or even (cyber) war. While a discussion on mapping these terms in the cyber landscape might be reasonable, we would like to state that the proposed model is generic enough to be applicable to all of them, because it focuses on the underlying mechanics. Considering the scope of this paper, we will use the term cyber conflict for all those mentioned combinations.\n## 3.1 Vulnerabilities Vulnerabilities, the knowledge about and the skills to exploit them, are of utter importance in any form of cyber conflict. It is quite clear that without exploitable vulnerabilities, cyber attacks would be pretty much limited to (D)DoS attacks (as they do not rely on a flaw in the target, but limit their targets' accessibility by exhausting bandwidth, CPU or other limited resource) or attempts to manipulate users through social engineering to get access to the target's system. To reflect that, we propose to take vulnerability as a basic entity and analyze cyber weapons and conflict by looking at them from a vulnerability point of view.\nVulnerabilities differ in their severity. Some of them enable an adversary to conduct a cyber attack against a target (e.g. root access), while some are likely not to be of any use to an attacker. The internationally recognized Common Vulnerability Scoring System introduces an open framework enabling one to score and compare the severity of a vulnerability based on its intrinsic qualities, its behavior over time and its environmental uniqueness (Mell, Scarfone, &amp; Romanosky, 2007). While comparing individual vulnerabilities, it makes a difference how severe every single one of them is. However, we will save a detailed examination of this issue for future research. For the moment, it might be safe to only consider those potentially leading to a complete violation of availability, confidentiality or integrity of an attacked IT system.\nThe dynamic nature of IT implies that the set of vulnerabilities changes over time. When new code gets installed, new vulnerabilities are added and/or other vulnerabilities get removed. There is a considerable amount of vulnerabilities publicly disclosed every day (e.g. at the National Vulnerability Database ) but some vulnerabilities remain unpatched although known to the public for decades.\nNaturally, there exists a set of all vulnerabilities that are in the software installed somewhere. This is not constant and changes every time new software is installed, removed or configured. Each party has knowledge about some of the vulnerabilities. There are vulnerabilities unknown to all parties. As such the union of all parties known vulnerabilities still might not give all existing vulnerabilities.\n## 3.2 Cyber defense Apparently a system without vulnerabilities is well defended against majority of cyber attack (apart from DoS based attacks). The defender of a target system has three options to render a vulnerability-based cyber weapon w useless.\n\n# Karlis Podins and Christian Czosseck\nBy knowing about vulnerabilities exploited by $w$ and having own infrastructure immune against $w$ by patching its own systems accordingly;\nBy putting in place means to effectively make an existing, unpatched vulnerability not exposed to the attacker (e.g. by using firewalls hiding a service to the Internet or signature-based attack detection). This would also apply to vulnerabilities unknown to the defender but coincidentally covered;\nBy putting in place means to detect and mitigate cyber attacks before their effect manifests itself.\nOne could assume that cyber security aware parties have full control over and knowledge about their own IT assets, making sure not to be vulnerable to attacks they known by themselves (as they ultimately relay on vulnerabilities). Realty shows us that this does not hold true all the time, but nevertheless we keep this assumption for the sake of simplicity, assuming the target to be capable and willing for defending his cyber frontline.\n## 3.3 Cyber weapons development\nCyber Weapons are produced based on knowledge of target's vulnerabilities. It should be clear that before developing any weapon $w$, a party must have knowledge about the vulnerabilities the weapon will exploit and for any given weapon $w$ it is possible to find respective vulnerabilities.\nMore formally speaking, there exists a natural mapping $e$ from cyber weapons to vulnerabilities they exploit. For any given weapon $w$, the set $e(w)$ is either empty (in the case of a DoS attack or cases of social engineering) or it contains at least one vulnerability.\nSometimes, successfully attacked IT Systems can be used for manual or automated creation of (new) cyber weapons for further attacks, e.g. sending infected emails to all persons in contact list or probing the local network for other vulnerable machines.\nTo effectively enlarge one's weapons arsenal with new weapons, a party is required to find an additional vulnerability.\nAs time passes, other parties discover vulnerabilities in a non-deterministic manner. When a party discovers a vulnerability $v$, we can assume that their defenses are upgraded, making weapons exploiting vulnerability $v$ ineffective against party $p$. Research by Moore et al.  propose a similar vulnerability-based look but assumes the opposite, that own infrastructure is not patched not to warn the opposing parties of discovered vulnerabilities, coming to noteworthy conclusions.\nAdditionally, it seems reasonable to assume that the target party $t$ has adequate logging and attack detection systems in place and will be capable of identifying exploited vulnerabilities at least after they have been used by a cyber weapon, leading to improved cyber defense.\nThis stresses again the overlap between cyber attacks and defenses and vulnerability discovery plays a central role both for attackers and defenders.\n## 4. Implications on party relationships\nIn following section we will test vulnerability-based thinking by applying it to model cyber disarmament, coalitions, collective defense, pacifism and arms control.\n## 4.1 Cyber disarmament\nIn contrast to vague cyber disarmament discussion  the proposed model offers an effective method of cyber weapon disarmament, as asked for by (Cahill &amp; Rozinov, 2003). Disarmament of cyberspace could be achieved by public vulnerability disclosure. If a party wants to verifiably dismantle some of its cyber weapons, it could publicly disclose all the vulnerabilities used by them. Unlike in real-world disarmament, which affects only the disarming party, cyber disarmament is global. After other parties have adequately reacted to disclosed information, all cyber weapons using disclosed vulnerabilities are rendered useless. This is regardless if they are in the possession of the disarming party or by another party.\nKarlis Podins and Christian Czosseck\nBut there are further peculiarities. Unlike in the conventional weapons domain, if a party $p$ dismantles a set of cyber weapons by disclosing the respective vulnerabilities, defense of $p$ is not affected. Following our assumption that a party always tries to be protected against all known vulnerabilities, $p$ does not disclose a new attack vector against itself, leaving its adversaries without an advantage by this action.\n$P$'s offensive capabilities are decreased by an unknown factor, depending on how many other parties had the disclosed vulnerabilities in their IT systems.\n## 4.2 Cyber coalitions\nIf two or more parties would mutually agree on cyber disarmament, public vulnerability disclosure can be used with the consequences as described before. But an interesting approach would be a mutual vulnerability disclosure; it effectively means that cyber weapons involved in the mutual disarmament would be ineffective against other parties involved in the disarmament agreement, but still potentially effective against $3^{\\text{rd}}$ parties.\nBy exchanging information on vulnerabilities between each other one enables the other to build new weapons based on the newly learned vulnerabilities. But at the same moment both become immune to cyber attacks based on the exchanged vulnerabilities, as soon as they have implemented the necessary changes in their defense. Their offensive capabilities to attack each other decreases or remains the same.\nLet $c$ be any other $3^{\\text{rd}}$ party not part of the treaty or coalition between $a$ and $b$. With the newly won knowledge both parties $a$ and $b$ might have gain additional knowledge to build a cyber weapon $c$ is vulnerable to, enhancing their offensive capabilities against $c$ or at least remaining the same.\n## 4.3 Cooperative cyber defense\nBased on the definition of cyber defense given above, cooperation in cyber defense between two or more parties can manifest by exchanging of vulnerability information and/or attack detection procedures, if it provides tangible benefits to each party.\nBut in the case of vulnerability information exchange, there is no difference from the aforementioned cyber coalition. This leads to the observation that it is possible for cooperative cyber defense to be indistinguishable from a cyber coalition.\nTo arrange a cooperative cyber defense that is purely defensive in nature, the cooperation between the parties would be limited to the exchange of signatures and other attack detection information without sharing vulnerabilities per se. If knowledge about vulnerabilities shall also be shared without giving an offensive advantage to the parties, it must be done by public disclose with the consequences as described under cyber disarmament.\n## 4.4 Cyber pacifism\nPacific movement is usually limited to protest when in conventional weapons domain. But this could change in the cyber space.\nApart from voicing concerns about cyber weapons as discussed in , a more active strategy could be to actively search for vulnerabilities and publicly disclose them as soon as possible. As in the case of cyber disarmament, it would universally destroy the corresponding cyber weapons, hitting the weapons arsenals of many parties simultaneously.\nAssuming enough resources are present, the cyber pacifist can have a significant impact on the cyber weapons arsenals of other nation-states without committing any aggressive actions. This again shows how different the cyber weapons world is, leading to new possibilities, but also new limitations.\n## 4.5 Cyber arms control\nA problem of what to do with cyber weapons found during an inspection as illegal under an Cyber Arms Control treaty is stated by Dorothy Denning . Within our proposed model, the\nKarlis Podins and Christian Czosseck\nsame public disclosure procedure as for cyber disarmament could be applied, after the found cyber weapon got analyzed to identify the vulnerability exploited by it. Wherever other copies of discovered cyber weapon are stored, they all rely on the same vulnerability (or same set of vulnerabilities), by disclosing those vulnerabilities one can effectively neutralize each and every of those copies at the same time.\n## 5. Conclusion\nCyber weapons are a new type of armament that follows different rules than the established rules of conventional weapons or weapons of mass destruction. The revolutionary nature of cyber weapons as a means and method of warfare demands the creation of a new conflict model.\nThis article proposes a highly-simplified, vulnerabilities-based model that defines and describes cyber weapons and cyber defense. The authors analyzed the relationships between hypothetical parties who would develop and employ cyber weapons. The model revealed a number of important findings, such as the fact that a defensive alliance, in which the parties exchanged their knowledge of cyber vulnerabilities, would lead to an enhanced offensive capability by every member of the alliance. Further, the authors proposed a strategy for cyber attack deterrence based on the introduced model. The restricted definition of cyber weapons together with vulnerability-based model has been shown useful for solving cyber arms control problem, and we hope that the model will show useful in other problems as well.\nThe examples used in this article primarily highlight the typical roles expected of nation-states, but the authors believe that the model's principles will apply in the corporate world as well.\nDisclaimer: The opinions expressed here are those of the authors and should not be considered as the official policy of the NATO Cooperative Cyber Defence Centre of Excellence or NATO.\n## Acknowledgements\nBoth authors contributed equally. The opinions shared in this article are those of the authors and do not represent the views of NATO or its member states. The authors would like to thank Mr. Kenneth Geers and Prof. Peeter Lorents who gave us valuable feedback while writing this article.",
  "citations": {
    "style": "author_year",
    "flat_text": "Karlis Podins and Christian Czosseck Cooperative Cyber Defence Centre of Excellence, Tallinn, Estonia karlis.podins@ccdcoe.org Christian.czosseck@ccdcoe.org Abstract: Throughout history, mankind has developed and employed novel weapons systems and equally novel countermeasures. Naturally, both offensive and defensive systems are limited by the laws of nature. Consequently, military concepts and doctrines were designed by implicitly taking into account those same limitations. The digital age has introduced a new class of weaponry that poses an initial challenge to our common understanding of conflict and warfare as for their different characteristics: cyber weapons. Cyber weapons and other terms like hacking are used frequently, commonly without giving clear definitions in the given context. We propose a restricted definition of cyber weapons as consisting primarily of data and knowledge, presenting themselves in the form of prepared and executed computer codes on or a sequence of user interactions with a vulnerable system. This article explores the crucial differences between the conventional weapons and cyber weapons domains, starting a debate on to which extent classical concepts and doctrines are applicable to cyber space and cyber conflict. This motivates a discussion on the role of vulnerabilities in IT systems and their impact to IT security and cyber attacks. The authors describe a vulnerability-based model for cyber weapons and for cyber defense. This model is then applied to describe the relationship between cyber-capable actors (e.g. nation-states). The proposed model clarifies important implications for cyber coalition-building, and disarmament. Furthermore, it presents a general solution for the problem of the destruction of cyber weapons, i.e. in the context of cyber arms control.\nKeywords: cyber weapons, cyber defense, disarmament, coalition, vulnerabilities # 1. Introduction As conflicts have moved into cyberspace (and vice versa), a clear understanding of cyber weapon becomes a necessity. The development of weapons was always part of mankind's history. Weapons evolved to suit the tactics, but from time to time new weapons revolutionized the tactics and strategies of warfare. The developments of artillery, gunpowder, aviation or weapons of mass destruction are just some examples from recent history. They all caused dramatic changes on the face of the battlefield. But all those weapons developed so far have similar kinetic and/or thermal properties due to the shared physical domain.\nIn the cyber attacks on Estonia in 2007, a campaign of massive distributed denial of service (DDoS) attacks against government websites, paired with hacking attempts against valuable targets like ISP backbone routers, a new type of conflict became a reality. Many more politically motivated DDoS attacks followed. It drew strong and inconsistent media attention, up to being termed the first cyber war in history, as discussed by. While Article 5 of the North Atlantic Treaty, governing mutual support among NATO nations in case of an armed attack was not invoked, national security leadership around the world received a wakeup call. However, several years later we still have not seen a commonly agreed definition of cyber weapons or cyber warfare (Ottis &amp; Lorents, 2010).\nIn first section we are going to define basic terms and give short overview about special properties of cyber domain and cyber weapons. The concepts and terminology initially used were based on our understanding of conventional weapons or weapons of mass destruction. Unfortunately, cyber weapons, being data and knowledge, follow other rules than their conventional counterparts. Thus the effects of cyber weapons on their target are different. In 2007 a direct, destructive cyber attack on a power generator was proven possible in a real life experiment. Latest prominent case, the Stuxnet virus, which is assumed to have sabotaged the Iran nuclear program starting from 2009, shows how powerful a cyber weapon in a real world setting can be (Falliere, Murchu, &amp; Chien, 2010; Langner, 2011). Some research states that conventional weapons framework is ineffective, is not applicable or has left a big gap between our assumptions about cyber weapons and reality (Sulek &amp; Moran, 2009). We do not want to get involved in this controversial discussion, but rather explicitly show some surprising aspects of cyber domain.\n\nSection 2 of the paper introduces a vulnerability-based model of cyber conflict. We argue that knowledge about vulnerabilities is key element in understanding both cyber offense and cyber defense, and build a simplified model of cyber conflict around this idea.\nIn section 3 we will apply the vulnerability-based model on selected aspects of cyber conflicts. By using the proposed model to describe relationship and interactions between cyber-capable actors we demonstrate applications of proposed approach.\n\nIn recent years, the prefix „Cyber “has become quite common and was added to many existing terms with the intention of extending its meaning into cyberspace (Ottis &amp; Lorents, 2010). While terms like cyber war (warfare), cyber defense or cyber weapons are widely used, there is a lack of commonly accepted definition, and authors often use terms without precisely describing their meaning.\nIn the context of this paper we would like to offer the following definitions.\nDefinition 1: Cyber Weapon and Cyber Attack.\nA cyber weapon is data and knowledge that is capable of, designed to and executed with the intention to affect the integrity, availability and/or confidentiality of an IT system (target) without its owner's approval. The target's defense is overcome by abusing existing vulnerabilities in the target.\nApplication of cyber weapon shall be named a Cyber Attack.\nDefinition 2: Vulnerability.\nA vulnerability is an exploitable flaw in an IT system, which allows an attacker to usurp privileges or trust, access data or execute commands, he normally would not be allowed or expected to. This includes mis- or known default configuration but excludes social engineering means. Possible examples are: taking control of a system, reading or modifying information stored or processed or adding functionality.\nWhen starting discussions on conflicts in cyberspace, one should clearly understand the cyber domain and its special properties. Cyberspace differs from conventional weapons domains, some differences being minor while some are of the utmost importance. We believe that ignoring these differences and straight-forward application of established concepts especially on weapons has caused some of the confusion around the cyber domain. In the following an overview of key differences between the cyber domain and the domain of conventional arms is provided. As for space reasons, an analogy to the domains of nuclear, biological and chemical (NBC) weapons is not made.\nThe confusion can be easily explained just by looking at the definitions. While established concept assumes weapon to be a physical object, cyber weapon under proposed definition is knowledge and data derived from it.\nThe extent and severity of cyber attacks can vary as recent history has shown, from local (loss of email confidentiality due to loss of password) to nation-wide. As for the time being, cyber attacks do not directly kill living beings, but can cause abuse of, malfunctions or the destruction of equipment. That, as a $2^{\\text{nd}}$ or higher order result, can lead to a lethal effect or further destruction.\nThe distance between attacker and target is irrelevant for conducting the attack as long as there is connectivity between them. By connectivity we mean possibility to communicate between the attacker and the target, including not only wired or wireless media, but alsomethods to transfer information between air-gapped networks (see e.g. Falliere et al., 2010; Langner, 2011). Considering the Internet as the global network, all connected computers, smart phones, cars, industrial control systems (SCADA), or Internet enabled household electronics are just some of the possible targets. As of the very nature of the Internet a cyber attack can be initiated from any (connected) place on this planet to reach almost everywhere.\nKarlis Podins and Christian Czosseck Launched attacks hit their target nearly instantly. While preparing a cyber attack might demand time consuming preparations, some of the effects could manifest itself in the blink of an eye. With this the defensive aspect of time, which can be used in conventional warfare to start a countermeasure against an attack, becomes less relevant.\nThere is no border or neutral area. National territory or borders on the Internet are only considered by legal departments, e.g., but so far those concepts have almost no everyday practical meaning. While it is possible to cut or limit nation's connectivity to Internet, the consequences for any modern nation state are too bizarre to consider it a long term solution.\nThe attribution of an attack to a cyber attacker is, with technical means, nearly impossible (Hunker &amp; Hutchinson, 2008). While attribution might be possible by also considering information from other sources and by analyzing the behavior and beneficial outcome for other parties, this is not guaranteed. The Conficker worm so far has not been attributed to any party, although considerable public and security community attention was focused to it, as well as USD 250,000 bounty was offered by Microsoft(\"Microsoft Collaborates With Industry to Disrupt Conficker Worm,\"2009). If an attacker plots his attacks with enough care, he could even maintain a steady attack on his adversary without being identified (Lemay, Fernandez, &amp; Knight, 2010). But having, to a reasonable extent, a confirmed source is a common requirement for the attacked party to take active countermeasures, especially if they are of violent nature.\nCyber weapons do not have a physical nature, they are knowledge and data as defined above. To conduct a cyber attack, the attacker has to send data to the victim. Most can be made persistent, e.g. by writing a script or program and storing this on an IT system. Like ordinary files, those cyber weapons can then be copied without noteworthy costs so the number of copies of a cyber weapon is usually irrelevant. Storage and transportation of cyber weapons also seem easier than for physical counterparts, one party could even decide to keep a copy or even the whole cyber weapon arsenal outside its own borders, hiding it in different places all over the Internet.\nCyber weapons production costs are mainly human resources related. While we recognize the initial investment in R&amp;D as necessary, success of lone hackers and loose groups (Anonymous, LulzSec) shows that a lot can be achieved with limited funds. We believe that especially for a nation-state it is a minor expense compared to development of advanced conventional weapons. The production of conventional weapons depends mostly on the costs of fabrication, which often is a combination of labor costs, materials, machines and infrastructure. In contradiction to this, cyber weapons are constructed mainly by human knowledge on relatively cheap IT equipment. Their skills and knowledge in areas like software development, exploit development and penetration testing are the essence of the attack. Hiring the right personnel and keeping or extending their skills is the major investment needed to maintain or extend a cyber weapons arsenal.\nThe knowledge of a target's vulnerabilities and how to exploit them is of central importance to the attacker. On the other side, this knowledge is also the most important piece of information needed by the target of the attack to set up an efficient defense.\nThis leads us to the 1st paradox of cyber weapons: they are subject to time-decay. If a cyber weapon is exploiting a vulnerability, it is effective as long as the target IT system has this vulnerability. Vulnerabilities get discovered and patched, and target systems can change their software/hardware at their will, so the period of effectiveness for a cyber weapon is undefined, but likely to decrease the longer the vulnerability is known. This aspect is also discussed in (Moore, Friedman, &amp; Procaccia, 2010).\nThe $2^{nd}$ paradox is that of cyber weapons usage may lead to the target enhancing its defense in a very short time. As soon as a cyber attack is executed, the target might have means in place to detect that an attack occurred and how it was conducted. While the initial attack might have been successful, the likelihood that a proper defense can be built after it is reasonably high, rendering the used cyber weapon useless against the same target and even against others in cases of existing cooperation or disclosure. An example is specially crafted malware. As soon as samples of a particular new malware get collected and analyzed, appropriate antivirus, IDS and software patching could be done rather fast. Still this is ultimately decided by the capabilities for the actors.\n\nThis has consequences for one's ability to test the effectiveness of cyber weapons. As soon as a certain cyber weapon is tested in the wild or even against the target itself, the likelihood is reasonably high to believe that security-aware targets will find a way to enhance their defense against the attack. (It is recognized that techniques are available to the attacker to re-launch the same attack using changed code, and that the target can only learn from an attack if he recognizes it in the first place.) But testing those attacks in a closed test environment will not always guarantee their successful later deployment, as it will be hard for the attacker to build a reasonably complete testing environment with the true attributes of the real target. Nevertheless, it has to be pointed out, that it is quite common to use commercial off-the-shelf hardware and software, which can also be easily acquired by the attacker in order to test his defenses.\nThe given unique attributes and examples support our opinion, that conventional arms and the ways we use them, are different from cyber weapons. This is why in the following section we propose a model to describe cyber domain and conflicts within.\n## 3. A vulnerability based view on cyber weapons The actors (parties) of cyber incidents might be individuals, groups of individuals, companies or nation-states. All possible combinations of parties attacking each other with cyber weapons reflect different scenarios, which, depending on effects, we would call criminal acts, industrial espionage, terrorism, conflicts or even (cyber) war. While a discussion on mapping these terms in the cyber landscape might be reasonable, we would like to state that the proposed model is generic enough to be applicable to all of them, because it focuses on the underlying mechanics. Considering the scope of this paper, we will use the term cyber conflict for all those mentioned combinations.\n## 3.1 Vulnerabilities Vulnerabilities, the knowledge about and the skills to exploit them, are of utter importance in any form of cyber conflict. It is quite clear that without exploitable vulnerabilities, cyber attacks would be pretty much limited to (D)DoS attacks (as they do not rely on a flaw in the target, but limit their targets' accessibility by exhausting bandwidth, CPU or other limited resource) or attempts to manipulate users through social engineering to get access to the target's system. To reflect that, we propose to take vulnerability as a basic entity and analyze cyber weapons and conflict by looking at them from a vulnerability point of view.\nVulnerabilities differ in their severity. Some of them enable an adversary to conduct a cyber attack against a target (e.g. root access), while some are likely not to be of any use to an attacker. The internationally recognized Common Vulnerability Scoring System introduces an open framework enabling one to score and compare the severity of a vulnerability based on its intrinsic qualities, its behavior over time and its environmental uniqueness (Mell, Scarfone, &amp; Romanosky, 2007). While comparing individual vulnerabilities, it makes a difference how severe every single one of them is. However, we will save a detailed examination of this issue for future research. For the moment, it might be safe to only consider those potentially leading to a complete violation of availability, confidentiality or integrity of an attacked IT system.\nThe dynamic nature of IT implies that the set of vulnerabilities changes over time. When new code gets installed, new vulnerabilities are added and/or other vulnerabilities get removed. There is a considerable amount of vulnerabilities publicly disclosed every day (e.g. at the National Vulnerability Database ) but some vulnerabilities remain unpatched although known to the public for decades.\nNaturally, there exists a set of all vulnerabilities that are in the software installed somewhere. This is not constant and changes every time new software is installed, removed or configured. Each party has knowledge about some of the vulnerabilities. There are vulnerabilities unknown to all parties. As such the union of all parties known vulnerabilities still might not give all existing vulnerabilities.\n## 3.2 Cyber defense Apparently a system without vulnerabilities is well defended against majority of cyber attack (apart from DoS based attacks). The defender of a target system has three options to render a vulnerability-based cyber weapon w useless.\n\n# Karlis Podins and Christian Czosseck\nBy knowing about vulnerabilities exploited by $w$ and having own infrastructure immune against $w$ by patching its own systems accordingly;\nBy putting in place means to effectively make an existing, unpatched vulnerability not exposed to the attacker (e.g. by using firewalls hiding a service to the Internet or signature-based attack detection). This would also apply to vulnerabilities unknown to the defender but coincidentally covered;\nBy putting in place means to detect and mitigate cyber attacks before their effect manifests itself.\nOne could assume that cyber security aware parties have full control over and knowledge about their own IT assets, making sure not to be vulnerable to attacks they known by themselves (as they ultimately relay on vulnerabilities). Realty shows us that this does not hold true all the time, but nevertheless we keep this assumption for the sake of simplicity, assuming the target to be capable and willing for defending his cyber frontline.\n## 3.3 Cyber weapons development\nCyber Weapons are produced based on knowledge of target's vulnerabilities. It should be clear that before developing any weapon $w$, a party must have knowledge about the vulnerabilities the weapon will exploit and for any given weapon $w$ it is possible to find respective vulnerabilities.\nMore formally speaking, there exists a natural mapping $e$ from cyber weapons to vulnerabilities they exploit. For any given weapon $w$, the set $e(w)$ is either empty (in the case of a DoS attack or cases of social engineering) or it contains at least one vulnerability.\nSometimes, successfully attacked IT Systems can be used for manual or automated creation of (new) cyber weapons for further attacks, e.g. sending infected emails to all persons in contact list or probing the local network for other vulnerable machines.\nTo effectively enlarge one's weapons arsenal with new weapons, a party is required to find an additional vulnerability.\nAs time passes, other parties discover vulnerabilities in a non-deterministic manner. When a party discovers a vulnerability $v$, we can assume that their defenses are upgraded, making weapons exploiting vulnerability $v$ ineffective against party $p$. Research by Moore et al.  propose a similar vulnerability-based look but assumes the opposite, that own infrastructure is not patched not to warn the opposing parties of discovered vulnerabilities, coming to noteworthy conclusions.\nAdditionally, it seems reasonable to assume that the target party $t$ has adequate logging and attack detection systems in place and will be capable of identifying exploited vulnerabilities at least after they have been used by a cyber weapon, leading to improved cyber defense.\nThis stresses again the overlap between cyber attacks and defenses and vulnerability discovery plays a central role both for attackers and defenders.\n## 4. Implications on party relationships\nIn following section we will test vulnerability-based thinking by applying it to model cyber disarmament, coalitions, collective defense, pacifism and arms control.\n## 4.1 Cyber disarmament\nIn contrast to vague cyber disarmament discussion  the proposed model offers an effective method of cyber weapon disarmament, as asked for by (Cahill &amp; Rozinov, 2003). Disarmament of cyberspace could be achieved by public vulnerability disclosure. If a party wants to verifiably dismantle some of its cyber weapons, it could publicly disclose all the vulnerabilities used by them. Unlike in real-world disarmament, which affects only the disarming party, cyber disarmament is global. After other parties have adequately reacted to disclosed information, all cyber weapons using disclosed vulnerabilities are rendered useless. This is regardless if they are in the possession of the disarming party or by another party.\nKarlis Podins and Christian Czosseck\nBut there are further peculiarities. Unlike in the conventional weapons domain, if a party $p$ dismantles a set of cyber weapons by disclosing the respective vulnerabilities, defense of $p$ is not affected. Following our assumption that a party always tries to be protected against all known vulnerabilities, $p$ does not disclose a new attack vector against itself, leaving its adversaries without an advantage by this action.\n$P$'s offensive capabilities are decreased by an unknown factor, depending on how many other parties had the disclosed vulnerabilities in their IT systems.\n## 4.2 Cyber coalitions\nIf two or more parties would mutually agree on cyber disarmament, public vulnerability disclosure can be used with the consequences as described before. But an interesting approach would be a mutual vulnerability disclosure; it effectively means that cyber weapons involved in the mutual disarmament would be ineffective against other parties involved in the disarmament agreement, but still potentially effective against $3^{\\text{rd}}$ parties.\nBy exchanging information on vulnerabilities between each other one enables the other to build new weapons based on the newly learned vulnerabilities. But at the same moment both become immune to cyber attacks based on the exchanged vulnerabilities, as soon as they have implemented the necessary changes in their defense. Their offensive capabilities to attack each other decreases or remains the same.\nLet $c$ be any other $3^{\\text{rd}}$ party not part of the treaty or coalition between $a$ and $b$. With the newly won knowledge both parties $a$ and $b$ might have gain additional knowledge to build a cyber weapon $c$ is vulnerable to, enhancing their offensive capabilities against $c$ or at least remaining the same.\n## 4.3 Cooperative cyber defense\nBased on the definition of cyber defense given above, cooperation in cyber defense between two or more parties can manifest by exchanging of vulnerability information and/or attack detection procedures, if it provides tangible benefits to each party.\nBut in the case of vulnerability information exchange, there is no difference from the aforementioned cyber coalition. This leads to the observation that it is possible for cooperative cyber defense to be indistinguishable from a cyber coalition.\nTo arrange a cooperative cyber defense that is purely defensive in nature, the cooperation between the parties would be limited to the exchange of signatures and other attack detection information without sharing vulnerabilities per se. If knowledge about vulnerabilities shall also be shared without giving an offensive advantage to the parties, it must be done by public disclose with the consequences as described under cyber disarmament.\n## 4.4 Cyber pacifism\nPacific movement is usually limited to protest when in conventional weapons domain. But this could change in the cyber space.\nApart from voicing concerns about cyber weapons as discussed in , a more active strategy could be to actively search for vulnerabilities and publicly disclose them as soon as possible. As in the case of cyber disarmament, it would universally destroy the corresponding cyber weapons, hitting the weapons arsenals of many parties simultaneously.\nAssuming enough resources are present, the cyber pacifist can have a significant impact on the cyber weapons arsenals of other nation-states without committing any aggressive actions. This again shows how different the cyber weapons world is, leading to new possibilities, but also new limitations.\n## 4.5 Cyber arms control\nA problem of what to do with cyber weapons found during an inspection as illegal under an Cyber Arms Control treaty is stated by Dorothy Denning . Within our proposed model, the\nKarlis Podins and Christian Czosseck\nsame public disclosure procedure as for cyber disarmament could be applied, after the found cyber weapon got analyzed to identify the vulnerability exploited by it. Wherever other copies of discovered cyber weapon are stored, they all rely on the same vulnerability (or same set of vulnerabilities), by disclosing those vulnerabilities one can effectively neutralize each and every of those copies at the same time.\n## 5. Conclusion\nCyber weapons are a new type of armament that follows different rules than the established rules of conventional weapons or weapons of mass destruction. The revolutionary nature of cyber weapons as a means and method of warfare demands the creation of a new conflict model.\nThis article proposes a highly-simplified, vulnerabilities-based model that defines and describes cyber weapons and cyber defense. The authors analyzed the relationships between hypothetical parties who would develop and employ cyber weapons. The model revealed a number of important findings, such as the fact that a defensive alliance, in which the parties exchanged their knowledge of cyber vulnerabilities, would lead to an enhanced offensive capability by every member of the alliance. Further, the authors proposed a strategy for cyber attack deterrence based on the introduced model. The restricted definition of cyber weapons together with vulnerability-based model has been shown useful for solving cyber arms control problem, and we hope that the model will show useful in other problems as well.\nThe examples used in this article primarily highlight the typical roles expected of nation-states, but the authors believe that the model's principles will apply in the corporate world as well.\nDisclaimer: The opinions expressed here are those of the authors and should not be considered as the official policy of the NATO Cooperative Cyber Defence Centre of Excellence or NATO.\n## Acknowledgements\nBoth authors contributed equally. The opinions shared in this article are those of the authors and do not represent the views of NATO or its member states. The authors would like to thank Mr. Kenneth Geers and Prof. Peeter Lorents who gave us valuable feedback while writing this article.",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "198\n# A Vulnerability-Based Model of Cyber Weapons and its Implications for Cyber Conflict\nKarlis Podins and Christian Czosseck\nCooperative Cyber Defence Centre of Excellence, Tallinn, Estonia\nkarlis.podins@ccdcoe.org\nChristian.czosseck@ccdcoe.org\nAbstract: Throughout history, mankind has developed and employed novel weapons systems and equally novel countermeasures. Naturally, both offensive and defensive systems are limited by the laws of nature. Consequently, military concepts and doctrines were designed by implicitly taking into account those same limitations. The digital age has introduced a new class of weaponry that poses an initial challenge to our common understanding of conflict and warfare as for their different characteristics: cyber weapons. Cyber weapons and other terms like hacking are used frequently, commonly without giving clear definitions in the given context. We propose a restricted definition of cyber weapons as consisting primarily of data and knowledge, presenting themselves in the form of prepared and executed computer codes on or a sequence of user interactions with a vulnerable system. This article explores the crucial differences between the conventional weapons and cyber weapons domains, starting a debate on to which extent classical concepts and doctrines are applicable to cyber space and cyber conflict. This motivates a discussion on the role of vulnerabilities in IT systems and their impact to IT security and cyber attacks. The authors describe a vulnerability-based model for cyber weapons and for cyber defense. This model is then applied to describe the relationship between cyber-capable actors (e.g. nation-states). The proposed model clarifies important implications for cyber coalition-building, and disarmament. Furthermore, it presents a general solution for the problem of the destruction of cyber weapons, i.e. in the context of cyber arms control.\nKeywords: cyber weapons, cyber defense, disarmament, coalition, vulnerabilities\n# 1. Introduction\nAs conflicts have moved into cyberspace (and vice versa), a clear understanding of cyber weapon becomes a necessity. The development of weapons was always part of mankind's history. Weapons evolved to suit the tactics, but from time to time new weapons revolutionized the tactics and strategies of warfare. The developments of artillery, gunpowder, aviation or weapons of mass destruction are just some examples from recent history. They all caused dramatic changes on the face of the battlefield. But all those weapons developed so far have similar kinetic and/or thermal properties due to the shared physical domain.\nIn the cyber attacks on Estonia in 2007, a campaign of massive distributed denial of service (DDoS) attacks against government websites, paired with hacking attempts against valuable targets like ISP backbone routers, a new type of conflict became a reality (Evron, 2008). Many more politically motivated DDoS attacks followed (Nazario, 2009). It drew strong and inconsistent media attention, up to being termed the first cyber war in history, as discussed by (Farivar, 2009). While Article 5 of the North Atlantic Treaty, governing mutual support among NATO nations in case of an armed attack was not invoked, national security leadership around the world received a wakeup call. However, several years later we still have not seen a commonly agreed definition of cyber weapons or cyber warfare (Ottis &amp; Lorents, 2010).\nIn first section we are going to define basic terms and give short overview about special properties of cyber domain and cyber weapons. The concepts and terminology initially used were based on our understanding of conventional weapons or weapons of mass destruction (Sharma, 2009). Unfortunately, cyber weapons, being data and knowledge, follow other rules than their conventional counterparts. Thus the effects of cyber weapons on their target are different. In 2007 a direct, destructive cyber attack on a power generator was proven possible in a real life experiment (Herold, 2007). Latest prominent case, the Stuxnet virus, which is assumed to have sabotaged the Iran nuclear program starting from 2009, shows how powerful a cyber weapon in a real world setting can be (Falliere, Murchu, &amp; Chien, 2010; Langner, 2011). Some research states that conventional weapons framework is ineffective, is not applicable or has left a big gap between our assumptions about cyber weapons and reality (Sulek &amp; Moran, 2009). We do not want to get involved in this controversial discussion, but rather explicitly show some surprising aspects of cyber domain.\n199\nKarlis Podins and Christian Czosseck\nSection 2 of the paper introduces a vulnerability-based model of cyber conflict. We argue that knowledge about vulnerabilities is key element in understanding both cyber offense and cyber defense, and build a simplified model of cyber conflict around this idea.\nIn section 3 we will apply the vulnerability-based model on selected aspects of cyber conflicts. By using the proposed model to describe relationship and interactions between cyber-capable actors we demonstrate applications of proposed approach.\n2. The cyber domain and its weapons\nIn recent years, the prefix „Cyber“ has become quite common and was added to many existing terms with the intention of extending its meaning into cyberspace (Ottis &amp; Lorents, 2010). While terms like cyber war (warfare), cyber defense or cyber weapons are widely used, there is a lack of commonly accepted definition, and authors often use terms without precisely describing their meaning.\nIn the context of this paper we would like to offer the following definitions.\nDefinition 1: Cyber Weapon and Cyber Attack.\nA cyber weapon is data and knowledge that is capable of, designed to and executed with the intention to affect the integrity, availability and/or confidentiality of an IT system (target) without its owner's approval. The target's defense is overcome by abusing existing vulnerabilities in the target.\nApplication of cyber weapon shall be named a Cyber Attack.\nDefinition 2: Vulnerability.\nA vulnerability is an exploitable flaw in an IT system, which allows an attacker to usurp privileges or trust, access data or execute commands, he normally would not be allowed or expected to. This includes mis- or known default configuration but excludes social engineering means. Possible examples are: taking control of a system, reading or modifying information stored or processed or adding functionality.\nWhen starting discussions on conflicts in cyberspace, one should clearly understand the cyber domain and its special properties. Cyberspace differs from conventional weapons domains, some differences being minor while some are of the utmost importance. We believe that ignoring these differences and straight-forward application of established concepts especially on weapons has caused some of the confusion around the cyber domain. In the following an overview of key differences between the cyber domain and the domain of conventional arms is provided. As for space reasons, an analogy to the domains of nuclear, biological and chemical (NBC) weapons is not made.\nThe confusion can be easily explained just by looking at the definitions. While established concept assumes weapon to be a physical object, cyber weapon under proposed definition is knowledge and data derived from it.\nThe extent and severity of cyber attacks can vary as recent history has shown, from local (loss of email confidentiality due to loss of password) to nation-wide (Ottis, 2008). As for the time being, cyber attacks do not directly kill living beings, but can cause abuse of, malfunctions or the destruction of equipment. That, as a  $2^{\\text{nd}}$  or higher order result, can lead to a lethal effect or further destruction (Ziolkowski, 2010).\nThe distance between attacker and target is irrelevant for conducting the attack as long as there is connectivity between them. By connectivity we mean possibility to communicate between the attacker and the target, including not only wired or wireless media, but alsomethods to transfer information between air-gapped networks (see e.g. Falliere et al., 2010; Langner, 2011). Considering the Internet as the global network, all connected computers, smart phones, cars, industrial control systems (SCADA), or Internet enabled household electronics are just some of the possible targets. As of the very nature of the Internet a cyber attack can be initiated from any (connected) place on this planet to reach almost everywhere.\nKarlis Podins and Christian Czosseck\nLaunched attacks hit their target nearly instantly. While preparing a cyber attack might demand time consuming preparations, some of the effects could manifest itself in the blink of an eye. With this the defensive aspect of time, which can be used in conventional warfare to start a countermeasure against an attack, becomes less relevant.\nThere is no border or neutral area. National territory or borders on the Internet are only considered by legal departments, e.g. (Kelsey, 2008), but so far those concepts have almost no everyday practical meaning. While it is possible to cut or limit nation's connectivity to Internet, the consequences for any modern nation state are too bizarre to consider it a long term solution.\nThe attribution of an attack to a cyber attacker is, with technical means, nearly impossible (Hunker &amp; Hutchinson, 2008). While attribution might be possible by also considering information from other sources and by analyzing the behavior and beneficial outcome for other parties (Ottis, 2008), this is not guaranteed. The Conficker worm so far has not been attributed to any party, although considerable public and security community attention was focused to it, as well as USD 250,000 bounty was offered by Microsoft(\"Microsoft Collaborates With Industry to Disrupt Conficker Worm,\" 2009). If an attacker plots his attacks with enough care, he could even maintain a steady attack on his adversary without being identified (Lemay, Fernandez, &amp; Knight, 2010). But having, to a reasonable extent, a confirmed source is a common requirement for the attacked party to take active countermeasures, especially if they are of violent nature (Ziolkowski, 2010).\nCyber weapons do not have a physical nature, they are knowledge and data as defined above. To conduct a cyber attack, the attacker has to send data to the victim. Most can be made persistent, e.g. by writing a script or program and storing this on an IT system. Like ordinary files, those cyber weapons can then be copied without noteworthy costs so the number of copies of a cyber weapon is usually irrelevant. Storage and transportation of cyber weapons also seem easier than for physical counterparts, one party could even decide to keep a copy or even the whole cyber weapon arsenal outside its own borders, hiding it in different places all over the Internet.\nCyber weapons production costs are mainly human resources related. While we recognize the initial investment in R&amp;D as necessary, success of lone hackers and loose groups (Anonymous, LulzSec) shows that a lot can be achieved with limited funds. We believe that especially for a nation-state it is a minor expense compared to development of advanced conventional weapons. The production of conventional weapons depends mostly on the costs of fabrication, which often is a combination of labor costs, materials, machines and infrastructure. In contradiction to this, cyber weapons are constructed mainly by human knowledge on relatively cheap IT equipment. Their skills and knowledge in areas like software development, exploit development and penetration testing are the essence of the attack. Hiring the right personnel and keeping or extending their skills is the major investment needed to maintain or extend a cyber weapons arsenal (Miller, 2010).\nThe knowledge of a target's vulnerabilities and how to exploit them is of central importance to the attacker. On the other side, this knowledge is also the most important piece of information needed by the target of the attack to set up an efficient defense.\nThis leads us to the 1st paradox of cyber weapons: they are subject to time-decay. If a cyber weapon is exploiting a vulnerability, it is effective as long as the target IT system has this vulnerability. Vulnerabilities get discovered and patched, and target systems can change their software/hardware at their will, so the period of effectiveness for a cyber weapon is undefined, but likely to decrease the longer the vulnerability is known. This aspect is also discussed in (Moore, Friedman, &amp; Procaccia, 2010).\nThe  $2^{nd}$  paradox is that of cyber weapons usage may lead to the target enhancing its defense in a very short time. As soon as a cyber attack is executed, the target might have means in place to detect that an attack occurred and how it was conducted. While the initial attack might have been successful, the likelihood that a proper defense can be built after it is reasonably high, rendering the used cyber weapon useless against the same target and even against others in cases of existing cooperation or disclosure. An example is specially crafted malware. As soon as samples of a particular new malware get collected and analyzed, appropriate antivirus, IDS and software patching could be done rather fast. Still this is ultimately decided by the capabilities for the actors.\n200\nKarlis Podins and Christian Czosseck\nThis has consequences for one's ability to test the effectiveness of cyber weapons. As soon as a certain cyber weapon is tested in the wild or even against the target itself, the likelihood is reasonably high to believe that security-aware targets will find a way to enhance their defense against the attack. (It is recognized that techniques are available to the attacker to re-launch the same attack using changed code, and that the target can only learn from an attack if he recognizes it in the first place.) But testing those attacks in a closed test environment will not always guarantee their successful later deployment, as it will be hard for the attacker to build a reasonably complete testing environment with the true attributes of the real target. Nevertheless, it has to be pointed out, that it is quite common to use commercial off-the-shelf hardware and software, which can also be easily acquired by the attacker in order to test his defenses.\nThe given unique attributes and examples support our opinion, that conventional arms and the ways we use them, are different from cyber weapons. This is why in the following section we propose a model to describe cyber domain and conflicts within.\n## 3. A vulnerability based view on cyber weapons\nThe actors (parties) of cyber incidents might be individuals, groups of individuals, companies or nation-states. All possible combinations of parties attacking each other with cyber weapons reflect different scenarios, which, depending on effects, we would call criminal acts, industrial espionage, terrorism, conflicts or even (cyber) war. While a discussion on mapping these terms in the cyber landscape might be reasonable, we would like to state that the proposed model is generic enough to be applicable to all of them, because it focuses on the underlying mechanics. Considering the scope of this paper, we will use the term cyber conflict for all those mentioned combinations.\n## 3.1 Vulnerabilities\nVulnerabilities, the knowledge about and the skills to exploit them, are of utter importance in any form of cyber conflict. It is quite clear that without exploitable vulnerabilities, cyber attacks would be pretty much limited to (D)DoS attacks (as they do not rely on a flaw in the target, but limit their targets' accessibility by exhausting bandwidth, CPU or other limited resource) or attempts to manipulate users through social engineering to get access to the target's system. To reflect that, we propose to take vulnerability as a basic entity and analyze cyber weapons and conflict by looking at them from a vulnerability point of view.\nVulnerabilities differ in their severity. Some of them enable an adversary to conduct a cyber attack against a target (e.g. root access), while some are likely not to be of any use to an attacker. The internationally recognized Common Vulnerability Scoring System introduces an open framework enabling one to score and compare the severity of a vulnerability based on its intrinsic qualities, its behavior over time and its environmental uniqueness (Mell, Scarfone, &amp; Romanosky, 2007). While comparing individual vulnerabilities, it makes a difference how severe every single one of them is. However, we will save a detailed examination of this issue for future research. For the moment, it might be safe to only consider those potentially leading to a complete violation of availability, confidentiality or integrity of an attacked IT system.\nThe dynamic nature of IT implies that the set of vulnerabilities changes over time. When new code gets installed, new vulnerabilities are added and/or other vulnerabilities get removed. There is a considerable amount of vulnerabilities publicly disclosed every day (e.g. at the National Vulnerability Database (Security, 2010)) but some vulnerabilities remain unpatched although known to the public for decades (Oiaga, 2010).\nNaturally, there exists a set of all vulnerabilities that are in the software installed somewhere. This is not constant and changes every time new software is installed, removed or configured. Each party has knowledge about some of the vulnerabilities. There are vulnerabilities unknown to all parties. As such the union of all parties known vulnerabilities still might not give all existing vulnerabilities.\n## 3.2 Cyber defense\nApparently a system without vulnerabilities is well defended against majority of cyber attack (apart from DoS based attacks). The defender of a target system has three options to render a vulnerability-based cyber weapon w useless.\n201\n202\n# Karlis Podins and Christian Czosseck\nBy knowing about vulnerabilities exploited by $w$ and having own infrastructure immune against $w$ by patching its own systems accordingly;\nBy putting in place means to effectively make an existing, unpatched vulnerability not exposed to the attacker (e.g. by using firewalls hiding a service to the Internet or signature-based attack detection). This would also apply to vulnerabilities unknown to the defender but coincidentally covered;\nBy putting in place means to detect and mitigate cyber attacks before their effect manifests itself.\nOne could assume that cyber security aware parties have full control over and knowledge about their own IT assets, making sure not to be vulnerable to attacks they known by themselves (as they ultimately relay on vulnerabilities). Realty shows us that this does not hold true all the time, but nevertheless we keep this assumption for the sake of simplicity, assuming the target to be capable and willing for defending his cyber frontline.\n## 3.3 Cyber weapons development\nCyber Weapons are produced based on knowledge of target's vulnerabilities. It should be clear that before developing any weapon $w$, a party must have knowledge about the vulnerabilities the weapon will exploit and for any given weapon $w$ it is possible to find respective vulnerabilities.\nMore formally speaking, there exists a natural mapping $e$ from cyber weapons to vulnerabilities they exploit. For any given weapon $w$, the set $e(w)$ is either empty (in the case of a DoS attack or cases of social engineering) or it contains at least one vulnerability.\nSometimes, successfully attacked IT Systems can be used for manual or automated creation of (new) cyber weapons for further attacks, e.g. sending infected emails to all persons in contact list or probing the local network for other vulnerable machines.\nTo effectively enlarge one's weapons arsenal with new weapons, a party is required to find an additional vulnerability.\nAs time passes, other parties discover vulnerabilities in a non-deterministic manner. When a party discovers a vulnerability $v$, we can assume that their defenses are upgraded, making weapons exploiting vulnerability $v$ ineffective against party $p$. Research by Moore et al. (Moore et al., 2010) propose a similar vulnerability-based look but assumes the opposite, that own infrastructure is not patched not to warn the opposing parties of discovered vulnerabilities, coming to noteworthy conclusions.\nAdditionally, it seems reasonable to assume that the target party $t$ has adequate logging and attack detection systems in place and will be capable of identifying exploited vulnerabilities at least after they have been used by a cyber weapon, leading to improved cyber defense.\nThis stresses again the overlap between cyber attacks and defenses and vulnerability discovery plays a central role both for attackers and defenders.\n## 4. Implications on party relationships\nIn following section we will test vulnerability-based thinking by applying it to model cyber disarmament, coalitions, collective defense, pacifism and arms control.\n## 4.1 Cyber disarmament\nIn contrast to vague cyber disarmament discussion (Gjelten, 2010) the proposed model offers an effective method of cyber weapon disarmament, as asked for by (Cahill &amp; Rozinov, 2003). Disarmament of cyberspace could be achieved by public vulnerability disclosure. If a party wants to verifiably dismantle some of its cyber weapons, it could publicly disclose all the vulnerabilities used by them. Unlike in real-world disarmament, which affects only the disarming party, cyber disarmament is global. After other parties have adequately reacted to disclosed information, all cyber weapons using disclosed vulnerabilities are rendered useless. This is regardless if they are in the possession of the disarming party or by another party.\nKarlis Podins and Christian Czosseck\nBut there are further peculiarities. Unlike in the conventional weapons domain, if a party $p$ dismantles a set of cyber weapons by disclosing the respective vulnerabilities, defense of $p$ is not affected. Following our assumption that a party always tries to be protected against all known vulnerabilities, $p$ does not disclose a new attack vector against itself, leaving its adversaries without an advantage by this action.\n$P$'s offensive capabilities are decreased by an unknown factor, depending on how many other parties had the disclosed vulnerabilities in their IT systems.\n## 4.2 Cyber coalitions\nIf two or more parties would mutually agree on cyber disarmament, public vulnerability disclosure can be used with the consequences as described before. But an interesting approach would be a mutual vulnerability disclosure; it effectively means that cyber weapons involved in the mutual disarmament would be ineffective against other parties involved in the disarmament agreement, but still potentially effective against $3^{\\text{rd}}$ parties.\nBy exchanging information on vulnerabilities between each other one enables the other to build new weapons based on the newly learned vulnerabilities. But at the same moment both become immune to cyber attacks based on the exchanged vulnerabilities, as soon as they have implemented the necessary changes in their defense. Their offensive capabilities to attack each other decreases or remains the same.\nLet $c$ be any other $3^{\\text{rd}}$ party not part of the treaty or coalition between $a$ and $b$. With the newly won knowledge both parties $a$ and $b$ might have gain additional knowledge to build a cyber weapon $c$ is vulnerable to, enhancing their offensive capabilities against $c$ or at least remaining the same.\n## 4.3 Cooperative cyber defense\nBased on the definition of cyber defense given above, cooperation in cyber defense between two or more parties can manifest by exchanging of vulnerability information and/or attack detection procedures, if it provides tangible benefits to each party.\nBut in the case of vulnerability information exchange, there is no difference from the aforementioned cyber coalition. This leads to the observation that it is possible for cooperative cyber defense to be indistinguishable from a cyber coalition.\nTo arrange a cooperative cyber defense that is purely defensive in nature, the cooperation between the parties would be limited to the exchange of signatures and other attack detection information without sharing vulnerabilities per se. If knowledge about vulnerabilities shall also be shared without giving an offensive advantage to the parties, it must be done by public disclose with the consequences as described under cyber disarmament.\n## 4.4 Cyber pacifism\nPacific movement is usually limited to protest when in conventional weapons domain. But this could change in the cyber space.\nApart from voicing concerns about cyber weapons as discussed in (Rowe, 2007), a more active strategy could be to actively search for vulnerabilities and publicly disclose them as soon as possible. As in the case of cyber disarmament, it would universally destroy the corresponding cyber weapons, hitting the weapons arsenals of many parties simultaneously.\nAssuming enough resources are present, the cyber pacifist can have a significant impact on the cyber weapons arsenals of other nation-states without committing any aggressive actions. This again shows how different the cyber weapons world is, leading to new possibilities, but also new limitations.\n## 4.5 Cyber arms control\nA problem of what to do with cyber weapons found during an inspection as illegal under an Cyber Arms Control treaty is stated by Dorothy Denning (Denning, 2001). Within our proposed model, the\nKarlis Podins and Christian Czosseck\nsame public disclosure procedure as for cyber disarmament could be applied, after the found cyber weapon got analyzed to identify the vulnerability exploited by it. Wherever other copies of discovered cyber weapon are stored, they all rely on the same vulnerability (or same set of vulnerabilities), by disclosing those vulnerabilities one can effectively neutralize each and every of those copies at the same time.\n## 5. Conclusion\nCyber weapons are a new type of armament that follows different rules than the established rules of conventional weapons or weapons of mass destruction. The revolutionary nature of cyber weapons as a means and method of warfare demands the creation of a new conflict model.\nThis article proposes a highly-simplified, vulnerabilities-based model that defines and describes cyber weapons and cyber defense. The authors analyzed the relationships between hypothetical parties who would develop and employ cyber weapons. The model revealed a number of important findings, such as the fact that a defensive alliance, in which the parties exchanged their knowledge of cyber vulnerabilities, would lead to an enhanced offensive capability by every member of the alliance. Further, the authors proposed a strategy for cyber attack deterrence based on the introduced model. The restricted definition of cyber weapons together with vulnerability-based model has been shown useful for solving cyber arms control problem, and we hope that the model will show useful in other problems as well.\nThe examples used in this article primarily highlight the typical roles expected of nation-states, but the authors believe that the model's principles will apply in the corporate world as well.\nDisclaimer: The opinions expressed here are those of the authors and should not be considered as the official policy of the NATO Cooperative Cyber Defence Centre of Excellence or NATO.\n## Acknowledgements\nBoth authors contributed equally. The opinions shared in this article are those of the authors and do not represent the views of NATO or its member states. The authors would like to thank Mr. Kenneth Geers and Prof. Peeter Lorents who gave us valuable feedback while writing this article."
    },
    "numeric": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "198\n# A Vulnerability-Based Model of Cyber Weapons and its Implications for Cyber Conflict\nKarlis Podins and Christian Czosseck\nCooperative Cyber Defence Centre of Excellence, Tallinn, Estonia\nkarlis.podins@ccdcoe.org\nChristian.czosseck@ccdcoe.org\nAbstract: Throughout history, mankind has developed and employed novel weapons systems and equally novel countermeasures. Naturally, both offensive and defensive systems are limited by the laws of nature. Consequently, military concepts and doctrines were designed by implicitly taking into account those same limitations. The digital age has introduced a new class of weaponry that poses an initial challenge to our common understanding of conflict and warfare as for their different characteristics: cyber weapons. Cyber weapons and other terms like hacking are used frequently, commonly without giving clear definitions in the given context. We propose a restricted definition of cyber weapons as consisting primarily of data and knowledge, presenting themselves in the form of prepared and executed computer codes on or a sequence of user interactions with a vulnerable system. This article explores the crucial differences between the conventional weapons and cyber weapons domains, starting a debate on to which extent classical concepts and doctrines are applicable to cyber space and cyber conflict. This motivates a discussion on the role of vulnerabilities in IT systems and their impact to IT security and cyber attacks. The authors describe a vulnerability-based model for cyber weapons and for cyber defense. This model is then applied to describe the relationship between cyber-capable actors (e.g. nation-states). The proposed model clarifies important implications for cyber coalition-building, and disarmament. Furthermore, it presents a general solution for the problem of the destruction of cyber weapons, i.e. in the context of cyber arms control.\nKeywords: cyber weapons, cyber defense, disarmament, coalition, vulnerabilities\n# 1. Introduction\nAs conflicts have moved into cyberspace (and vice versa), a clear understanding of cyber weapon becomes a necessity. The development of weapons was always part of mankind's history. Weapons evolved to suit the tactics, but from time to time new weapons revolutionized the tactics and strategies of warfare. The developments of artillery, gunpowder, aviation or weapons of mass destruction are just some examples from recent history. They all caused dramatic changes on the face of the battlefield. But all those weapons developed so far have similar kinetic and/or thermal properties due to the shared physical domain.\nIn the cyber attacks on Estonia in 2007, a campaign of massive distributed denial of service (DDoS) attacks against government websites, paired with hacking attempts against valuable targets like ISP backbone routers, a new type of conflict became a reality (Evron, 2008). Many more politically motivated DDoS attacks followed (Nazario, 2009). It drew strong and inconsistent media attention, up to being termed the first cyber war in history, as discussed by (Farivar, 2009). While Article 5 of the North Atlantic Treaty, governing mutual support among NATO nations in case of an armed attack was not invoked, national security leadership around the world received a wakeup call. However, several years later we still have not seen a commonly agreed definition of cyber weapons or cyber warfare (Ottis &amp; Lorents, 2010).\nIn first section we are going to define basic terms and give short overview about special properties of cyber domain and cyber weapons. The concepts and terminology initially used were based on our understanding of conventional weapons or weapons of mass destruction (Sharma, 2009). Unfortunately, cyber weapons, being data and knowledge, follow other rules than their conventional counterparts. Thus the effects of cyber weapons on their target are different. In 2007 a direct, destructive cyber attack on a power generator was proven possible in a real life experiment (Herold, 2007). Latest prominent case, the Stuxnet virus, which is assumed to have sabotaged the Iran nuclear program starting from 2009, shows how powerful a cyber weapon in a real world setting can be (Falliere, Murchu, &amp; Chien, 2010; Langner, 2011). Some research states that conventional weapons framework is ineffective, is not applicable or has left a big gap between our assumptions about cyber weapons and reality (Sulek &amp; Moran, 2009). We do not want to get involved in this controversial discussion, but rather explicitly show some surprising aspects of cyber domain.\n199\nKarlis Podins and Christian Czosseck\nSection 2 of the paper introduces a vulnerability-based model of cyber conflict. We argue that knowledge about vulnerabilities is key element in understanding both cyber offense and cyber defense, and build a simplified model of cyber conflict around this idea.\nIn section 3 we will apply the vulnerability-based model on selected aspects of cyber conflicts. By using the proposed model to describe relationship and interactions between cyber-capable actors we demonstrate applications of proposed approach.\n2. The cyber domain and its weapons\nIn recent years, the prefix „Cyber“ has become quite common and was added to many existing terms with the intention of extending its meaning into cyberspace (Ottis &amp; Lorents, 2010). While terms like cyber war (warfare), cyber defense or cyber weapons are widely used, there is a lack of commonly accepted definition, and authors often use terms without precisely describing their meaning.\nIn the context of this paper we would like to offer the following definitions.\nDefinition 1: Cyber Weapon and Cyber Attack.\nA cyber weapon is data and knowledge that is capable of, designed to and executed with the intention to affect the integrity, availability and/or confidentiality of an IT system (target) without its owner's approval. The target's defense is overcome by abusing existing vulnerabilities in the target.\nApplication of cyber weapon shall be named a Cyber Attack.\nDefinition 2: Vulnerability.\nA vulnerability is an exploitable flaw in an IT system, which allows an attacker to usurp privileges or trust, access data or execute commands, he normally would not be allowed or expected to. This includes mis- or known default configuration but excludes social engineering means. Possible examples are: taking control of a system, reading or modifying information stored or processed or adding functionality.\nWhen starting discussions on conflicts in cyberspace, one should clearly understand the cyber domain and its special properties. Cyberspace differs from conventional weapons domains, some differences being minor while some are of the utmost importance. We believe that ignoring these differences and straight-forward application of established concepts especially on weapons has caused some of the confusion around the cyber domain. In the following an overview of key differences between the cyber domain and the domain of conventional arms is provided. As for space reasons, an analogy to the domains of nuclear, biological and chemical (NBC) weapons is not made.\nThe confusion can be easily explained just by looking at the definitions. While established concept assumes weapon to be a physical object, cyber weapon under proposed definition is knowledge and data derived from it.\nThe extent and severity of cyber attacks can vary as recent history has shown, from local (loss of email confidentiality due to loss of password) to nation-wide (Ottis, 2008). As for the time being, cyber attacks do not directly kill living beings, but can cause abuse of, malfunctions or the destruction of equipment. That, as a  $2^{\\text{nd}}$  or higher order result, can lead to a lethal effect or further destruction (Ziolkowski, 2010).\nThe distance between attacker and target is irrelevant for conducting the attack as long as there is connectivity between them. By connectivity we mean possibility to communicate between the attacker and the target, including not only wired or wireless media, but alsomethods to transfer information between air-gapped networks (see e.g. Falliere et al., 2010; Langner, 2011). Considering the Internet as the global network, all connected computers, smart phones, cars, industrial control systems (SCADA), or Internet enabled household electronics are just some of the possible targets. As of the very nature of the Internet a cyber attack can be initiated from any (connected) place on this planet to reach almost everywhere.\nKarlis Podins and Christian Czosseck\nLaunched attacks hit their target nearly instantly. While preparing a cyber attack might demand time consuming preparations, some of the effects could manifest itself in the blink of an eye. With this the defensive aspect of time, which can be used in conventional warfare to start a countermeasure against an attack, becomes less relevant.\nThere is no border or neutral area. National territory or borders on the Internet are only considered by legal departments, e.g. (Kelsey, 2008), but so far those concepts have almost no everyday practical meaning. While it is possible to cut or limit nation's connectivity to Internet, the consequences for any modern nation state are too bizarre to consider it a long term solution.\nThe attribution of an attack to a cyber attacker is, with technical means, nearly impossible (Hunker &amp; Hutchinson, 2008). While attribution might be possible by also considering information from other sources and by analyzing the behavior and beneficial outcome for other parties (Ottis, 2008), this is not guaranteed. The Conficker worm so far has not been attributed to any party, although considerable public and security community attention was focused to it, as well as USD 250,000 bounty was offered by Microsoft(\"Microsoft Collaborates With Industry to Disrupt Conficker Worm,\" 2009). If an attacker plots his attacks with enough care, he could even maintain a steady attack on his adversary without being identified (Lemay, Fernandez, &amp; Knight, 2010). But having, to a reasonable extent, a confirmed source is a common requirement for the attacked party to take active countermeasures, especially if they are of violent nature (Ziolkowski, 2010).\nCyber weapons do not have a physical nature, they are knowledge and data as defined above. To conduct a cyber attack, the attacker has to send data to the victim. Most can be made persistent, e.g. by writing a script or program and storing this on an IT system. Like ordinary files, those cyber weapons can then be copied without noteworthy costs so the number of copies of a cyber weapon is usually irrelevant. Storage and transportation of cyber weapons also seem easier than for physical counterparts, one party could even decide to keep a copy or even the whole cyber weapon arsenal outside its own borders, hiding it in different places all over the Internet.\nCyber weapons production costs are mainly human resources related. While we recognize the initial investment in R&amp;D as necessary, success of lone hackers and loose groups (Anonymous, LulzSec) shows that a lot can be achieved with limited funds. We believe that especially for a nation-state it is a minor expense compared to development of advanced conventional weapons. The production of conventional weapons depends mostly on the costs of fabrication, which often is a combination of labor costs, materials, machines and infrastructure. In contradiction to this, cyber weapons are constructed mainly by human knowledge on relatively cheap IT equipment. Their skills and knowledge in areas like software development, exploit development and penetration testing are the essence of the attack. Hiring the right personnel and keeping or extending their skills is the major investment needed to maintain or extend a cyber weapons arsenal (Miller, 2010).\nThe knowledge of a target's vulnerabilities and how to exploit them is of central importance to the attacker. On the other side, this knowledge is also the most important piece of information needed by the target of the attack to set up an efficient defense.\nThis leads us to the 1st paradox of cyber weapons: they are subject to time-decay. If a cyber weapon is exploiting a vulnerability, it is effective as long as the target IT system has this vulnerability. Vulnerabilities get discovered and patched, and target systems can change their software/hardware at their will, so the period of effectiveness for a cyber weapon is undefined, but likely to decrease the longer the vulnerability is known. This aspect is also discussed in (Moore, Friedman, &amp; Procaccia, 2010).\nThe  $2^{nd}$  paradox is that of cyber weapons usage may lead to the target enhancing its defense in a very short time. As soon as a cyber attack is executed, the target might have means in place to detect that an attack occurred and how it was conducted. While the initial attack might have been successful, the likelihood that a proper defense can be built after it is reasonably high, rendering the used cyber weapon useless against the same target and even against others in cases of existing cooperation or disclosure. An example is specially crafted malware. As soon as samples of a particular new malware get collected and analyzed, appropriate antivirus, IDS and software patching could be done rather fast. Still this is ultimately decided by the capabilities for the actors.\n200\nKarlis Podins and Christian Czosseck\nThis has consequences for one's ability to test the effectiveness of cyber weapons. As soon as a certain cyber weapon is tested in the wild or even against the target itself, the likelihood is reasonably high to believe that security-aware targets will find a way to enhance their defense against the attack. (It is recognized that techniques are available to the attacker to re-launch the same attack using changed code, and that the target can only learn from an attack if he recognizes it in the first place.) But testing those attacks in a closed test environment will not always guarantee their successful later deployment, as it will be hard for the attacker to build a reasonably complete testing environment with the true attributes of the real target. Nevertheless, it has to be pointed out, that it is quite common to use commercial off-the-shelf hardware and software, which can also be easily acquired by the attacker in order to test his defenses.\nThe given unique attributes and examples support our opinion, that conventional arms and the ways we use them, are different from cyber weapons. This is why in the following section we propose a model to describe cyber domain and conflicts within.\n## 3. A vulnerability based view on cyber weapons\nThe actors (parties) of cyber incidents might be individuals, groups of individuals, companies or nation-states. All possible combinations of parties attacking each other with cyber weapons reflect different scenarios, which, depending on effects, we would call criminal acts, industrial espionage, terrorism, conflicts or even (cyber) war. While a discussion on mapping these terms in the cyber landscape might be reasonable, we would like to state that the proposed model is generic enough to be applicable to all of them, because it focuses on the underlying mechanics. Considering the scope of this paper, we will use the term cyber conflict for all those mentioned combinations.\n## 3.1 Vulnerabilities\nVulnerabilities, the knowledge about and the skills to exploit them, are of utter importance in any form of cyber conflict. It is quite clear that without exploitable vulnerabilities, cyber attacks would be pretty much limited to (D)DoS attacks (as they do not rely on a flaw in the target, but limit their targets' accessibility by exhausting bandwidth, CPU or other limited resource) or attempts to manipulate users through social engineering to get access to the target's system. To reflect that, we propose to take vulnerability as a basic entity and analyze cyber weapons and conflict by looking at them from a vulnerability point of view.\nVulnerabilities differ in their severity. Some of them enable an adversary to conduct a cyber attack against a target (e.g. root access), while some are likely not to be of any use to an attacker. The internationally recognized Common Vulnerability Scoring System introduces an open framework enabling one to score and compare the severity of a vulnerability based on its intrinsic qualities, its behavior over time and its environmental uniqueness (Mell, Scarfone, &amp; Romanosky, 2007). While comparing individual vulnerabilities, it makes a difference how severe every single one of them is. However, we will save a detailed examination of this issue for future research. For the moment, it might be safe to only consider those potentially leading to a complete violation of availability, confidentiality or integrity of an attacked IT system.\nThe dynamic nature of IT implies that the set of vulnerabilities changes over time. When new code gets installed, new vulnerabilities are added and/or other vulnerabilities get removed. There is a considerable amount of vulnerabilities publicly disclosed every day (e.g. at the National Vulnerability Database (Security, 2010)) but some vulnerabilities remain unpatched although known to the public for decades (Oiaga, 2010).\nNaturally, there exists a set of all vulnerabilities that are in the software installed somewhere. This is not constant and changes every time new software is installed, removed or configured. Each party has knowledge about some of the vulnerabilities. There are vulnerabilities unknown to all parties. As such the union of all parties known vulnerabilities still might not give all existing vulnerabilities.\n## 3.2 Cyber defense\nApparently a system without vulnerabilities is well defended against majority of cyber attack (apart from DoS based attacks). The defender of a target system has three options to render a vulnerability-based cyber weapon w useless.\n201\n202\n# Karlis Podins and Christian Czosseck\nBy knowing about vulnerabilities exploited by $w$ and having own infrastructure immune against $w$ by patching its own systems accordingly;\nBy putting in place means to effectively make an existing, unpatched vulnerability not exposed to the attacker (e.g. by using firewalls hiding a service to the Internet or signature-based attack detection). This would also apply to vulnerabilities unknown to the defender but coincidentally covered;\nBy putting in place means to detect and mitigate cyber attacks before their effect manifests itself.\nOne could assume that cyber security aware parties have full control over and knowledge about their own IT assets, making sure not to be vulnerable to attacks they known by themselves (as they ultimately relay on vulnerabilities). Realty shows us that this does not hold true all the time, but nevertheless we keep this assumption for the sake of simplicity, assuming the target to be capable and willing for defending his cyber frontline.\n## 3.3 Cyber weapons development\nCyber Weapons are produced based on knowledge of target's vulnerabilities. It should be clear that before developing any weapon $w$, a party must have knowledge about the vulnerabilities the weapon will exploit and for any given weapon $w$ it is possible to find respective vulnerabilities.\nMore formally speaking, there exists a natural mapping $e$ from cyber weapons to vulnerabilities they exploit. For any given weapon $w$, the set $e(w)$ is either empty (in the case of a DoS attack or cases of social engineering) or it contains at least one vulnerability.\nSometimes, successfully attacked IT Systems can be used for manual or automated creation of (new) cyber weapons for further attacks, e.g. sending infected emails to all persons in contact list or probing the local network for other vulnerable machines.\nTo effectively enlarge one's weapons arsenal with new weapons, a party is required to find an additional vulnerability.\nAs time passes, other parties discover vulnerabilities in a non-deterministic manner. When a party discovers a vulnerability $v$, we can assume that their defenses are upgraded, making weapons exploiting vulnerability $v$ ineffective against party $p$. Research by Moore et al. (Moore et al., 2010) propose a similar vulnerability-based look but assumes the opposite, that own infrastructure is not patched not to warn the opposing parties of discovered vulnerabilities, coming to noteworthy conclusions.\nAdditionally, it seems reasonable to assume that the target party $t$ has adequate logging and attack detection systems in place and will be capable of identifying exploited vulnerabilities at least after they have been used by a cyber weapon, leading to improved cyber defense.\nThis stresses again the overlap between cyber attacks and defenses and vulnerability discovery plays a central role both for attackers and defenders.\n## 4. Implications on party relationships\nIn following section we will test vulnerability-based thinking by applying it to model cyber disarmament, coalitions, collective defense, pacifism and arms control.\n## 4.1 Cyber disarmament\nIn contrast to vague cyber disarmament discussion (Gjelten, 2010) the proposed model offers an effective method of cyber weapon disarmament, as asked for by (Cahill &amp; Rozinov, 2003). Disarmament of cyberspace could be achieved by public vulnerability disclosure. If a party wants to verifiably dismantle some of its cyber weapons, it could publicly disclose all the vulnerabilities used by them. Unlike in real-world disarmament, which affects only the disarming party, cyber disarmament is global. After other parties have adequately reacted to disclosed information, all cyber weapons using disclosed vulnerabilities are rendered useless. This is regardless if they are in the possession of the disarming party or by another party.\nKarlis Podins and Christian Czosseck\nBut there are further peculiarities. Unlike in the conventional weapons domain, if a party $p$ dismantles a set of cyber weapons by disclosing the respective vulnerabilities, defense of $p$ is not affected. Following our assumption that a party always tries to be protected against all known vulnerabilities, $p$ does not disclose a new attack vector against itself, leaving its adversaries without an advantage by this action.\n$P$'s offensive capabilities are decreased by an unknown factor, depending on how many other parties had the disclosed vulnerabilities in their IT systems.\n## 4.2 Cyber coalitions\nIf two or more parties would mutually agree on cyber disarmament, public vulnerability disclosure can be used with the consequences as described before. But an interesting approach would be a mutual vulnerability disclosure; it effectively means that cyber weapons involved in the mutual disarmament would be ineffective against other parties involved in the disarmament agreement, but still potentially effective against $3^{\\text{rd}}$ parties.\nBy exchanging information on vulnerabilities between each other one enables the other to build new weapons based on the newly learned vulnerabilities. But at the same moment both become immune to cyber attacks based on the exchanged vulnerabilities, as soon as they have implemented the necessary changes in their defense. Their offensive capabilities to attack each other decreases or remains the same.\nLet $c$ be any other $3^{\\text{rd}}$ party not part of the treaty or coalition between $a$ and $b$. With the newly won knowledge both parties $a$ and $b$ might have gain additional knowledge to build a cyber weapon $c$ is vulnerable to, enhancing their offensive capabilities against $c$ or at least remaining the same.\n## 4.3 Cooperative cyber defense\nBased on the definition of cyber defense given above, cooperation in cyber defense between two or more parties can manifest by exchanging of vulnerability information and/or attack detection procedures, if it provides tangible benefits to each party.\nBut in the case of vulnerability information exchange, there is no difference from the aforementioned cyber coalition. This leads to the observation that it is possible for cooperative cyber defense to be indistinguishable from a cyber coalition.\nTo arrange a cooperative cyber defense that is purely defensive in nature, the cooperation between the parties would be limited to the exchange of signatures and other attack detection information without sharing vulnerabilities per se. If knowledge about vulnerabilities shall also be shared without giving an offensive advantage to the parties, it must be done by public disclose with the consequences as described under cyber disarmament.\n## 4.4 Cyber pacifism\nPacific movement is usually limited to protest when in conventional weapons domain. But this could change in the cyber space.\nApart from voicing concerns about cyber weapons as discussed in (Rowe, 2007), a more active strategy could be to actively search for vulnerabilities and publicly disclose them as soon as possible. As in the case of cyber disarmament, it would universally destroy the corresponding cyber weapons, hitting the weapons arsenals of many parties simultaneously.\nAssuming enough resources are present, the cyber pacifist can have a significant impact on the cyber weapons arsenals of other nation-states without committing any aggressive actions. This again shows how different the cyber weapons world is, leading to new possibilities, but also new limitations.\n## 4.5 Cyber arms control\nA problem of what to do with cyber weapons found during an inspection as illegal under an Cyber Arms Control treaty is stated by Dorothy Denning (Denning, 2001). Within our proposed model, the\nKarlis Podins and Christian Czosseck\nsame public disclosure procedure as for cyber disarmament could be applied, after the found cyber weapon got analyzed to identify the vulnerability exploited by it. Wherever other copies of discovered cyber weapon are stored, they all rely on the same vulnerability (or same set of vulnerabilities), by disclosing those vulnerabilities one can effectively neutralize each and every of those copies at the same time.\n## 5. Conclusion\nCyber weapons are a new type of armament that follows different rules than the established rules of conventional weapons or weapons of mass destruction. The revolutionary nature of cyber weapons as a means and method of warfare demands the creation of a new conflict model.\nThis article proposes a highly-simplified, vulnerabilities-based model that defines and describes cyber weapons and cyber defense. The authors analyzed the relationships between hypothetical parties who would develop and employ cyber weapons. The model revealed a number of important findings, such as the fact that a defensive alliance, in which the parties exchanged their knowledge of cyber vulnerabilities, would lead to an enhanced offensive capability by every member of the alliance. Further, the authors proposed a strategy for cyber attack deterrence based on the introduced model. The restricted definition of cyber weapons together with vulnerability-based model has been shown useful for solving cyber arms control problem, and we hope that the model will show useful in other problems as well.\nThe examples used in this article primarily highlight the typical roles expected of nation-states, but the authors believe that the model's principles will apply in the corporate world as well.\nDisclaimer: The opinions expressed here are those of the authors and should not be considered as the official policy of the NATO Cooperative Cyber Defence Centre of Excellence or NATO.\n## Acknowledgements\nBoth authors contributed equally. The opinions shared in this article are those of the authors and do not represent the views of NATO or its member states. The authors would like to thank Mr. Kenneth Geers and Prof. Peeter Lorents who gave us valuable feedback while writing this article."
    },
    "author_year": {
      "total": {
        "intext_total": 17,
        "success_occurrences": 17,
        "success_unique": 15,
        "bib_unique_total": 76,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.19736842105263158,
        "success_percentage": 100.0,
        "style": "author_year"
      },
      "results": [
        {
          "index": "evron|2008",
          "intext_citation": "(Evron, 2008)",
          "preceding_text": "In the cyber attacks on Estonia in 2007, a campaign of massive distributed denial of service (DDoS) attacks against government websites, paired with hacking attempts against valuable targets like ISP backbone routers, a new type of conflict became a reality",
          "footnote": "Evron, G. (2008). Battling botnets and online mobs: Estonia's defense efforts during the internet war. *Georgetown Journal of International Affairs*, 9(1), 121–126."
        },
        {
          "index": "nazario|2009",
          "intext_citation": "(Nazario, 2009)",
          "preceding_text": "Many more politically motivated DDoS attacks followed",
          "footnote": "Nazario, J. (2009). Politically Motivated Denial of Service Attacks. In C. Czosseck &amp; K. Geers (Eds.), The Virtual Battlefield: Perspectives on Cyber Warfare (pp. 163-181). 163-181: IOS Press."
        },
        {
          "index": "farivar|2009",
          "intext_citation": "(Farivar, 2009)",
          "preceding_text": "Many more politically motivated DDoS attacks followed (Nazario, 2009). It drew strong and inconsistent media attention, up to being termed the first cyber war in history, as discussed by",
          "footnote": "Farivar, C. (2009). A Brief Examination of Media Coverage of Cyberattacks (2007 - Present). In C. Czosseck &amp; K. Geers (Eds.), *The Virtual Battlefield: Perspectives on Cyber Warfare* (p. 183). Amsterdam: IOS Press."
        },
        {
          "index": "sharma|2009",
          "intext_citation": "(Sharma, 2009)",
          "preceding_text": "The concepts and terminology initially used were based on our understanding of conventional weapons or weapons of mass destruction",
          "footnote": "Sharma, A. (2009). Cyber Wars: A Paradigm Shift from Means to Ends. In C. Czosseck &amp; K. Geers (Eds.), The Virtual Battlefield: Perspectives on Cyber Warfare (Vol. 34, pp. 3-17). Amsterdam: IOS Press."
        },
        {
          "index": "herold|2007",
          "intext_citation": "(Herold, 2007)",
          "preceding_text": "Thus the effects of cyber weapons on their target are different. In 2007 a direct, destructive cyber attack on a power generator was proven possible in a real life experiment",
          "footnote": "Herold, R. (2007). DHS Exploding Generator Shows Dire Need For Better Computer Security. *Realtime IT Compliance*. www.realtime-itcompliance.com. Retrieved August 17, 2010, from http://www.realtime-itcompliance.com/information_security/2007/09/dhs_exploding_generator_shows.htm"
        },
        {
          "index": "ottis|2008",
          "intext_citation": "(Ottis, 2008)",
          "preceding_text": "The extent and severity of cyber attacks can vary as recent history has shown, from local (loss of email confidentiality due to loss of password) to nation-wide",
          "footnote": "Ottis, R. (2008). Analysis of the 2007 Cyber Attacks Against Estonia from the Information Warfare Perspective. Proceedings of the 7th European Conference on Information Warfare (p. 163). Academic Conferences Limited."
        },
        {
          "index": "ziolkowski|2010",
          "intext_citation": "(Ziolkowski, 2010)",
          "preceding_text": "That, as a  $2^{\\text{nd}}$  or higher order result, can lead to a lethal effect or further destruction",
          "footnote": "Ziolkowski, K. (2010). Computer Network Operations and the Law of Armed Conflict. Military Law and the Law of War Review, (49), 47-94."
        },
        {
          "index": "kelsey|2008",
          "intext_citation": "(Kelsey, 2008)",
          "preceding_text": "There is no border or neutral area. National territory or borders on the Internet are only considered by legal departments, e.g.",
          "footnote": "Kelsey, J. T. G. (2008). Hacking into International Humanitarian Law: The Principles of Distinction and Neutrality in the Age of Cyber Warfare. *Michigan Law Review*, (May), 1427-1452."
        },
        {
          "index": "ottis|2008",
          "intext_citation": "(Ottis, 2008)",
          "preceding_text": "While attribution might be possible by also considering information from other sources and by analyzing the behavior and beneficial outcome for other parties",
          "footnote": "Ottis, R. (2008). Analysis of the 2007 Cyber Attacks Against Estonia from the Information Warfare Perspective. Proceedings of the 7th European Conference on Information Warfare (p. 163). Academic Conferences Limited."
        },
        {
          "index": "ziolkowski|2010",
          "intext_citation": "(Ziolkowski, 2010)",
          "preceding_text": "But having, to a reasonable extent, a confirmed source is a common requirement for the attacked party to take active countermeasures, especially if they are of violent nature",
          "footnote": "Ziolkowski, K. (2010). Computer Network Operations and the Law of Armed Conflict. Military Law and the Law of War Review, (49), 47-94."
        },
        {
          "index": "miller|2010",
          "intext_citation": "(Miller, 2010)",
          "preceding_text": "Hiring the right personnel and keeping or extending their skills is the major investment needed to maintain or extend a cyber weapons arsenal",
          "footnote": "Miller, C. (2010). Kim Jong-il and me: How to build a cyber army to attack the U.S. Tallinn: CCD COE Publications. Retrieved from http://www.ccdcoe.org/conference2010/agenda.html"
        },
        {
          "index": "security|2010",
          "intext_citation": "(Security, 2010)",
          "preceding_text": "There is a considerable amount of vulnerabilities publicly disclosed every day (e.g. at the National Vulnerability Database",
          "footnote": "Security, D. O. H. (2010). National Vulnerability Database (NVD) Search Vulnerabilities. Retrieved August 17, 2010, from http://web.nvd.nist.gov/view/vuln/search?execution=e2s1"
        },
        {
          "index": "oiaga|2010",
          "intext_citation": "(Oiaga, 2010)",
          "preceding_text": "at the National Vulnerability Database (Security, 2010)) but some vulnerabilities remain unpatched although known to the public for decades",
          "footnote": "Oiaga, M. (2010). Windows Blue Screens of Death After Patch for 17-Year Old Vulnerability Is Applied. Retrieved August 17, 2010, from http://news.softpedia.com/news/Windows-Blue-Screens-of-Death-after-Patch-for-17-Year-Old-Vulnerability-Is-Applied-134808.shtml"
        },
        {
          "index": "moore|2010",
          "intext_citation": "(Moore et al., 2010)",
          "preceding_text": "When a party discovers a vulnerability $v$, we can assume that their defenses are upgraded, making weapons exploiting vulnerability $v$ ineffective against party $p$. Research by Moore et al.",
          "footnote": "Moore, T., Friedman, A., &amp; Procaccia, A. D. (2010). Would a 'cyber warrior' protect us: exploring trade-offs between attack and defense of information systems. Proceedings of the 2010 workshop on New security paradigms (pp. 85–94). ACM. Retrieved from http://dl.acm.org/citation.cfm?id=1900559"
        },
        {
          "index": "gjelten|2010",
          "intext_citation": "(Gjelten, 2010)",
          "preceding_text": "In contrast to vague cyber disarmament discussion",
          "footnote": "Gjelten, T. (2010). Debating Cyber Disarmament. *World Affairs*. Retrieved March 1, 2012, from http://www.worldaffairsjournal.org/article/shadow-wars-debating-cyber-disarmament"
        },
        {
          "index": "rowe|2007",
          "intext_citation": "(Rowe, 2007)",
          "preceding_text": "Apart from voicing concerns about cyber weapons as discussed in",
          "footnote": "Rowe, N. C. (2007). War Crimes from Cyber-weapons. Journal of Information Warfare, 6(3), 15–25. Retrieved from http://academic-conferences.org/pdfs/JIW6_3.pdf#page=21"
        },
        {
          "index": "denning|2001",
          "intext_citation": "(Denning, 2001)",
          "preceding_text": "A problem of what to do with cyber weapons found during an inspection as illegal under an Cyber Arms Control treaty is stated by Dorothy Denning",
          "footnote": "Denning, D. (2001). Obstacles and Options for Cyber Arms Control. *Arms Control in Cyberspace*, Heinrich Böll Foundation, Berlin, Germany, 1-13. Retrieved from http://faculty.nps.edu/dedennin/publications/berlin.pdf"
        }
      ],
      "flat_text": "Karlis Podins and Christian Czosseck Cooperative Cyber Defence Centre of Excellence, Tallinn, Estonia karlis.podins@ccdcoe.org Christian.czosseck@ccdcoe.org Abstract: Throughout history, mankind has developed and employed novel weapons systems and equally novel countermeasures. Naturally, both offensive and defensive systems are limited by the laws of nature. Consequently, military concepts and doctrines were designed by implicitly taking into account those same limitations. The digital age has introduced a new class of weaponry that poses an initial challenge to our common understanding of conflict and warfare as for their different characteristics: cyber weapons. Cyber weapons and other terms like hacking are used frequently, commonly without giving clear definitions in the given context. We propose a restricted definition of cyber weapons as consisting primarily of data and knowledge, presenting themselves in the form of prepared and executed computer codes on or a sequence of user interactions with a vulnerable system. This article explores the crucial differences between the conventional weapons and cyber weapons domains, starting a debate on to which extent classical concepts and doctrines are applicable to cyber space and cyber conflict. This motivates a discussion on the role of vulnerabilities in IT systems and their impact to IT security and cyber attacks. The authors describe a vulnerability-based model for cyber weapons and for cyber defense. This model is then applied to describe the relationship between cyber-capable actors (e.g. nation-states). The proposed model clarifies important implications for cyber coalition-building, and disarmament. Furthermore, it presents a general solution for the problem of the destruction of cyber weapons, i.e. in the context of cyber arms control.\nKeywords: cyber weapons, cyber defense, disarmament, coalition, vulnerabilities # 1. Introduction As conflicts have moved into cyberspace (and vice versa), a clear understanding of cyber weapon becomes a necessity. The development of weapons was always part of mankind's history. Weapons evolved to suit the tactics, but from time to time new weapons revolutionized the tactics and strategies of warfare. The developments of artillery, gunpowder, aviation or weapons of mass destruction are just some examples from recent history. They all caused dramatic changes on the face of the battlefield. But all those weapons developed so far have similar kinetic and/or thermal properties due to the shared physical domain.\nIn the cyber attacks on Estonia in 2007, a campaign of massive distributed denial of service (DDoS) attacks against government websites, paired with hacking attempts against valuable targets like ISP backbone routers, a new type of conflict became a reality. Many more politically motivated DDoS attacks followed. It drew strong and inconsistent media attention, up to being termed the first cyber war in history, as discussed by. While Article 5 of the North Atlantic Treaty, governing mutual support among NATO nations in case of an armed attack was not invoked, national security leadership around the world received a wakeup call. However, several years later we still have not seen a commonly agreed definition of cyber weapons or cyber warfare (Ottis &amp; Lorents, 2010).\nIn first section we are going to define basic terms and give short overview about special properties of cyber domain and cyber weapons. The concepts and terminology initially used were based on our understanding of conventional weapons or weapons of mass destruction. Unfortunately, cyber weapons, being data and knowledge, follow other rules than their conventional counterparts. Thus the effects of cyber weapons on their target are different. In 2007 a direct, destructive cyber attack on a power generator was proven possible in a real life experiment. Latest prominent case, the Stuxnet virus, which is assumed to have sabotaged the Iran nuclear program starting from 2009, shows how powerful a cyber weapon in a real world setting can be (Falliere, Murchu, &amp; Chien, 2010; Langner, 2011). Some research states that conventional weapons framework is ineffective, is not applicable or has left a big gap between our assumptions about cyber weapons and reality (Sulek &amp; Moran, 2009). We do not want to get involved in this controversial discussion, but rather explicitly show some surprising aspects of cyber domain.\n\nSection 2 of the paper introduces a vulnerability-based model of cyber conflict. We argue that knowledge about vulnerabilities is key element in understanding both cyber offense and cyber defense, and build a simplified model of cyber conflict around this idea.\nIn section 3 we will apply the vulnerability-based model on selected aspects of cyber conflicts. By using the proposed model to describe relationship and interactions between cyber-capable actors we demonstrate applications of proposed approach.\n\nIn recent years, the prefix „Cyber “has become quite common and was added to many existing terms with the intention of extending its meaning into cyberspace (Ottis &amp; Lorents, 2010). While terms like cyber war (warfare), cyber defense or cyber weapons are widely used, there is a lack of commonly accepted definition, and authors often use terms without precisely describing their meaning.\nIn the context of this paper we would like to offer the following definitions.\nDefinition 1: Cyber Weapon and Cyber Attack.\nA cyber weapon is data and knowledge that is capable of, designed to and executed with the intention to affect the integrity, availability and/or confidentiality of an IT system (target) without its owner's approval. The target's defense is overcome by abusing existing vulnerabilities in the target.\nApplication of cyber weapon shall be named a Cyber Attack.\nDefinition 2: Vulnerability.\nA vulnerability is an exploitable flaw in an IT system, which allows an attacker to usurp privileges or trust, access data or execute commands, he normally would not be allowed or expected to. This includes mis- or known default configuration but excludes social engineering means. Possible examples are: taking control of a system, reading or modifying information stored or processed or adding functionality.\nWhen starting discussions on conflicts in cyberspace, one should clearly understand the cyber domain and its special properties. Cyberspace differs from conventional weapons domains, some differences being minor while some are of the utmost importance. We believe that ignoring these differences and straight-forward application of established concepts especially on weapons has caused some of the confusion around the cyber domain. In the following an overview of key differences between the cyber domain and the domain of conventional arms is provided. As for space reasons, an analogy to the domains of nuclear, biological and chemical (NBC) weapons is not made.\nThe confusion can be easily explained just by looking at the definitions. While established concept assumes weapon to be a physical object, cyber weapon under proposed definition is knowledge and data derived from it.\nThe extent and severity of cyber attacks can vary as recent history has shown, from local (loss of email confidentiality due to loss of password) to nation-wide. As for the time being, cyber attacks do not directly kill living beings, but can cause abuse of, malfunctions or the destruction of equipment. That, as a $2^{\\text{nd}}$ or higher order result, can lead to a lethal effect or further destruction.\nThe distance between attacker and target is irrelevant for conducting the attack as long as there is connectivity between them. By connectivity we mean possibility to communicate between the attacker and the target, including not only wired or wireless media, but alsomethods to transfer information between air-gapped networks (see e.g. Falliere et al., 2010; Langner, 2011). Considering the Internet as the global network, all connected computers, smart phones, cars, industrial control systems (SCADA), or Internet enabled household electronics are just some of the possible targets. As of the very nature of the Internet a cyber attack can be initiated from any (connected) place on this planet to reach almost everywhere.\nKarlis Podins and Christian Czosseck Launched attacks hit their target nearly instantly. While preparing a cyber attack might demand time consuming preparations, some of the effects could manifest itself in the blink of an eye. With this the defensive aspect of time, which can be used in conventional warfare to start a countermeasure against an attack, becomes less relevant.\nThere is no border or neutral area. National territory or borders on the Internet are only considered by legal departments, e.g., but so far those concepts have almost no everyday practical meaning. While it is possible to cut or limit nation's connectivity to Internet, the consequences for any modern nation state are too bizarre to consider it a long term solution.\nThe attribution of an attack to a cyber attacker is, with technical means, nearly impossible (Hunker &amp; Hutchinson, 2008). While attribution might be possible by also considering information from other sources and by analyzing the behavior and beneficial outcome for other parties, this is not guaranteed. The Conficker worm so far has not been attributed to any party, although considerable public and security community attention was focused to it, as well as USD 250,000 bounty was offered by Microsoft(\"Microsoft Collaborates With Industry to Disrupt Conficker Worm,\"2009). If an attacker plots his attacks with enough care, he could even maintain a steady attack on his adversary without being identified (Lemay, Fernandez, &amp; Knight, 2010). But having, to a reasonable extent, a confirmed source is a common requirement for the attacked party to take active countermeasures, especially if they are of violent nature.\nCyber weapons do not have a physical nature, they are knowledge and data as defined above. To conduct a cyber attack, the attacker has to send data to the victim. Most can be made persistent, e.g. by writing a script or program and storing this on an IT system. Like ordinary files, those cyber weapons can then be copied without noteworthy costs so the number of copies of a cyber weapon is usually irrelevant. Storage and transportation of cyber weapons also seem easier than for physical counterparts, one party could even decide to keep a copy or even the whole cyber weapon arsenal outside its own borders, hiding it in different places all over the Internet.\nCyber weapons production costs are mainly human resources related. While we recognize the initial investment in R&amp;D as necessary, success of lone hackers and loose groups (Anonymous, LulzSec) shows that a lot can be achieved with limited funds. We believe that especially for a nation-state it is a minor expense compared to development of advanced conventional weapons. The production of conventional weapons depends mostly on the costs of fabrication, which often is a combination of labor costs, materials, machines and infrastructure. In contradiction to this, cyber weapons are constructed mainly by human knowledge on relatively cheap IT equipment. Their skills and knowledge in areas like software development, exploit development and penetration testing are the essence of the attack. Hiring the right personnel and keeping or extending their skills is the major investment needed to maintain or extend a cyber weapons arsenal.\nThe knowledge of a target's vulnerabilities and how to exploit them is of central importance to the attacker. On the other side, this knowledge is also the most important piece of information needed by the target of the attack to set up an efficient defense.\nThis leads us to the 1st paradox of cyber weapons: they are subject to time-decay. If a cyber weapon is exploiting a vulnerability, it is effective as long as the target IT system has this vulnerability. Vulnerabilities get discovered and patched, and target systems can change their software/hardware at their will, so the period of effectiveness for a cyber weapon is undefined, but likely to decrease the longer the vulnerability is known. This aspect is also discussed in (Moore, Friedman, &amp; Procaccia, 2010).\nThe $2^{nd}$ paradox is that of cyber weapons usage may lead to the target enhancing its defense in a very short time. As soon as a cyber attack is executed, the target might have means in place to detect that an attack occurred and how it was conducted. While the initial attack might have been successful, the likelihood that a proper defense can be built after it is reasonably high, rendering the used cyber weapon useless against the same target and even against others in cases of existing cooperation or disclosure. An example is specially crafted malware. As soon as samples of a particular new malware get collected and analyzed, appropriate antivirus, IDS and software patching could be done rather fast. Still this is ultimately decided by the capabilities for the actors.\n\nThis has consequences for one's ability to test the effectiveness of cyber weapons. As soon as a certain cyber weapon is tested in the wild or even against the target itself, the likelihood is reasonably high to believe that security-aware targets will find a way to enhance their defense against the attack. (It is recognized that techniques are available to the attacker to re-launch the same attack using changed code, and that the target can only learn from an attack if he recognizes it in the first place.) But testing those attacks in a closed test environment will not always guarantee their successful later deployment, as it will be hard for the attacker to build a reasonably complete testing environment with the true attributes of the real target. Nevertheless, it has to be pointed out, that it is quite common to use commercial off-the-shelf hardware and software, which can also be easily acquired by the attacker in order to test his defenses.\nThe given unique attributes and examples support our opinion, that conventional arms and the ways we use them, are different from cyber weapons. This is why in the following section we propose a model to describe cyber domain and conflicts within.\n## 3. A vulnerability based view on cyber weapons The actors (parties) of cyber incidents might be individuals, groups of individuals, companies or nation-states. All possible combinations of parties attacking each other with cyber weapons reflect different scenarios, which, depending on effects, we would call criminal acts, industrial espionage, terrorism, conflicts or even (cyber) war. While a discussion on mapping these terms in the cyber landscape might be reasonable, we would like to state that the proposed model is generic enough to be applicable to all of them, because it focuses on the underlying mechanics. Considering the scope of this paper, we will use the term cyber conflict for all those mentioned combinations.\n## 3.1 Vulnerabilities Vulnerabilities, the knowledge about and the skills to exploit them, are of utter importance in any form of cyber conflict. It is quite clear that without exploitable vulnerabilities, cyber attacks would be pretty much limited to (D)DoS attacks (as they do not rely on a flaw in the target, but limit their targets' accessibility by exhausting bandwidth, CPU or other limited resource) or attempts to manipulate users through social engineering to get access to the target's system. To reflect that, we propose to take vulnerability as a basic entity and analyze cyber weapons and conflict by looking at them from a vulnerability point of view.\nVulnerabilities differ in their severity. Some of them enable an adversary to conduct a cyber attack against a target (e.g. root access), while some are likely not to be of any use to an attacker. The internationally recognized Common Vulnerability Scoring System introduces an open framework enabling one to score and compare the severity of a vulnerability based on its intrinsic qualities, its behavior over time and its environmental uniqueness (Mell, Scarfone, &amp; Romanosky, 2007). While comparing individual vulnerabilities, it makes a difference how severe every single one of them is. However, we will save a detailed examination of this issue for future research. For the moment, it might be safe to only consider those potentially leading to a complete violation of availability, confidentiality or integrity of an attacked IT system.\nThe dynamic nature of IT implies that the set of vulnerabilities changes over time. When new code gets installed, new vulnerabilities are added and/or other vulnerabilities get removed. There is a considerable amount of vulnerabilities publicly disclosed every day (e.g. at the National Vulnerability Database ) but some vulnerabilities remain unpatched although known to the public for decades.\nNaturally, there exists a set of all vulnerabilities that are in the software installed somewhere. This is not constant and changes every time new software is installed, removed or configured. Each party has knowledge about some of the vulnerabilities. There are vulnerabilities unknown to all parties. As such the union of all parties known vulnerabilities still might not give all existing vulnerabilities.\n## 3.2 Cyber defense Apparently a system without vulnerabilities is well defended against majority of cyber attack (apart from DoS based attacks). The defender of a target system has three options to render a vulnerability-based cyber weapon w useless.\n\n# Karlis Podins and Christian Czosseck\nBy knowing about vulnerabilities exploited by $w$ and having own infrastructure immune against $w$ by patching its own systems accordingly;\nBy putting in place means to effectively make an existing, unpatched vulnerability not exposed to the attacker (e.g. by using firewalls hiding a service to the Internet or signature-based attack detection). This would also apply to vulnerabilities unknown to the defender but coincidentally covered;\nBy putting in place means to detect and mitigate cyber attacks before their effect manifests itself.\nOne could assume that cyber security aware parties have full control over and knowledge about their own IT assets, making sure not to be vulnerable to attacks they known by themselves (as they ultimately relay on vulnerabilities). Realty shows us that this does not hold true all the time, but nevertheless we keep this assumption for the sake of simplicity, assuming the target to be capable and willing for defending his cyber frontline.\n## 3.3 Cyber weapons development\nCyber Weapons are produced based on knowledge of target's vulnerabilities. It should be clear that before developing any weapon $w$, a party must have knowledge about the vulnerabilities the weapon will exploit and for any given weapon $w$ it is possible to find respective vulnerabilities.\nMore formally speaking, there exists a natural mapping $e$ from cyber weapons to vulnerabilities they exploit. For any given weapon $w$, the set $e(w)$ is either empty (in the case of a DoS attack or cases of social engineering) or it contains at least one vulnerability.\nSometimes, successfully attacked IT Systems can be used for manual or automated creation of (new) cyber weapons for further attacks, e.g. sending infected emails to all persons in contact list or probing the local network for other vulnerable machines.\nTo effectively enlarge one's weapons arsenal with new weapons, a party is required to find an additional vulnerability.\nAs time passes, other parties discover vulnerabilities in a non-deterministic manner. When a party discovers a vulnerability $v$, we can assume that their defenses are upgraded, making weapons exploiting vulnerability $v$ ineffective against party $p$. Research by Moore et al.  propose a similar vulnerability-based look but assumes the opposite, that own infrastructure is not patched not to warn the opposing parties of discovered vulnerabilities, coming to noteworthy conclusions.\nAdditionally, it seems reasonable to assume that the target party $t$ has adequate logging and attack detection systems in place and will be capable of identifying exploited vulnerabilities at least after they have been used by a cyber weapon, leading to improved cyber defense.\nThis stresses again the overlap between cyber attacks and defenses and vulnerability discovery plays a central role both for attackers and defenders.\n## 4. Implications on party relationships\nIn following section we will test vulnerability-based thinking by applying it to model cyber disarmament, coalitions, collective defense, pacifism and arms control.\n## 4.1 Cyber disarmament\nIn contrast to vague cyber disarmament discussion  the proposed model offers an effective method of cyber weapon disarmament, as asked for by (Cahill &amp; Rozinov, 2003). Disarmament of cyberspace could be achieved by public vulnerability disclosure. If a party wants to verifiably dismantle some of its cyber weapons, it could publicly disclose all the vulnerabilities used by them. Unlike in real-world disarmament, which affects only the disarming party, cyber disarmament is global. After other parties have adequately reacted to disclosed information, all cyber weapons using disclosed vulnerabilities are rendered useless. This is regardless if they are in the possession of the disarming party or by another party.\nKarlis Podins and Christian Czosseck\nBut there are further peculiarities. Unlike in the conventional weapons domain, if a party $p$ dismantles a set of cyber weapons by disclosing the respective vulnerabilities, defense of $p$ is not affected. Following our assumption that a party always tries to be protected against all known vulnerabilities, $p$ does not disclose a new attack vector against itself, leaving its adversaries without an advantage by this action.\n$P$'s offensive capabilities are decreased by an unknown factor, depending on how many other parties had the disclosed vulnerabilities in their IT systems.\n## 4.2 Cyber coalitions\nIf two or more parties would mutually agree on cyber disarmament, public vulnerability disclosure can be used with the consequences as described before. But an interesting approach would be a mutual vulnerability disclosure; it effectively means that cyber weapons involved in the mutual disarmament would be ineffective against other parties involved in the disarmament agreement, but still potentially effective against $3^{\\text{rd}}$ parties.\nBy exchanging information on vulnerabilities between each other one enables the other to build new weapons based on the newly learned vulnerabilities. But at the same moment both become immune to cyber attacks based on the exchanged vulnerabilities, as soon as they have implemented the necessary changes in their defense. Their offensive capabilities to attack each other decreases or remains the same.\nLet $c$ be any other $3^{\\text{rd}}$ party not part of the treaty or coalition between $a$ and $b$. With the newly won knowledge both parties $a$ and $b$ might have gain additional knowledge to build a cyber weapon $c$ is vulnerable to, enhancing their offensive capabilities against $c$ or at least remaining the same.\n## 4.3 Cooperative cyber defense\nBased on the definition of cyber defense given above, cooperation in cyber defense between two or more parties can manifest by exchanging of vulnerability information and/or attack detection procedures, if it provides tangible benefits to each party.\nBut in the case of vulnerability information exchange, there is no difference from the aforementioned cyber coalition. This leads to the observation that it is possible for cooperative cyber defense to be indistinguishable from a cyber coalition.\nTo arrange a cooperative cyber defense that is purely defensive in nature, the cooperation between the parties would be limited to the exchange of signatures and other attack detection information without sharing vulnerabilities per se. If knowledge about vulnerabilities shall also be shared without giving an offensive advantage to the parties, it must be done by public disclose with the consequences as described under cyber disarmament.\n## 4.4 Cyber pacifism\nPacific movement is usually limited to protest when in conventional weapons domain. But this could change in the cyber space.\nApart from voicing concerns about cyber weapons as discussed in , a more active strategy could be to actively search for vulnerabilities and publicly disclose them as soon as possible. As in the case of cyber disarmament, it would universally destroy the corresponding cyber weapons, hitting the weapons arsenals of many parties simultaneously.\nAssuming enough resources are present, the cyber pacifist can have a significant impact on the cyber weapons arsenals of other nation-states without committing any aggressive actions. This again shows how different the cyber weapons world is, leading to new possibilities, but also new limitations.\n## 4.5 Cyber arms control\nA problem of what to do with cyber weapons found during an inspection as illegal under an Cyber Arms Control treaty is stated by Dorothy Denning . Within our proposed model, the\nKarlis Podins and Christian Czosseck\nsame public disclosure procedure as for cyber disarmament could be applied, after the found cyber weapon got analyzed to identify the vulnerability exploited by it. Wherever other copies of discovered cyber weapon are stored, they all rely on the same vulnerability (or same set of vulnerabilities), by disclosing those vulnerabilities one can effectively neutralize each and every of those copies at the same time.\n## 5. Conclusion\nCyber weapons are a new type of armament that follows different rules than the established rules of conventional weapons or weapons of mass destruction. The revolutionary nature of cyber weapons as a means and method of warfare demands the creation of a new conflict model.\nThis article proposes a highly-simplified, vulnerabilities-based model that defines and describes cyber weapons and cyber defense. The authors analyzed the relationships between hypothetical parties who would develop and employ cyber weapons. The model revealed a number of important findings, such as the fact that a defensive alliance, in which the parties exchanged their knowledge of cyber vulnerabilities, would lead to an enhanced offensive capability by every member of the alliance. Further, the authors proposed a strategy for cyber attack deterrence based on the introduced model. The restricted definition of cyber weapons together with vulnerability-based model has been shown useful for solving cyber arms control problem, and we hope that the model will show useful in other problems as well.\nThe examples used in this article primarily highlight the typical roles expected of nation-states, but the authors believe that the model's principles will apply in the corporate world as well.\nDisclaimer: The opinions expressed here are those of the authors and should not be considered as the official policy of the NATO Cooperative Cyber Defence Centre of Excellence or NATO.\n## Acknowledgements\nBoth authors contributed equally. The opinions shared in this article are those of the authors and do not represent the views of NATO or its member states. The authors would like to thank Mr. Kenneth Geers and Prof. Peeter Lorents who gave us valuable feedback while writing this article."
    }
  },
  "citation_summary": {
    "style": "author_year",
    "dominant_bucket": "author_year",
    "dominant": {
      "intext_total": 17.0,
      "success_occurrences": 17.0,
      "success_unique": 15.0,
      "bib_unique_total": 76.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 0.19736842105263158,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "author_year"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "numeric": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 17.0,
        "success_occurrences": 17.0,
        "success_unique": 15.0,
        "bib_unique_total": 76.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.19736842105263158,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "A Vulnerability-Based Model of Cyber Weapons and its Implications for Cyber Conflict",
    "subtitle": "Cooperative Cyber Defence Centre of Excellence, Tallinn, Estonia",
    "document_type": "unknown",
    "venue": "",
    "publication_year": null,
    "authors": [
      "Karlis Podins",
      "Christian Czosseck"
    ],
    "affiliations": [
      "Cooperative Cyber Defence Centre of Excellence, Tallinn, Estonia"
    ],
    "emails": [
      "karlis.podins@ccdcoe.org",
      "Christian.czosseck@ccdcoe.org"
    ],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "Throughout history, mankind has developed and employed novel weapons systems and equally novel countermeasures. Naturally, both offensive and defensive systems are limited by the laws of nature. Consequently, military concepts and doctrines were designed by implicitly taking into account those same limitations. The digital age has introduced a new class of weaponry that poses an initial challenge to our common understanding of conflict and warfare as for their different characteristics: cyber weapons. Cyber weapons and other terms like hacking are used frequently, commonly without giving clear definitions in the given context. We propose a restricted definition of cyber weapons as consisting primarily of data and knowledge, presenting themselves in the form of prepared and executed computer codes on or a sequence of user interactions with a vulnerable system. This article explores the crucial differences between the conventional weapons and cyber weapons domains, starting a debate on to which extent classical concepts and doctrines are applicable to cyber space and cyber conflict. This motivates a discussion on the role of vulnerabilities in IT systems and their impact to IT security and cyber attacks. The authors describe a vulnerability-based model for cyber weapons and for cyber defense. This model is then applied to describe the relationship between cyber-capable actors (e.g. nation-states). The proposed model clarifies important implications for cyber coalition-building, and disarmament. Furthermore, it presents a general solution for the problem of the destruction of cyber weapons, i.e. in the context of cyber arms control.",
    "keywords": [
      "cyber weapons",
      "cyber defense",
      "disarmament",
      "coalition",
      "vulnerabilities"
    ],
    "publication_dates": {},
    "identifiers": {
      "doi": [],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": []
    },
    "references_block_count": 1,
    "references_entries_estimated": 23,
    "heading_count": 17,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "no_identifier"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 17,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 1.0,
      "footnote_coverage": 1.0,
      "unique_index_count": 15
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "author_year",
      "recommended_style": "author_year",
      "aligned": true,
      "signals": {
        "superscript_hits": 0,
        "superscript_definition_lines": 0,
        "numeric_bracket_hits": 0,
        "numeric_endnote_lines": 1,
        "author_year_hits": 17
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 76.0,
      "dominant_bib_coverage_rate": 0.19736842105263158,
      "dominant_link_target": "bibliography",
      "dominant_unresolved_flag": "unresolved_reference_links"
    },
    "heading_validation": {
      "heading_count": 17,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 8,
      "has_reference_heading": true,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": true,
        "emails": true,
        "orcids": false,
        "abstract": true,
        "keywords": true,
        "venue": false,
        "persistent_identifier": false,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 2,
        "affiliations": 1,
        "emails": 2,
        "orcids": 0,
        "keywords": 5,
        "doi": 0,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 0
      },
      "coverage": {
        "core_coverage": 0.8333333333333334,
        "email_author_link_rate": 1.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "no_identifier"
        ],
        "toc_dot_lines": 0
      },
      "flags": [
        "meta_missing_persistent_identifier"
      ]
    },
    "flags": [
      "low_bib_coverage",
      "heading_numbering_parent_violation",
      "meta_missing_persistent_identifier"
    ]
  },
  "updated_at_utc": "2026-02-14T08:27:48.699364+00:00"
}