{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\EF6QKQFP\\InstitutionalisingCyberAttribution.pdf",
  "custom_id": "230",
  "response": {
    "id": "batch-b6235e9e-231-ddd9c1fc-6dec-4010-b8f4-58b0061a885b",
    "custom_id": "230",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "# INSTITUTIONALISING CYBER ATTRIBUTION\n\nThe escalation of cyberattacks calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions.\n\nWhile information and communication technologies (ICTs) provide immense opportunities for social and economic development, there are also disturbing trends in the global ICT environment. One of the major threats is the proliferation of cyberattacks. The dramatic increase in the scale and destructive magnitude of cyberattacks implies the assumption that there is an inclination to carry out cyberattacks, because normativisation, compliance, enforcement, trust and cooperation are at relatively low levels. In order to prevent the further escalation of tensions in cyberspace, it would be essential to implement confidence- and capacity-building measures, which would increase deterrent effects and reverse the increasingly offensive doctrines of national cybersecurity strategies. These shifts could be achieved by establishing an internationally legitimised and/or globally recognised cyber(attack) attribution mechanism, which could be institutionalised as an international organisation, a multi-stakeholder or non-governmental transnational organisation or a transnationally coordinated decentralised governance network. In support of this view, this article examines the following questions:\n\n(1) Why would the establishment of a cyber attribution mechanism be a suitable solution to deter cyberattacks?\n(2) In what circumstances and under what legal framework should a cyber attribution mechanism be deployed?\n(3) How do key political powers construe the necessity to cooperate and/or create new legal mechanisms in order to overcome the challenges posed by cyberattacks and their attribution?\n(4) What are the main steps and considerations of designing institutional solutions for a cyber attribution mechanism?\n\n# REVERSING CYBERATTACKERS' MOTIVES\n\nA possible explanation for the ongoing cyber \"arms race\" can be found by extending the \"security dilemma\" to cyber operations. This dilemma models the behaviour of two rival entities (e.g. two states) in a situation in which the entities have a lack of trust in each other. According to the model: if one entity increases its (cyber)security measures, then this will make its rival feel threatened and incited to respond with countermeasures, which could lead to a dangerous escalatory dynamic. These sequence of events are particularly prone to take place within the context of ICTs, where there is a widely held perception that the offensive side has significant advantages over the defensive side.\n\n|  Current cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 2,2 | 0,3  |\n|   |  Offensive | 3,0 | 1,1  |\n\nHOW?\n\n|  Desired cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 3,3 | 1,2  |\n|   |  Offensive | 2,1 | 0,0  |\n\nTable 1: Game theoretic representation of the cybersecurity dilemma\n\nIf we look at this problem (and possible solutions) through the lens of non-cooperative game theory, then we can better understand the underlying strategic considerations of two rival entities",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 1,
            "markdown": "(Table 1). Both entities (and other stakeholders of cyberspace) would benefit from only defending. However, since both entities lack knowledge about what their rival is doing, the payoff for attacking is greater, regardless of what their rival does. The empirical validity of this reasoning has been demonstrated by how some states (such as Australia, the UK, the US and France) have declared that their official policy stances extend beyond an \"active cyber defence system\" to include \"offensive cyber capabilities and operations\". Considering that this trend poses a threat to international peace and global cybersecurity, it is an urgent matter to find a way to reverse (explicit and concealed) offensive motives.\n\nA possible solution for deterring cyberattacks would be to raise the costs (decrease the payoff) of attacking and lower the costs (increase the payoff) of defending.4 In order to stimulate these shifts, it would be essential to persuade potential attackers that the cost-benefit calculus of attacking is unfavourable. This could be achieved in a twofold way. First, by implementing a formalised set of procedures capable of producing credible (i.e. objective, persuasive and transparent) public evidences and assessments of cyberattacks, attackers would be made more exposed to being held responsible for cyberattacks (and to bear legal consequences which flow therefrom). Secondly, by sharing and/or increasing network security monitoring resources and information, entities which refrain from attacking would be offered technical assistance and legal reassurances.\n\n# A global cyber attribution mechanism would deter cyberattacks by raising the costs of attacking and lowering the costs of defending.\n\nThe attainment of the abovementioned objectives calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions. Confidence-building requires the formation of an institutionalised mechanism of coordination and/or cooperation between participating entities. Creating predictable normative expectations in terms of how cyberattacks are attributed would promote common understandings and reduce the risks of mistrust and misperception. On the other hand,\n\ncapacity-building would be essential to guarantee the effective functioning of a cyber attribution mechanism. This could be achieved by ensuring that the mechanism is equipped with adequate resources, intelligence capabilities, investigative powers and safeguards against external influences.\n\n# ATTRIBUTION OF CYBERATTACKS\n\nThe purpose of a cyber attribution mechanism is to identify the subject(s) who shall bear responsibility for a cyberattack (Figure 1). In order to determine the circumstances when a cyber attribution mechanism should be deployed, it is first important to delineate when a malicious cyber operation is to be considered a cyberattack. In this aspect, it is necessary to define the notion of 'cyberattack' and distinguish it from 'cybercrime' and 'cyberwarfare'. Although these are interrelated categories, they have different material scopes and are linked to distinct legal regimes. If it is deemed that a cyberattack took place, then the next step is to identify (attribute) its source by technical means. However, the attribution of a cyberattack to a specific perpetrator (and other parties involved in the attack) can be understood in various ways, because the question of \"who is responsible?\" can be answered in several ways. In case the perpetrator (and other parties involved in the attack) can be identified (with a certain degree of confidence), then the third step is a normative process of establishing and/or invoking responsibility for the violation of law, which, at an international level, entails the international responsibility (of a state) for the breach of an international obligation. However, in case a cyberattack is judged to be the act of a non-state entity, then it is a contentious issue to determine what standard of control and of dependence are required to attribute the act to a particular state.\n\n![img-0.jpeg](img-0.jpeg)\nFigure 2: Cyber attribution mechanism",
            "images": [
              {
                "id": "img-0.jpeg",
                "top_left_x": 896,
                "top_left_y": 1679,
                "bottom_right_x": 1508,
                "bottom_right_y": 2086,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 2,
            "markdown": "# $\\succ$  Defining 'cyberattack'\n\nThe terms 'cyberattack', 'cybercrime' and 'cyberwarfare' are frequently used without due consideration to their conceptual meanings. This absence of clarity makes it all the more difficult to design a meaningful legal response. To address this uncertainty, a working definition for 'cyberattack' can be given as follows:\n\nan act or series of acts, which are perpetrated by a state or non-state entity against the legitimate interests of a (nother) state or the interests of the international community as a whole, to undermine the proper functioning of computer networks or systems for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, or injury including any damage.\n\nIn contrast to cyberattacks, cybercrimes can be perpetrated only by individuals or non-state entities. While a cyberattack constitutes a breach of an international obligation, a cybercrime is an act which violates domestic, supranational or international criminal law. Cybercrimes have a purpose or effect other than to target the legitimate interests of a (nother) state or the interests of the international community as a whole. Although they are committed by means of a computer system, they do not undermine the proper functioning of computer networks or systems. National laws and international legal instruments usually do not provide a strict definition for cybercrimes, they refer to it rather as a collection of illegal acts. According to their offence object and modus operandi, cybercrimes include not only acts for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, but also computer-related acts for personal or financial gain or harm, as well as computer content-related acts.[6]\n\nThe prerequisite of a cyberwarfare is that it must constitute a cyberattack, but in addition to satisfying the criteria of a cyberattack, its effects must reach the 'armed attack' threshold under international law (jus ad bellum) or the cyberattack must take place in the context of an international or non-international armed conflict (jus in bello). A state may exercise the right to self-defence and take countermeasures, if they suffer a cyberattack amounting to the level of an armed attack. However, there is legal uncertainty about this threshold in cases when a cyberattack results in severe non-destructive or non-injurious\n\nconsequences (e.g. it destabilises the financial sector of another state, or undermines its election process or the functioning of any of its institutions). With regard to the overlapping and/or distinct elements of these definitions, one can depict the abstract boundaries of the three terms (Figure 2).\n\n![img-1.jpeg](img-1.jpeg)\nFigure 2: Logical relations between malicious cyber operations\n\n# &gt; Attribution in cyberspace\n\nAttribution entails the problem of minimising uncertainty on all levels without having a uniformly applicable methodology at disposal and where the findings typically appear in shades rather than as a \"black-and-white\" evidence. Attribution is a key component of deterrence, important in strengthening defence against further attacks and a prerequisite to holding the perpetrator of (and other parties involved in) a cyberattack responsible. Cyber attribution carries several meanings, which are conceptually distinct, but often related in practice. The identified subject can be: (a) the computer device(s) from which the cyberattack was carried out; (b) the person(s) who carried out the operation; and (c) the ultimately responsible person, group of persons or state who conducted the cyberattack, or the state which failed to take appropriate measures to prevent a cyberattack emanating from within its territory.\n\n# $\\succ$  Responsibility for cyberattacks\n\nIt is undisputed that an internationally wrongful act of a state entails the international responsibility of that state.9 Additionally, it is a general principle of international law that the conduct of a person or group of persons shall be considered an act of a state, if the person or group of persons is in fact acting on the instructions of, or under the direction or control of that state in carrying out the conduct.10",
            "images": [
              {
                "id": "img-1.jpeg",
                "top_left_x": 868,
                "top_left_y": 446,
                "bottom_right_x": 1533,
                "bottom_right_y": 858,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 3,
            "markdown": "International courts have developed the ‘effective control’¹¹ and ‘overall control’¹² standards to assess the degree of control which must be exercised by a state in order for the conduct to be considered attributable to it. However, these tests require the proof of a relatively high level of state involvement, which seems inadequate in cyberspace due to the technical difficulties of tracing cyberattacks and the ease of controlling them under camouflage. In order to broaden the scope of conducts leading to the determination of control, the UN report of the Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (2015) proposed that “States should not knowingly allow their territory to be used for internationally wrongful acts using ICTs”,¹³ which paraphrases the general principle of the duty of due diligence.¹⁴\n\n## NATIONAL CYBERSECURITY STRATEGIES\n\nBefore discussing the possible institutionalisation of cyber attribution, it is useful to be aware of what the stated interests of key political forces are on this matter. In this respect, one may refer to the cybersecurity doctrines set out by the permanent members of the United Nations Security Council:\n\n- China: The National Cyberspace Security Strategy (2016) states that China “will deepen bilateral and multilateral network security dialogues and information exchanges with countries, effectively manage differences, actively participate in global and regional organisations’ network security cooperation”, with a view to developing a multilateral, democratic and transparent Internet governance system which respects cyberspace sovereignty and adheres to the rule of law.¹⁵\n- France: The launch of the Paris Call for Trust and Security in Cyberspace (2018) by France has received wide support from states and non-state entities. The supporters of the declaration affirm their “willingness to work together, in the existing fora and through the relevant organizations, institutions, mechanisms and processes to assist one another and implement cooperative measures, notably in order to: [p]revent and recover from malicious cyber activities that threaten or cause significant, indiscriminate or systemic harm to individuals and critical infrastructure”.¹⁶ On the national level, the Strategic Review of Cyber Defence (2017) proclaims that the principle of\n\nsovereignty applies to cyberspace, hence France may invoke state responsibility by claiming a breach of the due diligence duty.¹⁷ The doctrine states that “France must in particular work to reach an agreement at the international level on the obligations faced by a State whose infrastructure would be used for malicious purposes.”¹⁸ In relation to this, the document proposes the “establishment of a «chain of responsibility» allowing the victim State to benefit from the assistance of those States through which the attack passes.”¹⁹\n\n- Russia: The Doctrine of Information Security (2016) expresses Russia’s strategic objectives of “taking part in establishing an international information security system capable of effectively countering the use of information technologies for military and political purposes that are contrary to international law, or for terrorist, extremist, criminal or other illegal purposes” and “creating international legal mechanisms taking into account the specific nature of information technologies and intended to prevent and settle conflicts between States in information space”.²⁰\n- United Kingdom: The National Cyber Strategy (2016-2021) states that the UK “will seek to influence the decision-making of those engaging in [.] disruptive or destructive cyber activity and continue to build frameworks to support international cooperation.”²¹ It will “attribute specific cyber identities publicly”, when it is judged “in the national interest to do so.”²²\n- United States: The National Cyber Strategy (2018) sets out the plan of launching a Cyber Deterrence Initiative “to work with like-minded states to coordinate and support each other’s responses to significant malicious cyber incidents, including through intelligence sharing, buttressing of attribution claims, public statements of support for responsive actions taken, and joint imposition of consequences against malign actors.”²³\n\nAlthough attribution remains a sovereign political decision, there is a tendency reflected in state practice and opinio juris to support international coordination and/or cooperation for the purpose of preventing and responding to cyberattacks. There is growing recognition that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to address cyberspace vulnerabilities and the ‘attribution problem’.\n\n4",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 4,
            "markdown": "![img-2.jpeg](img-2.jpeg)\nFigure 3: Roadmap to institutionalising a cyber attribution mechanism\n\n# INSTITUTIONAL DESIGN CHOICES\n\nThe escalation of cyberattacks, along with the reluctance of states to make attribution claims, and the risk of politicisation when they do, has intensified demand for a politically neutral and fact-based analysis of cyberattacks. This has been articulated by various proposals on the issue.[24] By building on and advancing these models, this article provides a step-by-step approach to highlight the main decisions and considerations that would need to be made and taken into account in the course of designing a cyber attribution mechanism (Figure 3).\n\n# $\\succ$  Constitutive act or agreement\n\nThe creation of a cyber attribution mechanism requires the drafting of a constitutive act or agreement by a founding body or members in order to stipulate the rules governing the functioning of the mechanism. This requires the formation of a working group (within or outside the scope of an international or transnational organisation) to which participants could be delegated by states and/or non-state entities (i.e. from the private sector, the Internet technical community, academia and/or the civil society). Considering that negotiations between states could drag on for a long time, non-state entities should play an active role in building an alliance which promotes efforts to institutionalise cyber attribution. If there are\n\ndifficulties in reaching a wide consensus on a prompt solution, then parties to the negotiations might consider adopting a phased approach, whereby by ad hoc groupings of states and/or non-state entities could conduct joint investigations of major cyberattacks.[25] Testing various cooperative and/or collaborative arrangements could help build trust and identify ways to create a more formalised cyber attribution mechanism over time.\n\n# $\\succ$  Legal status and composition\n\nA cyber attribution mechanism could be institutionalised in a number of ways (Figure 4). An intergovernmental proposal could initiate the establishment of an international organisation by treaty or other instrument governed by international law. This organisation could function autonomously, but may have its relationship to the United Nations fixed by a special agreement, in a similar way to the IAEA or the Organisation for the Prohibition of Chemical Weapons (OPCW). Modelling a cyber attribution organisation on the basis of the OPCW is particularly worthy of consideration, as the OPCW was granted legal mandate in 2018 to \"provide technical expertise to identify those who were perpetrators, organisers, sponsors or otherwise involved in the use of chemicals as weapons\", \"with a view to facilitating universal attribution of all chemical weapons attacks\".[26]",
            "images": [
              {
                "id": "img-2.jpeg",
                "top_left_x": 107,
                "top_left_y": 187,
                "bottom_right_x": 1536,
                "bottom_right_y": 923,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 5,
            "markdown": "![img-3.jpeg](img-3.jpeg)\nFigure 4: Possible ways of institutionalising a cyber attribution mechanism\n\nAlternatively, non-state entities could form an alliance to establish a transnational organisation or a transnationally coordinated decentralised network (with or without the involvement of states). The former would need to be incorporated under domestic private law (practically, of a neutral country), while the latter would need to be based on a contractual agreement between participants. In both cases, non-state members could include entities, which can demonstrate considerable presence in the global cybersecurity market and/or significant technical forensics capabilities and/or other capabilities to oversee the proper functioning of international or national telecommunications networks. Membership could have multiple tiers/categories and may be tied to the sponsorship of a predefined number of other members, similarly to how the membership of FIRST, the leading international confederation of computer incident response teams, is organised.\n\n## Principles of functioning\n\nThe international legitimacy and/or global recognition of a cyber attribution mechanism would depend largely on its credibility. To achieve this, the mechanism would need to be guided by the following principles: rules-based functioning, autonomy, impartiality, objectivity, inclusivity, technical competency, narrow focus, consensus-driven and transparency. Any investigations must be carried out with due observance of the sovereign rights of states. However, the mechanism cannot be subject to any external influence incompatible with the purpose of drawing credible attributions. If neutrality cannot be ensured, then a diverse range of competing interests should be represented.\n\n## Structure\n\nAn international or transnational cyber attribution organisation would require the establishment of organs. The organisation could include, for example, a general conference (consisting of representatives of members), an executive body (board of governors) and a technical secretariat (professional and general service staff), which would encompass investigative teams. The organisation could ensure internal accountability by developing a separate organ or procedure for the purpose of conducting independent peer reviews. Additionally, the establishment of a legal committee could ensure that national laws and international law are respected during investigations.\n\nIn the case of a transnationally coordinated decentralised governance network, participants could establish a permanently functioning consultative forum to coordinate their attribution efforts. Although a decentralised but coordinated system would constitute a less formalised mechanism, it may prompt faster attributions (thus, earlier opportunities to improve defence systems). The multiplicity of attributors would foster ad hoc peer reviewing, where participants have incentives to confirm or debunk other attributions (and thereby enhance or undermine the credibility of an attribution).[27]\n\n## Resources\n\nA cyber attribution mechanism must have the technical expertise, intelligence capabilities, financial means and other resources to enable it to fulfill its purpose. These resources would need to come primarily from the contribution of members. Since most states do not possess sufficient resources to",
            "images": [
              {
                "id": "img-3.jpeg",
                "top_left_x": 110,
                "top_left_y": 187,
                "bottom_right_x": 1543,
                "bottom_right_y": 701,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 6,
            "markdown": "conduct their own attribution investigations, they might be willing to support common efforts due to the operational benefits they can gain by sharing costs. The challenge of convincing competitors to collaborate could be solved by adopting a formalised information sharing system with privacy and data protection assurances.²⁸ The paramount consideration in the employment and the conditions of service should be the objective of securing the highest standards of competence, integrity and efficiency, while reflecting the principle of equitable geographical distribution.\n\n&gt; **Admissibility criteria**\n\nConsidering that a cyber attribution mechanism has limited capacities, there should be a set of criteria which determines: who can initiate proceedings and whether a cyberattack is significant enough to merit investigation. As regards the first condition, it seems reasonable to give the right to initiate proceedings to those who have been directly or indirectly affected by the alleged cyberattack. Granting the victim the exclusive right of initiation preserves the victim's privacy, autonomy and ability to determine whether and when to seek an attribution investigation.²⁹ As regards the second condition, the scale and effects of the alleged cyberattack must reach a sufficiently high threshold. This threshold could be determined based on the evidences collected about the intensity, damages, directness, invasiveness, immediacy, military character, offence object and modus operandi of the cyberattack.\n\n&gt; **Investigations**\n\nA cyber attribution mechanism should clearly define and publish the framework based on which evidence shall be collected and assessed.³⁰ In the case of international or transnational cyber attribution organisations, the organisations should have the powers to access and/or request information from members and other entities. There should also be a process to collect and protect voluntarily shared information from third parties. As regards a transnationally coordinated decentralised governance network, the challenges posed by coordinating the investigations of multiple attributors (i.e. primarily, the protection of sensitive information, intellectual property and proprietary methods) could be overcome by developing parallel attribution chains, which could then be cross-correlated.³¹\n\n&gt; **Burden of proof**\n\nThe burden of proof could be eased by requesting a reasonably suspected entity to plausibly prove their non-involvement in a cyberattack by supplying relevant, tamper-proof and anonymised empirical data about a specific cyber operation.³² (This could be a procedural design solution for implementing the French concept on the “chain of responsibility”.) Alternatively, a ‘virtual control’ test³³ would be suitable to assess the degree of state control exercised over a non-state entity. Accordingly, if it can be demonstrated that a state funded or equipped a non-state entity, then that state should be responsible for the non-state entity’s cyberattack, unless that state rebuts the presumption of responsibility through cooperation in the attribution efforts. In this case, adequate cooperation would shift the burden of attribution back to the attributors and keep the standard for the degree of control at the level of the ‘overall control’ test.\n\n&gt; **Confidence and severity assessments**\n\nA cyber attribution mechanism should establish and adhere to a set of standards for assessing the confidence of its attributions. As attribution is a statement with an inherent degree of uncertainty, the confidence level associated with a finding expresses the estimative probability of its certainty, that is to say, how corroborated, plausible, logical and/or comprehensive underlying evidences are.³⁴ In addition to this, a standardised methodology could be used to estimate the magnitude of the severity (potential impact) of cyberattacks by quantifying the (direct and indirect) harms that the victim suffers.\n\n&gt; **Peer review**\n\nA cyber attribution mechanism could improve the quality of results and obtain a higher level of validation through an independent peer reviewing process. As a result, peers could approve the assessment, draw alternative assessments or call for further investigations.\n\n&gt; **Decision-making**\n\nThe decision-making of a cyber attribution mechanism should be driven by consensus. If an unanimous decision cannot be reached, then majority and minority opinions should be recorded. A cyber attribution mechanism should be narrowly focused on",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 7,
            "markdown": "attribution. However, in the case that a cyber attribution organisation has member states, then if an attribution ruling finds against a subject, then the case, along with the evidences and their assessments, could be referred to the International Court of Justice or the United Nations General Assembly or Security Council for the purpose of determining legal responsibility and appropriate enforcement actions.\n\n&gt; Reporting\n\nAttribution reports should provide a clear and rational explanation for attribution assessments and decisions. It shall also give due consideration to alternative assessments. Technical details should be published for further assessments and broader use in order to facilitate the strengthening of defensive systems.\n\nCONCLUSIONS\n\nThere is growing recognition amongst states that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to protect the security, stability, safety and resilience of the Internet and connected devices from cyberattacks. The deterrence of cyberattacks could be achieved by establishing an institutional mechanism capable of credibly identifying the subject(s) responsible for cyberattacks, which would raise the costs of attacking and decrease the costs of defending. Although a cyber attribution mechanism could be designed in multiple ways, it is important to ensure the international legitimacy and/or global recognition of the mechanism by implementing appropriate confidence- and capacity-building institutional solutions.\n\n1 Ben BUCHANAN (2016): The Cybersecurity Dilemma: Hacking, Trust, and Fear Between Nations. New York, NY, United States: Oxford University Press, 190.\n2 John H. HERZ (1950): Idealist Internationalism and the Security Dilemma. World Politics, 2(2), 157–180 at 157.\n3 See Australian Government (2016): Australia's Cyber Security Strategy: Enabling Innovation, Growth &amp; Prosperity, 28; HM Government of the United Kingdom (2016): National Cyber Security Strategy 2016-2021, 51 at sec. 6.5; Department of Defense of the United States of America (2018): Department of Defense Strategy 2018 (Summary), 1; Ministère des Armées [Ministry of the Armies, French Republic] (2019): Éléments publics de doctrine militaire de lutte informatique offensive [Public Elements of the Military Doctrine for Offensive Cyber Operations], 4.\n4 Brendan KUERBIS (2018): Defusing the cybersecurity dilemma game through attribution and network monitoring. Blog post (13 April 2018), Internet Governance Project, School of Public Policy at Georgia Institute of Technology, <https: 04=\"\" 13=\"\" 2018=\"\" defusing-cybersecurity-dilemma-game-attribution-network-monitoring=\"\" www.internetgovernance.org=\"\">.\n5 See Oona A. HATHAWAY et al. (2012): The Law of Cyber-Attack. California Law Review, 100, 817–886 at 822–837.\n6 United Nations Office on Drugs and Crime (2013): Comprehensive Study on Cybercrime (Draft, February 2013). New York, NY, United States: United Nations, 16.\n\n7 Michael N. SCHMITT (2012): The Law of Cyber Warfare: Quo Vadis? Stanford Law &amp; Policy Review, 25, 269–300 at 282–283.\n8 Thomas RID – Ben BUCHANAN (2015): Attributing Cyber Attacks. The Journal of Strategic Studies, 38(1–2), 4–37 at 7.\n9 International Law Commission (2001): Yearbook of the International Law Commission, Volume II, Part Two: Report of the Commission to the General Assembly on the work of its fifty-third session (A/CN.4/SER.A/2001/Add.1, Part 2). New York, NY, United States – Geneva, Switzerland: United Nations [a.k.a. Draft Articles on Responsibility of States for Internationally Wrongful Acts], 32 at art. 1.\n10 Ibid., 47 at art. 8.\n11 See Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. United States of America), Merits, Judgment, I.C.J. Reports 1986, 64–65 at para. 115.\n12 See Prosecutor v. Dusko Tadic, International Tribunal for the Former Yugoslavia, Case IT-94-1-A (1999), ILM, Vol. 38, No. 6 (November 1999), 1546 at para. 115.\n13 United Nations General Assembly, Seventieth session, Item 93 of the provisional agenda, Developments in the field of information and telecommunications in the context of international security (A/70/174, 22 July 2015), Report of the Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security at para. 13(c).\n14 See Corfu Channel Case (United Kingdom v. Albania), Merits (Judgment of April 9th, 1949), I.C.J. Reports 1949, 22.\n15 國家互聯網信息辦公室 [National Internet Information Office, People's Republic of China] (2016): 国家网络空间安全战略 [National Cyberspace Security Strategy] (27 December 2016), sec. 2 and 4(9).\n16 Paris Call for Trust and Security in Cyberspace (11 November 2018).\n17 Secrétariat général de la défense et de la sécurité nationale [Secretariat-General for National Defence and Security, French Republic] (2018): Revue stratégique de cyberdéfense [Strategic Review of Cyberdefence] (12 February 2018), 82.\n18 Ibid., 86.\n19 Ibid., 160.\n20 Doctrine of Information Security of the Russian Federation (approved by the Decree of the President of the Russian Federation, No. 646 of December 5, 2016), art. 29, paras. b)-c).\n21 HM Government of the United Kingdom (2016): National Cyber Security Strategy 2016-2021, 63 at sec. 8.3.\n22 Ibid., 50 at sec. 6.3.3.\n23 President of the United States of America (2018): National Cyber Strategy of the United States of America (September 2018), 21.\n24 See Jason HEALEY – John C. MALLERY – Klara Tothova JORDAN – Nathaniel V. YOUD (2014): Confidence-Building Measures in Cyberspace: A Multistakeholder Approach for Stability and Security. Washington, DC, United States: Atlantic Council; Scott CHARNEY et al. (2016): From Articulation to Implementation: Enabling progress on cybersecurity norms. Microsoft Corporation; John S. DAVIS II et al. (2017): Stateless Attribution: Toward International Accountability in Cyberspace. Santa Monica, CA, United States: RAND Corporation; Jessica BEYER et al. (2017): Cyberattack Attribution: A Blueprint for Private Sector Leadership. University of Washington, The Henry M. Jackson School of International Studies.\n25 HEALEY et al. [Ibid.], 12.\n26 Organisation for the Prohibition of Chemical Weapons, Fourth Special Session (C-SS-4/DEC.3, 26–28 June 2018), Decision Addressing the Threat from Chemical Weapons Use, paras. 19-20.\n27 Kristen E. EICHENSEHR (2019): Decentralized Cyberattack Attribution. AIIL Unbound, 113, 213–217 at 216–217.\n28 BEYER et al. [op. cit. 24], 41.\n29 DAVIS II et al. [op. cit. 24], 36.\n30 Ibid., 37.\n31 See HEALEY et al. [op. cit. 24], 12.\n32 Thomas REINHOLD (2018): Rethinking the Attribution Problem - A Plausible Proof of Non-Involvement as an Alternative to Credible Attribution. In: Global Commission on the Stability of Cyberspace: Briefings from the Research Advisory Group (Bratislava, Slovakia, May 2018). The Hague, The Netherlands: The Hague Centre for Strategic Studies, 134–149.\n33 Peter MARGULIES (2013): Sovereignty and Cyber Attacks: Technology's Challenge to the Law of State Responsibility. Melbourne Journal of International Law, 14(2), 496–519 at 514.\n34 Herbert LIN (2015): Attribution of Malicious Cyber Incidents: From Soup to Nuts. Hoover Institution Aegis Paper Series on National Security, Technology, and Law, 1607, 30–33.</https:>",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 8,
          "doc_size_bytes": 890655
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "# INSTITUTIONALISING CYBER ATTRIBUTION\nThe escalation of cyberattacks calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions.\nWhile information and communication technologies (ICTs) provide immense opportunities for social and economic development, there are also disturbing trends in the global ICT environment. One of the major threats is the proliferation of cyberattacks. The dramatic increase in the scale and destructive magnitude of cyberattacks implies the assumption that there is an inclination to carry out cyberattacks, because normativisation, compliance, enforcement, trust and cooperation are at relatively low levels. In order to prevent the further escalation of tensions in cyberspace, it would be essential to implement confidence- and capacity-building measures, which would increase deterrent effects and reverse the increasingly offensive doctrines of national cybersecurity strategies. These shifts could be achieved by establishing an internationally legitimised and/or globally recognised cyber(attack) attribution mechanism, which could be institutionalised as an international organisation, a multi-stakeholder or non-governmental transnational organisation or a transnationally coordinated decentralised governance network. In support of this view, this article examines the following questions:\n(1) Why would the establishment of a cyber attribution mechanism be a suitable solution to deter cyberattacks?\n(2) In what circumstances and under what legal framework should a cyber attribution mechanism be deployed?\n(3) How do key political powers construe the necessity to cooperate and/or create new legal mechanisms in order to overcome the challenges posed by cyberattacks and their attribution?\n(4) What are the main steps and considerations of designing institutional solutions for a cyber attribution mechanism?\n# REVERSING CYBERATTACKERS' MOTIVES\nA possible explanation for the ongoing cyber \"arms race\" can be found by extending the \"security dilemma\" to cyber operations. This dilemma models the behaviour of two rival entities (e.g. two states) in a situation in which the entities have a lack of trust in each other. According to the model: if one entity increases its (cyber)security measures, then this will make its rival feel threatened and incited to respond with countermeasures, which could lead to a dangerous escalatory dynamic. These sequence of events are particularly prone to take place within the context of ICTs, where there is a widely held perception that the offensive side has significant advantages over the defensive side.\n|  Current cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 2,2 | 0,3  |\n|   |  Offensive | 3,0 | 1,1  |\nHOW?\n|  Desired cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 3,3 | 1,2  |\n|   |  Offensive | 2,1 | 0,0  |\nTable 1: Game theoretic representation of the cybersecurity dilemma\nIf we look at this problem (and possible solutions) through the lens of non-cooperative game theory, then we can better understand the underlying strategic considerations of two rival entities\n(Table 1). Both entities (and other stakeholders of cyberspace) would benefit from only defending. However, since both entities lack knowledge about what their rival is doing, the payoff for attacking is greater, regardless of what their rival does. The empirical validity of this reasoning has been demonstrated by how some states (such as Australia, the UK, the US and France) have declared that their official policy stances extend beyond an \"active cyber defence system\" to include \"offensive cyber capabilities and operations\". Considering that this trend poses a threat to international peace and global cybersecurity, it is an urgent matter to find a way to reverse (explicit and concealed) offensive motives.\nA possible solution for deterring cyberattacks would be to raise the costs (decrease the payoff) of attacking and lower the costs (increase the payoff) of defending.4 In order to stimulate these shifts, it would be essential to persuade potential attackers that the cost-benefit calculus of attacking is unfavourable. This could be achieved in a twofold way. First, by implementing a formalised set of procedures capable of producing credible (i.e. objective, persuasive and transparent) public evidences and assessments of cyberattacks, attackers would be made more exposed to being held responsible for cyberattacks (and to bear legal consequences which flow therefrom). Secondly, by sharing and/or increasing network security monitoring resources and information, entities which refrain from attacking would be offered technical assistance and legal reassurances.\n# A global cyber attribution mechanism would deter cyberattacks by raising the costs of attacking and lowering the costs of defending.\nThe attainment of the abovementioned objectives calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions. Confidence-building requires the formation of an institutionalised mechanism of coordination and/or cooperation between participating entities. Creating predictable normative expectations in terms of how cyberattacks are attributed would promote common understandings and reduce the risks of mistrust and misperception. On the other hand,\ncapacity-building would be essential to guarantee the effective functioning of a cyber attribution mechanism. This could be achieved by ensuring that the mechanism is equipped with adequate resources, intelligence capabilities, investigative powers and safeguards against external influences.\n# ATTRIBUTION OF CYBERATTACKS\nThe purpose of a cyber attribution mechanism is to identify the subject(s) who shall bear responsibility for a cyberattack (Figure 1). In order to determine the circumstances when a cyber attribution mechanism should be deployed, it is first important to delineate when a malicious cyber operation is to be considered a cyberattack. In this aspect, it is necessary to define the notion of 'cyberattack' and distinguish it from 'cybercrime' and 'cyberwarfare'. Although these are interrelated categories, they have different material scopes and are linked to distinct legal regimes. If it is deemed that a cyberattack took place, then the next step is to identify (attribute) its source by technical means. However, the attribution of a cyberattack to a specific perpetrator (and other parties involved in the attack) can be understood in various ways, because the question of \"who is responsible?\" can be answered in several ways. In case the perpetrator (and other parties involved in the attack) can be identified (with a certain degree of confidence), then the third step is a normative process of establishing and/or invoking responsibility for the violation of law, which, at an international level, entails the international responsibility (of a state) for the breach of an international obligation. However, in case a cyberattack is judged to be the act of a non-state entity, then it is a contentious issue to determine what standard of control and of dependence are required to attribute the act to a particular state.\nFigure 2: Cyber attribution mechanism\n# $\\succ$  Defining 'cyberattack'\nThe terms 'cyberattack', 'cybercrime' and 'cyberwarfare' are frequently used without due consideration to their conceptual meanings. This absence of clarity makes it all the more difficult to design a meaningful legal response. To address this uncertainty, a working definition for 'cyberattack' can be given as follows:\nan act or series of acts, which are perpetrated by a state or non-state entity against the legitimate interests of a (nother) state or the interests of the international community as a whole, to undermine the proper functioning of computer networks or systems for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, or injury including any damage.\nIn contrast to cyberattacks, cybercrimes can be perpetrated only by individuals or non-state entities. While a cyberattack constitutes a breach of an international obligation, a cybercrime is an act which violates domestic, supranational or international criminal law. Cybercrimes have a purpose or effect other than to target the legitimate interests of a (nother) state or the interests of the international community as a whole. Although they are committed by means of a computer system, they do not undermine the proper functioning of computer networks or systems. National laws and international legal instruments usually do not provide a strict definition for cybercrimes, they refer to it rather as a collection of illegal acts. According to their offence object and modus operandi, cybercrimes include not only acts for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, but also computer-related acts for personal or financial gain or harm, as well as computer content-related acts.[6]\nThe prerequisite of a cyberwarfare is that it must constitute a cyberattack, but in addition to satisfying the criteria of a cyberattack, its effects must reach the 'armed attack' threshold under international law (jus ad bellum) or the cyberattack must take place in the context of an international or non-international armed conflict (jus in bello). A state may exercise the right to self-defence and take countermeasures, if they suffer a cyberattack amounting to the level of an armed attack. However, there is legal uncertainty about this threshold in cases when a cyberattack results in severe non-destructive or non-injurious\nconsequences (e.g. it destabilises the financial sector of another state, or undermines its election process or the functioning of any of its institutions). With regard to the overlapping and/or distinct elements of these definitions, one can depict the abstract boundaries of the three terms (Figure 2).\nFigure 2: Logical relations between malicious cyber operations\n# &gt; Attribution in cyberspace\nAttribution entails the problem of minimising uncertainty on all levels without having a uniformly applicable methodology at disposal and where the findings typically appear in shades rather than as a \"black-and-white\" evidence. Attribution is a key component of deterrence, important in strengthening defence against further attacks and a prerequisite to holding the perpetrator of (and other parties involved in) a cyberattack responsible. Cyber attribution carries several meanings, which are conceptually distinct, but often related in practice. The identified subject can be: (a) the computer device(s) from which the cyberattack was carried out; (b) the person(s) who carried out the operation; and (c) the ultimately responsible person, group of persons or state who conducted the cyberattack, or the state which failed to take appropriate measures to prevent a cyberattack emanating from within its territory.\n# $\\succ$  Responsibility for cyberattacks\nIt is undisputed that an internationally wrongful act of a state entails the international responsibility of that state.9 Additionally, it is a general principle of international law that the conduct of a person or group of persons shall be considered an act of a state, if the person or group of persons is in fact acting on the instructions of, or under the direction or control of that state in carrying out the conduct.10\nInternational courts have developed the ‘effective control’¹¹ and ‘overall control’¹² standards to assess the degree of control which must be exercised by a state in order for the conduct to be considered attributable to it. However, these tests require the proof of a relatively high level of state involvement, which seems inadequate in cyberspace due to the technical difficulties of tracing cyberattacks and the ease of controlling them under camouflage. In order to broaden the scope of conducts leading to the determination of control, the UN report of the Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (2015) proposed that “States should not knowingly allow their territory to be used for internationally wrongful acts using ICTs”,¹³ which paraphrases the general principle of the duty of due diligence.¹⁴\n## NATIONAL CYBERSECURITY STRATEGIES\nBefore discussing the possible institutionalisation of cyber attribution, it is useful to be aware of what the stated interests of key political forces are on this matter. In this respect, one may refer to the cybersecurity doctrines set out by the permanent members of the United Nations Security Council:\n- China: The National Cyberspace Security Strategy (2016) states that China “will deepen bilateral and multilateral network security dialogues and information exchanges with countries, effectively manage differences, actively participate in global and regional organisations’ network security cooperation”, with a view to developing a multilateral, democratic and transparent Internet governance system which respects cyberspace sovereignty and adheres to the rule of law.¹⁵\n- France: The launch of the Paris Call for Trust and Security in Cyberspace (2018) by France has received wide support from states and non-state entities. The supporters of the declaration affirm their “willingness to work together, in the existing fora and through the relevant organizations, institutions, mechanisms and processes to assist one another and implement cooperative measures, notably in order to: [p]revent and recover from malicious cyber activities that threaten or cause significant, indiscriminate or systemic harm to individuals and critical infrastructure”.¹⁶ On the national level, the Strategic Review of Cyber Defence (2017) proclaims that the principle of\nsovereignty applies to cyberspace, hence France may invoke state responsibility by claiming a breach of the due diligence duty.¹⁷ The doctrine states that “France must in particular work to reach an agreement at the international level on the obligations faced by a State whose infrastructure would be used for malicious purposes.”¹⁸ In relation to this, the document proposes the “establishment of a «chain of responsibility» allowing the victim State to benefit from the assistance of those States through which the attack passes.”¹⁹\n- Russia: The Doctrine of Information Security (2016) expresses Russia’s strategic objectives of “taking part in establishing an international information security system capable of effectively countering the use of information technologies for military and political purposes that are contrary to international law, or for terrorist, extremist, criminal or other illegal purposes” and “creating international legal mechanisms taking into account the specific nature of information technologies and intended to prevent and settle conflicts between States in information space”.²⁰\n- United Kingdom: The National Cyber Strategy (2016-2021) states that the UK “will seek to influence the decision-making of those engaging in [.] disruptive or destructive cyber activity and continue to build frameworks to support international cooperation.”²¹ It will “attribute specific cyber identities publicly”, when it is judged “in the national interest to do so.”²²\n- United States: The National Cyber Strategy (2018) sets out the plan of launching a Cyber Deterrence Initiative “to work with like-minded states to coordinate and support each other’s responses to significant malicious cyber incidents, including through intelligence sharing, buttressing of attribution claims, public statements of support for responsive actions taken, and joint imposition of consequences against malign actors.”²³\nAlthough attribution remains a sovereign political decision, there is a tendency reflected in state practice and opinio juris to support international coordination and/or cooperation for the purpose of preventing and responding to cyberattacks. There is growing recognition that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to address cyberspace vulnerabilities and the ‘attribution problem’.\n4\nFigure 3: Roadmap to institutionalising a cyber attribution mechanism\n# INSTITUTIONAL DESIGN CHOICES\nThe escalation of cyberattacks, along with the reluctance of states to make attribution claims, and the risk of politicisation when they do, has intensified demand for a politically neutral and fact-based analysis of cyberattacks. This has been articulated by various proposals on the issue.[24] By building on and advancing these models, this article provides a step-by-step approach to highlight the main decisions and considerations that would need to be made and taken into account in the course of designing a cyber attribution mechanism (Figure 3).\n# $\\succ$  Constitutive act or agreement\nThe creation of a cyber attribution mechanism requires the drafting of a constitutive act or agreement by a founding body or members in order to stipulate the rules governing the functioning of the mechanism. This requires the formation of a working group (within or outside the scope of an international or transnational organisation) to which participants could be delegated by states and/or non-state entities (i.e. from the private sector, the Internet technical community, academia and/or the civil society). Considering that negotiations between states could drag on for a long time, non-state entities should play an active role in building an alliance which promotes efforts to institutionalise cyber attribution. If there are\ndifficulties in reaching a wide consensus on a prompt solution, then parties to the negotiations might consider adopting a phased approach, whereby by ad hoc groupings of states and/or non-state entities could conduct joint investigations of major cyberattacks.[25] Testing various cooperative and/or collaborative arrangements could help build trust and identify ways to create a more formalised cyber attribution mechanism over time.\n# $\\succ$  Legal status and composition\nA cyber attribution mechanism could be institutionalised in a number of ways (Figure 4). An intergovernmental proposal could initiate the establishment of an international organisation by treaty or other instrument governed by international law. This organisation could function autonomously, but may have its relationship to the United Nations fixed by a special agreement, in a similar way to the IAEA or the Organisation for the Prohibition of Chemical Weapons (OPCW). Modelling a cyber attribution organisation on the basis of the OPCW is particularly worthy of consideration, as the OPCW was granted legal mandate in 2018 to \"provide technical expertise to identify those who were perpetrators, organisers, sponsors or otherwise involved in the use of chemicals as weapons\", \"with a view to facilitating universal attribution of all chemical weapons attacks\".[26]\nFigure 4: Possible ways of institutionalising a cyber attribution mechanism\nAlternatively, non-state entities could form an alliance to establish a transnational organisation or a transnationally coordinated decentralised network (with or without the involvement of states). The former would need to be incorporated under domestic private law (practically, of a neutral country), while the latter would need to be based on a contractual agreement between participants. In both cases, non-state members could include entities, which can demonstrate considerable presence in the global cybersecurity market and/or significant technical forensics capabilities and/or other capabilities to oversee the proper functioning of international or national telecommunications networks. Membership could have multiple tiers/categories and may be tied to the sponsorship of a predefined number of other members, similarly to how the membership of FIRST, the leading international confederation of computer incident response teams, is organised.\n## Principles of functioning\nThe international legitimacy and/or global recognition of a cyber attribution mechanism would depend largely on its credibility. To achieve this, the mechanism would need to be guided by the following principles: rules-based functioning, autonomy, impartiality, objectivity, inclusivity, technical competency, narrow focus, consensus-driven and transparency. Any investigations must be carried out with due observance of the sovereign rights of states. However, the mechanism cannot be subject to any external influence incompatible with the purpose of drawing credible attributions. If neutrality cannot be ensured, then a diverse range of competing interests should be represented.\n## Structure\nAn international or transnational cyber attribution organisation would require the establishment of organs. The organisation could include, for example, a general conference (consisting of representatives of members), an executive body (board of governors) and a technical secretariat (professional and general service staff), which would encompass investigative teams. The organisation could ensure internal accountability by developing a separate organ or procedure for the purpose of conducting independent peer reviews. Additionally, the establishment of a legal committee could ensure that national laws and international law are respected during investigations.\nIn the case of a transnationally coordinated decentralised governance network, participants could establish a permanently functioning consultative forum to coordinate their attribution efforts. Although a decentralised but coordinated system would constitute a less formalised mechanism, it may prompt faster attributions (thus, earlier opportunities to improve defence systems). The multiplicity of attributors would foster ad hoc peer reviewing, where participants have incentives to confirm or debunk other attributions (and thereby enhance or undermine the credibility of an attribution).[27]\n## Resources\nA cyber attribution mechanism must have the technical expertise, intelligence capabilities, financial means and other resources to enable it to fulfill its purpose. These resources would need to come primarily from the contribution of members. Since most states do not possess sufficient resources to\nconduct their own attribution investigations, they might be willing to support common efforts due to the operational benefits they can gain by sharing costs. The challenge of convincing competitors to collaborate could be solved by adopting a formalised information sharing system with privacy and data protection assurances.²⁸ The paramount consideration in the employment and the conditions of service should be the objective of securing the highest standards of competence, integrity and efficiency, while reflecting the principle of equitable geographical distribution.\n&gt; **Admissibility criteria**\nConsidering that a cyber attribution mechanism has limited capacities, there should be a set of criteria which determines: who can initiate proceedings and whether a cyberattack is significant enough to merit investigation. As regards the first condition, it seems reasonable to give the right to initiate proceedings to those who have been directly or indirectly affected by the alleged cyberattack. Granting the victim the exclusive right of initiation preserves the victim's privacy, autonomy and ability to determine whether and when to seek an attribution investigation.²⁹ As regards the second condition, the scale and effects of the alleged cyberattack must reach a sufficiently high threshold. This threshold could be determined based on the evidences collected about the intensity, damages, directness, invasiveness, immediacy, military character, offence object and modus operandi of the cyberattack.\n&gt; **Investigations**\nA cyber attribution mechanism should clearly define and publish the framework based on which evidence shall be collected and assessed.³⁰ In the case of international or transnational cyber attribution organisations, the organisations should have the powers to access and/or request information from members and other entities. There should also be a process to collect and protect voluntarily shared information from third parties. As regards a transnationally coordinated decentralised governance network, the challenges posed by coordinating the investigations of multiple attributors (i.e. primarily, the protection of sensitive information, intellectual property and proprietary methods) could be overcome by developing parallel attribution chains, which could then be cross-correlated.³¹\n&gt; **Burden of proof**\nThe burden of proof could be eased by requesting a reasonably suspected entity to plausibly prove their non-involvement in a cyberattack by supplying relevant, tamper-proof and anonymised empirical data about a specific cyber operation.³² (This could be a procedural design solution for implementing the French concept on the “chain of responsibility”.) Alternatively, a ‘virtual control’ test³³ would be suitable to assess the degree of state control exercised over a non-state entity. Accordingly, if it can be demonstrated that a state funded or equipped a non-state entity, then that state should be responsible for the non-state entity’s cyberattack, unless that state rebuts the presumption of responsibility through cooperation in the attribution efforts. In this case, adequate cooperation would shift the burden of attribution back to the attributors and keep the standard for the degree of control at the level of the ‘overall control’ test.\n&gt; **Confidence and severity assessments**\nA cyber attribution mechanism should establish and adhere to a set of standards for assessing the confidence of its attributions. As attribution is a statement with an inherent degree of uncertainty, the confidence level associated with a finding expresses the estimative probability of its certainty, that is to say, how corroborated, plausible, logical and/or comprehensive underlying evidences are.³⁴ In addition to this, a standardised methodology could be used to estimate the magnitude of the severity (potential impact) of cyberattacks by quantifying the (direct and indirect) harms that the victim suffers.\n&gt; **Peer review**\nA cyber attribution mechanism could improve the quality of results and obtain a higher level of validation through an independent peer reviewing process. As a result, peers could approve the assessment, draw alternative assessments or call for further investigations.\n&gt; **Decision-making**\nThe decision-making of a cyber attribution mechanism should be driven by consensus. If an unanimous decision cannot be reached, then majority and minority opinions should be recorded. A cyber attribution mechanism should be narrowly focused on\nattribution. However, in the case that a cyber attribution organisation has member states, then if an attribution ruling finds against a subject, then the case, along with the evidences and their assessments, could be referred to the International Court of Justice or the United Nations General Assembly or Security Council for the purpose of determining legal responsibility and appropriate enforcement actions.\n&gt; Reporting\nAttribution reports should provide a clear and rational explanation for attribution assessments and decisions. It shall also give due consideration to alternative assessments. Technical details should be published for further assessments and broader use in order to facilitate the strengthening of defensive systems.\nCONCLUSIONS\nThere is growing recognition amongst states that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to protect the security, stability, safety and resilience of the Internet and connected devices from cyberattacks. The deterrence of cyberattacks could be achieved by establishing an institutional mechanism capable of credibly identifying the subject(s) responsible for cyberattacks, which would raise the costs of attacking and decrease the costs of defending. Although a cyber attribution mechanism could be designed in multiple ways, it is important to ensure the international legitimacy and/or global recognition of the mechanism by implementing appropriate confidence- and capacity-building institutional solutions.\n1 Ben BUCHANAN (2016): The Cybersecurity Dilemma: Hacking, Trust, and Fear Between Nations. New York, NY, United States: Oxford University Press, 190.\n2 John H. HERZ (1950): Idealist Internationalism and the Security Dilemma. World Politics, 2(2), 157–180 at 157.\n3 See Australian Government (2016): Australia's Cyber Security Strategy: Enabling Innovation, Growth &amp; Prosperity, 28; HM Government of the United Kingdom (2016): National Cyber Security Strategy 2016-2021, 51 at sec. 6.5; Department of Defense of the United States of America (2018): Department of Defense Strategy 2018 (Summary), 1; Ministère des Armées [Ministry of the Armies, French Republic] (2019): Éléments publics de doctrine militaire de lutte informatique offensive [Public Elements of the Military Doctrine for Offensive Cyber Operations], 4.\n4 Brendan KUERBIS (2018): Defusing the cybersecurity dilemma game through attribution and network monitoring. Blog post (13 April 2018), Internet Governance Project, School of Public Policy at Georgia Institute of Technology, <https: 04=\"\" 13=\"\" 2018=\"\" defusing-cybersecurity-dilemma-game-attribution-network-monitoring=\"\" www.internetgovernance.org=\"\">.\n5 See Oona A. HATHAWAY et al. (2012): The Law of Cyber-Attack. California Law Review, 100, 817–886 at 822–837.\n6 United Nations Office on Drugs and Crime (2013): Comprehensive Study on Cybercrime (Draft, February 2013). New York, NY, United States: United Nations, 16.\n7 Michael N. SCHMITT (2012): The Law of Cyber Warfare: Quo Vadis? Stanford Law &amp; Policy Review, 25, 269–300 at 282–283.\n8 Thomas RID – Ben BUCHANAN (2015): Attributing Cyber Attacks. The Journal of Strategic Studies, 38(1–2), 4–37 at 7.\n9 International Law Commission (2001): Yearbook of the International Law Commission, Volume II, Part Two: Report of the Commission to the General Assembly on the work of its fifty-third session (A/CN.4/SER.A/2001/Add.1, Part 2). New York, NY, United States – Geneva, Switzerland: United Nations [a.k.a. Draft Articles on Responsibility of States for Internationally Wrongful Acts], 32 at art. 1.\n10 Ibid., 47 at art. 8.\n11 See Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. United States of America), Merits, Judgment, I.C.J. Reports 1986, 64–65 at para. 115.\n12 See Prosecutor v. Dusko Tadic, International Tribunal for the Former Yugoslavia, Case IT-94-1-A (1999), ILM, Vol. 38, No. 6 (November 1999), 1546 at para. 115.\n13 United Nations General Assembly, Seventieth session, Item 93 of the provisional agenda, Developments in the field of information and telecommunications in the context of international security (A/70/174, 22 July 2015), Report of the Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security at para. 13(c).\n14 See Corfu Channel Case (United Kingdom v. Albania), Merits (Judgment of April 9th, 1949), I.C.J. Reports 1949, 22.\n15 國家互聯網信息辦公室 [National Internet Information Office, People's Republic of China] (2016): 国家网络空间安全战略 [National Cyberspace Security Strategy] (27 December 2016), sec. 2 and 4(9).\n16 Paris Call for Trust and Security in Cyberspace (11 November 2018).\n17 Secrétariat général de la défense et de la sécurité nationale [Secretariat-General for National Defence and Security, French Republic] (2018): Revue stratégique de cyberdéfense [Strategic Review of Cyberdefence] (12 February 2018), 82.\n18 Ibid., 86.\n19 Ibid., 160.\n20 Doctrine of Information Security of the Russian Federation (approved by the Decree of the President of the Russian Federation, No. 646 of December 5, 2016), art. 29, paras. b)-c).\n21 HM Government of the United Kingdom (2016): National Cyber Security Strategy 2016-2021, 63 at sec. 8.3.\n22 Ibid., 50 at sec. 6.3.3.\n23 President of the United States of America (2018): National Cyber Strategy of the United States of America (September 2018), 21.\n24 See Jason HEALEY – John C. MALLERY – Klara Tothova JORDAN – Nathaniel V. YOUD (2014): Confidence-Building Measures in Cyberspace: A Multistakeholder Approach for Stability and Security. Washington, DC, United States: Atlantic Council; Scott CHARNEY et al. (2016): From Articulation to Implementation: Enabling progress on cybersecurity norms. Microsoft Corporation; John S. DAVIS II et al. (2017): Stateless Attribution: Toward International Accountability in Cyberspace. Santa Monica, CA, United States: RAND Corporation; Jessica BEYER et al. (2017): Cyberattack Attribution: A Blueprint for Private Sector Leadership. University of Washington, The Henry M. Jackson School of International Studies.\n25 HEALEY et al. [Ibid.], 12.\n26 Organisation for the Prohibition of Chemical Weapons, Fourth Special Session (C-SS-4/DEC.3, 26–28 June 2018), Decision Addressing the Threat from Chemical Weapons Use, paras. 19-20.\n27 Kristen E. EICHENSEHR (2019): Decentralized Cyberattack Attribution. AIIL Unbound, 113, 213–217 at 216–217.\n28 BEYER et al. [op. cit. 24], 41.\n29 DAVIS II et al. [op. cit. 24], 36.\n30 Ibid., 37.\n31 See HEALEY et al. [op. cit. 24], 12.\n32 Thomas REINHOLD (2018): Rethinking the Attribution Problem - A Plausible Proof of Non-Involvement as an Alternative to Credible Attribution. In: Global Commission on the Stability of Cyberspace: Briefings from the Research Advisory Group (Bratislava, Slovakia, May 2018). The Hague, The Netherlands: The Hague Centre for Strategic Studies, 134–149.\n33 Peter MARGULIES (2013): Sovereignty and Cyber Attacks: Technology's Challenge to the Law of State Responsibility. Melbourne Journal of International Law, 14(2), 496–519 at 514.\n34 Herbert LIN (2015): Attribution of Malicious Cyber Incidents: From Soup to Nuts. Hoover Institution Aegis Paper Series on National Security, Technology, and Law, 1607, 30–33.</https:>",
  "references": [],
  "flat_text": "# INSTITUTIONALISING CYBER ATTRIBUTION\nThe escalation of cyberattacks calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions.\nWhile information and communication technologies (ICTs) provide immense opportunities for social and economic development, there are also disturbing trends in the global ICT environment. One of the major threats is the proliferation of cyberattacks. The dramatic increase in the scale and destructive magnitude of cyberattacks implies the assumption that there is an inclination to carry out cyberattacks, because normativisation, compliance, enforcement, trust and cooperation are at relatively low levels. In order to prevent the further escalation of tensions in cyberspace, it would be essential to implement confidence- and capacity-building measures, which would increase deterrent effects and reverse the increasingly offensive doctrines of national cybersecurity strategies. These shifts could be achieved by establishing an internationally legitimised and/or globally recognised cyber(attack) attribution mechanism, which could be institutionalised as an international organisation, a multi-stakeholder or non-governmental transnational organisation or a transnationally coordinated decentralised governance network. In support of this view, this article examines the following questions:\n(1) Why would the establishment of a cyber attribution mechanism be a suitable solution to deter cyberattacks?\n(2) In what circumstances and under what legal framework should a cyber attribution mechanism be deployed?\n(3) How do key political powers construe the necessity to cooperate and/or create new legal mechanisms in order to overcome the challenges posed by cyberattacks and their attribution?\n(4) What are the main steps and considerations of designing institutional solutions for a cyber attribution mechanism?\n# REVERSING CYBERATTACKERS' MOTIVES\nA possible explanation for the ongoing cyber \"arms race\" can be found by extending the \"security dilemma\" to cyber operations. This dilemma models the behaviour of two rival entities (e.g. two states) in a situation in which the entities have a lack of trust in each other. According to the model: if one entity increases its (cyber)security measures, then this will make its rival feel threatened and incited to respond with countermeasures, which could lead to a dangerous escalatory dynamic. These sequence of events are particularly prone to take place within the context of ICTs, where there is a widely held perception that the offensive side has significant advantages over the defensive side.\n|  Current cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 2,2 | 0,3  |\n|   |  Offensive | 3,0 | 1,1  |\nHOW?\n|  Desired cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 3,3 | 1,2  |\n|   |  Offensive | 2,1 | 0,0  |\nTable 1: Game theoretic representation of the cybersecurity dilemma\nIf we look at this problem (and possible solutions) through the lens of non-cooperative game theory, then we can better understand the underlying strategic considerations of two rival entities\n(Table 1). Both entities (and other stakeholders of cyberspace) would benefit from only defending. However, since both entities lack knowledge about what their rival is doing, the payoff for attacking is greater, regardless of what their rival does. The empirical validity of this reasoning has been demonstrated by how some states (such as Australia, the UK, the US and France) have declared that their official policy stances extend beyond an \"active cyber defence system\" to include \"offensive cyber capabilities and operations\". Considering that this trend poses a threat to international peace and global cybersecurity, it is an urgent matter to find a way to reverse (explicit and concealed) offensive motives.\nA possible solution for deterring cyberattacks would be to raise the costs (decrease the payoff) of attacking and lower the costs (increase the payoff) of defending.4 In order to stimulate these shifts, it would be essential to persuade potential attackers that the cost-benefit calculus of attacking is unfavourable. This could be achieved in a twofold way. First, by implementing a formalised set of procedures capable of producing credible (i.e. objective, persuasive and transparent) public evidences and assessments of cyberattacks, attackers would be made more exposed to being held responsible for cyberattacks (and to bear legal consequences which flow therefrom). Secondly, by sharing and/or increasing network security monitoring resources and information, entities which refrain from attacking would be offered technical assistance and legal reassurances.\n# A global cyber attribution mechanism would deter cyberattacks by raising the costs of attacking and lowering the costs of defending.\nThe attainment of the abovementioned objectives calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions. Confidence-building requires the formation of an institutionalised mechanism of coordination and/or cooperation between participating entities. Creating predictable normative expectations in terms of how cyberattacks are attributed would promote common understandings and reduce the risks of mistrust and misperception. On the other hand,\ncapacity-building would be essential to guarantee the effective functioning of a cyber attribution mechanism. This could be achieved by ensuring that the mechanism is equipped with adequate resources, intelligence capabilities, investigative powers and safeguards against external influences.\n# ATTRIBUTION OF CYBERATTACKS\nThe purpose of a cyber attribution mechanism is to identify the subject(s) who shall bear responsibility for a cyberattack (Figure 1). In order to determine the circumstances when a cyber attribution mechanism should be deployed, it is first important to delineate when a malicious cyber operation is to be considered a cyberattack. In this aspect, it is necessary to define the notion of 'cyberattack' and distinguish it from 'cybercrime' and 'cyberwarfare'. Although these are interrelated categories, they have different material scopes and are linked to distinct legal regimes. If it is deemed that a cyberattack took place, then the next step is to identify (attribute) its source by technical means. However, the attribution of a cyberattack to a specific perpetrator (and other parties involved in the attack) can be understood in various ways, because the question of \"who is responsible?\" can be answered in several ways. In case the perpetrator (and other parties involved in the attack) can be identified (with a certain degree of confidence), then the third step is a normative process of establishing and/or invoking responsibility for the violation of law, which, at an international level, entails the international responsibility (of a state) for the breach of an international obligation. However, in case a cyberattack is judged to be the act of a non-state entity, then it is a contentious issue to determine what standard of control and of dependence are required to attribute the act to a particular state.\nFigure 2: Cyber attribution mechanism\n# $\\succ$  Defining 'cyberattack'\nThe terms 'cyberattack', 'cybercrime' and 'cyberwarfare' are frequently used without due consideration to their conceptual meanings. This absence of clarity makes it all the more difficult to design a meaningful legal response. To address this uncertainty, a working definition for 'cyberattack' can be given as follows:\nan act or series of acts, which are perpetrated by a state or non-state entity against the legitimate interests of a (nother) state or the interests of the international community as a whole, to undermine the proper functioning of computer networks or systems for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, or injury including any damage.\nIn contrast to cyberattacks, cybercrimes can be perpetrated only by individuals or non-state entities. While a cyberattack constitutes a breach of an international obligation, a cybercrime is an act which violates domestic, supranational or international criminal law. Cybercrimes have a purpose or effect other than to target the legitimate interests of a (nother) state or the interests of the international community as a whole. Although they are committed by means of a computer system, they do not undermine the proper functioning of computer networks or systems. National laws and international legal instruments usually do not provide a strict definition for cybercrimes, they refer to it rather as a collection of illegal acts. According to their offence object and modus operandi, cybercrimes include not only acts for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, but also computer-related acts for personal or financial gain or harm, as well as computer content-related acts.[6]\nThe prerequisite of a cyberwarfare is that it must constitute a cyberattack, but in addition to satisfying the criteria of a cyberattack, its effects must reach the 'armed attack' threshold under international law (jus ad bellum) or the cyberattack must take place in the context of an international or non-international armed conflict (jus in bello). A state may exercise the right to self-defence and take countermeasures, if they suffer a cyberattack amounting to the level of an armed attack. However, there is legal uncertainty about this threshold in cases when a cyberattack results in severe non-destructive or non-injurious\nconsequences (e.g. it destabilises the financial sector of another state, or undermines its election process or the functioning of any of its institutions). With regard to the overlapping and/or distinct elements of these definitions, one can depict the abstract boundaries of the three terms (Figure 2).\nFigure 2: Logical relations between malicious cyber operations\n# &gt; Attribution in cyberspace\nAttribution entails the problem of minimising uncertainty on all levels without having a uniformly applicable methodology at disposal and where the findings typically appear in shades rather than as a \"black-and-white\" evidence. Attribution is a key component of deterrence, important in strengthening defence against further attacks and a prerequisite to holding the perpetrator of (and other parties involved in) a cyberattack responsible. Cyber attribution carries several meanings, which are conceptually distinct, but often related in practice. The identified subject can be: (a) the computer device(s) from which the cyberattack was carried out; (b) the person(s) who carried out the operation; and (c) the ultimately responsible person, group of persons or state who conducted the cyberattack, or the state which failed to take appropriate measures to prevent a cyberattack emanating from within its territory.\n# $\\succ$  Responsibility for cyberattacks\nIt is undisputed that an internationally wrongful act of a state entails the international responsibility of that state.9 Additionally, it is a general principle of international law that the conduct of a person or group of persons shall be considered an act of a state, if the person or group of persons is in fact acting on the instructions of, or under the direction or control of that state in carrying out the conduct.10\nInternational courts have developed the ‘effective control’¹¹ and ‘overall control’¹² standards to assess the degree of control which must be exercised by a state in order for the conduct to be considered attributable to it. However, these tests require the proof of a relatively high level of state involvement, which seems inadequate in cyberspace due to the technical difficulties of tracing cyberattacks and the ease of controlling them under camouflage. In order to broaden the scope of conducts leading to the determination of control, the UN report of the Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (2015) proposed that “States should not knowingly allow their territory to be used for internationally wrongful acts using ICTs”,¹³ which paraphrases the general principle of the duty of due diligence.¹⁴\n## NATIONAL CYBERSECURITY STRATEGIES\nBefore discussing the possible institutionalisation of cyber attribution, it is useful to be aware of what the stated interests of key political forces are on this matter. In this respect, one may refer to the cybersecurity doctrines set out by the permanent members of the United Nations Security Council:\n- China: The National Cyberspace Security Strategy (2016) states that China “will deepen bilateral and multilateral network security dialogues and information exchanges with countries, effectively manage differences, actively participate in global and regional organisations’ network security cooperation”, with a view to developing a multilateral, democratic and transparent Internet governance system which respects cyberspace sovereignty and adheres to the rule of law.¹⁵\n- France: The launch of the Paris Call for Trust and Security in Cyberspace (2018) by France has received wide support from states and non-state entities. The supporters of the declaration affirm their “willingness to work together, in the existing fora and through the relevant organizations, institutions, mechanisms and processes to assist one another and implement cooperative measures, notably in order to: [p]revent and recover from malicious cyber activities that threaten or cause significant, indiscriminate or systemic harm to individuals and critical infrastructure”.¹⁶ On the national level, the Strategic Review of Cyber Defence (2017) proclaims that the principle of\nsovereignty applies to cyberspace, hence France may invoke state responsibility by claiming a breach of the due diligence duty.¹⁷ The doctrine states that “France must in particular work to reach an agreement at the international level on the obligations faced by a State whose infrastructure would be used for malicious purposes.”¹⁸ In relation to this, the document proposes the “establishment of a «chain of responsibility» allowing the victim State to benefit from the assistance of those States through which the attack passes.”¹⁹\n- Russia: The Doctrine of Information Security (2016) expresses Russia’s strategic objectives of “taking part in establishing an international information security system capable of effectively countering the use of information technologies for military and political purposes that are contrary to international law, or for terrorist, extremist, criminal or other illegal purposes” and “creating international legal mechanisms taking into account the specific nature of information technologies and intended to prevent and settle conflicts between States in information space”.²⁰\n- United Kingdom: The National Cyber Strategy (2016-2021) states that the UK “will seek to influence the decision-making of those engaging in [.] disruptive or destructive cyber activity and continue to build frameworks to support international cooperation.”²¹ It will “attribute specific cyber identities publicly”, when it is judged “in the national interest to do so.”²²\n- United States: The National Cyber Strategy (2018) sets out the plan of launching a Cyber Deterrence Initiative “to work with like-minded states to coordinate and support each other’s responses to significant malicious cyber incidents, including through intelligence sharing, buttressing of attribution claims, public statements of support for responsive actions taken, and joint imposition of consequences against malign actors.”²³\nAlthough attribution remains a sovereign political decision, there is a tendency reflected in state practice and opinio juris to support international coordination and/or cooperation for the purpose of preventing and responding to cyberattacks. There is growing recognition that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to address cyberspace vulnerabilities and the ‘attribution problem’.\n\n# INSTITUTIONAL DESIGN CHOICES\nThe escalation of cyberattacks, along with the reluctance of states to make attribution claims, and the risk of politicisation when they do, has intensified demand for a politically neutral and fact-based analysis of cyberattacks. This has been articulated by various proposals on the issue.[24] By building on and advancing these models, this article provides a step-by-step approach to highlight the main decisions and considerations that would need to be made and taken into account in the course of designing a cyber attribution mechanism (Figure 3).\n# $\\succ$  Constitutive act or agreement\nThe creation of a cyber attribution mechanism requires the drafting of a constitutive act or agreement by a founding body or members in order to stipulate the rules governing the functioning of the mechanism. This requires the formation of a working group (within or outside the scope of an international or transnational organisation) to which participants could be delegated by states and/or non-state entities (i.e. from the private sector, the Internet technical community, academia and/or the civil society). Considering that negotiations between states could drag on for a long time, non-state entities should play an active role in building an alliance which promotes efforts to institutionalise cyber attribution. If there are\ndifficulties in reaching a wide consensus on a prompt solution, then parties to the negotiations might consider adopting a phased approach, whereby by ad hoc groupings of states and/or non-state entities could conduct joint investigations of major cyberattacks.[25] Testing various cooperative and/or collaborative arrangements could help build trust and identify ways to create a more formalised cyber attribution mechanism over time.\n# $\\succ$  Legal status and composition\nA cyber attribution mechanism could be institutionalised in a number of ways (Figure 4). An intergovernmental proposal could initiate the establishment of an international organisation by treaty or other instrument governed by international law. This organisation could function autonomously, but may have its relationship to the United Nations fixed by a special agreement, in a similar way to the IAEA or the Organisation for the Prohibition of Chemical Weapons (OPCW). Modelling a cyber attribution organisation on the basis of the OPCW is particularly worthy of consideration, as the OPCW was granted legal mandate in 2018 to \"provide technical expertise to identify those who were perpetrators, organisers, sponsors or otherwise involved in the use of chemicals as weapons\", \"with a view to facilitating universal attribution of all chemical weapons attacks\".[26]\nFigure 4: Possible ways of institutionalising a cyber attribution mechanism\nAlternatively, non-state entities could form an alliance to establish a transnational organisation or a transnationally coordinated decentralised network (with or without the involvement of states). The former would need to be incorporated under domestic private law (practically, of a neutral country), while the latter would need to be based on a contractual agreement between participants. In both cases, non-state members could include entities, which can demonstrate considerable presence in the global cybersecurity market and/or significant technical forensics capabilities and/or other capabilities to oversee the proper functioning of international or national telecommunications networks. Membership could have multiple tiers/categories and may be tied to the sponsorship of a predefined number of other members, similarly to how the membership of FIRST, the leading international confederation of computer incident response teams, is organised.\n## Principles of functioning\nThe international legitimacy and/or global recognition of a cyber attribution mechanism would depend largely on its credibility. To achieve this, the mechanism would need to be guided by the following principles: rules-based functioning, autonomy, impartiality, objectivity, inclusivity, technical competency, narrow focus, consensus-driven and transparency. Any investigations must be carried out with due observance of the sovereign rights of states. However, the mechanism cannot be subject to any external influence incompatible with the purpose of drawing credible attributions. If neutrality cannot be ensured, then a diverse range of competing interests should be represented.\n## Structure\nAn international or transnational cyber attribution organisation would require the establishment of organs. The organisation could include, for example, a general conference (consisting of representatives of members), an executive body (board of governors) and a technical secretariat (professional and general service staff), which would encompass investigative teams. The organisation could ensure internal accountability by developing a separate organ or procedure for the purpose of conducting independent peer reviews. Additionally, the establishment of a legal committee could ensure that national laws and international law are respected during investigations.\nIn the case of a transnationally coordinated decentralised governance network, participants could establish a permanently functioning consultative forum to coordinate their attribution efforts. Although a decentralised but coordinated system would constitute a less formalised mechanism, it may prompt faster attributions (thus, earlier opportunities to improve defence systems). The multiplicity of attributors would foster ad hoc peer reviewing, where participants have incentives to confirm or debunk other attributions (and thereby enhance or undermine the credibility of an attribution).[27]\n## Resources\nA cyber attribution mechanism must have the technical expertise, intelligence capabilities, financial means and other resources to enable it to fulfill its purpose. These resources would need to come primarily from the contribution of members. Since most states do not possess sufficient resources to\nconduct their own attribution investigations, they might be willing to support common efforts due to the operational benefits they can gain by sharing costs. The challenge of convincing competitors to collaborate could be solved by adopting a formalised information sharing system with privacy and data protection assurances.²⁸ The paramount consideration in the employment and the conditions of service should be the objective of securing the highest standards of competence, integrity and efficiency, while reflecting the principle of equitable geographical distribution.\n&gt; **Admissibility criteria**\nConsidering that a cyber attribution mechanism has limited capacities, there should be a set of criteria which determines: who can initiate proceedings and whether a cyberattack is significant enough to merit investigation. As regards the first condition, it seems reasonable to give the right to initiate proceedings to those who have been directly or indirectly affected by the alleged cyberattack. Granting the victim the exclusive right of initiation preserves the victim's privacy, autonomy and ability to determine whether and when to seek an attribution investigation.²⁹ As regards the second condition, the scale and effects of the alleged cyberattack must reach a sufficiently high threshold. This threshold could be determined based on the evidences collected about the intensity, damages, directness, invasiveness, immediacy, military character, offence object and modus operandi of the cyberattack.\n&gt; **Investigations**\nA cyber attribution mechanism should clearly define and publish the framework based on which evidence shall be collected and assessed.³⁰ In the case of international or transnational cyber attribution organisations, the organisations should have the powers to access and/or request information from members and other entities. There should also be a process to collect and protect voluntarily shared information from third parties. As regards a transnationally coordinated decentralised governance network, the challenges posed by coordinating the investigations of multiple attributors (i.e. primarily, the protection of sensitive information, intellectual property and proprietary methods) could be overcome by developing parallel attribution chains, which could then be cross-correlated.³¹\n&gt; **Burden of proof**\nThe burden of proof could be eased by requesting a reasonably suspected entity to plausibly prove their non-involvement in a cyberattack by supplying relevant, tamper-proof and anonymised empirical data about a specific cyber operation.³² (This could be a procedural design solution for implementing the French concept on the “chain of responsibility”.) Alternatively, a ‘virtual control’ test³³ would be suitable to assess the degree of state control exercised over a non-state entity. Accordingly, if it can be demonstrated that a state funded or equipped a non-state entity, then that state should be responsible for the non-state entity’s cyberattack, unless that state rebuts the presumption of responsibility through cooperation in the attribution efforts. In this case, adequate cooperation would shift the burden of attribution back to the attributors and keep the standard for the degree of control at the level of the ‘overall control’ test.\n&gt; **Confidence and severity assessments**\nA cyber attribution mechanism should establish and adhere to a set of standards for assessing the confidence of its attributions. As attribution is a statement with an inherent degree of uncertainty, the confidence level associated with a finding expresses the estimative probability of its certainty, that is to say, how corroborated, plausible, logical and/or comprehensive underlying evidences are.³⁴ In addition to this, a standardised methodology could be used to estimate the magnitude of the severity (potential impact) of cyberattacks by quantifying the (direct and indirect) harms that the victim suffers.\n&gt; **Peer review**\nA cyber attribution mechanism could improve the quality of results and obtain a higher level of validation through an independent peer reviewing process. As a result, peers could approve the assessment, draw alternative assessments or call for further investigations.\n&gt; **Decision-making**\nThe decision-making of a cyber attribution mechanism should be driven by consensus. If an unanimous decision cannot be reached, then majority and minority opinions should be recorded. A cyber attribution mechanism should be narrowly focused on\nattribution. However, in the case that a cyber attribution organisation has member states, then if an attribution ruling finds against a subject, then the case, along with the evidences and their assessments, could be referred to the International Court of Justice or the United Nations General Assembly or Security Council for the purpose of determining legal responsibility and appropriate enforcement actions.\n&gt; Reporting\nAttribution reports should provide a clear and rational explanation for attribution assessments and decisions. It shall also give due consideration to alternative assessments. Technical details should be published for further assessments and broader use in order to facilitate the strengthening of defensive systems.\nCONCLUSIONS\nThere is growing recognition amongst states that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to protect the security, stability, safety and resilience of the Internet and connected devices from cyberattacks. The deterrence of cyberattacks could be achieved by establishing an institutional mechanism capable of credibly identifying the subject(s) responsible for cyberattacks, which would raise the costs of attacking and decrease the costs of defending. Although a cyber attribution mechanism could be designed in multiple ways, it is important to ensure the international legitimacy and/or global recognition of the mechanism by implementing appropriate confidence- and capacity-building institutional solutions.",
  "citations": {
    "style": "author_year",
    "flat_text": "# INSTITUTIONALISING CYBER ATTRIBUTION\nThe escalation of cyberattacks calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions.\nWhile information and communication technologies (ICTs) provide immense opportunities for social and economic development, there are also disturbing trends in the global ICT environment. One of the major threats is the proliferation of cyberattacks. The dramatic increase in the scale and destructive magnitude of cyberattacks implies the assumption that there is an inclination to carry out cyberattacks, because normativisation, compliance, enforcement, trust and cooperation are at relatively low levels. In order to prevent the further escalation of tensions in cyberspace, it would be essential to implement confidence- and capacity-building measures, which would increase deterrent effects and reverse the increasingly offensive doctrines of national cybersecurity strategies. These shifts could be achieved by establishing an internationally legitimised and/or globally recognised cyber(attack) attribution mechanism, which could be institutionalised as an international organisation, a multi-stakeholder or non-governmental transnational organisation or a transnationally coordinated decentralised governance network. In support of this view, this article examines the following questions:\n(1) Why would the establishment of a cyber attribution mechanism be a suitable solution to deter cyberattacks?\n(2) In what circumstances and under what legal framework should a cyber attribution mechanism be deployed?\n(3) How do key political powers construe the necessity to cooperate and/or create new legal mechanisms in order to overcome the challenges posed by cyberattacks and their attribution?\n(4) What are the main steps and considerations of designing institutional solutions for a cyber attribution mechanism?\n# REVERSING CYBERATTACKERS' MOTIVES\nA possible explanation for the ongoing cyber \"arms race\" can be found by extending the \"security dilemma\" to cyber operations. This dilemma models the behaviour of two rival entities (e.g. two states) in a situation in which the entities have a lack of trust in each other. According to the model: if one entity increases its (cyber)security measures, then this will make its rival feel threatened and incited to respond with countermeasures, which could lead to a dangerous escalatory dynamic. These sequence of events are particularly prone to take place within the context of ICTs, where there is a widely held perception that the offensive side has significant advantages over the defensive side.\n|  Current cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 2,2 | 0,3  |\n|   |  Offensive | 3,0 | 1,1  |\nHOW?\n|  Desired cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 3,3 | 1,2  |\n|   |  Offensive | 2,1 | 0,0  |\nTable 1: Game theoretic representation of the cybersecurity dilemma\nIf we look at this problem (and possible solutions) through the lens of non-cooperative game theory, then we can better understand the underlying strategic considerations of two rival entities\n(Table 1). Both entities (and other stakeholders of cyberspace) would benefit from only defending. However, since both entities lack knowledge about what their rival is doing, the payoff for attacking is greater, regardless of what their rival does. The empirical validity of this reasoning has been demonstrated by how some states (such as Australia, the UK, the US and France) have declared that their official policy stances extend beyond an \"active cyber defence system\" to include \"offensive cyber capabilities and operations\". Considering that this trend poses a threat to international peace and global cybersecurity, it is an urgent matter to find a way to reverse (explicit and concealed) offensive motives.\nA possible solution for deterring cyberattacks would be to raise the costs (decrease the payoff) of attacking and lower the costs (increase the payoff) of defending.4 In order to stimulate these shifts, it would be essential to persuade potential attackers that the cost-benefit calculus of attacking is unfavourable. This could be achieved in a twofold way. First, by implementing a formalised set of procedures capable of producing credible (i.e. objective, persuasive and transparent) public evidences and assessments of cyberattacks, attackers would be made more exposed to being held responsible for cyberattacks (and to bear legal consequences which flow therefrom). Secondly, by sharing and/or increasing network security monitoring resources and information, entities which refrain from attacking would be offered technical assistance and legal reassurances.\n# A global cyber attribution mechanism would deter cyberattacks by raising the costs of attacking and lowering the costs of defending.\nThe attainment of the abovementioned objectives calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions. Confidence-building requires the formation of an institutionalised mechanism of coordination and/or cooperation between participating entities. Creating predictable normative expectations in terms of how cyberattacks are attributed would promote common understandings and reduce the risks of mistrust and misperception. On the other hand,\ncapacity-building would be essential to guarantee the effective functioning of a cyber attribution mechanism. This could be achieved by ensuring that the mechanism is equipped with adequate resources, intelligence capabilities, investigative powers and safeguards against external influences.\n# ATTRIBUTION OF CYBERATTACKS\nThe purpose of a cyber attribution mechanism is to identify the subject(s) who shall bear responsibility for a cyberattack (Figure 1). In order to determine the circumstances when a cyber attribution mechanism should be deployed, it is first important to delineate when a malicious cyber operation is to be considered a cyberattack. In this aspect, it is necessary to define the notion of 'cyberattack' and distinguish it from 'cybercrime' and 'cyberwarfare'. Although these are interrelated categories, they have different material scopes and are linked to distinct legal regimes. If it is deemed that a cyberattack took place, then the next step is to identify (attribute) its source by technical means. However, the attribution of a cyberattack to a specific perpetrator (and other parties involved in the attack) can be understood in various ways, because the question of \"who is responsible?\" can be answered in several ways. In case the perpetrator (and other parties involved in the attack) can be identified (with a certain degree of confidence), then the third step is a normative process of establishing and/or invoking responsibility for the violation of law, which, at an international level, entails the international responsibility (of a state) for the breach of an international obligation. However, in case a cyberattack is judged to be the act of a non-state entity, then it is a contentious issue to determine what standard of control and of dependence are required to attribute the act to a particular state.\nFigure 2: Cyber attribution mechanism\n# $\\succ$  Defining 'cyberattack'\nThe terms 'cyberattack', 'cybercrime' and 'cyberwarfare' are frequently used without due consideration to their conceptual meanings. This absence of clarity makes it all the more difficult to design a meaningful legal response. To address this uncertainty, a working definition for 'cyberattack' can be given as follows:\nan act or series of acts, which are perpetrated by a state or non-state entity against the legitimate interests of a (nother) state or the interests of the international community as a whole, to undermine the proper functioning of computer networks or systems for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, or injury including any damage.\nIn contrast to cyberattacks, cybercrimes can be perpetrated only by individuals or non-state entities. While a cyberattack constitutes a breach of an international obligation, a cybercrime is an act which violates domestic, supranational or international criminal law. Cybercrimes have a purpose or effect other than to target the legitimate interests of a (nother) state or the interests of the international community as a whole. Although they are committed by means of a computer system, they do not undermine the proper functioning of computer networks or systems. National laws and international legal instruments usually do not provide a strict definition for cybercrimes, they refer to it rather as a collection of illegal acts. According to their offence object and modus operandi, cybercrimes include not only acts for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, but also computer-related acts for personal or financial gain or harm, as well as computer content-related acts.[6]\nThe prerequisite of a cyberwarfare is that it must constitute a cyberattack, but in addition to satisfying the criteria of a cyberattack, its effects must reach the 'armed attack' threshold under international law (jus ad bellum) or the cyberattack must take place in the context of an international or non-international armed conflict (jus in bello). A state may exercise the right to self-defence and take countermeasures, if they suffer a cyberattack amounting to the level of an armed attack. However, there is legal uncertainty about this threshold in cases when a cyberattack results in severe non-destructive or non-injurious\nconsequences (e.g. it destabilises the financial sector of another state, or undermines its election process or the functioning of any of its institutions). With regard to the overlapping and/or distinct elements of these definitions, one can depict the abstract boundaries of the three terms (Figure 2).\nFigure 2: Logical relations between malicious cyber operations\n# &gt; Attribution in cyberspace\nAttribution entails the problem of minimising uncertainty on all levels without having a uniformly applicable methodology at disposal and where the findings typically appear in shades rather than as a \"black-and-white\" evidence. Attribution is a key component of deterrence, important in strengthening defence against further attacks and a prerequisite to holding the perpetrator of (and other parties involved in) a cyberattack responsible. Cyber attribution carries several meanings, which are conceptually distinct, but often related in practice. The identified subject can be: (a) the computer device(s) from which the cyberattack was carried out; (b) the person(s) who carried out the operation; and (c) the ultimately responsible person, group of persons or state who conducted the cyberattack, or the state which failed to take appropriate measures to prevent a cyberattack emanating from within its territory.\n# $\\succ$  Responsibility for cyberattacks\nIt is undisputed that an internationally wrongful act of a state entails the international responsibility of that state.9 Additionally, it is a general principle of international law that the conduct of a person or group of persons shall be considered an act of a state, if the person or group of persons is in fact acting on the instructions of, or under the direction or control of that state in carrying out the conduct.10\nInternational courts have developed the ‘effective control’¹¹ and ‘overall control’¹² standards to assess the degree of control which must be exercised by a state in order for the conduct to be considered attributable to it. However, these tests require the proof of a relatively high level of state involvement, which seems inadequate in cyberspace due to the technical difficulties of tracing cyberattacks and the ease of controlling them under camouflage. In order to broaden the scope of conducts leading to the determination of control, the UN report of the Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (2015) proposed that “States should not knowingly allow their territory to be used for internationally wrongful acts using ICTs”,¹³ which paraphrases the general principle of the duty of due diligence.¹⁴\n## NATIONAL CYBERSECURITY STRATEGIES\nBefore discussing the possible institutionalisation of cyber attribution, it is useful to be aware of what the stated interests of key political forces are on this matter. In this respect, one may refer to the cybersecurity doctrines set out by the permanent members of the United Nations Security Council:\n- China: The National Cyberspace Security Strategy (2016) states that China “will deepen bilateral and multilateral network security dialogues and information exchanges with countries, effectively manage differences, actively participate in global and regional organisations’ network security cooperation”, with a view to developing a multilateral, democratic and transparent Internet governance system which respects cyberspace sovereignty and adheres to the rule of law.¹⁵\n- France: The launch of the Paris Call for Trust and Security in Cyberspace (2018) by France has received wide support from states and non-state entities. The supporters of the declaration affirm their “willingness to work together, in the existing fora and through the relevant organizations, institutions, mechanisms and processes to assist one another and implement cooperative measures, notably in order to: [p]revent and recover from malicious cyber activities that threaten or cause significant, indiscriminate or systemic harm to individuals and critical infrastructure”.¹⁶ On the national level, the Strategic Review of Cyber Defence (2017) proclaims that the principle of\nsovereignty applies to cyberspace, hence France may invoke state responsibility by claiming a breach of the due diligence duty.¹⁷ The doctrine states that “France must in particular work to reach an agreement at the international level on the obligations faced by a State whose infrastructure would be used for malicious purposes.”¹⁸ In relation to this, the document proposes the “establishment of a «chain of responsibility» allowing the victim State to benefit from the assistance of those States through which the attack passes.”¹⁹\n- Russia: The Doctrine of Information Security (2016) expresses Russia’s strategic objectives of “taking part in establishing an international information security system capable of effectively countering the use of information technologies for military and political purposes that are contrary to international law, or for terrorist, extremist, criminal or other illegal purposes” and “creating international legal mechanisms taking into account the specific nature of information technologies and intended to prevent and settle conflicts between States in information space”.²⁰\n- United Kingdom: The National Cyber Strategy (2016-2021) states that the UK “will seek to influence the decision-making of those engaging in [.] disruptive or destructive cyber activity and continue to build frameworks to support international cooperation.”²¹ It will “attribute specific cyber identities publicly”, when it is judged “in the national interest to do so.”²²\n- United States: The National Cyber Strategy (2018) sets out the plan of launching a Cyber Deterrence Initiative “to work with like-minded states to coordinate and support each other’s responses to significant malicious cyber incidents, including through intelligence sharing, buttressing of attribution claims, public statements of support for responsive actions taken, and joint imposition of consequences against malign actors.”²³\nAlthough attribution remains a sovereign political decision, there is a tendency reflected in state practice and opinio juris to support international coordination and/or cooperation for the purpose of preventing and responding to cyberattacks. There is growing recognition that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to address cyberspace vulnerabilities and the ‘attribution problem’.\n\n# INSTITUTIONAL DESIGN CHOICES\nThe escalation of cyberattacks, along with the reluctance of states to make attribution claims, and the risk of politicisation when they do, has intensified demand for a politically neutral and fact-based analysis of cyberattacks. This has been articulated by various proposals on the issue.[24] By building on and advancing these models, this article provides a step-by-step approach to highlight the main decisions and considerations that would need to be made and taken into account in the course of designing a cyber attribution mechanism (Figure 3).\n# $\\succ$  Constitutive act or agreement\nThe creation of a cyber attribution mechanism requires the drafting of a constitutive act or agreement by a founding body or members in order to stipulate the rules governing the functioning of the mechanism. This requires the formation of a working group (within or outside the scope of an international or transnational organisation) to which participants could be delegated by states and/or non-state entities (i.e. from the private sector, the Internet technical community, academia and/or the civil society). Considering that negotiations between states could drag on for a long time, non-state entities should play an active role in building an alliance which promotes efforts to institutionalise cyber attribution. If there are\ndifficulties in reaching a wide consensus on a prompt solution, then parties to the negotiations might consider adopting a phased approach, whereby by ad hoc groupings of states and/or non-state entities could conduct joint investigations of major cyberattacks.[25] Testing various cooperative and/or collaborative arrangements could help build trust and identify ways to create a more formalised cyber attribution mechanism over time.\n# $\\succ$  Legal status and composition\nA cyber attribution mechanism could be institutionalised in a number of ways (Figure 4). An intergovernmental proposal could initiate the establishment of an international organisation by treaty or other instrument governed by international law. This organisation could function autonomously, but may have its relationship to the United Nations fixed by a special agreement, in a similar way to the IAEA or the Organisation for the Prohibition of Chemical Weapons (OPCW). Modelling a cyber attribution organisation on the basis of the OPCW is particularly worthy of consideration, as the OPCW was granted legal mandate in 2018 to \"provide technical expertise to identify those who were perpetrators, organisers, sponsors or otherwise involved in the use of chemicals as weapons\", \"with a view to facilitating universal attribution of all chemical weapons attacks\".[26]\nFigure 4: Possible ways of institutionalising a cyber attribution mechanism\nAlternatively, non-state entities could form an alliance to establish a transnational organisation or a transnationally coordinated decentralised network (with or without the involvement of states). The former would need to be incorporated under domestic private law (practically, of a neutral country), while the latter would need to be based on a contractual agreement between participants. In both cases, non-state members could include entities, which can demonstrate considerable presence in the global cybersecurity market and/or significant technical forensics capabilities and/or other capabilities to oversee the proper functioning of international or national telecommunications networks. Membership could have multiple tiers/categories and may be tied to the sponsorship of a predefined number of other members, similarly to how the membership of FIRST, the leading international confederation of computer incident response teams, is organised.\n## Principles of functioning\nThe international legitimacy and/or global recognition of a cyber attribution mechanism would depend largely on its credibility. To achieve this, the mechanism would need to be guided by the following principles: rules-based functioning, autonomy, impartiality, objectivity, inclusivity, technical competency, narrow focus, consensus-driven and transparency. Any investigations must be carried out with due observance of the sovereign rights of states. However, the mechanism cannot be subject to any external influence incompatible with the purpose of drawing credible attributions. If neutrality cannot be ensured, then a diverse range of competing interests should be represented.\n## Structure\nAn international or transnational cyber attribution organisation would require the establishment of organs. The organisation could include, for example, a general conference (consisting of representatives of members), an executive body (board of governors) and a technical secretariat (professional and general service staff), which would encompass investigative teams. The organisation could ensure internal accountability by developing a separate organ or procedure for the purpose of conducting independent peer reviews. Additionally, the establishment of a legal committee could ensure that national laws and international law are respected during investigations.\nIn the case of a transnationally coordinated decentralised governance network, participants could establish a permanently functioning consultative forum to coordinate their attribution efforts. Although a decentralised but coordinated system would constitute a less formalised mechanism, it may prompt faster attributions (thus, earlier opportunities to improve defence systems). The multiplicity of attributors would foster ad hoc peer reviewing, where participants have incentives to confirm or debunk other attributions (and thereby enhance or undermine the credibility of an attribution).[27]\n## Resources\nA cyber attribution mechanism must have the technical expertise, intelligence capabilities, financial means and other resources to enable it to fulfill its purpose. These resources would need to come primarily from the contribution of members. Since most states do not possess sufficient resources to\nconduct their own attribution investigations, they might be willing to support common efforts due to the operational benefits they can gain by sharing costs. The challenge of convincing competitors to collaborate could be solved by adopting a formalised information sharing system with privacy and data protection assurances.²⁸ The paramount consideration in the employment and the conditions of service should be the objective of securing the highest standards of competence, integrity and efficiency, while reflecting the principle of equitable geographical distribution.\n&gt; **Admissibility criteria**\nConsidering that a cyber attribution mechanism has limited capacities, there should be a set of criteria which determines: who can initiate proceedings and whether a cyberattack is significant enough to merit investigation. As regards the first condition, it seems reasonable to give the right to initiate proceedings to those who have been directly or indirectly affected by the alleged cyberattack. Granting the victim the exclusive right of initiation preserves the victim's privacy, autonomy and ability to determine whether and when to seek an attribution investigation.²⁹ As regards the second condition, the scale and effects of the alleged cyberattack must reach a sufficiently high threshold. This threshold could be determined based on the evidences collected about the intensity, damages, directness, invasiveness, immediacy, military character, offence object and modus operandi of the cyberattack.\n&gt; **Investigations**\nA cyber attribution mechanism should clearly define and publish the framework based on which evidence shall be collected and assessed.³⁰ In the case of international or transnational cyber attribution organisations, the organisations should have the powers to access and/or request information from members and other entities. There should also be a process to collect and protect voluntarily shared information from third parties. As regards a transnationally coordinated decentralised governance network, the challenges posed by coordinating the investigations of multiple attributors (i.e. primarily, the protection of sensitive information, intellectual property and proprietary methods) could be overcome by developing parallel attribution chains, which could then be cross-correlated.³¹\n&gt; **Burden of proof**\nThe burden of proof could be eased by requesting a reasonably suspected entity to plausibly prove their non-involvement in a cyberattack by supplying relevant, tamper-proof and anonymised empirical data about a specific cyber operation.³² (This could be a procedural design solution for implementing the French concept on the “chain of responsibility”.) Alternatively, a ‘virtual control’ test³³ would be suitable to assess the degree of state control exercised over a non-state entity. Accordingly, if it can be demonstrated that a state funded or equipped a non-state entity, then that state should be responsible for the non-state entity’s cyberattack, unless that state rebuts the presumption of responsibility through cooperation in the attribution efforts. In this case, adequate cooperation would shift the burden of attribution back to the attributors and keep the standard for the degree of control at the level of the ‘overall control’ test.\n&gt; **Confidence and severity assessments**\nA cyber attribution mechanism should establish and adhere to a set of standards for assessing the confidence of its attributions. As attribution is a statement with an inherent degree of uncertainty, the confidence level associated with a finding expresses the estimative probability of its certainty, that is to say, how corroborated, plausible, logical and/or comprehensive underlying evidences are.³⁴ In addition to this, a standardised methodology could be used to estimate the magnitude of the severity (potential impact) of cyberattacks by quantifying the (direct and indirect) harms that the victim suffers.\n&gt; **Peer review**\nA cyber attribution mechanism could improve the quality of results and obtain a higher level of validation through an independent peer reviewing process. As a result, peers could approve the assessment, draw alternative assessments or call for further investigations.\n&gt; **Decision-making**\nThe decision-making of a cyber attribution mechanism should be driven by consensus. If an unanimous decision cannot be reached, then majority and minority opinions should be recorded. A cyber attribution mechanism should be narrowly focused on\nattribution. However, in the case that a cyber attribution organisation has member states, then if an attribution ruling finds against a subject, then the case, along with the evidences and their assessments, could be referred to the International Court of Justice or the United Nations General Assembly or Security Council for the purpose of determining legal responsibility and appropriate enforcement actions.\n&gt; Reporting\nAttribution reports should provide a clear and rational explanation for attribution assessments and decisions. It shall also give due consideration to alternative assessments. Technical details should be published for further assessments and broader use in order to facilitate the strengthening of defensive systems.\nCONCLUSIONS\nThere is growing recognition amongst states that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to protect the security, stability, safety and resilience of the Internet and connected devices from cyberattacks. The deterrence of cyberattacks could be achieved by establishing an institutional mechanism capable of credibly identifying the subject(s) responsible for cyberattacks, which would raise the costs of attacking and decrease the costs of defending. Although a cyber attribution mechanism could be designed in multiple ways, it is important to ensure the international legitimacy and/or global recognition of the mechanism by implementing appropriate confidence- and capacity-building institutional solutions.",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 9,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 17,
        "missing_intext_indices": [
          2,
          5,
          7,
          8,
          11,
          12,
          13,
          14,
          15,
          16,
          17,
          18,
          19,
          20,
          21,
          22,
          23
        ],
        "highest_intext_index": 25,
        "missing_footnotes_for_seen_total": 8,
        "missing_footnotes_for_seen_intext": [
          1,
          3,
          4,
          6,
          9,
          10,
          24,
          25
        ],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "hybrid"
      },
      "results": [
        {
          "index": "6",
          "intext_citation": "acts.[6]",
          "preceding_text": "ct and modus operandi, cybercrimes include not only acts for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, but also computer-related acts for personal or financial gain or harm, as well as computer content-related",
          "footnote": null
        },
        {
          "index": "24",
          "intext_citation": "issue.[24]",
          "preceding_text": "This has been articulated by various proposals on the",
          "footnote": null
        },
        {
          "index": "25",
          "intext_citation": "cyberattacks.[25]",
          "preceding_text": "If there are difficulties in reaching a wide consensus on a prompt solution, then parties to the negotiations might consider adopting a phased approach, whereby by ad hoc groupings of states and/or non-state entities could conduct joint investigations of major",
          "footnote": null
        },
        {
          "index": "4",
          "intext_citation": "defending.4",
          "preceding_text": "A possible solution for deterring cyberattacks would be to raise the costs (decrease the payoff) of attacking and lower the costs (increase the payoff) of",
          "footnote": null
        },
        {
          "index": "9",
          "intext_citation": "state.9",
          "preceding_text": "# $\\succ$ Responsibility for cyberattacks It is undisputed that an internationally wrongful act of a state entails the international responsibility of that",
          "footnote": null
        },
        {
          "index": "10",
          "intext_citation": "conduct.10",
          "preceding_text": ", it is a general principle of international law that the conduct of a person or group of persons shall be considered an act of a state, if the person or group of persons is in fact acting on the instructions of, or under the direction or control of that state in carrying out the",
          "footnote": null
        },
        {
          "index": "4",
          "intext_citation": "CN.4",
          "preceding_text": "9 International Law Commission (2001): Yearbook of the International Law Commission, Volume II, Part Two: Report of the Commission to the General Assembly on the work of its fifty-third session (A/",
          "footnote": null
        },
        {
          "index": "1",
          "intext_citation": "Add.1",
          "preceding_text": "9 International Law Commission (2001): Yearbook of the International Law Commission, Volume II, Part Two: Report of the Commission to the General Assembly on the work of its fifty-third session (A/CN.4/SER.A/2001/",
          "footnote": null
        },
        {
          "index": "3",
          "intext_citation": "DEC.3",
          "preceding_text": "26 Organisation for the Prohibition of Chemical Weapons, Fourth Special Session (C-SS-4/",
          "footnote": null
        }
      ],
      "flat_text": "# INSTITUTIONALISING CYBER ATTRIBUTION\nThe escalation of cyberattacks calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions.\nWhile information and communication technologies (ICTs) provide immense opportunities for social and economic development, there are also disturbing trends in the global ICT environment. One of the major threats is the proliferation of cyberattacks. The dramatic increase in the scale and destructive magnitude of cyberattacks implies the assumption that there is an inclination to carry out cyberattacks, because normativisation, compliance, enforcement, trust and cooperation are at relatively low levels. In order to prevent the further escalation of tensions in cyberspace, it would be essential to implement confidence- and capacity-building measures, which would increase deterrent effects and reverse the increasingly offensive doctrines of national cybersecurity strategies. These shifts could be achieved by establishing an internationally legitimised and/or globally recognised cyber(attack) attribution mechanism, which could be institutionalised as an international organisation, a multi-stakeholder or non-governmental transnational organisation or a transnationally coordinated decentralised governance network. In support of this view, this article examines the following questions:\n(1) Why would the establishment of a cyber attribution mechanism be a suitable solution to deter cyberattacks?\n(2) In what circumstances and under what legal framework should a cyber attribution mechanism be deployed?\n(3) How do key political powers construe the necessity to cooperate and/or create new legal mechanisms in order to overcome the challenges posed by cyberattacks and their attribution?\n(4) What are the main steps and considerations of designing institutional solutions for a cyber attribution mechanism?\n# REVERSING CYBERATTACKERS' MOTIVES\nA possible explanation for the ongoing cyber \"arms race\" can be found by extending the \"security dilemma\" to cyber operations. This dilemma models the behaviour of two rival entities (e.g. two states) in a situation in which the entities have a lack of trust in each other. According to the model: if one entity increases its (cyber)security measures, then this will make its rival feel threatened and incited to respond with countermeasures, which could lead to a dangerous escalatory dynamic. These sequence of events are particularly prone to take place within the context of ICTs, where there is a widely held perception that the offensive side has significant advantages over the defensive side.\n|  Current cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 2,2 | 0,3  |\n|   |  Offensive | 3,0 | 1,1  |\nHOW?\n|  Desired cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 3,3 | 1,2  |\n|   |  Offensive | 2,1 | 0,0  |\nTable 1: Game theoretic representation of the cybersecurity dilemma\nIf we look at this problem (and possible solutions) through the lens of non-cooperative game theory, then we can better understand the underlying strategic considerations of two rival entities\n(Table 1). Both entities (and other stakeholders of cyberspace) would benefit from only defending. However, since both entities lack knowledge about what their rival is doing, the payoff for attacking is greater, regardless of what their rival does. The empirical validity of this reasoning has been demonstrated by how some states (such as Australia, the UK, the US and France) have declared that their official policy stances extend beyond an \"active cyber defence system\" to include \"offensive cyber capabilities and operations\". Considering that this trend poses a threat to international peace and global cybersecurity, it is an urgent matter to find a way to reverse (explicit and concealed) offensive motives.\nA possible solution for deterring cyberattacks would be to raise the costs (decrease the payoff) of attacking and lower the costs (increase the payoff) of defending.4 In order to stimulate these shifts, it would be essential to persuade potential attackers that the cost-benefit calculus of attacking is unfavourable. This could be achieved in a twofold way. First, by implementing a formalised set of procedures capable of producing credible (i.e. objective, persuasive and transparent) public evidences and assessments of cyberattacks, attackers would be made more exposed to being held responsible for cyberattacks (and to bear legal consequences which flow therefrom). Secondly, by sharing and/or increasing network security monitoring resources and information, entities which refrain from attacking would be offered technical assistance and legal reassurances.\n# A global cyber attribution mechanism would deter cyberattacks by raising the costs of attacking and lowering the costs of defending.\nThe attainment of the abovementioned objectives calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions. Confidence-building requires the formation of an institutionalised mechanism of coordination and/or cooperation between participating entities. Creating predictable normative expectations in terms of how cyberattacks are attributed would promote common understandings and reduce the risks of mistrust and misperception. On the other hand,\ncapacity-building would be essential to guarantee the effective functioning of a cyber attribution mechanism. This could be achieved by ensuring that the mechanism is equipped with adequate resources, intelligence capabilities, investigative powers and safeguards against external influences.\n# ATTRIBUTION OF CYBERATTACKS\nThe purpose of a cyber attribution mechanism is to identify the subject(s) who shall bear responsibility for a cyberattack (Figure 1). In order to determine the circumstances when a cyber attribution mechanism should be deployed, it is first important to delineate when a malicious cyber operation is to be considered a cyberattack. In this aspect, it is necessary to define the notion of 'cyberattack' and distinguish it from 'cybercrime' and 'cyberwarfare'. Although these are interrelated categories, they have different material scopes and are linked to distinct legal regimes. If it is deemed that a cyberattack took place, then the next step is to identify (attribute) its source by technical means. However, the attribution of a cyberattack to a specific perpetrator (and other parties involved in the attack) can be understood in various ways, because the question of \"who is responsible?\" can be answered in several ways. In case the perpetrator (and other parties involved in the attack) can be identified (with a certain degree of confidence), then the third step is a normative process of establishing and/or invoking responsibility for the violation of law, which, at an international level, entails the international responsibility (of a state) for the breach of an international obligation. However, in case a cyberattack is judged to be the act of a non-state entity, then it is a contentious issue to determine what standard of control and of dependence are required to attribute the act to a particular state.\nFigure 2: Cyber attribution mechanism\n# $\\succ$  Defining 'cyberattack'\nThe terms 'cyberattack', 'cybercrime' and 'cyberwarfare' are frequently used without due consideration to their conceptual meanings. This absence of clarity makes it all the more difficult to design a meaningful legal response. To address this uncertainty, a working definition for 'cyberattack' can be given as follows:\nan act or series of acts, which are perpetrated by a state or non-state entity against the legitimate interests of a (nother) state or the interests of the international community as a whole, to undermine the proper functioning of computer networks or systems for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, or injury including any damage.\nIn contrast to cyberattacks, cybercrimes can be perpetrated only by individuals or non-state entities. While a cyberattack constitutes a breach of an international obligation, a cybercrime is an act which violates domestic, supranational or international criminal law. Cybercrimes have a purpose or effect other than to target the legitimate interests of a (nother) state or the interests of the international community as a whole. Although they are committed by means of a computer system, they do not undermine the proper functioning of computer networks or systems. National laws and international legal instruments usually do not provide a strict definition for cybercrimes, they refer to it rather as a collection of illegal acts. According to their offence object and modus operandi, cybercrimes include not only acts for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, but also computer-related acts for personal or financial gain or harm, as well as computer content-related acts.[6]\nThe prerequisite of a cyberwarfare is that it must constitute a cyberattack, but in addition to satisfying the criteria of a cyberattack, its effects must reach the 'armed attack' threshold under international law (jus ad bellum) or the cyberattack must take place in the context of an international or non-international armed conflict (jus in bello). A state may exercise the right to self-defence and take countermeasures, if they suffer a cyberattack amounting to the level of an armed attack. However, there is legal uncertainty about this threshold in cases when a cyberattack results in severe non-destructive or non-injurious\nconsequences (e.g. it destabilises the financial sector of another state, or undermines its election process or the functioning of any of its institutions). With regard to the overlapping and/or distinct elements of these definitions, one can depict the abstract boundaries of the three terms (Figure 2).\nFigure 2: Logical relations between malicious cyber operations\n# &gt; Attribution in cyberspace\nAttribution entails the problem of minimising uncertainty on all levels without having a uniformly applicable methodology at disposal and where the findings typically appear in shades rather than as a \"black-and-white\" evidence. Attribution is a key component of deterrence, important in strengthening defence against further attacks and a prerequisite to holding the perpetrator of (and other parties involved in) a cyberattack responsible. Cyber attribution carries several meanings, which are conceptually distinct, but often related in practice. The identified subject can be: (a) the computer device(s) from which the cyberattack was carried out; (b) the person(s) who carried out the operation; and (c) the ultimately responsible person, group of persons or state who conducted the cyberattack, or the state which failed to take appropriate measures to prevent a cyberattack emanating from within its territory.\n# $\\succ$  Responsibility for cyberattacks\nIt is undisputed that an internationally wrongful act of a state entails the international responsibility of that state.9 Additionally, it is a general principle of international law that the conduct of a person or group of persons shall be considered an act of a state, if the person or group of persons is in fact acting on the instructions of, or under the direction or control of that state in carrying out the conduct.10\nInternational courts have developed the ‘effective control’¹¹ and ‘overall control’¹² standards to assess the degree of control which must be exercised by a state in order for the conduct to be considered attributable to it. However, these tests require the proof of a relatively high level of state involvement, which seems inadequate in cyberspace due to the technical difficulties of tracing cyberattacks and the ease of controlling them under camouflage. In order to broaden the scope of conducts leading to the determination of control, the UN report of the Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (2015) proposed that “States should not knowingly allow their territory to be used for internationally wrongful acts using ICTs”,¹³ which paraphrases the general principle of the duty of due diligence.¹⁴\n## NATIONAL CYBERSECURITY STRATEGIES\nBefore discussing the possible institutionalisation of cyber attribution, it is useful to be aware of what the stated interests of key political forces are on this matter. In this respect, one may refer to the cybersecurity doctrines set out by the permanent members of the United Nations Security Council:\n- China: The National Cyberspace Security Strategy (2016) states that China “will deepen bilateral and multilateral network security dialogues and information exchanges with countries, effectively manage differences, actively participate in global and regional organisations’ network security cooperation”, with a view to developing a multilateral, democratic and transparent Internet governance system which respects cyberspace sovereignty and adheres to the rule of law.¹⁵\n- France: The launch of the Paris Call for Trust and Security in Cyberspace (2018) by France has received wide support from states and non-state entities. The supporters of the declaration affirm their “willingness to work together, in the existing fora and through the relevant organizations, institutions, mechanisms and processes to assist one another and implement cooperative measures, notably in order to: [p]revent and recover from malicious cyber activities that threaten or cause significant, indiscriminate or systemic harm to individuals and critical infrastructure”.¹⁶ On the national level, the Strategic Review of Cyber Defence (2017) proclaims that the principle of\nsovereignty applies to cyberspace, hence France may invoke state responsibility by claiming a breach of the due diligence duty.¹⁷ The doctrine states that “France must in particular work to reach an agreement at the international level on the obligations faced by a State whose infrastructure would be used for malicious purposes.”¹⁸ In relation to this, the document proposes the “establishment of a «chain of responsibility» allowing the victim State to benefit from the assistance of those States through which the attack passes.”¹⁹\n- Russia: The Doctrine of Information Security (2016) expresses Russia’s strategic objectives of “taking part in establishing an international information security system capable of effectively countering the use of information technologies for military and political purposes that are contrary to international law, or for terrorist, extremist, criminal or other illegal purposes” and “creating international legal mechanisms taking into account the specific nature of information technologies and intended to prevent and settle conflicts between States in information space”.²⁰\n- United Kingdom: The National Cyber Strategy (2016-2021) states that the UK “will seek to influence the decision-making of those engaging in [.] disruptive or destructive cyber activity and continue to build frameworks to support international cooperation.”²¹ It will “attribute specific cyber identities publicly”, when it is judged “in the national interest to do so.”²²\n- United States: The National Cyber Strategy (2018) sets out the plan of launching a Cyber Deterrence Initiative “to work with like-minded states to coordinate and support each other’s responses to significant malicious cyber incidents, including through intelligence sharing, buttressing of attribution claims, public statements of support for responsive actions taken, and joint imposition of consequences against malign actors.”²³\nAlthough attribution remains a sovereign political decision, there is a tendency reflected in state practice and opinio juris to support international coordination and/or cooperation for the purpose of preventing and responding to cyberattacks. There is growing recognition that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to address cyberspace vulnerabilities and the ‘attribution problem’.\n\n# INSTITUTIONAL DESIGN CHOICES\nThe escalation of cyberattacks, along with the reluctance of states to make attribution claims, and the risk of politicisation when they do, has intensified demand for a politically neutral and fact-based analysis of cyberattacks. This has been articulated by various proposals on the issue.[24] By building on and advancing these models, this article provides a step-by-step approach to highlight the main decisions and considerations that would need to be made and taken into account in the course of designing a cyber attribution mechanism (Figure 3).\n# $\\succ$  Constitutive act or agreement\nThe creation of a cyber attribution mechanism requires the drafting of a constitutive act or agreement by a founding body or members in order to stipulate the rules governing the functioning of the mechanism. This requires the formation of a working group (within or outside the scope of an international or transnational organisation) to which participants could be delegated by states and/or non-state entities (i.e. from the private sector, the Internet technical community, academia and/or the civil society). Considering that negotiations between states could drag on for a long time, non-state entities should play an active role in building an alliance which promotes efforts to institutionalise cyber attribution. If there are\ndifficulties in reaching a wide consensus on a prompt solution, then parties to the negotiations might consider adopting a phased approach, whereby by ad hoc groupings of states and/or non-state entities could conduct joint investigations of major cyberattacks.[25] Testing various cooperative and/or collaborative arrangements could help build trust and identify ways to create a more formalised cyber attribution mechanism over time.\n# $\\succ$  Legal status and composition\nA cyber attribution mechanism could be institutionalised in a number of ways (Figure 4). An intergovernmental proposal could initiate the establishment of an international organisation by treaty or other instrument governed by international law. This organisation could function autonomously, but may have its relationship to the United Nations fixed by a special agreement, in a similar way to the IAEA or the Organisation for the Prohibition of Chemical Weapons (OPCW). Modelling a cyber attribution organisation on the basis of the OPCW is particularly worthy of consideration, as the OPCW was granted legal mandate in 2018 to \"provide technical expertise to identify those who were perpetrators, organisers, sponsors or otherwise involved in the use of chemicals as weapons\", \"with a view to facilitating universal attribution of all chemical weapons attacks\".[26]\nFigure 4: Possible ways of institutionalising a cyber attribution mechanism\nAlternatively, non-state entities could form an alliance to establish a transnational organisation or a transnationally coordinated decentralised network (with or without the involvement of states). The former would need to be incorporated under domestic private law (practically, of a neutral country), while the latter would need to be based on a contractual agreement between participants. In both cases, non-state members could include entities, which can demonstrate considerable presence in the global cybersecurity market and/or significant technical forensics capabilities and/or other capabilities to oversee the proper functioning of international or national telecommunications networks. Membership could have multiple tiers/categories and may be tied to the sponsorship of a predefined number of other members, similarly to how the membership of FIRST, the leading international confederation of computer incident response teams, is organised.\n## Principles of functioning\nThe international legitimacy and/or global recognition of a cyber attribution mechanism would depend largely on its credibility. To achieve this, the mechanism would need to be guided by the following principles: rules-based functioning, autonomy, impartiality, objectivity, inclusivity, technical competency, narrow focus, consensus-driven and transparency. Any investigations must be carried out with due observance of the sovereign rights of states. However, the mechanism cannot be subject to any external influence incompatible with the purpose of drawing credible attributions. If neutrality cannot be ensured, then a diverse range of competing interests should be represented.\n## Structure\nAn international or transnational cyber attribution organisation would require the establishment of organs. The organisation could include, for example, a general conference (consisting of representatives of members), an executive body (board of governors) and a technical secretariat (professional and general service staff), which would encompass investigative teams. The organisation could ensure internal accountability by developing a separate organ or procedure for the purpose of conducting independent peer reviews. Additionally, the establishment of a legal committee could ensure that national laws and international law are respected during investigations.\nIn the case of a transnationally coordinated decentralised governance network, participants could establish a permanently functioning consultative forum to coordinate their attribution efforts. Although a decentralised but coordinated system would constitute a less formalised mechanism, it may prompt faster attributions (thus, earlier opportunities to improve defence systems). The multiplicity of attributors would foster ad hoc peer reviewing, where participants have incentives to confirm or debunk other attributions (and thereby enhance or undermine the credibility of an attribution).[27]\n## Resources\nA cyber attribution mechanism must have the technical expertise, intelligence capabilities, financial means and other resources to enable it to fulfill its purpose. These resources would need to come primarily from the contribution of members. Since most states do not possess sufficient resources to\nconduct their own attribution investigations, they might be willing to support common efforts due to the operational benefits they can gain by sharing costs. The challenge of convincing competitors to collaborate could be solved by adopting a formalised information sharing system with privacy and data protection assurances.²⁸ The paramount consideration in the employment and the conditions of service should be the objective of securing the highest standards of competence, integrity and efficiency, while reflecting the principle of equitable geographical distribution.\n&gt; **Admissibility criteria**\nConsidering that a cyber attribution mechanism has limited capacities, there should be a set of criteria which determines: who can initiate proceedings and whether a cyberattack is significant enough to merit investigation. As regards the first condition, it seems reasonable to give the right to initiate proceedings to those who have been directly or indirectly affected by the alleged cyberattack. Granting the victim the exclusive right of initiation preserves the victim's privacy, autonomy and ability to determine whether and when to seek an attribution investigation.²⁹ As regards the second condition, the scale and effects of the alleged cyberattack must reach a sufficiently high threshold. This threshold could be determined based on the evidences collected about the intensity, damages, directness, invasiveness, immediacy, military character, offence object and modus operandi of the cyberattack.\n&gt; **Investigations**\nA cyber attribution mechanism should clearly define and publish the framework based on which evidence shall be collected and assessed.³⁰ In the case of international or transnational cyber attribution organisations, the organisations should have the powers to access and/or request information from members and other entities. There should also be a process to collect and protect voluntarily shared information from third parties. As regards a transnationally coordinated decentralised governance network, the challenges posed by coordinating the investigations of multiple attributors (i.e. primarily, the protection of sensitive information, intellectual property and proprietary methods) could be overcome by developing parallel attribution chains, which could then be cross-correlated.³¹\n&gt; **Burden of proof**\nThe burden of proof could be eased by requesting a reasonably suspected entity to plausibly prove their non-involvement in a cyberattack by supplying relevant, tamper-proof and anonymised empirical data about a specific cyber operation.³² (This could be a procedural design solution for implementing the French concept on the “chain of responsibility”.) Alternatively, a ‘virtual control’ test³³ would be suitable to assess the degree of state control exercised over a non-state entity. Accordingly, if it can be demonstrated that a state funded or equipped a non-state entity, then that state should be responsible for the non-state entity’s cyberattack, unless that state rebuts the presumption of responsibility through cooperation in the attribution efforts. In this case, adequate cooperation would shift the burden of attribution back to the attributors and keep the standard for the degree of control at the level of the ‘overall control’ test.\n&gt; **Confidence and severity assessments**\nA cyber attribution mechanism should establish and adhere to a set of standards for assessing the confidence of its attributions. As attribution is a statement with an inherent degree of uncertainty, the confidence level associated with a finding expresses the estimative probability of its certainty, that is to say, how corroborated, plausible, logical and/or comprehensive underlying evidences are.³⁴ In addition to this, a standardised methodology could be used to estimate the magnitude of the severity (potential impact) of cyberattacks by quantifying the (direct and indirect) harms that the victim suffers.\n&gt; **Peer review**\nA cyber attribution mechanism could improve the quality of results and obtain a higher level of validation through an independent peer reviewing process. As a result, peers could approve the assessment, draw alternative assessments or call for further investigations.\n&gt; **Decision-making**\nThe decision-making of a cyber attribution mechanism should be driven by consensus. If an unanimous decision cannot be reached, then majority and minority opinions should be recorded. A cyber attribution mechanism should be narrowly focused on\nattribution. However, in the case that a cyber attribution organisation has member states, then if an attribution ruling finds against a subject, then the case, along with the evidences and their assessments, could be referred to the International Court of Justice or the United Nations General Assembly or Security Council for the purpose of determining legal responsibility and appropriate enforcement actions.\n&gt; Reporting\nAttribution reports should provide a clear and rational explanation for attribution assessments and decisions. It shall also give due consideration to alternative assessments. Technical details should be published for further assessments and broader use in order to facilitate the strengthening of defensive systems.\nCONCLUSIONS\nThere is growing recognition amongst states that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to protect the security, stability, safety and resilience of the Internet and connected devices from cyberattacks. The deterrence of cyberattacks could be achieved by establishing an institutional mechanism capable of credibly identifying the subject(s) responsible for cyberattacks, which would raise the costs of attacking and decrease the costs of defending. Although a cyber attribution mechanism could be designed in multiple ways, it is important to ensure the international legitimacy and/or global recognition of the mechanism by implementing appropriate confidence- and capacity-building institutional solutions."
    },
    "numeric": {
      "total": {
        "intext_total": 5,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [
        {
          "index": "6",
          "intext_citation": "[6]",
          "preceding_text": "urpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, but also computer-related acts for personal or financial gain or harm, as well as computer content-related acts.",
          "footnote": null
        },
        {
          "index": "24",
          "intext_citation": "[24]",
          "preceding_text": "This has been articulated by various proposals on the issue.",
          "footnote": null
        },
        {
          "index": "25",
          "intext_citation": "[25]",
          "preceding_text": "on a prompt solution, then parties to the negotiations might consider adopting a phased approach, whereby by ad hoc groupings of states and/or non-state entities could conduct joint investigations of major cyberattacks.",
          "footnote": null
        },
        {
          "index": "26",
          "intext_citation": "[26]",
          "preceding_text": "ical expertise to identify those who were perpetrators, organisers, sponsors or otherwise involved in the use of chemicals as weapons\", \"with a view to facilitating universal attribution of all chemical weapons attacks\".",
          "footnote": null
        },
        {
          "index": "27",
          "intext_citation": "[27]",
          "preceding_text": "stems). The multiplicity of attributors would foster ad hoc peer reviewing, where participants have incentives to confirm or debunk other attributions (and thereby enhance or undermine the credibility of an attribution).",
          "footnote": null
        }
      ],
      "flat_text": "# INSTITUTIONALISING CYBER ATTRIBUTION\nThe escalation of cyberattacks calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions.\nWhile information and communication technologies (ICTs) provide immense opportunities for social and economic development, there are also disturbing trends in the global ICT environment. One of the major threats is the proliferation of cyberattacks. The dramatic increase in the scale and destructive magnitude of cyberattacks implies the assumption that there is an inclination to carry out cyberattacks, because normativisation, compliance, enforcement, trust and cooperation are at relatively low levels. In order to prevent the further escalation of tensions in cyberspace, it would be essential to implement confidence- and capacity-building measures, which would increase deterrent effects and reverse the increasingly offensive doctrines of national cybersecurity strategies. These shifts could be achieved by establishing an internationally legitimised and/or globally recognised cyber(attack) attribution mechanism, which could be institutionalised as an international organisation, a multi-stakeholder or non-governmental transnational organisation or a transnationally coordinated decentralised governance network. In support of this view, this article examines the following questions:\n(1) Why would the establishment of a cyber attribution mechanism be a suitable solution to deter cyberattacks?\n(2) In what circumstances and under what legal framework should a cyber attribution mechanism be deployed?\n(3) How do key political powers construe the necessity to cooperate and/or create new legal mechanisms in order to overcome the challenges posed by cyberattacks and their attribution?\n(4) What are the main steps and considerations of designing institutional solutions for a cyber attribution mechanism?\n# REVERSING CYBERATTACKERS' MOTIVES\nA possible explanation for the ongoing cyber \"arms race\" can be found by extending the \"security dilemma\" to cyber operations. This dilemma models the behaviour of two rival entities (e.g. two states) in a situation in which the entities have a lack of trust in each other. According to the model: if one entity increases its (cyber)security measures, then this will make its rival feel threatened and incited to respond with countermeasures, which could lead to a dangerous escalatory dynamic. These sequence of events are particularly prone to take place within the context of ICTs, where there is a widely held perception that the offensive side has significant advantages over the defensive side.\n|  Current cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 2,2 | 0,3  |\n|   |  Offensive | 3,0 | 1,1  |\nHOW?\n|  Desired cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 3,3 | 1,2  |\n|   |  Offensive | 2,1 | 0,0  |\nTable 1: Game theoretic representation of the cybersecurity dilemma\nIf we look at this problem (and possible solutions) through the lens of non-cooperative game theory, then we can better understand the underlying strategic considerations of two rival entities\n(Table 1). Both entities (and other stakeholders of cyberspace) would benefit from only defending. However, since both entities lack knowledge about what their rival is doing, the payoff for attacking is greater, regardless of what their rival does. The empirical validity of this reasoning has been demonstrated by how some states (such as Australia, the UK, the US and France) have declared that their official policy stances extend beyond an \"active cyber defence system\" to include \"offensive cyber capabilities and operations\". Considering that this trend poses a threat to international peace and global cybersecurity, it is an urgent matter to find a way to reverse (explicit and concealed) offensive motives.\nA possible solution for deterring cyberattacks would be to raise the costs (decrease the payoff) of attacking and lower the costs (increase the payoff) of defending.4 In order to stimulate these shifts, it would be essential to persuade potential attackers that the cost-benefit calculus of attacking is unfavourable. This could be achieved in a twofold way. First, by implementing a formalised set of procedures capable of producing credible (i.e. objective, persuasive and transparent) public evidences and assessments of cyberattacks, attackers would be made more exposed to being held responsible for cyberattacks (and to bear legal consequences which flow therefrom). Secondly, by sharing and/or increasing network security monitoring resources and information, entities which refrain from attacking would be offered technical assistance and legal reassurances.\n# A global cyber attribution mechanism would deter cyberattacks by raising the costs of attacking and lowering the costs of defending.\nThe attainment of the abovementioned objectives calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions. Confidence-building requires the formation of an institutionalised mechanism of coordination and/or cooperation between participating entities. Creating predictable normative expectations in terms of how cyberattacks are attributed would promote common understandings and reduce the risks of mistrust and misperception. On the other hand,\ncapacity-building would be essential to guarantee the effective functioning of a cyber attribution mechanism. This could be achieved by ensuring that the mechanism is equipped with adequate resources, intelligence capabilities, investigative powers and safeguards against external influences.\n# ATTRIBUTION OF CYBERATTACKS\nThe purpose of a cyber attribution mechanism is to identify the subject(s) who shall bear responsibility for a cyberattack (Figure 1). In order to determine the circumstances when a cyber attribution mechanism should be deployed, it is first important to delineate when a malicious cyber operation is to be considered a cyberattack. In this aspect, it is necessary to define the notion of 'cyberattack' and distinguish it from 'cybercrime' and 'cyberwarfare'. Although these are interrelated categories, they have different material scopes and are linked to distinct legal regimes. If it is deemed that a cyberattack took place, then the next step is to identify (attribute) its source by technical means. However, the attribution of a cyberattack to a specific perpetrator (and other parties involved in the attack) can be understood in various ways, because the question of \"who is responsible?\" can be answered in several ways. In case the perpetrator (and other parties involved in the attack) can be identified (with a certain degree of confidence), then the third step is a normative process of establishing and/or invoking responsibility for the violation of law, which, at an international level, entails the international responsibility (of a state) for the breach of an international obligation. However, in case a cyberattack is judged to be the act of a non-state entity, then it is a contentious issue to determine what standard of control and of dependence are required to attribute the act to a particular state.\nFigure 2: Cyber attribution mechanism\n# $\\succ$  Defining 'cyberattack'\nThe terms 'cyberattack', 'cybercrime' and 'cyberwarfare' are frequently used without due consideration to their conceptual meanings. This absence of clarity makes it all the more difficult to design a meaningful legal response. To address this uncertainty, a working definition for 'cyberattack' can be given as follows:\nan act or series of acts, which are perpetrated by a state or non-state entity against the legitimate interests of a (nother) state or the interests of the international community as a whole, to undermine the proper functioning of computer networks or systems for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, or injury including any damage.\nIn contrast to cyberattacks, cybercrimes can be perpetrated only by individuals or non-state entities. While a cyberattack constitutes a breach of an international obligation, a cybercrime is an act which violates domestic, supranational or international criminal law. Cybercrimes have a purpose or effect other than to target the legitimate interests of a (nother) state or the interests of the international community as a whole. Although they are committed by means of a computer system, they do not undermine the proper functioning of computer networks or systems. National laws and international legal instruments usually do not provide a strict definition for cybercrimes, they refer to it rather as a collection of illegal acts. According to their offence object and modus operandi, cybercrimes include not only acts for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, but also computer-related acts for personal or financial gain or harm, as well as computer content-related acts.\nThe prerequisite of a cyberwarfare is that it must constitute a cyberattack, but in addition to satisfying the criteria of a cyberattack, its effects must reach the 'armed attack' threshold under international law (jus ad bellum) or the cyberattack must take place in the context of an international or non-international armed conflict (jus in bello). A state may exercise the right to self-defence and take countermeasures, if they suffer a cyberattack amounting to the level of an armed attack. However, there is legal uncertainty about this threshold in cases when a cyberattack results in severe non-destructive or non-injurious\nconsequences (e.g. it destabilises the financial sector of another state, or undermines its election process or the functioning of any of its institutions). With regard to the overlapping and/or distinct elements of these definitions, one can depict the abstract boundaries of the three terms (Figure 2).\nFigure 2: Logical relations between malicious cyber operations\n# &gt; Attribution in cyberspace\nAttribution entails the problem of minimising uncertainty on all levels without having a uniformly applicable methodology at disposal and where the findings typically appear in shades rather than as a \"black-and-white\" evidence. Attribution is a key component of deterrence, important in strengthening defence against further attacks and a prerequisite to holding the perpetrator of (and other parties involved in) a cyberattack responsible. Cyber attribution carries several meanings, which are conceptually distinct, but often related in practice. The identified subject can be: (a) the computer device(s) from which the cyberattack was carried out; (b) the person(s) who carried out the operation; and (c) the ultimately responsible person, group of persons or state who conducted the cyberattack, or the state which failed to take appropriate measures to prevent a cyberattack emanating from within its territory.\n# $\\succ$  Responsibility for cyberattacks\nIt is undisputed that an internationally wrongful act of a state entails the international responsibility of that state.9 Additionally, it is a general principle of international law that the conduct of a person or group of persons shall be considered an act of a state, if the person or group of persons is in fact acting on the instructions of, or under the direction or control of that state in carrying out the conduct.10\nInternational courts have developed the ‘effective control’¹¹ and ‘overall control’¹² standards to assess the degree of control which must be exercised by a state in order for the conduct to be considered attributable to it. However, these tests require the proof of a relatively high level of state involvement, which seems inadequate in cyberspace due to the technical difficulties of tracing cyberattacks and the ease of controlling them under camouflage. In order to broaden the scope of conducts leading to the determination of control, the UN report of the Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (2015) proposed that “States should not knowingly allow their territory to be used for internationally wrongful acts using ICTs”,¹³ which paraphrases the general principle of the duty of due diligence.¹⁴\n## NATIONAL CYBERSECURITY STRATEGIES\nBefore discussing the possible institutionalisation of cyber attribution, it is useful to be aware of what the stated interests of key political forces are on this matter. In this respect, one may refer to the cybersecurity doctrines set out by the permanent members of the United Nations Security Council:\n- China: The National Cyberspace Security Strategy (2016) states that China “will deepen bilateral and multilateral network security dialogues and information exchanges with countries, effectively manage differences, actively participate in global and regional organisations’ network security cooperation”, with a view to developing a multilateral, democratic and transparent Internet governance system which respects cyberspace sovereignty and adheres to the rule of law.¹⁵\n- France: The launch of the Paris Call for Trust and Security in Cyberspace (2018) by France has received wide support from states and non-state entities. The supporters of the declaration affirm their “willingness to work together, in the existing fora and through the relevant organizations, institutions, mechanisms and processes to assist one another and implement cooperative measures, notably in order to: [p]revent and recover from malicious cyber activities that threaten or cause significant, indiscriminate or systemic harm to individuals and critical infrastructure”.¹⁶ On the national level, the Strategic Review of Cyber Defence (2017) proclaims that the principle of\nsovereignty applies to cyberspace, hence France may invoke state responsibility by claiming a breach of the due diligence duty.¹⁷ The doctrine states that “France must in particular work to reach an agreement at the international level on the obligations faced by a State whose infrastructure would be used for malicious purposes.”¹⁸ In relation to this, the document proposes the “establishment of a «chain of responsibility» allowing the victim State to benefit from the assistance of those States through which the attack passes.”¹⁹\n- Russia: The Doctrine of Information Security (2016) expresses Russia’s strategic objectives of “taking part in establishing an international information security system capable of effectively countering the use of information technologies for military and political purposes that are contrary to international law, or for terrorist, extremist, criminal or other illegal purposes” and “creating international legal mechanisms taking into account the specific nature of information technologies and intended to prevent and settle conflicts between States in information space”.²⁰\n- United Kingdom: The National Cyber Strategy (2016-2021) states that the UK “will seek to influence the decision-making of those engaging in [.] disruptive or destructive cyber activity and continue to build frameworks to support international cooperation.”²¹ It will “attribute specific cyber identities publicly”, when it is judged “in the national interest to do so.”²²\n- United States: The National Cyber Strategy (2018) sets out the plan of launching a Cyber Deterrence Initiative “to work with like-minded states to coordinate and support each other’s responses to significant malicious cyber incidents, including through intelligence sharing, buttressing of attribution claims, public statements of support for responsive actions taken, and joint imposition of consequences against malign actors.”²³\nAlthough attribution remains a sovereign political decision, there is a tendency reflected in state practice and opinio juris to support international coordination and/or cooperation for the purpose of preventing and responding to cyberattacks. There is growing recognition that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to address cyberspace vulnerabilities and the ‘attribution problem’.\n4\nFigure 3: Roadmap to institutionalising a cyber attribution mechanism\n# INSTITUTIONAL DESIGN CHOICES\nThe escalation of cyberattacks, along with the reluctance of states to make attribution claims, and the risk of politicisation when they do, has intensified demand for a politically neutral and fact-based analysis of cyberattacks. This has been articulated by various proposals on the issue. By building on and advancing these models, this article provides a step-by-step approach to highlight the main decisions and considerations that would need to be made and taken into account in the course of designing a cyber attribution mechanism (Figure 3).\n# $\\succ$  Constitutive act or agreement\nThe creation of a cyber attribution mechanism requires the drafting of a constitutive act or agreement by a founding body or members in order to stipulate the rules governing the functioning of the mechanism. This requires the formation of a working group (within or outside the scope of an international or transnational organisation) to which participants could be delegated by states and/or non-state entities (i.e. from the private sector, the Internet technical community, academia and/or the civil society). Considering that negotiations between states could drag on for a long time, non-state entities should play an active role in building an alliance which promotes efforts to institutionalise cyber attribution. If there are\ndifficulties in reaching a wide consensus on a prompt solution, then parties to the negotiations might consider adopting a phased approach, whereby by ad hoc groupings of states and/or non-state entities could conduct joint investigations of major cyberattacks. Testing various cooperative and/or collaborative arrangements could help build trust and identify ways to create a more formalised cyber attribution mechanism over time.\n# $\\succ$  Legal status and composition\nA cyber attribution mechanism could be institutionalised in a number of ways (Figure 4). An intergovernmental proposal could initiate the establishment of an international organisation by treaty or other instrument governed by international law. This organisation could function autonomously, but may have its relationship to the United Nations fixed by a special agreement, in a similar way to the IAEA or the Organisation for the Prohibition of Chemical Weapons (OPCW). Modelling a cyber attribution organisation on the basis of the OPCW is particularly worthy of consideration, as the OPCW was granted legal mandate in 2018 to \"provide technical expertise to identify those who were perpetrators, organisers, sponsors or otherwise involved in the use of chemicals as weapons\", \"with a view to facilitating universal attribution of all chemical weapons attacks\".\nFigure 4: Possible ways of institutionalising a cyber attribution mechanism\nAlternatively, non-state entities could form an alliance to establish a transnational organisation or a transnationally coordinated decentralised network (with or without the involvement of states). The former would need to be incorporated under domestic private law (practically, of a neutral country), while the latter would need to be based on a contractual agreement between participants. In both cases, non-state members could include entities, which can demonstrate considerable presence in the global cybersecurity market and/or significant technical forensics capabilities and/or other capabilities to oversee the proper functioning of international or national telecommunications networks. Membership could have multiple tiers/categories and may be tied to the sponsorship of a predefined number of other members, similarly to how the membership of FIRST, the leading international confederation of computer incident response teams, is organised.\n## Principles of functioning\nThe international legitimacy and/or global recognition of a cyber attribution mechanism would depend largely on its credibility. To achieve this, the mechanism would need to be guided by the following principles: rules-based functioning, autonomy, impartiality, objectivity, inclusivity, technical competency, narrow focus, consensus-driven and transparency. Any investigations must be carried out with due observance of the sovereign rights of states. However, the mechanism cannot be subject to any external influence incompatible with the purpose of drawing credible attributions. If neutrality cannot be ensured, then a diverse range of competing interests should be represented.\n## Structure\nAn international or transnational cyber attribution organisation would require the establishment of organs. The organisation could include, for example, a general conference (consisting of representatives of members), an executive body (board of governors) and a technical secretariat (professional and general service staff), which would encompass investigative teams. The organisation could ensure internal accountability by developing a separate organ or procedure for the purpose of conducting independent peer reviews. Additionally, the establishment of a legal committee could ensure that national laws and international law are respected during investigations.\nIn the case of a transnationally coordinated decentralised governance network, participants could establish a permanently functioning consultative forum to coordinate their attribution efforts. Although a decentralised but coordinated system would constitute a less formalised mechanism, it may prompt faster attributions (thus, earlier opportunities to improve defence systems). The multiplicity of attributors would foster ad hoc peer reviewing, where participants have incentives to confirm or debunk other attributions (and thereby enhance or undermine the credibility of an attribution).\n## Resources\nA cyber attribution mechanism must have the technical expertise, intelligence capabilities, financial means and other resources to enable it to fulfill its purpose. These resources would need to come primarily from the contribution of members. Since most states do not possess sufficient resources to\nconduct their own attribution investigations, they might be willing to support common efforts due to the operational benefits they can gain by sharing costs. The challenge of convincing competitors to collaborate could be solved by adopting a formalised information sharing system with privacy and data protection assurances.²⁸ The paramount consideration in the employment and the conditions of service should be the objective of securing the highest standards of competence, integrity and efficiency, while reflecting the principle of equitable geographical distribution.\n&gt; **Admissibility criteria**\nConsidering that a cyber attribution mechanism has limited capacities, there should be a set of criteria which determines: who can initiate proceedings and whether a cyberattack is significant enough to merit investigation. As regards the first condition, it seems reasonable to give the right to initiate proceedings to those who have been directly or indirectly affected by the alleged cyberattack. Granting the victim the exclusive right of initiation preserves the victim's privacy, autonomy and ability to determine whether and when to seek an attribution investigation.²⁹ As regards the second condition, the scale and effects of the alleged cyberattack must reach a sufficiently high threshold. This threshold could be determined based on the evidences collected about the intensity, damages, directness, invasiveness, immediacy, military character, offence object and modus operandi of the cyberattack.\n&gt; **Investigations**\nA cyber attribution mechanism should clearly define and publish the framework based on which evidence shall be collected and assessed.³⁰ In the case of international or transnational cyber attribution organisations, the organisations should have the powers to access and/or request information from members and other entities. There should also be a process to collect and protect voluntarily shared information from third parties. As regards a transnationally coordinated decentralised governance network, the challenges posed by coordinating the investigations of multiple attributors (i.e. primarily, the protection of sensitive information, intellectual property and proprietary methods) could be overcome by developing parallel attribution chains, which could then be cross-correlated.³¹\n&gt; **Burden of proof**\nThe burden of proof could be eased by requesting a reasonably suspected entity to plausibly prove their non-involvement in a cyberattack by supplying relevant, tamper-proof and anonymised empirical data about a specific cyber operation.³² (This could be a procedural design solution for implementing the French concept on the “chain of responsibility”.) Alternatively, a ‘virtual control’ test³³ would be suitable to assess the degree of state control exercised over a non-state entity. Accordingly, if it can be demonstrated that a state funded or equipped a non-state entity, then that state should be responsible for the non-state entity’s cyberattack, unless that state rebuts the presumption of responsibility through cooperation in the attribution efforts. In this case, adequate cooperation would shift the burden of attribution back to the attributors and keep the standard for the degree of control at the level of the ‘overall control’ test.\n&gt; **Confidence and severity assessments**\nA cyber attribution mechanism should establish and adhere to a set of standards for assessing the confidence of its attributions. As attribution is a statement with an inherent degree of uncertainty, the confidence level associated with a finding expresses the estimative probability of its certainty, that is to say, how corroborated, plausible, logical and/or comprehensive underlying evidences are.³⁴ In addition to this, a standardised methodology could be used to estimate the magnitude of the severity (potential impact) of cyberattacks by quantifying the (direct and indirect) harms that the victim suffers.\n&gt; **Peer review**\nA cyber attribution mechanism could improve the quality of results and obtain a higher level of validation through an independent peer reviewing process. As a result, peers could approve the assessment, draw alternative assessments or call for further investigations.\n&gt; **Decision-making**\nThe decision-making of a cyber attribution mechanism should be driven by consensus. If an unanimous decision cannot be reached, then majority and minority opinions should be recorded. A cyber attribution mechanism should be narrowly focused on\nattribution. However, in the case that a cyber attribution organisation has member states, then if an attribution ruling finds against a subject, then the case, along with the evidences and their assessments, could be referred to the International Court of Justice or the United Nations General Assembly or Security Council for the purpose of determining legal responsibility and appropriate enforcement actions.\n&gt; Reporting\nAttribution reports should provide a clear and rational explanation for attribution assessments and decisions. It shall also give due consideration to alternative assessments. Technical details should be published for further assessments and broader use in order to facilitate the strengthening of defensive systems.\nCONCLUSIONS\nThere is growing recognition amongst states that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to protect the security, stability, safety and resilience of the Internet and connected devices from cyberattacks. The deterrence of cyberattacks could be achieved by establishing an institutional mechanism capable of credibly identifying the subject(s) responsible for cyberattacks, which would raise the costs of attacking and decrease the costs of defending. Although a cyber attribution mechanism could be designed in multiple ways, it is important to ensure the international legitimacy and/or global recognition of the mechanism by implementing appropriate confidence- and capacity-building institutional solutions.\n1 Ben BUCHANAN (2016): The Cybersecurity Dilemma: Hacking, Trust, and Fear Between Nations. New York, NY, United States: Oxford University Press, 190.\n2 John H. HERZ (1950): Idealist Internationalism and the Security Dilemma. World Politics, 2(2), 157–180 at 157.\n3 See Australian Government (2016): Australia's Cyber Security Strategy: Enabling Innovation, Growth &amp; Prosperity, 28; HM Government of the United Kingdom (2016): National Cyber Security Strategy 2016-2021, 51 at sec. 6.5; Department of Defense of the United States of America (2018): Department of Defense Strategy 2018 (Summary), 1; Ministère des Armées [Ministry of the Armies, French Republic] (2019): Éléments publics de doctrine militaire de lutte informatique offensive [Public Elements of the Military Doctrine for Offensive Cyber Operations], 4.\n4 Brendan KUERBIS (2018): Defusing the cybersecurity dilemma game through attribution and network monitoring. Blog post (13 April 2018), Internet Governance Project, School of Public Policy at Georgia Institute of Technology, <https: 04=\"\" 13=\"\" 2018=\"\" defusing-cybersecurity-dilemma-game-attribution-network-monitoring=\"\" www.internetgovernance.org=\"\">.\n5 See Oona A. HATHAWAY et al. (2012): The Law of Cyber-Attack. California Law Review, 100, 817–886 at 822–837.\n6 United Nations Office on Drugs and Crime (2013): Comprehensive Study on Cybercrime (Draft, February 2013). New York, NY, United States: United Nations, 16.\n7 Michael N. SCHMITT (2012): The Law of Cyber Warfare: Quo Vadis? Stanford Law &amp; Policy Review, 25, 269–300 at 282–283.\n8 Thomas RID – Ben BUCHANAN (2015): Attributing Cyber Attacks. The Journal of Strategic Studies, 38(1–2), 4–37 at 7.\n9 International Law Commission (2001): Yearbook of the International Law Commission, Volume II, Part Two: Report of the Commission to the General Assembly on the work of its fifty-third session (A/CN.4/SER.A/2001/Add.1, Part 2). New York, NY, United States – Geneva, Switzerland: United Nations [a.k.a. Draft Articles on Responsibility of States for Internationally Wrongful Acts], 32 at art. 1.\n10 Ibid., 47 at art. 8.\n11 See Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. United States of America), Merits, Judgment, I.C.J. Reports 1986, 64–65 at para. 115.\n12 See Prosecutor v. Dusko Tadic, International Tribunal for the Former Yugoslavia, Case IT-94-1-A (1999), ILM, Vol. 38, No. 6 (November 1999), 1546 at para. 115.\n13 United Nations General Assembly, Seventieth session, Item 93 of the provisional agenda, Developments in the field of information and telecommunications in the context of international security (A/70/174, 22 July 2015), Report of the Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security at para. 13(c).\n14 See Corfu Channel Case (United Kingdom v. Albania), Merits (Judgment of April 9th, 1949), I.C.J. Reports 1949, 22.\n15 國家互聯網信息辦公室 [National Internet Information Office, People's Republic of China] (2016): 国家网络空间安全战略 [National Cyberspace Security Strategy] (27 December 2016), sec. 2 and 4(9).\n16 Paris Call for Trust and Security in Cyberspace (11 November 2018).\n17 Secrétariat général de la défense et de la sécurité nationale [Secretariat-General for National Defence and Security, French Republic] (2018): Revue stratégique de cyberdéfense [Strategic Review of Cyberdefence] (12 February 2018), 82.\n18 Ibid., 86.\n19 Ibid., 160.\n20 Doctrine of Information Security of the Russian Federation (approved by the Decree of the President of the Russian Federation, No. 646 of December 5, 2016), art. 29, paras. b)-c).\n21 HM Government of the United Kingdom (2016): National Cyber Security Strategy 2016-2021, 63 at sec. 8.3.\n22 Ibid., 50 at sec. 6.3.3.\n23 President of the United States of America (2018): National Cyber Strategy of the United States of America (September 2018), 21.\n24 See Jason HEALEY – John C. MALLERY – Klara Tothova JORDAN – Nathaniel V. YOUD (2014): Confidence-Building Measures in Cyberspace: A Multistakeholder Approach for Stability and Security. Washington, DC, United States: Atlantic Council; Scott CHARNEY et al. (2016): From Articulation to Implementation: Enabling progress on cybersecurity norms. Microsoft Corporation; John S. DAVIS II et al. (2017): Stateless Attribution: Toward International Accountability in Cyberspace. Santa Monica, CA, United States: RAND Corporation; Jessica BEYER et al. (2017): Cyberattack Attribution: A Blueprint for Private Sector Leadership. University of Washington, The Henry M. Jackson School of International Studies.\n25 HEALEY et al. [Ibid.], 12.\n26 Organisation for the Prohibition of Chemical Weapons, Fourth Special Session (C-SS-4/DEC.3, 26–28 June 2018), Decision Addressing the Threat from Chemical Weapons Use, paras. 19-20.\n27 Kristen E. EICHENSEHR (2019): Decentralized Cyberattack Attribution. AIIL Unbound, 113, 213–217 at 216–217.\n28 BEYER et al. [op. cit. 24], 41.\n29 DAVIS II et al. [op. cit. 24], 36.\n30 Ibid., 37.\n31 See HEALEY et al. [op. cit. 24], 12.\n32 Thomas REINHOLD (2018): Rethinking the Attribution Problem - A Plausible Proof of Non-Involvement as an Alternative to Credible Attribution. In: Global Commission on the Stability of Cyberspace: Briefings from the Research Advisory Group (Bratislava, Slovakia, May 2018). The Hague, The Netherlands: The Hague Centre for Strategic Studies, 134–149.\n33 Peter MARGULIES (2013): Sovereignty and Cyber Attacks: Technology's Challenge to the Law of State Responsibility. Melbourne Journal of International Law, 14(2), 496–519 at 514.\n34 Herbert LIN (2015): Attribution of Malicious Cyber Incidents: From Soup to Nuts. Hoover Institution Aegis Paper Series on National Security, Technology, and Law, 1607, 30–33.</https:>"
    },
    "author_year": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "author_year"
      },
      "results": [],
      "flat_text": "# INSTITUTIONALISING CYBER ATTRIBUTION\nThe escalation of cyberattacks calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions.\nWhile information and communication technologies (ICTs) provide immense opportunities for social and economic development, there are also disturbing trends in the global ICT environment. One of the major threats is the proliferation of cyberattacks. The dramatic increase in the scale and destructive magnitude of cyberattacks implies the assumption that there is an inclination to carry out cyberattacks, because normativisation, compliance, enforcement, trust and cooperation are at relatively low levels. In order to prevent the further escalation of tensions in cyberspace, it would be essential to implement confidence- and capacity-building measures, which would increase deterrent effects and reverse the increasingly offensive doctrines of national cybersecurity strategies. These shifts could be achieved by establishing an internationally legitimised and/or globally recognised cyber(attack) attribution mechanism, which could be institutionalised as an international organisation, a multi-stakeholder or non-governmental transnational organisation or a transnationally coordinated decentralised governance network. In support of this view, this article examines the following questions:\n(1) Why would the establishment of a cyber attribution mechanism be a suitable solution to deter cyberattacks?\n(2) In what circumstances and under what legal framework should a cyber attribution mechanism be deployed?\n(3) How do key political powers construe the necessity to cooperate and/or create new legal mechanisms in order to overcome the challenges posed by cyberattacks and their attribution?\n(4) What are the main steps and considerations of designing institutional solutions for a cyber attribution mechanism?\n# REVERSING CYBERATTACKERS' MOTIVES\nA possible explanation for the ongoing cyber \"arms race\" can be found by extending the \"security dilemma\" to cyber operations. This dilemma models the behaviour of two rival entities (e.g. two states) in a situation in which the entities have a lack of trust in each other. According to the model: if one entity increases its (cyber)security measures, then this will make its rival feel threatened and incited to respond with countermeasures, which could lead to a dangerous escalatory dynamic. These sequence of events are particularly prone to take place within the context of ICTs, where there is a widely held perception that the offensive side has significant advantages over the defensive side.\n|  Current cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 2,2 | 0,3  |\n|   |  Offensive | 3,0 | 1,1  |\nHOW?\n|  Desired cybersecurity strategies  |   |   |   |\n| --- | --- | --- | --- |\n|  Payoff matrix | Entity  |   |   |\n|   |   |  Defensive | Offensive  |\n|  Rival | Defensive | 3,3 | 1,2  |\n|   |  Offensive | 2,1 | 0,0  |\nTable 1: Game theoretic representation of the cybersecurity dilemma\nIf we look at this problem (and possible solutions) through the lens of non-cooperative game theory, then we can better understand the underlying strategic considerations of two rival entities\n(Table 1). Both entities (and other stakeholders of cyberspace) would benefit from only defending. However, since both entities lack knowledge about what their rival is doing, the payoff for attacking is greater, regardless of what their rival does. The empirical validity of this reasoning has been demonstrated by how some states (such as Australia, the UK, the US and France) have declared that their official policy stances extend beyond an \"active cyber defence system\" to include \"offensive cyber capabilities and operations\". Considering that this trend poses a threat to international peace and global cybersecurity, it is an urgent matter to find a way to reverse (explicit and concealed) offensive motives.\nA possible solution for deterring cyberattacks would be to raise the costs (decrease the payoff) of attacking and lower the costs (increase the payoff) of defending.4 In order to stimulate these shifts, it would be essential to persuade potential attackers that the cost-benefit calculus of attacking is unfavourable. This could be achieved in a twofold way. First, by implementing a formalised set of procedures capable of producing credible (i.e. objective, persuasive and transparent) public evidences and assessments of cyberattacks, attackers would be made more exposed to being held responsible for cyberattacks (and to bear legal consequences which flow therefrom). Secondly, by sharing and/or increasing network security monitoring resources and information, entities which refrain from attacking would be offered technical assistance and legal reassurances.\n# A global cyber attribution mechanism would deter cyberattacks by raising the costs of attacking and lowering the costs of defending.\nThe attainment of the abovementioned objectives calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions. Confidence-building requires the formation of an institutionalised mechanism of coordination and/or cooperation between participating entities. Creating predictable normative expectations in terms of how cyberattacks are attributed would promote common understandings and reduce the risks of mistrust and misperception. On the other hand,\ncapacity-building would be essential to guarantee the effective functioning of a cyber attribution mechanism. This could be achieved by ensuring that the mechanism is equipped with adequate resources, intelligence capabilities, investigative powers and safeguards against external influences.\n# ATTRIBUTION OF CYBERATTACKS\nThe purpose of a cyber attribution mechanism is to identify the subject(s) who shall bear responsibility for a cyberattack (Figure 1). In order to determine the circumstances when a cyber attribution mechanism should be deployed, it is first important to delineate when a malicious cyber operation is to be considered a cyberattack. In this aspect, it is necessary to define the notion of 'cyberattack' and distinguish it from 'cybercrime' and 'cyberwarfare'. Although these are interrelated categories, they have different material scopes and are linked to distinct legal regimes. If it is deemed that a cyberattack took place, then the next step is to identify (attribute) its source by technical means. However, the attribution of a cyberattack to a specific perpetrator (and other parties involved in the attack) can be understood in various ways, because the question of \"who is responsible?\" can be answered in several ways. In case the perpetrator (and other parties involved in the attack) can be identified (with a certain degree of confidence), then the third step is a normative process of establishing and/or invoking responsibility for the violation of law, which, at an international level, entails the international responsibility (of a state) for the breach of an international obligation. However, in case a cyberattack is judged to be the act of a non-state entity, then it is a contentious issue to determine what standard of control and of dependence are required to attribute the act to a particular state.\nFigure 2: Cyber attribution mechanism\n# $\\succ$  Defining 'cyberattack'\nThe terms 'cyberattack', 'cybercrime' and 'cyberwarfare' are frequently used without due consideration to their conceptual meanings. This absence of clarity makes it all the more difficult to design a meaningful legal response. To address this uncertainty, a working definition for 'cyberattack' can be given as follows:\nan act or series of acts, which are perpetrated by a state or non-state entity against the legitimate interests of a (nother) state or the interests of the international community as a whole, to undermine the proper functioning of computer networks or systems for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, or injury including any damage.\nIn contrast to cyberattacks, cybercrimes can be perpetrated only by individuals or non-state entities. While a cyberattack constitutes a breach of an international obligation, a cybercrime is an act which violates domestic, supranational or international criminal law. Cybercrimes have a purpose or effect other than to target the legitimate interests of a (nother) state or the interests of the international community as a whole. Although they are committed by means of a computer system, they do not undermine the proper functioning of computer networks or systems. National laws and international legal instruments usually do not provide a strict definition for cybercrimes, they refer to it rather as a collection of illegal acts. According to their offence object and modus operandi, cybercrimes include not only acts for the purpose or effect of causing loss of availability, integrity or confidentiality of computer data or systems, but also computer-related acts for personal or financial gain or harm, as well as computer content-related acts.[6]\nThe prerequisite of a cyberwarfare is that it must constitute a cyberattack, but in addition to satisfying the criteria of a cyberattack, its effects must reach the 'armed attack' threshold under international law (jus ad bellum) or the cyberattack must take place in the context of an international or non-international armed conflict (jus in bello). A state may exercise the right to self-defence and take countermeasures, if they suffer a cyberattack amounting to the level of an armed attack. However, there is legal uncertainty about this threshold in cases when a cyberattack results in severe non-destructive or non-injurious\nconsequences (e.g. it destabilises the financial sector of another state, or undermines its election process or the functioning of any of its institutions). With regard to the overlapping and/or distinct elements of these definitions, one can depict the abstract boundaries of the three terms (Figure 2).\nFigure 2: Logical relations between malicious cyber operations\n# &gt; Attribution in cyberspace\nAttribution entails the problem of minimising uncertainty on all levels without having a uniformly applicable methodology at disposal and where the findings typically appear in shades rather than as a \"black-and-white\" evidence. Attribution is a key component of deterrence, important in strengthening defence against further attacks and a prerequisite to holding the perpetrator of (and other parties involved in) a cyberattack responsible. Cyber attribution carries several meanings, which are conceptually distinct, but often related in practice. The identified subject can be: (a) the computer device(s) from which the cyberattack was carried out; (b) the person(s) who carried out the operation; and (c) the ultimately responsible person, group of persons or state who conducted the cyberattack, or the state which failed to take appropriate measures to prevent a cyberattack emanating from within its territory.\n# $\\succ$  Responsibility for cyberattacks\nIt is undisputed that an internationally wrongful act of a state entails the international responsibility of that state.9 Additionally, it is a general principle of international law that the conduct of a person or group of persons shall be considered an act of a state, if the person or group of persons is in fact acting on the instructions of, or under the direction or control of that state in carrying out the conduct.10\nInternational courts have developed the ‘effective control’¹¹ and ‘overall control’¹² standards to assess the degree of control which must be exercised by a state in order for the conduct to be considered attributable to it. However, these tests require the proof of a relatively high level of state involvement, which seems inadequate in cyberspace due to the technical difficulties of tracing cyberattacks and the ease of controlling them under camouflage. In order to broaden the scope of conducts leading to the determination of control, the UN report of the Group of Governmental Experts on Developments in the Field of Information and Telecommunications in the Context of International Security (2015) proposed that “States should not knowingly allow their territory to be used for internationally wrongful acts using ICTs”,¹³ which paraphrases the general principle of the duty of due diligence.¹⁴\n## NATIONAL CYBERSECURITY STRATEGIES\nBefore discussing the possible institutionalisation of cyber attribution, it is useful to be aware of what the stated interests of key political forces are on this matter. In this respect, one may refer to the cybersecurity doctrines set out by the permanent members of the United Nations Security Council:\n- China: The National Cyberspace Security Strategy (2016) states that China “will deepen bilateral and multilateral network security dialogues and information exchanges with countries, effectively manage differences, actively participate in global and regional organisations’ network security cooperation”, with a view to developing a multilateral, democratic and transparent Internet governance system which respects cyberspace sovereignty and adheres to the rule of law.¹⁵\n- France: The launch of the Paris Call for Trust and Security in Cyberspace (2018) by France has received wide support from states and non-state entities. The supporters of the declaration affirm their “willingness to work together, in the existing fora and through the relevant organizations, institutions, mechanisms and processes to assist one another and implement cooperative measures, notably in order to: [p]revent and recover from malicious cyber activities that threaten or cause significant, indiscriminate or systemic harm to individuals and critical infrastructure”.¹⁶ On the national level, the Strategic Review of Cyber Defence (2017) proclaims that the principle of\nsovereignty applies to cyberspace, hence France may invoke state responsibility by claiming a breach of the due diligence duty.¹⁷ The doctrine states that “France must in particular work to reach an agreement at the international level on the obligations faced by a State whose infrastructure would be used for malicious purposes.”¹⁸ In relation to this, the document proposes the “establishment of a «chain of responsibility» allowing the victim State to benefit from the assistance of those States through which the attack passes.”¹⁹\n- Russia: The Doctrine of Information Security (2016) expresses Russia’s strategic objectives of “taking part in establishing an international information security system capable of effectively countering the use of information technologies for military and political purposes that are contrary to international law, or for terrorist, extremist, criminal or other illegal purposes” and “creating international legal mechanisms taking into account the specific nature of information technologies and intended to prevent and settle conflicts between States in information space”.²⁰\n- United Kingdom: The National Cyber Strategy (2016-2021) states that the UK “will seek to influence the decision-making of those engaging in [.] disruptive or destructive cyber activity and continue to build frameworks to support international cooperation.”²¹ It will “attribute specific cyber identities publicly”, when it is judged “in the national interest to do so.”²²\n- United States: The National Cyber Strategy (2018) sets out the plan of launching a Cyber Deterrence Initiative “to work with like-minded states to coordinate and support each other’s responses to significant malicious cyber incidents, including through intelligence sharing, buttressing of attribution claims, public statements of support for responsive actions taken, and joint imposition of consequences against malign actors.”²³\nAlthough attribution remains a sovereign political decision, there is a tendency reflected in state practice and opinio juris to support international coordination and/or cooperation for the purpose of preventing and responding to cyberattacks. There is growing recognition that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to address cyberspace vulnerabilities and the ‘attribution problem’.\n\n# INSTITUTIONAL DESIGN CHOICES\nThe escalation of cyberattacks, along with the reluctance of states to make attribution claims, and the risk of politicisation when they do, has intensified demand for a politically neutral and fact-based analysis of cyberattacks. This has been articulated by various proposals on the issue.[24] By building on and advancing these models, this article provides a step-by-step approach to highlight the main decisions and considerations that would need to be made and taken into account in the course of designing a cyber attribution mechanism (Figure 3).\n# $\\succ$  Constitutive act or agreement\nThe creation of a cyber attribution mechanism requires the drafting of a constitutive act or agreement by a founding body or members in order to stipulate the rules governing the functioning of the mechanism. This requires the formation of a working group (within or outside the scope of an international or transnational organisation) to which participants could be delegated by states and/or non-state entities (i.e. from the private sector, the Internet technical community, academia and/or the civil society). Considering that negotiations between states could drag on for a long time, non-state entities should play an active role in building an alliance which promotes efforts to institutionalise cyber attribution. If there are\ndifficulties in reaching a wide consensus on a prompt solution, then parties to the negotiations might consider adopting a phased approach, whereby by ad hoc groupings of states and/or non-state entities could conduct joint investigations of major cyberattacks.[25] Testing various cooperative and/or collaborative arrangements could help build trust and identify ways to create a more formalised cyber attribution mechanism over time.\n# $\\succ$  Legal status and composition\nA cyber attribution mechanism could be institutionalised in a number of ways (Figure 4). An intergovernmental proposal could initiate the establishment of an international organisation by treaty or other instrument governed by international law. This organisation could function autonomously, but may have its relationship to the United Nations fixed by a special agreement, in a similar way to the IAEA or the Organisation for the Prohibition of Chemical Weapons (OPCW). Modelling a cyber attribution organisation on the basis of the OPCW is particularly worthy of consideration, as the OPCW was granted legal mandate in 2018 to \"provide technical expertise to identify those who were perpetrators, organisers, sponsors or otherwise involved in the use of chemicals as weapons\", \"with a view to facilitating universal attribution of all chemical weapons attacks\".[26]\nFigure 4: Possible ways of institutionalising a cyber attribution mechanism\nAlternatively, non-state entities could form an alliance to establish a transnational organisation or a transnationally coordinated decentralised network (with or without the involvement of states). The former would need to be incorporated under domestic private law (practically, of a neutral country), while the latter would need to be based on a contractual agreement between participants. In both cases, non-state members could include entities, which can demonstrate considerable presence in the global cybersecurity market and/or significant technical forensics capabilities and/or other capabilities to oversee the proper functioning of international or national telecommunications networks. Membership could have multiple tiers/categories and may be tied to the sponsorship of a predefined number of other members, similarly to how the membership of FIRST, the leading international confederation of computer incident response teams, is organised.\n## Principles of functioning\nThe international legitimacy and/or global recognition of a cyber attribution mechanism would depend largely on its credibility. To achieve this, the mechanism would need to be guided by the following principles: rules-based functioning, autonomy, impartiality, objectivity, inclusivity, technical competency, narrow focus, consensus-driven and transparency. Any investigations must be carried out with due observance of the sovereign rights of states. However, the mechanism cannot be subject to any external influence incompatible with the purpose of drawing credible attributions. If neutrality cannot be ensured, then a diverse range of competing interests should be represented.\n## Structure\nAn international or transnational cyber attribution organisation would require the establishment of organs. The organisation could include, for example, a general conference (consisting of representatives of members), an executive body (board of governors) and a technical secretariat (professional and general service staff), which would encompass investigative teams. The organisation could ensure internal accountability by developing a separate organ or procedure for the purpose of conducting independent peer reviews. Additionally, the establishment of a legal committee could ensure that national laws and international law are respected during investigations.\nIn the case of a transnationally coordinated decentralised governance network, participants could establish a permanently functioning consultative forum to coordinate their attribution efforts. Although a decentralised but coordinated system would constitute a less formalised mechanism, it may prompt faster attributions (thus, earlier opportunities to improve defence systems). The multiplicity of attributors would foster ad hoc peer reviewing, where participants have incentives to confirm or debunk other attributions (and thereby enhance or undermine the credibility of an attribution).[27]\n## Resources\nA cyber attribution mechanism must have the technical expertise, intelligence capabilities, financial means and other resources to enable it to fulfill its purpose. These resources would need to come primarily from the contribution of members. Since most states do not possess sufficient resources to\nconduct their own attribution investigations, they might be willing to support common efforts due to the operational benefits they can gain by sharing costs. The challenge of convincing competitors to collaborate could be solved by adopting a formalised information sharing system with privacy and data protection assurances.²⁸ The paramount consideration in the employment and the conditions of service should be the objective of securing the highest standards of competence, integrity and efficiency, while reflecting the principle of equitable geographical distribution.\n&gt; **Admissibility criteria**\nConsidering that a cyber attribution mechanism has limited capacities, there should be a set of criteria which determines: who can initiate proceedings and whether a cyberattack is significant enough to merit investigation. As regards the first condition, it seems reasonable to give the right to initiate proceedings to those who have been directly or indirectly affected by the alleged cyberattack. Granting the victim the exclusive right of initiation preserves the victim's privacy, autonomy and ability to determine whether and when to seek an attribution investigation.²⁹ As regards the second condition, the scale and effects of the alleged cyberattack must reach a sufficiently high threshold. This threshold could be determined based on the evidences collected about the intensity, damages, directness, invasiveness, immediacy, military character, offence object and modus operandi of the cyberattack.\n&gt; **Investigations**\nA cyber attribution mechanism should clearly define and publish the framework based on which evidence shall be collected and assessed.³⁰ In the case of international or transnational cyber attribution organisations, the organisations should have the powers to access and/or request information from members and other entities. There should also be a process to collect and protect voluntarily shared information from third parties. As regards a transnationally coordinated decentralised governance network, the challenges posed by coordinating the investigations of multiple attributors (i.e. primarily, the protection of sensitive information, intellectual property and proprietary methods) could be overcome by developing parallel attribution chains, which could then be cross-correlated.³¹\n&gt; **Burden of proof**\nThe burden of proof could be eased by requesting a reasonably suspected entity to plausibly prove their non-involvement in a cyberattack by supplying relevant, tamper-proof and anonymised empirical data about a specific cyber operation.³² (This could be a procedural design solution for implementing the French concept on the “chain of responsibility”.) Alternatively, a ‘virtual control’ test³³ would be suitable to assess the degree of state control exercised over a non-state entity. Accordingly, if it can be demonstrated that a state funded or equipped a non-state entity, then that state should be responsible for the non-state entity’s cyberattack, unless that state rebuts the presumption of responsibility through cooperation in the attribution efforts. In this case, adequate cooperation would shift the burden of attribution back to the attributors and keep the standard for the degree of control at the level of the ‘overall control’ test.\n&gt; **Confidence and severity assessments**\nA cyber attribution mechanism should establish and adhere to a set of standards for assessing the confidence of its attributions. As attribution is a statement with an inherent degree of uncertainty, the confidence level associated with a finding expresses the estimative probability of its certainty, that is to say, how corroborated, plausible, logical and/or comprehensive underlying evidences are.³⁴ In addition to this, a standardised methodology could be used to estimate the magnitude of the severity (potential impact) of cyberattacks by quantifying the (direct and indirect) harms that the victim suffers.\n&gt; **Peer review**\nA cyber attribution mechanism could improve the quality of results and obtain a higher level of validation through an independent peer reviewing process. As a result, peers could approve the assessment, draw alternative assessments or call for further investigations.\n&gt; **Decision-making**\nThe decision-making of a cyber attribution mechanism should be driven by consensus. If an unanimous decision cannot be reached, then majority and minority opinions should be recorded. A cyber attribution mechanism should be narrowly focused on\nattribution. However, in the case that a cyber attribution organisation has member states, then if an attribution ruling finds against a subject, then the case, along with the evidences and their assessments, could be referred to the International Court of Justice or the United Nations General Assembly or Security Council for the purpose of determining legal responsibility and appropriate enforcement actions.\n&gt; Reporting\nAttribution reports should provide a clear and rational explanation for attribution assessments and decisions. It shall also give due consideration to alternative assessments. Technical details should be published for further assessments and broader use in order to facilitate the strengthening of defensive systems.\nCONCLUSIONS\nThere is growing recognition amongst states that strengthening existing institutional frameworks and/or creating new international legal mechanisms are inevitable to protect the security, stability, safety and resilience of the Internet and connected devices from cyberattacks. The deterrence of cyberattacks could be achieved by establishing an institutional mechanism capable of credibly identifying the subject(s) responsible for cyberattacks, which would raise the costs of attacking and decrease the costs of defending. Although a cyber attribution mechanism could be designed in multiple ways, it is important to ensure the international legitimacy and/or global recognition of the mechanism by implementing appropriate confidence- and capacity-building institutional solutions."
    }
  },
  "citation_summary": {
    "style": "author_year",
    "dominant_bucket": "author_year",
    "dominant": {
      "intext_total": 0.0,
      "success_occurrences": 0.0,
      "success_unique": 0.0,
      "bib_unique_total": 0.0,
      "occurrence_match_rate": 0.0,
      "bib_coverage_rate": 0.0,
      "success_percentage": 0.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "author_year"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 9.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 17.0,
        "highest_intext_index": 25.0,
        "missing_footnotes_for_seen_total": 8.0,
        "uncited_footnote_total": 0.0,
        "style": "hybrid"
      },
      "numeric": {
        "intext_total": 5.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "INSTITUTIONALISING CYBER ATTRIBUTION",
    "subtitle": "(1) Why would the establishment of a cyber attribution mechanism be a suitable solution to deter cyberattacks?",
    "document_type": "unknown",
    "venue": "",
    "publication_year": null,
    "authors": [
      "REVERSING CYBERATTACKERS' MOTIVES"
    ],
    "affiliations": [
      "# INSTITUTIONALISING CYBER ATTRIBUTION",
      "The escalation of cyberattacks calls for the establishment of a global cyber attribution mechanism, which would ascertain responsibility for cyberattacks by incorporating confidence- and capacity-building institutional solutions.",
      "(4) What are the main steps and considerations of designing institutional solutions for a cyber attribution mechanism?"
    ],
    "emails": [],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "",
    "keywords": [],
    "publication_dates": {},
    "identifiers": {
      "doi": [],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "www.internet"
      ]
    },
    "references_block_count": 0,
    "references_entries_estimated": 0,
    "heading_count": 14,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "no_abstract",
        "no_identifier"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "author_year",
      "recommended_style": "unknown",
      "aligned": true,
      "signals": {
        "superscript_hits": 20,
        "superscript_definition_lines": 0,
        "numeric_bracket_hits": 5,
        "numeric_endnote_lines": 0,
        "author_year_hits": 0
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 0.0,
      "dominant_bib_coverage_rate": 0.0,
      "dominant_link_target": "bibliography",
      "dominant_unresolved_flag": "unresolved_reference_links"
    },
    "heading_validation": {
      "heading_count": 14,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": false,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": true,
        "emails": false,
        "orcids": false,
        "abstract": false,
        "keywords": false,
        "venue": false,
        "persistent_identifier": false,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 1,
        "affiliations": 3,
        "emails": 0,
        "orcids": 0,
        "keywords": 0,
        "doi": 0,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 1
      },
      "coverage": {
        "core_coverage": 0.6666666666666666,
        "email_author_link_rate": 0.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "no_abstract",
          "no_identifier"
        ],
        "toc_dot_lines": 0
      },
      "flags": [
        "meta_missing_abstract_and_keywords",
        "meta_missing_persistent_identifier"
      ]
    },
    "flags": [
      "missing_reference_heading",
      "meta_missing_abstract_and_keywords",
      "meta_missing_persistent_identifier"
    ]
  },
  "updated_at_utc": "2026-02-14T08:27:54.239364+00:00"
}