{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\RMLNAJQX\\Bronk and Watling - 2021 - I. The slow and imprecise art of cyber warfare.pdf",
  "custom_id": "411",
  "response": {
    "id": "batch-b6235e9e-412-acc61a64-d3be-4b6d-a4a9-e116bd666838",
    "custom_id": "411",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "Noosey Harcoins\n\nWhitehall Papers\n\nRoutledge Taylor &amp; Francis Group\n\nISSN: 0268-1307 (Print) 1754-5382 (Online) Journal homepage: www.tandfonline.com/journals/rwhi20\n\n# I. The Slow and Imprecise Art of Cyber Warfare\n\nJustin Bronk &amp; Jack Watling\n\nTo cite this article: Justin Bronk &amp; Jack Watling (2021) I. The Slow and Imprecise Art of Cyber Warfare, Whitehall Papers, 99:1, 11-23, DOI: 10.1080/02681307.2021.2005891\n\nTo link to this article: https://doi.org/10.1080/02681307.2021.2005891\n\nPublished online: 06 Dec 2021.\n\nSubmit your article to this journal\n\nArticle views: 536\n\nView related articles\n\nView Crossmark data\n\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rwhi20",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2314,
              "width": 1762
            }
          },
          {
            "index": 1,
            "markdown": "11\n\n# I. THE SLOW AND IMPRECISE ART OF CYBER WARFARE\n\nJUSTIN BRONK AND JACK WATLING\n\nSally Walker, former Director of Cyber at GCHQ, has stated that cyber attacks 'can have impact in the real world and you can do it at scale'.¹ Because cyber attacks can target everything from financial systems and critical national infrastructure to political leaders and legal institutions – undermining trust and the rule of law – they can have an 'attrition' effect on the cohesion of states to which open societies 'are uniquely vulnerable'.² Such warnings over the years, combined with high-profile incidents like the WannaCry ransomware attack against the NHS, have meant that military leaders have recognised the importance of the 'cyber domain'.³ When new forms of conflict first emerge, however, there is almost always a period of inflated expectation.⁴ For the small community within Defence who have worked in the margins to explore the novel capability, there is a tendency to hype its effects and downplay its limitations in order to gain the attention of the wider defence and security community and secure resources within the bureaucracy. For that wider community – lacking an understanding of the capability – it is often much easier to visualise the potential threats posed by novel weapons than the challenges involved in employing them effectively. Cyber warfare today is arguably at the peak of this inflated discourse,\n\n¹ Sally Walker, 'Into the Grey Zone Podcast: Episode Five – Cyber Power (Part II)', Sky News, 3 June 2021, 06:00, <https: into-the-grey-zone-podcast-episode-five-cyber-power-part-ii-12212228=\"\" news.sky.com=\"\" story=\"\">, accessed 26 July 2021.\n² Ibid., 10:30.\n³ National Audit Office, Investigation: WannaCry Cyber Attack and the NHS, HC 414 (London: National Audit Office, 2018).\n⁴ This is visualised in Gartner, 'Gartner Hype Cycle', <https: gartner-hype-cycle=\"\" en=\"\" methodologies=\"\" research=\"\" www.gartner.com=\"\">, accessed 30 March 2021.</https:></https:>",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 2,
            "markdown": "Justin Bronk and Jack Watling\n\nwhere its importance is recognised but its implications remain poorly understood beyond the limited community of technical specialists.\n\nIn briefings, military commanders often characterise cyber capabilities by the speed, scale and sophistication of the effect. Outlining the challenge of 'convergence' between warfighting domains, Lieutenant General Eric Wesley described how 'cyber is moving at milliseconds, ships are moving at 30 knots, vehicles at 30 km. The ability to synchronise that might be a bit of a stretch'. As well as an expectation of near-instantaneous effects, there is a persistent fear of the devastation that could be wrought. General Wesley Clark, former NATO Supreme Commander Europe, warned that 'it's possible to shut down critical infrastructure, refineries, businesses, banks, transportation – but most importantly, the electricity grid. It's been done by the Russians in the Ukraine'. Finally, there is a great deal of anxiety in militaries about the sophistication of cyber effects against conventional military systems. General John Allen, for instance, hypothesised about an incident in which a US Navy vessel had its defensive systems rendered ineffective by cyber attack, making it vulnerable to conventional munitions.\n\nA more thorough examination of the mechanics of cyber warfare renders much of this military discourse highly hyperbolic. Although data can travel quickly, cyber attacks are slow to develop and deliver, and often unpredictable and isolated in their effects. The challenge with integrating cyber effects into multi-domain operations is the opposite of the problem suggested by Wesley – that cyber attacks take far too long to easily synchronise with conventional operations. As Walker noted, 'it just doesn't relate to conventional warfare'. A realistic appreciation of the impact of cyber capabilities on the future of warfare must begin with a concrete understanding of how cyber attacks work. Appreciating what is required to attack a digital system reveals its limitations and so allows for the potential impact of such techniques on warfare to be put into perspective. This chapter seeks to explain how cyber attacks function and suggests their likely trajectory on the future battlefield.[9]\n\n[5] US Department of Defense, 'AUSA Global Force Symposium: Day 3 – Opening Remarks and Keynote Speaker', 18 March 2021, 35:00, <https: dod.defense.gov=\"\" index?videoid=\"668339\" news=\"\" special-reports=\"\" videos=\"\">, accessed 26 July 2021.\n\n[6] Mandi Kogosowski, “We’re on the Brink of an Enormous Cyber Catastrophe”, *Israel Defense*, 4 June 2021, <https: 49194=\"\" en=\"\" node=\"\" www.israeldefense.co.il=\"\">, accessed 26 July 2021.\n\n[7] John R Allen and Amir Hussain, 'On Hyperwar', *Proceedings Magazine* (Vol. 143, No. 7, 2017), p. 1373.\n\n[8] Walker, 'Into the Grey Zone Podcast', 13:49.\n\n[9] Cyber practitioners are necessarily very precise in the language they employ. This chapter is intended to help non-cyber practitioners understand key concepts and</https:></https:>",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 3,
            "markdown": "The Slow and Imprecise Art of Cyber Warfare\n\n# The Anatomy of a Cyber Attack\n\nCyber activity is primarily concerned with the virtual dimension,¹⁰ which is characterised by its dependence on invented languages.¹¹ Information encoded in these invented languages comprises data.¹² Military cyber attacks seek to achieve at least one of three things: to access data that an adversary does not wish to share; to change the data that an adversary holds; or to destroy an adversary's data.¹³ The first requirement for conducting a cyber attack is to identify that an adversary holds data. For example, a range table for a munition in a printed handbook exists in the physical dimension as paper and in the cognitive dimension if it has been memorised by an operator, but not in the virtual dimension. If, however, the range table has been translated into data and is stored on a digital device, it exists in the virtual dimension and can be subjected to cyber attack. If this data is accessible as part of a fire control system supporting geographically dispersed artillery pieces, then that data must be remotely accessible via a network. It can therefore be attacked remotely.\n\nSince the virtual dimension is fabricated, it is usually not immediately apparent to an external party what systems have been digitised, what they are connected to, or what languages are used to store the data and manage the network. Furthermore, programming languages do not simply store information but also contain grammar for describing commands that the system can execute. These commands describe how the data is to be stored, who has permission to access it, and what checks are carried out to determine who each user is. All of these facets of a network are invisible to an intruder until they have interacted with part of that\n\nuses analogy and imprecise terms to aid accessibility. The authors apologise to specialists in the field for the resulting lack of precision.\n\n¹⁰ Ministry of Defence, 'Joint Doctrine Publication 0-30: UK Air and Space Power', 2ⁿᵈ edition, December 2017, p. 17.\n¹¹ David J Peterson, *Art of Language Invention, The: From Horse-Lords to Dark Elves to Sand Worms, the Words Behind World-Building* (London: Penguin, 2015), pp. 21–22.\n¹² The subset of invented languages used in computing comprises markup and programming languages. Markup languages allow the programming instructions to not be displayed when displaying data in a non-programming language. See Thomas Powell, *HTML &amp; XHTML: The Complete Reference* (New York, NY: McGraw-Hill, 2003), p. 25. Programming languages use imperative and declarative syntax to describe and command the execution of specified functions, see Michael Gordon, *Programming Language Theory and Its Implementation* (Hoboken: Prentice Hall, 1988).\n¹³ These offensive aims can be understood as the offensive mirror image of the CIA's triad model of cybersecurity principles: confidentiality; integrity; and availability. See 'What Is Security Analysis?', <https: cia.htm=\"\" security=\"\" www.doc.ic.ac.uk=\"\" ~ajs300=\"\">, accessed 21 October 2021.</https:>",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 4,
            "markdown": "Justin Bronk and Jack Watling\n\nnetwork. Therefore, having determined that a digital target exists, an attacker must seek to intrude into the network which contains it, and exfiltrate data to determine how that network is constructed and by what languages it is governed.\n\nA lack of information about a network makes designing penetrations that are difficult to detect almost impossible, just as it is very difficult for a non-native speaker of a language to pass as a native speaker.[14] For this reason, the initial penetration and mapping of networks involves an extensive reconnaissance effort. Attackers will often conduct a high volume of unsophisticated attacks on the basis that while only a few will make any headway into the network, they will generate valuable information about which nodes in the network hold administrative privileges and how the protocols that govern the network function.[15] Large-scale unsophisticated attacks produce a constant noise so that adversaries cannot necessarily determine what is being targeted. In many ways, this is because the purpose is to find what targets might be available. This is comparable to a reconnaissance by force, or advance to contact, rather than a deliberate reconnaissance. However, the defenders will try to identify who is perpetrating this reconnaissance in order to anticipate what subsequent, more sophisticated attacks might look like.[16]\n\nOnce the shape of a network and the location of data and privileges are identified, an attacker will begin to craft specialised attacks to gain access to those points. This will often require detailed information about the humans who govern these points in the network, and how they interact with it in the physical dimension, because this can provide valuable information about how to attack the system.[17] These deliberate attacks against identified nodes must be carried out without being detected. If an intrusion is detected, the defender can simply sever the node that has been penetrated or change the permissions to deny it any useful access to the rest of the network. At that point, the attacker must\n\n[14] Simon Müller, 'Discourse Makers in Native and Non-Native English Discourse', PhD submission to Justus Liebig University Giessen, Amsterdam, 2004; Melissa M Baese-Berk and Tuuli H Morrill, 'Speaking Rate Consistency in Native and Non-Native Speakers of English', *Journal of the Acoustical Society of America* (Vol. 138, No. 3, 2015), pp. 223–28.\n\n[15] H P Sanghvi and M S Dahiya, 'Cyber Reconnaissance: An Alarm Before Cyber Attack', *International Journal of Computer Applications* (Vol. 63, No. 6, 2013), pp. 36–38.\n\n[16] This is the purpose of cyber threat intelligence. See Henry Dalziel, *How to Define and Build an Effective Cyber Threat Intelligence Capability* (Waltham, MA: Syngress, 2015).\n\n[17] Micah Zenko, *Red Team: How to Succeed by Thinking Like the Enemy* (New York, NY: Basic Books, 2015), pp. 171–83.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 5,
            "markdown": "The Slow and Imprecise Art of Cyber Warfare\n\nbegin from scratch against a defender that has gained information about the attacker's techniques and signature.\n\nAfter a critical node is penetrated, data from it must be exfiltrated and analysed to allow the attacker to see further into the network and target the next node up the chain. Ultimately, the aim is for the attacker to gain access to repositories of data, or to components of a system that can control other parts of the system. Whereas most parts of a network have the right to read a limited set of data, some administrative nodes have permission to rewrite the instructions governing the system. Attackers seek access to administrators because these accounts can change or destroy the data or physical infrastructure that constitute the enemy system. For example, an administrator for a fire control system might substitute an accurate range table for an inaccurate one, ensuring the artillery system as a whole misses any target it tries to engage. Alternatively, it could delete the range table so that the system cannot calculate firing solutions. The administrator could even delete the instructions for the system to read a range table, and then destroy the instructions for the system to accept new instructions so that the defender cannot simply upload a new range table when the data is found to be missing.\n\nAlmost all components of a network will be subject to varying levels of encryption which must be cracked or bypassed by an attacker at each stage. This could require the entry of a simple password, or for more sensitive and better defended systems, a three-part authentication comprising something known by the individual who owns the node (a password), something they have (a physical key), and something they are (biometric data). Passwords to confirm that someone requesting access to a system is the right individual can be cracked through a brute force (guessing all possible combinations) or analytical attack. The latter method can be invalidated by randomly generating passwords. In practice, any effectively defended system will have millions of possible solutions to passwords at each level, and incorrect entries will attract the attention of defenders. For this reason, attackers will endeavour to bypass passwords through hacking. Hacking involves the interrogation of the code to find ambiguities through which an attack can convince the system that a password is not necessary or has been entered when it has not.[18]\n\n[18] There is an alternative distinction drawn between hacking and cracking that is framed in ethical terms, with the former being constructive and the latter destructive. In practice, this ethical distinction – while important in the early days of the internet – has fragmented. See John P Carlin with Garrett M Graff, *Dawn of the Code War: America's Battle Against Russia, China, and the Rising Global Cyber Threat* (New York, NY: Public Affairs, 2018), chapter 1.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 6,
            "markdown": "Justin Bronk and Jack Watling\n\nTo envisage how a hack works, consider the consequences of someone using poor grammar, as in the sentence: 'Correct and verified, the user may decrypt the data'. In conversation, this can be understood to mean 'if the user has been correctly identified and verified, then they may decrypt the data'. However, the sentence could equally be literally interpreted as saying 'the user is correct and verified and may decrypt the data'. A hack would suggest to the system that it should proceed with the latter interpretation. Because complex code involves thousands of lines of instruction, often written by multiple people at different times, there will often be minor contradictions or ambiguities that can be discovered and then leveraged by an attacker.[19]\n\nWhen these ambiguities and contradictions are part of the code in a system, they are termed 'zero-days' because they are vulnerabilities that were introduced into the system by the way it was designed, and at the time of discovery represent an open vulnerability that has not been patched, leaving defenders with zero days to resolve the problem. By storing zero-day exploits which they discover through reconnaissance efforts, an attacker can subsequently employ them to bypass a system's defences. However, just as the poor grammar cited above can be clarified, so too can a defender clarify their coding to make a system more secure. If, therefore, they identify that a zero-day exploit has enabled penetration of their network, they can often patch the system to edit out and close the vulnerability, or else closely monitor it to gain intelligence on potential ongoing or future attacks. Consequently, attackers must make a trade-off between the value of accessing a system at any given time and the risk of losing the ability to bypass its encryption or being rapidly attributed and potentially counter-attacked if discovered.\n\nAttacking sensitive digital systems is further complicated by the fact that they are often air-gapped, meaning they are not susceptible to remote access. This means that, to attack them, an adversary must either create an artificial connection to the outside world or physically plug into the air-gapped network without being detected. This may require multiple physical penetrations since the first intrusion may simply allow the attacker to collect information about what language the system uses and how it is structured. They must then physically penetrate the system a second time to deliver a designed payload to attack it. If they do not wish to immediately activate the delivered payload, they may need to\n\n[19] A common issue is poor hygiene in compound coding for signifier/signified correlation. See Paolo Rocchi, 'The Concepts of Signifier/Signified Revisited', IBM, <http: dtmd=\"\" rocchi.pdf=\"\" presentations=\"\" mcs.open.ac.uk=\"\" session%202=\"\">, accessed 30 March 2021.</http:>",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 7,
            "markdown": "The Slow and Imprecise Art of Cyber Warfare\n\npenetrate the system a third time to trigger the attack at the desired point in time.\n\nA cyber attack may therefore be envisaged as comprising seven stages:\n\n1. Reconnaissance: to understand the target network.\n2. Weaponisation: designing a payload to exploit vulnerabilities.\n3. Delivery: insertion of the payload through the system.\n4. Exploitation: using new access to identify and target the key node.\n5. Installation: installing the payload at the target node of the system.\n6. Command and control: having a means of initiating the payload.\n7. Action on objectives: having the desired effect on the system.²⁰\n\nAttempting to gain entry to a complex defended system may require several iterations of this cycle as the attackers fight their way into the network. Against a complex network with multiple layers, which ultimately ends in an air-gapped component, working into a network may take between one and three years.²¹ While embedding malicious capabilities into public utilities or other legacy civilian systems may be more straightforward,²² attacking military systems is complex, sensitive and has a significant lead time, requiring payloads to be embedded during peacetime if they are to be available during war.\n\nIf a cyber attack is prosecuted in peacetime and the payload initiated before the outbreak of war, its effects will either be limited or escalatory. For example, to return to the artillery fire control system, if it were penetrated and the range tables altered prior to a conflict, this could mean that the change would be noticed during an exercise, the range tables corrected and the system security patched prior to a conflict. Alternatively, it could mean that during the same exercise the artillery kills friendly forces. This would lead to an investigation and, if the cause could be attributed to a hostile cyber attack, it would lead to a significant\n\n²⁰ Joseph Raczynski, ‘Kill Chain: The 7 Stages of a Cyberattack’, *Thomson Reuters*, 12 October 2018.\n²¹ Author interview with a senior CTI director at a major bank, March 2021; author interview with a senior military cyber warfare officer, February 2021; author interview with a law enforcement officer specialising in counter-cyber operations, January 2021.\n²² House of Commons, ‘A Major Cyber Attack on the UK is a Matter of “When, Not If”’, Joint Committee on the National Security Strategy, 22 January 2018, <https: index.html=\"\" jcnss-cni-report=\"\" houseofcommons.shorthandstories.com=\"\">, accessed 30 March 2021.</https:>",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 8,
            "markdown": "Justin Bronk and Jack Watling\n\nescalation in tensions or could even be interpreted by the victim as a casus belli.²³\n\nConversely, a cyber payload that sits dormant in a system until activated during a conflict presents other challenges. It must either be activated automatically when certain criteria are met or manually. The latter requires a sustained capacity to connect to the system at short notice to be maintained by the attacker. For military systems – given the changes that occur when a state transitions to war – this may be difficult, requiring the embedding of agents with knowledge of the penetration inside the enemy force. However, a payload that monitors the system so that it can activate under certain conditions is an active rather than passive insertion and is, therefore, more susceptible to detection. It could also activate under circumstances unforeseen by the attacker.\n\nThe final limitation of a military cyber capability is that cyber attacks function by inserting data into a system so that it is directed to behave in a specific manner. It is effective not in itself, but because of how the payload interacts with the rest of the system. Because the system is fabricated, however, and the language invented, it is subject to being expanded, divided, updated and changed in fundamental ways. Therefore, a payload that must remain dormant may be activated only to find that the surrounding environment has been altered to the extent that its code no longer makes any sense within the language with which it is supposed to interact. A well-defended system will be periodically patched so that changes like this should be routine. The result is that while militaries may spend years embedding capabilities into a network, they have no guarantees that when the time comes it will function as anticipated. Consequently, cyber attacks are unpredictable in their effects and are difficult to synchronise with established military planning and operations. This is a significant limitation, as the high lethality, mobility and relatively low quantities of most modern military capabilities mean that precise timing and coordination between different joint force elements are even more essential than they were in previous eras.\n\n## The Military Application of Cyber Weapons\n\nThere are limited scenarios in which a cyber attack can have a decisive operational or strategic effect when used in isolation. The most famous strategic cyber attack is the Stuxnet worm which formed part of a series of attacks on Iranian nuclear fuel enrichment centrifuges from 2008.²⁴\n\n²³ Jens Stoltenberg, ‘NATO Will Defend Itself’, NATO, last updated 29 August 2019, <https: en=\"\" en=\"\" natohq=\"\" news_168435.htm?selectedlocale=\"en\" www.nato.int=\"\">, accessed 30 March 2021.</https:>",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 9,
            "markdown": "The Slow and Imprecise Art of Cyber Warfare\n\nEstimates vary but some suggest that enough disruption was caused to set back Iranian nuclear enrichment by 18 to 24 months. However, the system reconnaissance and infiltration process took years, having reportedly begun in 2005.²⁵ Furthermore, when Stuxnet leaked accidentally beyond the air-gapped nuclear facility network, its code was subsequently identified and analysed by states and cyber security firms around the world. This resulted in public attribution of the Stuxnet attack itself to intelligence agencies in the US and Israel, as well as the probable attribution of other cyber weapons which appear to function in a similar manner.²⁶ It also gave Iran and other national and civilian organisations the opportunity to examine a strategic cyber payload described by a senior cyber security professional as 'by far the most complex piece of code that we've looked at – in a completely different league from anything we'd ever seen before'.²⁷\n\nThe Stuxnet leak, and the US/Israeli cyber operations against Iran's uranium enrichment programme as a whole, illustrate some of the key practical characteristics of cyber warfare as a standalone tool of national power. Attacks on defended systems require years of preparation to identify, infiltrate and exploit weak points. Once triggered, even very sophisticated payloads will be discovered, analysed and ultimately identified. The effects created can only ever be temporary in isolation, as states will patch their systems and replace damaged machinery if not prevented from doing so by other means. When the payloads are ultimately identified and analysed, peer and near-peer states can use insights gained to ascribe probable attribution, and also potentially to develop or enhance their own offensive cyber capabilities.\n\nLess sophisticated cyber payloads than Stuxnet-type cyber weapons can still be highly effective in causing standalone disruption and potentially physical damage if conducted against less defended systems such as those which control civilian infrastructure. Examples include the attack on a German steel mill in 2014, and the WannaCry ransomware attacks which caused major disruption to the NHS in 2017.²⁸ States such as Russia and\n\n²⁴ David E Sanger, ‘Obama Order Sped Up Wave of Cyberattacks Against Iran’, *New York Times*, 1 June 2012.\n²⁵ *Ibid.*\n²⁶ Josh Fruhlinger, ‘What is Stuxnet, Who Created It and How Does It Work?’, *CSO Online*, 22 August 2017, <https: 3218104=\"\" article=\"\" what-is-stuxnet-who-created-it-and-how-does-it-work.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.\n²⁷ *Ibid.*\n²⁸ TrendMicro, ‘German Steel Plant Suffers Significant Damage from Targeted Attack’, 12 January 2015, <https: fr=\"\" security=\"\" news=\"\" cyber-attacks=\"\" german-steel-plant-suffers-significant-damage-from-targeted-attack=\"\" www.trendmicro.com=\"\" vinfo=\"\">, accessed 3 March 2021; Josh Fruhlinger, ‘What Is WannaCry Ransomware, How</https:></https:>",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 10,
            "markdown": "Justin Bronk and Jack Watling\n\nNorth Korea regularly use quasi-criminal groups of hackers operating under loose state direction to demonstrate to expert communities their ability to disrupt and even directly damage civilian industry and critical national infrastructure (CNI). This capability is then tacitly leveraged to enhance deterrence messaging against potential state opponents. Some of these attacks exploit zero-day vulnerabilities, but most employ simple massed phishing attacks to infiltrate potential target networks. As such, they are much more effective against networks which rely on commercial operating systems which are well understood, do not use three-factor authentication security procedures and may be slow to implement security patches. The purpose of most attacks of this nature is also far less specific than strategic cyber weapons such as Stuxnet; either theft of information across a broad industrial sector, extortion or simply disruption for its own sake.\n\nFor most Western states, there are significant legal and ethical barriers to the use of offensive cyber capabilities against civilian targets, at least in any overt attempt at deterrence messaging. In any case, the ability to infiltrate civilian infrastructure and cause temporary disruption or even limited destructive effects is unlikely to deter a state opponent from conventional military action if it has already committed to such a high-risk course of action. The recent conflicts in eastern Ukraine and Nagorno-Karabakh provide compelling evidence that states are prepared to suffer extensive damage to both civilian and military targets without backing down from kinetic confrontations where national interests are clearly defined. As such, the immediate question for those who see the apocryphal cyber capability to 'turn out the lights in Moscow' as a cheaper replacement for conventional and nuclear deterrence tools is: what effect would such an attack have on a determined adversary, and for how long? It is perhaps ironic that hyperbolic narratives, such as that advanced by Nicole Perlroth,²⁹ use Ukraine as the example of how devastating cyber attacks can be, while somehow overlooking the extent to which Ukraine has weathered and recovered from Russia's cyber onslaught.\n\nWhilst there are few situations in which cyber weapons can replace more traditional forms of military capability outright, there are many potential ways in which offensive cyber tools can be used as part of joint operations. For example, a previously inserted cyber payload might be\n\nDoes it Infect, and Who Was Responsible?, CSO Online, 30 August 2018, <https: 3227906=\"\" article=\"\" what-is-wannacry-ransomware-how-does-it-infect-and-who-was-responsible.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.\n\n²⁹ Nicole Perlroth, This Is How They Tell Me the World Ends: The Cyberweapons Arms Race (London: Bloomsbury, 2021).</https:>",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 11,
            "markdown": "The Slow and Imprecise Art of Cyber Warfare\n\nused to disable or disrupt key adversary defence systems at a critical moment to enable a conventional attacking force to physically bypass or destroy them. Israel allegedly carried out just such an attack against the Syrian air defence network in 2007.³⁰ The normally bristling air defence network was rendered blind to an Israeli Air Force strike package which entered Syrian airspace, bombed a nuclear facility and withdrew unchallenged.³¹ It is still unclear in the public domain whether this was a case of a cyber payload or advanced electronic warfare techniques opening the door for the Israeli aircraft. In general terms, whereas cyber attacks involve the theft, alteration or deletion of data, electronic warfare involves the detection or disruption of enemy sensors and the transmission of data using electromagnetic energy. While both rely on an attacker having knowledge of how a target system operates, electronic warfare can be applied as an active effect in real time without lengthy network reconnaissance, infiltration and payload activation. In practice, the line between the two techniques is increasingly blurring. For example, information about the exact software and hardware configurations of a radar, obtained via cyber attacks against the defence network which it sits within, might be used to tailor sophisticated electronic warfare attack options using digital emitters such as active electronically scanned array radar sets. In this context, however, the cyber attack would have occurred long before the electronic attack, with the theft of data enabling conventional electronic warfare capabilities. What is clear, however, is that the Israeli attack in 2007 was successful because it blended cyber and/or electronic attack with a precisely choreographed application of traditional firepower. The attack on the Syrian air defence network itself was not intended to create strategic effects, but as an enabling capability it greatly reduced the risk profile and increased the effectiveness of an otherwise conventional strike operation.\n\nThe use of cyber attacks to 'open the door' for conventional forces in this way is dependent on several key factors. First, that the potential target can be identified well in advance of any requirement to exploit a breach. This is to allow sufficient time for the required reconnaissance, penetration and delivery stages of cyber attack preparation to be conducted. Second, in the case of an attack against a target such as an integrated air defence system (IADS), this activity will have to be coordinated with traditional intelligence gathering about the physical\n\n³⁰ Sharon Weinberger, 'How Israel Spoofed Syria's Air Defense System', WIRED, 4 October 2007.\n³¹ BBC News, 'Israel Admits Striking Suspected Syrian Nuclear Reactor in 2007', 21 March 2018.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 12,
            "markdown": "locations, individual system capabilities and patterns of movement exhibited by the radars and missile launchers themselves. This is so that the required virtual effects can be identified in terms of practical effects in the physical dimension, and it requires in-depth intelligence which will need to be gathered in multiple domains. This in turn introduces a third dependency for using cyber weapons in this way to enable conventional attacks; permissions and security clearance levels. Continuing with the IADS example, the required physical and network reconnaissance and intelligence-gathering activities would likely draw on resources from air force(s), multiple intelligence agencies and special forces operations. Many of these assets will require very high-level authorisation for tasking, and the products generated will be highly classified and not widely distributed within the military as a whole. As such, the successful use of cyber attacks as a coordinated enabler for conventional military operations requires operational planners to be aware of the art of the possible, in areas where they are unlikely to be in most countries by default. The final major dependency for this sort of attack is a linked one. Imagine a case where a cyber capability has been successfully developed and implanted with a compatible activation mechanism in a specific adversary defence system, and an operational commander is aware of it. In order to employ it, that commander must be able to justify its use to enable their conventional operation, given that once the cyber weapon is used the adversary will rapidly reset their systems, discover the vulnerability and patch it. In the case of the 2007 attack by the Israeli Air Force on a Syrian nuclear reactor, head of state authorisation would almost certainly have been granted for the operation, and the expending of a developed cyber capability (if indeed it was one) embedded over several years in the Syrian IADS deemed worthwhile to enable it. However, for more routine or ongoing military operations, cyber weapons will likely remain a capability held for specific situations rather than a regular feature. Furthermore, if military operations take place in an unforeseen context, it is unlikely that sufficient time will be available to prepare as thoroughly as Israel was able to do against its traditional rival to the north.\n\nA more ad-hoc use of disruptive cyber operations against CNI and military enabling capabilities is more likely to characterise the routine use of cyber capabilities in warfare in the coming decade. If the requirement is not to create a catastrophic failure in key military systems at a specific point in time to directly enable conventional operations, then the",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 13,
            "markdown": "The Slow and Imprecise Art of Cyber Warfare\n\ndependencies placed on cyber specialists are less onerous. For example, Russia has conducted a range of cyber attacks against Ukrainian military and civilian systems as part of its hybrid war against the country since 2014. These have included attacks on Ukrainian military communications in coordination with intensive electronic warfare operations, as well as attacks on the national power grid and banking system. The result was to impose further disruption and costs on the government in Kyiv in conjunction with sustained direct and indirect military support to rebel groups in Donetsk and Luhansk oblasts. In other words, cyber warfare offers states another vector through which to pressure opposing states in conjunction with traditional hard and soft power tools. In a NATO context, obvious potential targets for Russian cyber attacks in the event of a major crisis or limited conflict would be the networks which control the civilian port and rail infrastructure which would be critical for mobilisation and the deployment of conventional military forces to eastern Europe. Such attacks could have significant or even decisive effects on the strategic picture for the Alliance if coupled with sustained conventional and nuclear force posturing. However, on their own, they would only delay rather than prevent military capabilities being brought to bear.\n\nIn considering the impact of cyber warfare on future operations, militaries are clearly correct to be taking the security of their systems seriously. Offensive cyber operations offer opportunities to gain contextual tactical advantage by disrupting the functioning of enemy systems and undermining the adversary's confidence in their equipment. They also allow for the shaping of the human terrain around which fighting takes place when aimed at civilian systems. Nevertheless, cyber attacks should not be seen as an alternative to hard power. Nor can cyber attacks function as a standalone solution.\n\nFinally, the opportunities offered by offensive cyber capabilities are difficult to guarantee at a specified time and place, and so cannot be relied on as a foundational capability in deterrence terms. Cyber warfare is real and cannot be ignored. But for now, it remains slow and imprecise compared to more traditional levers of military power.\n\n23",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 14,
          "doc_size_bytes": 370470
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "Noosey Harcoins\nWhitehall Papers\nRoutledge Taylor &amp; Francis Group\nISSN: 0268-1307 (Print) 1754-5382 (Online) Journal homepage: www.tandfonline.com/journals/rwhi20\n# I. The Slow and Imprecise Art of Cyber Warfare\nJustin Bronk &amp; Jack Watling\nTo cite this article: Justin Bronk &amp; Jack Watling (2021) I. The Slow and Imprecise Art of Cyber Warfare, Whitehall Papers, 99:1, 11-23, DOI: 10.1080/02681307.2021.2005891\nTo link to this article: https://doi.org/10.1080/02681307.2021.2005891\nPublished online: 06 Dec 2021.\nSubmit your article to this journal\nArticle views: 536\nView related articles\nView Crossmark data\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rwhi20\n11\n# I. THE SLOW AND IMPRECISE ART OF CYBER WARFARE\nJUSTIN BRONK AND JACK WATLING\nSally Walker, former Director of Cyber at GCHQ, has stated that cyber attacks 'can have impact in the real world and you can do it at scale'.¹ Because cyber attacks can target everything from financial systems and critical national infrastructure to political leaders and legal institutions – undermining trust and the rule of law – they can have an 'attrition' effect on the cohesion of states to which open societies 'are uniquely vulnerable'.² Such warnings over the years, combined with high-profile incidents like the WannaCry ransomware attack against the NHS, have meant that military leaders have recognised the importance of the 'cyber domain'.³ When new forms of conflict first emerge, however, there is almost always a period of inflated expectation.⁴ For the small community within Defence who have worked in the margins to explore the novel capability, there is a tendency to hype its effects and downplay its limitations in order to gain the attention of the wider defence and security community and secure resources within the bureaucracy. For that wider community – lacking an understanding of the capability – it is often much easier to visualise the potential threats posed by novel weapons than the challenges involved in employing them effectively. Cyber warfare today is arguably at the peak of this inflated discourse,\n¹ Sally Walker, 'Into the Grey Zone Podcast: Episode Five – Cyber Power (Part II)', Sky News, 3 June 2021, 06:00, <https: into-the-grey-zone-podcast-episode-five-cyber-power-part-ii-12212228=\"\" news.sky.com=\"\" story=\"\">, accessed 26 July 2021.\n² Ibid., 10:30.\n³ National Audit Office, Investigation: WannaCry Cyber Attack and the NHS, HC 414 (London: National Audit Office, 2018).\n⁴ This is visualised in Gartner, 'Gartner Hype Cycle', <https: gartner-hype-cycle=\"\" en=\"\" methodologies=\"\" research=\"\" www.gartner.com=\"\">, accessed 30 March 2021.</https:></https:>\nJustin Bronk and Jack Watling\nwhere its importance is recognised but its implications remain poorly understood beyond the limited community of technical specialists.\nIn briefings, military commanders often characterise cyber capabilities by the speed, scale and sophistication of the effect. Outlining the challenge of 'convergence' between warfighting domains, Lieutenant General Eric Wesley described how 'cyber is moving at milliseconds, ships are moving at 30 knots, vehicles at 30 km. The ability to synchronise that might be a bit of a stretch'. As well as an expectation of near-instantaneous effects, there is a persistent fear of the devastation that could be wrought. General Wesley Clark, former NATO Supreme Commander Europe, warned that 'it's possible to shut down critical infrastructure, refineries, businesses, banks, transportation – but most importantly, the electricity grid. It's been done by the Russians in the Ukraine'. Finally, there is a great deal of anxiety in militaries about the sophistication of cyber effects against conventional military systems. General John Allen, for instance, hypothesised about an incident in which a US Navy vessel had its defensive systems rendered ineffective by cyber attack, making it vulnerable to conventional munitions.\nA more thorough examination of the mechanics of cyber warfare renders much of this military discourse highly hyperbolic. Although data can travel quickly, cyber attacks are slow to develop and deliver, and often unpredictable and isolated in their effects. The challenge with integrating cyber effects into multi-domain operations is the opposite of the problem suggested by Wesley – that cyber attacks take far too long to easily synchronise with conventional operations. As Walker noted, 'it just doesn't relate to conventional warfare'. A realistic appreciation of the impact of cyber capabilities on the future of warfare must begin with a concrete understanding of how cyber attacks work. Appreciating what is required to attack a digital system reveals its limitations and so allows for the potential impact of such techniques on warfare to be put into perspective. This chapter seeks to explain how cyber attacks function and suggests their likely trajectory on the future battlefield.[9]\n[5] US Department of Defense, 'AUSA Global Force Symposium: Day 3 – Opening Remarks and Keynote Speaker', 18 March 2021, 35:00, <https: dod.defense.gov=\"\" index?videoid=\"668339\" news=\"\" special-reports=\"\" videos=\"\">, accessed 26 July 2021.\n[6] Mandi Kogosowski, “We’re on the Brink of an Enormous Cyber Catastrophe”, *Israel Defense*, 4 June 2021, <https: 49194=\"\" en=\"\" node=\"\" www.israeldefense.co.il=\"\">, accessed 26 July 2021.\n[7] John R Allen and Amir Hussain, 'On Hyperwar', *Proceedings Magazine* (Vol. 143, No. 7, 2017), p. 1373.\n[8] Walker, 'Into the Grey Zone Podcast', 13:49.\n[9] Cyber practitioners are necessarily very precise in the language they employ. This chapter is intended to help non-cyber practitioners understand key concepts and</https:></https:>\nThe Slow and Imprecise Art of Cyber Warfare\n# The Anatomy of a Cyber Attack\nCyber activity is primarily concerned with the virtual dimension,¹⁰ which is characterised by its dependence on invented languages.¹¹ Information encoded in these invented languages comprises data.¹² Military cyber attacks seek to achieve at least one of three things: to access data that an adversary does not wish to share; to change the data that an adversary holds; or to destroy an adversary's data.¹³ The first requirement for conducting a cyber attack is to identify that an adversary holds data. For example, a range table for a munition in a printed handbook exists in the physical dimension as paper and in the cognitive dimension if it has been memorised by an operator, but not in the virtual dimension. If, however, the range table has been translated into data and is stored on a digital device, it exists in the virtual dimension and can be subjected to cyber attack. If this data is accessible as part of a fire control system supporting geographically dispersed artillery pieces, then that data must be remotely accessible via a network. It can therefore be attacked remotely.\nSince the virtual dimension is fabricated, it is usually not immediately apparent to an external party what systems have been digitised, what they are connected to, or what languages are used to store the data and manage the network. Furthermore, programming languages do not simply store information but also contain grammar for describing commands that the system can execute. These commands describe how the data is to be stored, who has permission to access it, and what checks are carried out to determine who each user is. All of these facets of a network are invisible to an intruder until they have interacted with part of that\nuses analogy and imprecise terms to aid accessibility. The authors apologise to specialists in the field for the resulting lack of precision.\n¹⁰ Ministry of Defence, 'Joint Doctrine Publication 0-30: UK Air and Space Power', 2ⁿᵈ edition, December 2017, p. 17.\n¹¹ David J Peterson, *Art of Language Invention, The: From Horse-Lords to Dark Elves to Sand Worms, the Words Behind World-Building* (London: Penguin, 2015), pp. 21–22.\n¹² The subset of invented languages used in computing comprises markup and programming languages. Markup languages allow the programming instructions to not be displayed when displaying data in a non-programming language. See Thomas Powell, *HTML &amp; XHTML: The Complete Reference* (New York, NY: McGraw-Hill, 2003), p. 25. Programming languages use imperative and declarative syntax to describe and command the execution of specified functions, see Michael Gordon, *Programming Language Theory and Its Implementation* (Hoboken: Prentice Hall, 1988).\n¹³ These offensive aims can be understood as the offensive mirror image of the CIA's triad model of cybersecurity principles: confidentiality; integrity; and availability. See 'What Is Security Analysis?', <https: cia.htm=\"\" security=\"\" www.doc.ic.ac.uk=\"\" ~ajs300=\"\">, accessed 21 October 2021.</https:>\nJustin Bronk and Jack Watling\nnetwork. Therefore, having determined that a digital target exists, an attacker must seek to intrude into the network which contains it, and exfiltrate data to determine how that network is constructed and by what languages it is governed.\nA lack of information about a network makes designing penetrations that are difficult to detect almost impossible, just as it is very difficult for a non-native speaker of a language to pass as a native speaker.[14] For this reason, the initial penetration and mapping of networks involves an extensive reconnaissance effort. Attackers will often conduct a high volume of unsophisticated attacks on the basis that while only a few will make any headway into the network, they will generate valuable information about which nodes in the network hold administrative privileges and how the protocols that govern the network function.[15] Large-scale unsophisticated attacks produce a constant noise so that adversaries cannot necessarily determine what is being targeted. In many ways, this is because the purpose is to find what targets might be available. This is comparable to a reconnaissance by force, or advance to contact, rather than a deliberate reconnaissance. However, the defenders will try to identify who is perpetrating this reconnaissance in order to anticipate what subsequent, more sophisticated attacks might look like.[16]\nOnce the shape of a network and the location of data and privileges are identified, an attacker will begin to craft specialised attacks to gain access to those points. This will often require detailed information about the humans who govern these points in the network, and how they interact with it in the physical dimension, because this can provide valuable information about how to attack the system.[17] These deliberate attacks against identified nodes must be carried out without being detected. If an intrusion is detected, the defender can simply sever the node that has been penetrated or change the permissions to deny it any useful access to the rest of the network. At that point, the attacker must\n[14] Simon Müller, 'Discourse Makers in Native and Non-Native English Discourse', PhD submission to Justus Liebig University Giessen, Amsterdam, 2004; Melissa M Baese-Berk and Tuuli H Morrill, 'Speaking Rate Consistency in Native and Non-Native Speakers of English', *Journal of the Acoustical Society of America* (Vol. 138, No. 3, 2015), pp. 223–28.\n[15] H P Sanghvi and M S Dahiya, 'Cyber Reconnaissance: An Alarm Before Cyber Attack', *International Journal of Computer Applications* (Vol. 63, No. 6, 2013), pp. 36–38.\n[16] This is the purpose of cyber threat intelligence. See Henry Dalziel, *How to Define and Build an Effective Cyber Threat Intelligence Capability* (Waltham, MA: Syngress, 2015).\n[17] Micah Zenko, *Red Team: How to Succeed by Thinking Like the Enemy* (New York, NY: Basic Books, 2015), pp. 171–83.\nThe Slow and Imprecise Art of Cyber Warfare\nbegin from scratch against a defender that has gained information about the attacker's techniques and signature.\nAfter a critical node is penetrated, data from it must be exfiltrated and analysed to allow the attacker to see further into the network and target the next node up the chain. Ultimately, the aim is for the attacker to gain access to repositories of data, or to components of a system that can control other parts of the system. Whereas most parts of a network have the right to read a limited set of data, some administrative nodes have permission to rewrite the instructions governing the system. Attackers seek access to administrators because these accounts can change or destroy the data or physical infrastructure that constitute the enemy system. For example, an administrator for a fire control system might substitute an accurate range table for an inaccurate one, ensuring the artillery system as a whole misses any target it tries to engage. Alternatively, it could delete the range table so that the system cannot calculate firing solutions. The administrator could even delete the instructions for the system to read a range table, and then destroy the instructions for the system to accept new instructions so that the defender cannot simply upload a new range table when the data is found to be missing.\nAlmost all components of a network will be subject to varying levels of encryption which must be cracked or bypassed by an attacker at each stage. This could require the entry of a simple password, or for more sensitive and better defended systems, a three-part authentication comprising something known by the individual who owns the node (a password), something they have (a physical key), and something they are (biometric data). Passwords to confirm that someone requesting access to a system is the right individual can be cracked through a brute force (guessing all possible combinations) or analytical attack. The latter method can be invalidated by randomly generating passwords. In practice, any effectively defended system will have millions of possible solutions to passwords at each level, and incorrect entries will attract the attention of defenders. For this reason, attackers will endeavour to bypass passwords through hacking. Hacking involves the interrogation of the code to find ambiguities through which an attack can convince the system that a password is not necessary or has been entered when it has not.[18]\n[18] There is an alternative distinction drawn between hacking and cracking that is framed in ethical terms, with the former being constructive and the latter destructive. In practice, this ethical distinction – while important in the early days of the internet – has fragmented. See John P Carlin with Garrett M Graff, *Dawn of the Code War: America's Battle Against Russia, China, and the Rising Global Cyber Threat* (New York, NY: Public Affairs, 2018), chapter 1.\nJustin Bronk and Jack Watling\nTo envisage how a hack works, consider the consequences of someone using poor grammar, as in the sentence: 'Correct and verified, the user may decrypt the data'. In conversation, this can be understood to mean 'if the user has been correctly identified and verified, then they may decrypt the data'. However, the sentence could equally be literally interpreted as saying 'the user is correct and verified and may decrypt the data'. A hack would suggest to the system that it should proceed with the latter interpretation. Because complex code involves thousands of lines of instruction, often written by multiple people at different times, there will often be minor contradictions or ambiguities that can be discovered and then leveraged by an attacker.[19]\nWhen these ambiguities and contradictions are part of the code in a system, they are termed 'zero-days' because they are vulnerabilities that were introduced into the system by the way it was designed, and at the time of discovery represent an open vulnerability that has not been patched, leaving defenders with zero days to resolve the problem. By storing zero-day exploits which they discover through reconnaissance efforts, an attacker can subsequently employ them to bypass a system's defences. However, just as the poor grammar cited above can be clarified, so too can a defender clarify their coding to make a system more secure. If, therefore, they identify that a zero-day exploit has enabled penetration of their network, they can often patch the system to edit out and close the vulnerability, or else closely monitor it to gain intelligence on potential ongoing or future attacks. Consequently, attackers must make a trade-off between the value of accessing a system at any given time and the risk of losing the ability to bypass its encryption or being rapidly attributed and potentially counter-attacked if discovered.\nAttacking sensitive digital systems is further complicated by the fact that they are often air-gapped, meaning they are not susceptible to remote access. This means that, to attack them, an adversary must either create an artificial connection to the outside world or physically plug into the air-gapped network without being detected. This may require multiple physical penetrations since the first intrusion may simply allow the attacker to collect information about what language the system uses and how it is structured. They must then physically penetrate the system a second time to deliver a designed payload to attack it. If they do not wish to immediately activate the delivered payload, they may need to\n[19] A common issue is poor hygiene in compound coding for signifier/signified correlation. See Paolo Rocchi, 'The Concepts of Signifier/Signified Revisited', IBM, <http: dtmd=\"\" rocchi.pdf=\"\" presentations=\"\" mcs.open.ac.uk=\"\" session%202=\"\">, accessed 30 March 2021.</http:>\nThe Slow and Imprecise Art of Cyber Warfare\npenetrate the system a third time to trigger the attack at the desired point in time.\nA cyber attack may therefore be envisaged as comprising seven stages:\n1. Reconnaissance: to understand the target network.\n2. Weaponisation: designing a payload to exploit vulnerabilities.\n3. Delivery: insertion of the payload through the system.\n4. Exploitation: using new access to identify and target the key node.\n5. Installation: installing the payload at the target node of the system.\n6. Command and control: having a means of initiating the payload.\n7. Action on objectives: having the desired effect on the system.²⁰\nAttempting to gain entry to a complex defended system may require several iterations of this cycle as the attackers fight their way into the network. Against a complex network with multiple layers, which ultimately ends in an air-gapped component, working into a network may take between one and three years.²¹ While embedding malicious capabilities into public utilities or other legacy civilian systems may be more straightforward,²² attacking military systems is complex, sensitive and has a significant lead time, requiring payloads to be embedded during peacetime if they are to be available during war.\nIf a cyber attack is prosecuted in peacetime and the payload initiated before the outbreak of war, its effects will either be limited or escalatory. For example, to return to the artillery fire control system, if it were penetrated and the range tables altered prior to a conflict, this could mean that the change would be noticed during an exercise, the range tables corrected and the system security patched prior to a conflict. Alternatively, it could mean that during the same exercise the artillery kills friendly forces. This would lead to an investigation and, if the cause could be attributed to a hostile cyber attack, it would lead to a significant\n²⁰ Joseph Raczynski, ‘Kill Chain: The 7 Stages of a Cyberattack’, *Thomson Reuters*, 12 October 2018.\n²¹ Author interview with a senior CTI director at a major bank, March 2021; author interview with a senior military cyber warfare officer, February 2021; author interview with a law enforcement officer specialising in counter-cyber operations, January 2021.\n²² House of Commons, ‘A Major Cyber Attack on the UK is a Matter of “When, Not If”’, Joint Committee on the National Security Strategy, 22 January 2018, <https: index.html=\"\" jcnss-cni-report=\"\" houseofcommons.shorthandstories.com=\"\">, accessed 30 March 2021.</https:>\nJustin Bronk and Jack Watling\nescalation in tensions or could even be interpreted by the victim as a casus belli.²³\nConversely, a cyber payload that sits dormant in a system until activated during a conflict presents other challenges. It must either be activated automatically when certain criteria are met or manually. The latter requires a sustained capacity to connect to the system at short notice to be maintained by the attacker. For military systems – given the changes that occur when a state transitions to war – this may be difficult, requiring the embedding of agents with knowledge of the penetration inside the enemy force. However, a payload that monitors the system so that it can activate under certain conditions is an active rather than passive insertion and is, therefore, more susceptible to detection. It could also activate under circumstances unforeseen by the attacker.\nThe final limitation of a military cyber capability is that cyber attacks function by inserting data into a system so that it is directed to behave in a specific manner. It is effective not in itself, but because of how the payload interacts with the rest of the system. Because the system is fabricated, however, and the language invented, it is subject to being expanded, divided, updated and changed in fundamental ways. Therefore, a payload that must remain dormant may be activated only to find that the surrounding environment has been altered to the extent that its code no longer makes any sense within the language with which it is supposed to interact. A well-defended system will be periodically patched so that changes like this should be routine. The result is that while militaries may spend years embedding capabilities into a network, they have no guarantees that when the time comes it will function as anticipated. Consequently, cyber attacks are unpredictable in their effects and are difficult to synchronise with established military planning and operations. This is a significant limitation, as the high lethality, mobility and relatively low quantities of most modern military capabilities mean that precise timing and coordination between different joint force elements are even more essential than they were in previous eras.\n## The Military Application of Cyber Weapons\nThere are limited scenarios in which a cyber attack can have a decisive operational or strategic effect when used in isolation. The most famous strategic cyber attack is the Stuxnet worm which formed part of a series of attacks on Iranian nuclear fuel enrichment centrifuges from 2008.²⁴\n²³ Jens Stoltenberg, ‘NATO Will Defend Itself’, NATO, last updated 29 August 2019, <https: en=\"\" en=\"\" natohq=\"\" news_168435.htm?selectedlocale=\"en\" www.nato.int=\"\">, accessed 30 March 2021.</https:>\nThe Slow and Imprecise Art of Cyber Warfare\nEstimates vary but some suggest that enough disruption was caused to set back Iranian nuclear enrichment by 18 to 24 months. However, the system reconnaissance and infiltration process took years, having reportedly begun in 2005.²⁵ Furthermore, when Stuxnet leaked accidentally beyond the air-gapped nuclear facility network, its code was subsequently identified and analysed by states and cyber security firms around the world. This resulted in public attribution of the Stuxnet attack itself to intelligence agencies in the US and Israel, as well as the probable attribution of other cyber weapons which appear to function in a similar manner.²⁶ It also gave Iran and other national and civilian organisations the opportunity to examine a strategic cyber payload described by a senior cyber security professional as 'by far the most complex piece of code that we've looked at – in a completely different league from anything we'd ever seen before'.²⁷\nThe Stuxnet leak, and the US/Israeli cyber operations against Iran's uranium enrichment programme as a whole, illustrate some of the key practical characteristics of cyber warfare as a standalone tool of national power. Attacks on defended systems require years of preparation to identify, infiltrate and exploit weak points. Once triggered, even very sophisticated payloads will be discovered, analysed and ultimately identified. The effects created can only ever be temporary in isolation, as states will patch their systems and replace damaged machinery if not prevented from doing so by other means. When the payloads are ultimately identified and analysed, peer and near-peer states can use insights gained to ascribe probable attribution, and also potentially to develop or enhance their own offensive cyber capabilities.\nLess sophisticated cyber payloads than Stuxnet-type cyber weapons can still be highly effective in causing standalone disruption and potentially physical damage if conducted against less defended systems such as those which control civilian infrastructure. Examples include the attack on a German steel mill in 2014, and the WannaCry ransomware attacks which caused major disruption to the NHS in 2017.²⁸ States such as Russia and\n²⁴ David E Sanger, ‘Obama Order Sped Up Wave of Cyberattacks Against Iran’, *New York Times*, 1 June 2012.\n²⁵ *Ibid.*\n²⁶ Josh Fruhlinger, ‘What is Stuxnet, Who Created It and How Does It Work?’, *CSO Online*, 22 August 2017, <https: 3218104=\"\" article=\"\" what-is-stuxnet-who-created-it-and-how-does-it-work.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.\n²⁷ *Ibid.*\n²⁸ TrendMicro, ‘German Steel Plant Suffers Significant Damage from Targeted Attack’, 12 January 2015, <https: fr=\"\" security=\"\" news=\"\" cyber-attacks=\"\" german-steel-plant-suffers-significant-damage-from-targeted-attack=\"\" www.trendmicro.com=\"\" vinfo=\"\">, accessed 3 March 2021; Josh Fruhlinger, ‘What Is WannaCry Ransomware, How</https:></https:>\nJustin Bronk and Jack Watling\nNorth Korea regularly use quasi-criminal groups of hackers operating under loose state direction to demonstrate to expert communities their ability to disrupt and even directly damage civilian industry and critical national infrastructure (CNI). This capability is then tacitly leveraged to enhance deterrence messaging against potential state opponents. Some of these attacks exploit zero-day vulnerabilities, but most employ simple massed phishing attacks to infiltrate potential target networks. As such, they are much more effective against networks which rely on commercial operating systems which are well understood, do not use three-factor authentication security procedures and may be slow to implement security patches. The purpose of most attacks of this nature is also far less specific than strategic cyber weapons such as Stuxnet; either theft of information across a broad industrial sector, extortion or simply disruption for its own sake.\nFor most Western states, there are significant legal and ethical barriers to the use of offensive cyber capabilities against civilian targets, at least in any overt attempt at deterrence messaging. In any case, the ability to infiltrate civilian infrastructure and cause temporary disruption or even limited destructive effects is unlikely to deter a state opponent from conventional military action if it has already committed to such a high-risk course of action. The recent conflicts in eastern Ukraine and Nagorno-Karabakh provide compelling evidence that states are prepared to suffer extensive damage to both civilian and military targets without backing down from kinetic confrontations where national interests are clearly defined. As such, the immediate question for those who see the apocryphal cyber capability to 'turn out the lights in Moscow' as a cheaper replacement for conventional and nuclear deterrence tools is: what effect would such an attack have on a determined adversary, and for how long? It is perhaps ironic that hyperbolic narratives, such as that advanced by Nicole Perlroth,²⁹ use Ukraine as the example of how devastating cyber attacks can be, while somehow overlooking the extent to which Ukraine has weathered and recovered from Russia's cyber onslaught.\nWhilst there are few situations in which cyber weapons can replace more traditional forms of military capability outright, there are many potential ways in which offensive cyber tools can be used as part of joint operations. For example, a previously inserted cyber payload might be\nDoes it Infect, and Who Was Responsible?, CSO Online, 30 August 2018, <https: 3227906=\"\" article=\"\" what-is-wannacry-ransomware-how-does-it-infect-and-who-was-responsible.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.\n²⁹ Nicole Perlroth, This Is How They Tell Me the World Ends: The Cyberweapons Arms Race (London: Bloomsbury, 2021).</https:>\nThe Slow and Imprecise Art of Cyber Warfare\nused to disable or disrupt key adversary defence systems at a critical moment to enable a conventional attacking force to physically bypass or destroy them. Israel allegedly carried out just such an attack against the Syrian air defence network in 2007.³⁰ The normally bristling air defence network was rendered blind to an Israeli Air Force strike package which entered Syrian airspace, bombed a nuclear facility and withdrew unchallenged.³¹ It is still unclear in the public domain whether this was a case of a cyber payload or advanced electronic warfare techniques opening the door for the Israeli aircraft. In general terms, whereas cyber attacks involve the theft, alteration or deletion of data, electronic warfare involves the detection or disruption of enemy sensors and the transmission of data using electromagnetic energy. While both rely on an attacker having knowledge of how a target system operates, electronic warfare can be applied as an active effect in real time without lengthy network reconnaissance, infiltration and payload activation. In practice, the line between the two techniques is increasingly blurring. For example, information about the exact software and hardware configurations of a radar, obtained via cyber attacks against the defence network which it sits within, might be used to tailor sophisticated electronic warfare attack options using digital emitters such as active electronically scanned array radar sets. In this context, however, the cyber attack would have occurred long before the electronic attack, with the theft of data enabling conventional electronic warfare capabilities. What is clear, however, is that the Israeli attack in 2007 was successful because it blended cyber and/or electronic attack with a precisely choreographed application of traditional firepower. The attack on the Syrian air defence network itself was not intended to create strategic effects, but as an enabling capability it greatly reduced the risk profile and increased the effectiveness of an otherwise conventional strike operation.\nThe use of cyber attacks to 'open the door' for conventional forces in this way is dependent on several key factors. First, that the potential target can be identified well in advance of any requirement to exploit a breach. This is to allow sufficient time for the required reconnaissance, penetration and delivery stages of cyber attack preparation to be conducted. Second, in the case of an attack against a target such as an integrated air defence system (IADS), this activity will have to be coordinated with traditional intelligence gathering about the physical\n³⁰ Sharon Weinberger, 'How Israel Spoofed Syria's Air Defense System', WIRED, 4 October 2007.\n³¹ BBC News, 'Israel Admits Striking Suspected Syrian Nuclear Reactor in 2007', 21 March 2018.\nlocations, individual system capabilities and patterns of movement exhibited by the radars and missile launchers themselves. This is so that the required virtual effects can be identified in terms of practical effects in the physical dimension, and it requires in-depth intelligence which will need to be gathered in multiple domains. This in turn introduces a third dependency for using cyber weapons in this way to enable conventional attacks; permissions and security clearance levels. Continuing with the IADS example, the required physical and network reconnaissance and intelligence-gathering activities would likely draw on resources from air force(s), multiple intelligence agencies and special forces operations. Many of these assets will require very high-level authorisation for tasking, and the products generated will be highly classified and not widely distributed within the military as a whole. As such, the successful use of cyber attacks as a coordinated enabler for conventional military operations requires operational planners to be aware of the art of the possible, in areas where they are unlikely to be in most countries by default. The final major dependency for this sort of attack is a linked one. Imagine a case where a cyber capability has been successfully developed and implanted with a compatible activation mechanism in a specific adversary defence system, and an operational commander is aware of it. In order to employ it, that commander must be able to justify its use to enable their conventional operation, given that once the cyber weapon is used the adversary will rapidly reset their systems, discover the vulnerability and patch it. In the case of the 2007 attack by the Israeli Air Force on a Syrian nuclear reactor, head of state authorisation would almost certainly have been granted for the operation, and the expending of a developed cyber capability (if indeed it was one) embedded over several years in the Syrian IADS deemed worthwhile to enable it. However, for more routine or ongoing military operations, cyber weapons will likely remain a capability held for specific situations rather than a regular feature. Furthermore, if military operations take place in an unforeseen context, it is unlikely that sufficient time will be available to prepare as thoroughly as Israel was able to do against its traditional rival to the north.\nA more ad-hoc use of disruptive cyber operations against CNI and military enabling capabilities is more likely to characterise the routine use of cyber capabilities in warfare in the coming decade. If the requirement is not to create a catastrophic failure in key military systems at a specific point in time to directly enable conventional operations, then the\nThe Slow and Imprecise Art of Cyber Warfare\ndependencies placed on cyber specialists are less onerous. For example, Russia has conducted a range of cyber attacks against Ukrainian military and civilian systems as part of its hybrid war against the country since 2014. These have included attacks on Ukrainian military communications in coordination with intensive electronic warfare operations, as well as attacks on the national power grid and banking system. The result was to impose further disruption and costs on the government in Kyiv in conjunction with sustained direct and indirect military support to rebel groups in Donetsk and Luhansk oblasts. In other words, cyber warfare offers states another vector through which to pressure opposing states in conjunction with traditional hard and soft power tools. In a NATO context, obvious potential targets for Russian cyber attacks in the event of a major crisis or limited conflict would be the networks which control the civilian port and rail infrastructure which would be critical for mobilisation and the deployment of conventional military forces to eastern Europe. Such attacks could have significant or even decisive effects on the strategic picture for the Alliance if coupled with sustained conventional and nuclear force posturing. However, on their own, they would only delay rather than prevent military capabilities being brought to bear.\nIn considering the impact of cyber warfare on future operations, militaries are clearly correct to be taking the security of their systems seriously. Offensive cyber operations offer opportunities to gain contextual tactical advantage by disrupting the functioning of enemy systems and undermining the adversary's confidence in their equipment. They also allow for the shaping of the human terrain around which fighting takes place when aimed at civilian systems. Nevertheless, cyber attacks should not be seen as an alternative to hard power. Nor can cyber attacks function as a standalone solution.\nFinally, the opportunities offered by offensive cyber capabilities are difficult to guarantee at a specified time and place, and so cannot be relied on as a foundational capability in deterrence terms. Cyber warfare is real and cannot be ignored. But for now, it remains slow and imprecise compared to more traditional levers of military power.\n23",
  "references": [],
  "flat_text": "Noosey Harcoins\nWhitehall Papers\nRoutledge Taylor &amp; Francis Group\nISSN: 0268-1307 (Print) 1754-5382 (Online) Journal homepage: www.tandfonline.com/journals/rwhi20\n# I. The Slow and Imprecise Art of Cyber Warfare\nJustin Bronk &amp; Jack Watling\nTo cite this article: Justin Bronk &amp; Jack Watling (2021) I. The Slow and Imprecise Art of Cyber Warfare, Whitehall Papers, 99:1, 11-23, DOI: 10.1080/02681307.2021.2005891\nTo link to this article: https://doi.org/10.1080/02681307.2021.2005891\nPublished online: 06 Dec 2021.\nSubmit your article to this journal\nArticle views: 536\nView related articles\nView Crossmark data\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rwhi20\n\nJUSTIN BRONK AND JACK WATLING\nSally Walker, former Director of Cyber at GCHQ, has stated that cyber attacks 'can have impact in the real world and you can do it at scale'. Because cyber attacks can target everything from financial systems and critical national infrastructure to political leaders and legal institutions – undermining trust and the rule of law – they can have an 'attrition' effect on the cohesion of states to which open societies 'are uniquely vulnerable'. Such warnings over the years, combined with high-profile incidents like the WannaCry ransomware attack against the NHS, have meant that military leaders have recognised the importance of the 'cyber domain'. When new forms of conflict first emerge, however, there is almost always a period of inflated expectation. For the small community within Defence who have worked in the margins to explore the novel capability, there is a tendency to hype its effects and downplay its limitations in order to gain the attention of the wider defence and security community and secure resources within the bureaucracy. For that wider community – lacking an understanding of the capability – it is often much easier to visualise the potential threats posed by novel weapons than the challenges involved in employing them effectively. Cyber warfare today is arguably at the peak of this inflated discourse,\n Sally Walker, 'Into the Grey Zone Podcast: Episode Five – Cyber Power (Part II)', Sky News, 3 June 2021, 06:00, <https: into-the-grey-zone-podcast-episode-five-cyber-power-part-ii-12212228=\"\" news.sky.com=\"\" story=\"\">, accessed 26 July 2021.\n Ibid., 10:30.\n National Audit Office, Investigation: WannaCry Cyber Attack and the NHS, HC 414 (London: National Audit Office, 2018).\n This is visualised in Gartner, 'Gartner Hype Cycle', <https: gartner-hype-cycle=\"\" en=\"\" methodologies=\"\" research=\"\" www.gartner.com=\"\">, accessed 30 March 2021.</https:></https:>\nJustin Bronk and Jack Watling\nwhere its importance is recognised but its implications remain poorly understood beyond the limited community of technical specialists.\nIn briefings, military commanders often characterise cyber capabilities by the speed, scale and sophistication of the effect. Outlining the challenge of 'convergence' between warfighting domains, Lieutenant General Eric Wesley described how 'cyber is moving at milliseconds, ships are moving at 30 knots, vehicles at 30 km. The ability to synchronise that might be a bit of a stretch'. As well as an expectation of near-instantaneous effects, there is a persistent fear of the devastation that could be wrought. General Wesley Clark, former NATO Supreme Commander Europe, warned that 'it's possible to shut down critical infrastructure, refineries, businesses, banks, transportation – but most importantly, the electricity grid. It's been done by the Russians in the Ukraine'. Finally, there is a great deal of anxiety in militaries about the sophistication of cyber effects against conventional military systems. General John Allen, for instance, hypothesised about an incident in which a US Navy vessel had its defensive systems rendered ineffective by cyber attack, making it vulnerable to conventional munitions.\nA more thorough examination of the mechanics of cyber warfare renders much of this military discourse highly hyperbolic. Although data can travel quickly, cyber attacks are slow to develop and deliver, and often unpredictable and isolated in their effects. The challenge with integrating cyber effects into multi-domain operations is the opposite of the problem suggested by Wesley – that cyber attacks take far too long to easily synchronise with conventional operations. As Walker noted, 'it just doesn't relate to conventional warfare'. A realistic appreciation of the impact of cyber capabilities on the future of warfare must begin with a concrete understanding of how cyber attacks work. Appreciating what is required to attack a digital system reveals its limitations and so allows for the potential impact of such techniques on warfare to be put into perspective. This chapter seeks to explain how cyber attacks function and suggests their likely trajectory on the future battlefield.[9]\n[5] US Department of Defense, 'AUSA Global Force Symposium: Day 3 – Opening Remarks and Keynote Speaker', 18 March 2021, 35:00, <https: dod.defense.gov=\"\" index?videoid=\"668339\" news=\"\" special-reports=\"\" videos=\"\">, accessed 26 July 2021.\n[6] Mandi Kogosowski, “We’re on the Brink of an Enormous Cyber Catastrophe”, *Israel Defense*, 4 June 2021, <https: 49194=\"\" en=\"\" node=\"\" www.israeldefense.co.il=\"\">, accessed 26 July 2021.\n[7] John R Allen and Amir Hussain, 'On Hyperwar', *Proceedings Magazine* (Vol. 143, No. 7, 2017), p. 1373.\n[8] Walker, 'Into the Grey Zone Podcast', 13:49.\n[9] Cyber practitioners are necessarily very precise in the language they employ. This chapter is intended to help non-cyber practitioners understand key concepts and</https:></https:>\nThe Slow and Imprecise Art of Cyber Warfare\n# The Anatomy of a Cyber Attack\nCyber activity is primarily concerned with the virtual dimension, which is characterised by its dependence on invented languages. Information encoded in these invented languages comprises data. Military cyber attacks seek to achieve at least one of three things: to access data that an adversary does not wish to share; to change the data that an adversary holds; or to destroy an adversary's data. The first requirement for conducting a cyber attack is to identify that an adversary holds data. For example, a range table for a munition in a printed handbook exists in the physical dimension as paper and in the cognitive dimension if it has been memorised by an operator, but not in the virtual dimension. If, however, the range table has been translated into data and is stored on a digital device, it exists in the virtual dimension and can be subjected to cyber attack. If this data is accessible as part of a fire control system supporting geographically dispersed artillery pieces, then that data must be remotely accessible via a network. It can therefore be attacked remotely.\nSince the virtual dimension is fabricated, it is usually not immediately apparent to an external party what systems have been digitised, what they are connected to, or what languages are used to store the data and manage the network. Furthermore, programming languages do not simply store information but also contain grammar for describing commands that the system can execute. These commands describe how the data is to be stored, who has permission to access it, and what checks are carried out to determine who each user is. All of these facets of a network are invisible to an intruder until they have interacted with part of that\nuses analogy and imprecise terms to aid accessibility. The authors apologise to specialists in the field for the resulting lack of precision.\n Ministry of Defence, 'Joint Doctrine Publication 0-30: UK Air and Space Power', 2ⁿᵈ edition, December 2017, p. 17.\n David J Peterson, *Art of Language Invention, The: From Horse-Lords to Dark Elves to Sand Worms, the Words Behind World-Building* (London: Penguin, 2015), pp. 21–22.\n The subset of invented languages used in computing comprises markup and programming languages. Markup languages allow the programming instructions to not be displayed when displaying data in a non-programming language. See Thomas Powell, *HTML &amp; XHTML: The Complete Reference* (New York, NY: McGraw-Hill, 2003), p. 25. Programming languages use imperative and declarative syntax to describe and command the execution of specified functions, see Michael Gordon, *Programming Language Theory and Its Implementation* (Hoboken: Prentice Hall, 1988).\n These offensive aims can be understood as the offensive mirror image of the CIA's triad model of cybersecurity principles: confidentiality; integrity; and availability. See 'What Is Security Analysis?', <https: cia.htm=\"\" security=\"\" www.doc.ic.ac.uk=\"\" ~ajs300=\"\">, accessed 21 October 2021.</https:>\nJustin Bronk and Jack Watling\nnetwork. Therefore, having determined that a digital target exists, an attacker must seek to intrude into the network which contains it, and exfiltrate data to determine how that network is constructed and by what languages it is governed.\nA lack of information about a network makes designing penetrations that are difficult to detect almost impossible, just as it is very difficult for a non-native speaker of a language to pass as a native speaker.[14] For this reason, the initial penetration and mapping of networks involves an extensive reconnaissance effort. Attackers will often conduct a high volume of unsophisticated attacks on the basis that while only a few will make any headway into the network, they will generate valuable information about which nodes in the network hold administrative privileges and how the protocols that govern the network function.[15] Large-scale unsophisticated attacks produce a constant noise so that adversaries cannot necessarily determine what is being targeted. In many ways, this is because the purpose is to find what targets might be available. This is comparable to a reconnaissance by force, or advance to contact, rather than a deliberate reconnaissance. However, the defenders will try to identify who is perpetrating this reconnaissance in order to anticipate what subsequent, more sophisticated attacks might look like.[16]\nOnce the shape of a network and the location of data and privileges are identified, an attacker will begin to craft specialised attacks to gain access to those points. This will often require detailed information about the humans who govern these points in the network, and how they interact with it in the physical dimension, because this can provide valuable information about how to attack the system.[17] These deliberate attacks against identified nodes must be carried out without being detected. If an intrusion is detected, the defender can simply sever the node that has been penetrated or change the permissions to deny it any useful access to the rest of the network. At that point, the attacker must\n[14] Simon Müller, 'Discourse Makers in Native and Non-Native English Discourse', PhD submission to Justus Liebig University Giessen, Amsterdam, 2004; Melissa M Baese-Berk and Tuuli H Morrill, 'Speaking Rate Consistency in Native and Non-Native Speakers of English', *Journal of the Acoustical Society of America* (Vol. 138, No. 3, 2015), pp. 223–28.\n[15] H P Sanghvi and M S Dahiya, 'Cyber Reconnaissance: An Alarm Before Cyber Attack', *International Journal of Computer Applications* (Vol. 63, No. 6, 2013), pp. 36–38.\n[16] This is the purpose of cyber threat intelligence. See Henry Dalziel, *How to Define and Build an Effective Cyber Threat Intelligence Capability* (Waltham, MA: Syngress, 2015).\n[17] Micah Zenko, *Red Team: How to Succeed by Thinking Like the Enemy* (New York, NY: Basic Books, 2015), pp. 171–83.\nThe Slow and Imprecise Art of Cyber Warfare\nbegin from scratch against a defender that has gained information about the attacker's techniques and signature.\nAfter a critical node is penetrated, data from it must be exfiltrated and analysed to allow the attacker to see further into the network and target the next node up the chain. Ultimately, the aim is for the attacker to gain access to repositories of data, or to components of a system that can control other parts of the system. Whereas most parts of a network have the right to read a limited set of data, some administrative nodes have permission to rewrite the instructions governing the system. Attackers seek access to administrators because these accounts can change or destroy the data or physical infrastructure that constitute the enemy system. For example, an administrator for a fire control system might substitute an accurate range table for an inaccurate one, ensuring the artillery system as a whole misses any target it tries to engage. Alternatively, it could delete the range table so that the system cannot calculate firing solutions. The administrator could even delete the instructions for the system to read a range table, and then destroy the instructions for the system to accept new instructions so that the defender cannot simply upload a new range table when the data is found to be missing.\nAlmost all components of a network will be subject to varying levels of encryption which must be cracked or bypassed by an attacker at each stage. This could require the entry of a simple password, or for more sensitive and better defended systems, a three-part authentication comprising something known by the individual who owns the node (a password), something they have (a physical key), and something they are (biometric data). Passwords to confirm that someone requesting access to a system is the right individual can be cracked through a brute force (guessing all possible combinations) or analytical attack. The latter method can be invalidated by randomly generating passwords. In practice, any effectively defended system will have millions of possible solutions to passwords at each level, and incorrect entries will attract the attention of defenders. For this reason, attackers will endeavour to bypass passwords through hacking. Hacking involves the interrogation of the code to find ambiguities through which an attack can convince the system that a password is not necessary or has been entered when it has not.[18]\n[18] There is an alternative distinction drawn between hacking and cracking that is framed in ethical terms, with the former being constructive and the latter destructive. In practice, this ethical distinction – while important in the early days of the internet – has fragmented. See John P Carlin with Garrett M Graff, *Dawn of the Code War: America's Battle Against Russia, China, and the Rising Global Cyber Threat* (New York, NY: Public Affairs, 2018), chapter 1.\nJustin Bronk and Jack Watling\nTo envisage how a hack works, consider the consequences of someone using poor grammar, as in the sentence: 'Correct and verified, the user may decrypt the data'. In conversation, this can be understood to mean 'if the user has been correctly identified and verified, then they may decrypt the data'. However, the sentence could equally be literally interpreted as saying 'the user is correct and verified and may decrypt the data'. A hack would suggest to the system that it should proceed with the latter interpretation. Because complex code involves thousands of lines of instruction, often written by multiple people at different times, there will often be minor contradictions or ambiguities that can be discovered and then leveraged by an attacker.[19]\nWhen these ambiguities and contradictions are part of the code in a system, they are termed 'zero-days' because they are vulnerabilities that were introduced into the system by the way it was designed, and at the time of discovery represent an open vulnerability that has not been patched, leaving defenders with zero days to resolve the problem. By storing zero-day exploits which they discover through reconnaissance efforts, an attacker can subsequently employ them to bypass a system's defences. However, just as the poor grammar cited above can be clarified, so too can a defender clarify their coding to make a system more secure. If, therefore, they identify that a zero-day exploit has enabled penetration of their network, they can often patch the system to edit out and close the vulnerability, or else closely monitor it to gain intelligence on potential ongoing or future attacks. Consequently, attackers must make a trade-off between the value of accessing a system at any given time and the risk of losing the ability to bypass its encryption or being rapidly attributed and potentially counter-attacked if discovered.\nAttacking sensitive digital systems is further complicated by the fact that they are often air-gapped, meaning they are not susceptible to remote access. This means that, to attack them, an adversary must either create an artificial connection to the outside world or physically plug into the air-gapped network without being detected. This may require multiple physical penetrations since the first intrusion may simply allow the attacker to collect information about what language the system uses and how it is structured. They must then physically penetrate the system a second time to deliver a designed payload to attack it. If they do not wish to immediately activate the delivered payload, they may need to\n[19] A common issue is poor hygiene in compound coding for signifier/signified correlation. See Paolo Rocchi, 'The Concepts of Signifier/Signified Revisited', IBM, <http: dtmd=\"\" rocchi.pdf=\"\" presentations=\"\" mcs.open.ac.uk=\"\" session%202=\"\">, accessed 30 March 2021.</http:>\nThe Slow and Imprecise Art of Cyber Warfare\npenetrate the system a third time to trigger the attack at the desired point in time.\nA cyber attack may therefore be envisaged as comprising seven stages:\n1. Reconnaissance: to understand the target network.\n2. Weaponisation: designing a payload to exploit vulnerabilities.\n3. Delivery: insertion of the payload through the system.\n4. Exploitation: using new access to identify and target the key node.\n5. Installation: installing the payload at the target node of the system.\n6. Command and control: having a means of initiating the payload.\n7. Action on objectives: having the desired effect on the system.\nAttempting to gain entry to a complex defended system may require several iterations of this cycle as the attackers fight their way into the network. Against a complex network with multiple layers, which ultimately ends in an air-gapped component, working into a network may take between one and three years. While embedding malicious capabilities into public utilities or other legacy civilian systems may be more straightforward, attacking military systems is complex, sensitive and has a significant lead time, requiring payloads to be embedded during peacetime if they are to be available during war.\nIf a cyber attack is prosecuted in peacetime and the payload initiated before the outbreak of war, its effects will either be limited or escalatory. For example, to return to the artillery fire control system, if it were penetrated and the range tables altered prior to a conflict, this could mean that the change would be noticed during an exercise, the range tables corrected and the system security patched prior to a conflict. Alternatively, it could mean that during the same exercise the artillery kills friendly forces. This would lead to an investigation and, if the cause could be attributed to a hostile cyber attack, it would lead to a significant\n Joseph Raczynski, ‘Kill Chain: The 7 Stages of a Cyberattack’, *Thomson Reuters*, 12 October 2018.\n Author interview with a senior CTI director at a major bank, March 2021; author interview with a senior military cyber warfare officer, February 2021; author interview with a law enforcement officer specialising in counter-cyber operations, January 2021.\n House of Commons, ‘A Major Cyber Attack on the UK is a Matter of “When, Not If”’, Joint Committee on the National Security Strategy, 22 January 2018, <https: index.html=\"\" jcnss-cni-report=\"\" houseofcommons.shorthandstories.com=\"\">, accessed 30 March 2021.</https:>\nJustin Bronk and Jack Watling\nescalation in tensions or could even be interpreted by the victim as a casus belli.\nConversely, a cyber payload that sits dormant in a system until activated during a conflict presents other challenges. It must either be activated automatically when certain criteria are met or manually. The latter requires a sustained capacity to connect to the system at short notice to be maintained by the attacker. For military systems – given the changes that occur when a state transitions to war – this may be difficult, requiring the embedding of agents with knowledge of the penetration inside the enemy force. However, a payload that monitors the system so that it can activate under certain conditions is an active rather than passive insertion and is, therefore, more susceptible to detection. It could also activate under circumstances unforeseen by the attacker.\nThe final limitation of a military cyber capability is that cyber attacks function by inserting data into a system so that it is directed to behave in a specific manner. It is effective not in itself, but because of how the payload interacts with the rest of the system. Because the system is fabricated, however, and the language invented, it is subject to being expanded, divided, updated and changed in fundamental ways. Therefore, a payload that must remain dormant may be activated only to find that the surrounding environment has been altered to the extent that its code no longer makes any sense within the language with which it is supposed to interact. A well-defended system will be periodically patched so that changes like this should be routine. The result is that while militaries may spend years embedding capabilities into a network, they have no guarantees that when the time comes it will function as anticipated. Consequently, cyber attacks are unpredictable in their effects and are difficult to synchronise with established military planning and operations. This is a significant limitation, as the high lethality, mobility and relatively low quantities of most modern military capabilities mean that precise timing and coordination between different joint force elements are even more essential than they were in previous eras.\n## The Military Application of Cyber Weapons\nThere are limited scenarios in which a cyber attack can have a decisive operational or strategic effect when used in isolation. The most famous strategic cyber attack is the Stuxnet worm which formed part of a series of attacks on Iranian nuclear fuel enrichment centrifuges from 2008.\n Jens Stoltenberg, ‘NATO Will Defend Itself’, NATO, last updated 29 August 2019, <https: en=\"\" en=\"\" natohq=\"\" news_168435.htm?selectedlocale=\"en\" www.nato.int=\"\">, accessed 30 March 2021.</https:>\nThe Slow and Imprecise Art of Cyber Warfare\nEstimates vary but some suggest that enough disruption was caused to set back Iranian nuclear enrichment by 18 to 24 months. However, the system reconnaissance and infiltration process took years, having reportedly begun in 2005. Furthermore, when Stuxnet leaked accidentally beyond the air-gapped nuclear facility network, its code was subsequently identified and analysed by states and cyber security firms around the world. This resulted in public attribution of the Stuxnet attack itself to intelligence agencies in the US and Israel, as well as the probable attribution of other cyber weapons which appear to function in a similar manner. It also gave Iran and other national and civilian organisations the opportunity to examine a strategic cyber payload described by a senior cyber security professional as 'by far the most complex piece of code that we've looked at – in a completely different league from anything we'd ever seen before'.\nThe Stuxnet leak, and the US/Israeli cyber operations against Iran's uranium enrichment programme as a whole, illustrate some of the key practical characteristics of cyber warfare as a standalone tool of national power. Attacks on defended systems require years of preparation to identify, infiltrate and exploit weak points. Once triggered, even very sophisticated payloads will be discovered, analysed and ultimately identified. The effects created can only ever be temporary in isolation, as states will patch their systems and replace damaged machinery if not prevented from doing so by other means. When the payloads are ultimately identified and analysed, peer and near-peer states can use insights gained to ascribe probable attribution, and also potentially to develop or enhance their own offensive cyber capabilities.\nLess sophisticated cyber payloads than Stuxnet-type cyber weapons can still be highly effective in causing standalone disruption and potentially physical damage if conducted against less defended systems such as those which control civilian infrastructure. Examples include the attack on a German steel mill in 2014, and the WannaCry ransomware attacks which caused major disruption to the NHS in 2017. States such as Russia and\n David E Sanger, ‘Obama Order Sped Up Wave of Cyberattacks Against Iran’, *New York Times*, 1 June 2012.\n *Ibid.*\n Josh Fruhlinger, ‘What is Stuxnet, Who Created It and How Does It Work?’, *CSO Online*, 22 August 2017, <https: 3218104=\"\" article=\"\" what-is-stuxnet-who-created-it-and-how-does-it-work.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.\n *Ibid.*\n TrendMicro, ‘German Steel Plant Suffers Significant Damage from Targeted Attack’, 12 January 2015, <https: fr=\"\" security=\"\" news=\"\" cyber-attacks=\"\" german-steel-plant-suffers-significant-damage-from-targeted-attack=\"\" www.trendmicro.com=\"\" vinfo=\"\">, accessed 3 March 2021; Josh Fruhlinger, ‘What Is WannaCry Ransomware, How</https:></https:>\nJustin Bronk and Jack Watling\nNorth Korea regularly use quasi-criminal groups of hackers operating under loose state direction to demonstrate to expert communities their ability to disrupt and even directly damage civilian industry and critical national infrastructure (CNI). This capability is then tacitly leveraged to enhance deterrence messaging against potential state opponents. Some of these attacks exploit zero-day vulnerabilities, but most employ simple massed phishing attacks to infiltrate potential target networks. As such, they are much more effective against networks which rely on commercial operating systems which are well understood, do not use three-factor authentication security procedures and may be slow to implement security patches. The purpose of most attacks of this nature is also far less specific than strategic cyber weapons such as Stuxnet; either theft of information across a broad industrial sector, extortion or simply disruption for its own sake.\nFor most Western states, there are significant legal and ethical barriers to the use of offensive cyber capabilities against civilian targets, at least in any overt attempt at deterrence messaging. In any case, the ability to infiltrate civilian infrastructure and cause temporary disruption or even limited destructive effects is unlikely to deter a state opponent from conventional military action if it has already committed to such a high-risk course of action. The recent conflicts in eastern Ukraine and Nagorno-Karabakh provide compelling evidence that states are prepared to suffer extensive damage to both civilian and military targets without backing down from kinetic confrontations where national interests are clearly defined. As such, the immediate question for those who see the apocryphal cyber capability to 'turn out the lights in Moscow' as a cheaper replacement for conventional and nuclear deterrence tools is: what effect would such an attack have on a determined adversary, and for how long? It is perhaps ironic that hyperbolic narratives, such as that advanced by Nicole Perlroth, use Ukraine as the example of how devastating cyber attacks can be, while somehow overlooking the extent to which Ukraine has weathered and recovered from Russia's cyber onslaught.\nWhilst there are few situations in which cyber weapons can replace more traditional forms of military capability outright, there are many potential ways in which offensive cyber tools can be used as part of joint operations. For example, a previously inserted cyber payload might be\nDoes it Infect, and Who Was Responsible?, CSO Online, 30 August 2018, <https: 3227906=\"\" article=\"\" what-is-wannacry-ransomware-how-does-it-infect-and-who-was-responsible.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.\n Nicole Perlroth, This Is How They Tell Me the World Ends: The Cyberweapons Arms Race (London: Bloomsbury, 2021).</https:>\nThe Slow and Imprecise Art of Cyber Warfare\nused to disable or disrupt key adversary defence systems at a critical moment to enable a conventional attacking force to physically bypass or destroy them. Israel allegedly carried out just such an attack against the Syrian air defence network in 2007. The normally bristling air defence network was rendered blind to an Israeli Air Force strike package which entered Syrian airspace, bombed a nuclear facility and withdrew unchallenged. It is still unclear in the public domain whether this was a case of a cyber payload or advanced electronic warfare techniques opening the door for the Israeli aircraft. In general terms, whereas cyber attacks involve the theft, alteration or deletion of data, electronic warfare involves the detection or disruption of enemy sensors and the transmission of data using electromagnetic energy. While both rely on an attacker having knowledge of how a target system operates, electronic warfare can be applied as an active effect in real time without lengthy network reconnaissance, infiltration and payload activation. In practice, the line between the two techniques is increasingly blurring. For example, information about the exact software and hardware configurations of a radar, obtained via cyber attacks against the defence network which it sits within, might be used to tailor sophisticated electronic warfare attack options using digital emitters such as active electronically scanned array radar sets. In this context, however, the cyber attack would have occurred long before the electronic attack, with the theft of data enabling conventional electronic warfare capabilities. What is clear, however, is that the Israeli attack in 2007 was successful because it blended cyber and/or electronic attack with a precisely choreographed application of traditional firepower. The attack on the Syrian air defence network itself was not intended to create strategic effects, but as an enabling capability it greatly reduced the risk profile and increased the effectiveness of an otherwise conventional strike operation.\nThe use of cyber attacks to 'open the door' for conventional forces in this way is dependent on several key factors. First, that the potential target can be identified well in advance of any requirement to exploit a breach. This is to allow sufficient time for the required reconnaissance, penetration and delivery stages of cyber attack preparation to be conducted. Second, in the case of an attack against a target such as an integrated air defence system (IADS), this activity will have to be coordinated with traditional intelligence gathering about the physical\n Sharon Weinberger, 'How Israel Spoofed Syria's Air Defense System', WIRED, 4 October 2007.\n BBC News, 'Israel Admits Striking Suspected Syrian Nuclear Reactor in 2007', 21 March 2018.\nlocations, individual system capabilities and patterns of movement exhibited by the radars and missile launchers themselves. This is so that the required virtual effects can be identified in terms of practical effects in the physical dimension, and it requires in-depth intelligence which will need to be gathered in multiple domains. This in turn introduces a third dependency for using cyber weapons in this way to enable conventional attacks; permissions and security clearance levels. Continuing with the IADS example, the required physical and network reconnaissance and intelligence-gathering activities would likely draw on resources from air force(s), multiple intelligence agencies and special forces operations. Many of these assets will require very high-level authorisation for tasking, and the products generated will be highly classified and not widely distributed within the military as a whole. As such, the successful use of cyber attacks as a coordinated enabler for conventional military operations requires operational planners to be aware of the art of the possible, in areas where they are unlikely to be in most countries by default. The final major dependency for this sort of attack is a linked one. Imagine a case where a cyber capability has been successfully developed and implanted with a compatible activation mechanism in a specific adversary defence system, and an operational commander is aware of it. In order to employ it, that commander must be able to justify its use to enable their conventional operation, given that once the cyber weapon is used the adversary will rapidly reset their systems, discover the vulnerability and patch it. In the case of the 2007 attack by the Israeli Air Force on a Syrian nuclear reactor, head of state authorisation would almost certainly have been granted for the operation, and the expending of a developed cyber capability (if indeed it was one) embedded over several years in the Syrian IADS deemed worthwhile to enable it. However, for more routine or ongoing military operations, cyber weapons will likely remain a capability held for specific situations rather than a regular feature. Furthermore, if military operations take place in an unforeseen context, it is unlikely that sufficient time will be available to prepare as thoroughly as Israel was able to do against its traditional rival to the north.\nA more ad-hoc use of disruptive cyber operations against CNI and military enabling capabilities is more likely to characterise the routine use of cyber capabilities in warfare in the coming decade. If the requirement is not to create a catastrophic failure in key military systems at a specific point in time to directly enable conventional operations, then the\nThe Slow and Imprecise Art of Cyber Warfare\ndependencies placed on cyber specialists are less onerous. For example, Russia has conducted a range of cyber attacks against Ukrainian military and civilian systems as part of its hybrid war against the country since 2014. These have included attacks on Ukrainian military communications in coordination with intensive electronic warfare operations, as well as attacks on the national power grid and banking system. The result was to impose further disruption and costs on the government in Kyiv in conjunction with sustained direct and indirect military support to rebel groups in Donetsk and Luhansk oblasts. In other words, cyber warfare offers states another vector through which to pressure opposing states in conjunction with traditional hard and soft power tools. In a NATO context, obvious potential targets for Russian cyber attacks in the event of a major crisis or limited conflict would be the networks which control the civilian port and rail infrastructure which would be critical for mobilisation and the deployment of conventional military forces to eastern Europe. Such attacks could have significant or even decisive effects on the strategic picture for the Alliance if coupled with sustained conventional and nuclear force posturing. However, on their own, they would only delay rather than prevent military capabilities being brought to bear.\nIn considering the impact of cyber warfare on future operations, militaries are clearly correct to be taking the security of their systems seriously. Offensive cyber operations offer opportunities to gain contextual tactical advantage by disrupting the functioning of enemy systems and undermining the adversary's confidence in their equipment. They also allow for the shaping of the human terrain around which fighting takes place when aimed at civilian systems. Nevertheless, cyber attacks should not be seen as an alternative to hard power. Nor can cyber attacks function as a standalone solution.\nFinally, the opportunities offered by offensive cyber capabilities are difficult to guarantee at a specified time and place, and so cannot be relied on as a foundational capability in deterrence terms. Cyber warfare is real and cannot be ignored. But for now, it remains slow and imprecise compared to more traditional levers of military power.\n23",
  "citations": {
    "style": "superscript",
    "flat_text": "Noosey Harcoins\nWhitehall Papers\nRoutledge Taylor &amp; Francis Group\nISSN: 0268-1307 (Print) 1754-5382 (Online) Journal homepage: www.tandfonline.com/journals/rwhi20\n# I. The Slow and Imprecise Art of Cyber Warfare\nJustin Bronk &amp; Jack Watling\nTo cite this article: Justin Bronk &amp; Jack Watling (2021) I. The Slow and Imprecise Art of Cyber Warfare, Whitehall Papers, 99:1, 11-23, DOI: 10.1080/02681307.2021.2005891\nTo link to this article: https://doi.org/10.1080/02681307.2021.2005891\nPublished online: 06 Dec 2021.\nSubmit your article to this journal\nArticle views: 536\nView related articles\nView Crossmark data\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rwhi20\n\nJUSTIN BRONK AND JACK WATLING\nSally Walker, former Director of Cyber at GCHQ, has stated that cyber attacks 'can have impact in the real world and you can do it at scale'. Because cyber attacks can target everything from financial systems and critical national infrastructure to political leaders and legal institutions – undermining trust and the rule of law – they can have an 'attrition' effect on the cohesion of states to which open societies 'are uniquely vulnerable'. Such warnings over the years, combined with high-profile incidents like the WannaCry ransomware attack against the NHS, have meant that military leaders have recognised the importance of the 'cyber domain'. When new forms of conflict first emerge, however, there is almost always a period of inflated expectation. For the small community within Defence who have worked in the margins to explore the novel capability, there is a tendency to hype its effects and downplay its limitations in order to gain the attention of the wider defence and security community and secure resources within the bureaucracy. For that wider community – lacking an understanding of the capability – it is often much easier to visualise the potential threats posed by novel weapons than the challenges involved in employing them effectively. Cyber warfare today is arguably at the peak of this inflated discourse,\n Sally Walker, 'Into the Grey Zone Podcast: Episode Five – Cyber Power (Part II)', Sky News, 3 June 2021, 06:00, <https: into-the-grey-zone-podcast-episode-five-cyber-power-part-ii-12212228=\"\" news.sky.com=\"\" story=\"\">, accessed 26 July 2021.\n Ibid., 10:30.\n National Audit Office, Investigation: WannaCry Cyber Attack and the NHS, HC 414 (London: National Audit Office, 2018).\n This is visualised in Gartner, 'Gartner Hype Cycle', <https: gartner-hype-cycle=\"\" en=\"\" methodologies=\"\" research=\"\" www.gartner.com=\"\">, accessed 30 March 2021.</https:></https:>\nJustin Bronk and Jack Watling\nwhere its importance is recognised but its implications remain poorly understood beyond the limited community of technical specialists.\nIn briefings, military commanders often characterise cyber capabilities by the speed, scale and sophistication of the effect. Outlining the challenge of 'convergence' between warfighting domains, Lieutenant General Eric Wesley described how 'cyber is moving at milliseconds, ships are moving at 30 knots, vehicles at 30 km. The ability to synchronise that might be a bit of a stretch'. As well as an expectation of near-instantaneous effects, there is a persistent fear of the devastation that could be wrought. General Wesley Clark, former NATO Supreme Commander Europe, warned that 'it's possible to shut down critical infrastructure, refineries, businesses, banks, transportation – but most importantly, the electricity grid. It's been done by the Russians in the Ukraine'. Finally, there is a great deal of anxiety in militaries about the sophistication of cyber effects against conventional military systems. General John Allen, for instance, hypothesised about an incident in which a US Navy vessel had its defensive systems rendered ineffective by cyber attack, making it vulnerable to conventional munitions.\nA more thorough examination of the mechanics of cyber warfare renders much of this military discourse highly hyperbolic. Although data can travel quickly, cyber attacks are slow to develop and deliver, and often unpredictable and isolated in their effects. The challenge with integrating cyber effects into multi-domain operations is the opposite of the problem suggested by Wesley – that cyber attacks take far too long to easily synchronise with conventional operations. As Walker noted, 'it just doesn't relate to conventional warfare'. A realistic appreciation of the impact of cyber capabilities on the future of warfare must begin with a concrete understanding of how cyber attacks work. Appreciating what is required to attack a digital system reveals its limitations and so allows for the potential impact of such techniques on warfare to be put into perspective. This chapter seeks to explain how cyber attacks function and suggests their likely trajectory on the future battlefield.[9]\n[5] US Department of Defense, 'AUSA Global Force Symposium: Day 3 – Opening Remarks and Keynote Speaker', 18 March 2021, 35:00, <https: dod.defense.gov=\"\" index?videoid=\"668339\" news=\"\" special-reports=\"\" videos=\"\">, accessed 26 July 2021.\n[6] Mandi Kogosowski, “We’re on the Brink of an Enormous Cyber Catastrophe”, *Israel Defense*, 4 June 2021, <https: 49194=\"\" en=\"\" node=\"\" www.israeldefense.co.il=\"\">, accessed 26 July 2021.\n[7] John R Allen and Amir Hussain, 'On Hyperwar', *Proceedings Magazine* (Vol. 143, No. 7, 2017), p. 1373.\n[8] Walker, 'Into the Grey Zone Podcast', 13:49.\n[9] Cyber practitioners are necessarily very precise in the language they employ. This chapter is intended to help non-cyber practitioners understand key concepts and</https:></https:>\nThe Slow and Imprecise Art of Cyber Warfare\n# The Anatomy of a Cyber Attack\nCyber activity is primarily concerned with the virtual dimension, which is characterised by its dependence on invented languages. Information encoded in these invented languages comprises data. Military cyber attacks seek to achieve at least one of three things: to access data that an adversary does not wish to share; to change the data that an adversary holds; or to destroy an adversary's data. The first requirement for conducting a cyber attack is to identify that an adversary holds data. For example, a range table for a munition in a printed handbook exists in the physical dimension as paper and in the cognitive dimension if it has been memorised by an operator, but not in the virtual dimension. If, however, the range table has been translated into data and is stored on a digital device, it exists in the virtual dimension and can be subjected to cyber attack. If this data is accessible as part of a fire control system supporting geographically dispersed artillery pieces, then that data must be remotely accessible via a network. It can therefore be attacked remotely.\nSince the virtual dimension is fabricated, it is usually not immediately apparent to an external party what systems have been digitised, what they are connected to, or what languages are used to store the data and manage the network. Furthermore, programming languages do not simply store information but also contain grammar for describing commands that the system can execute. These commands describe how the data is to be stored, who has permission to access it, and what checks are carried out to determine who each user is. All of these facets of a network are invisible to an intruder until they have interacted with part of that\nuses analogy and imprecise terms to aid accessibility. The authors apologise to specialists in the field for the resulting lack of precision.\n Ministry of Defence, 'Joint Doctrine Publication 0-30: UK Air and Space Power', 2ⁿᵈ edition, December 2017, p. 17.\n David J Peterson, *Art of Language Invention, The: From Horse-Lords to Dark Elves to Sand Worms, the Words Behind World-Building* (London: Penguin, 2015), pp. 21–22.\n The subset of invented languages used in computing comprises markup and programming languages. Markup languages allow the programming instructions to not be displayed when displaying data in a non-programming language. See Thomas Powell, *HTML &amp; XHTML: The Complete Reference* (New York, NY: McGraw-Hill, 2003), p. 25. Programming languages use imperative and declarative syntax to describe and command the execution of specified functions, see Michael Gordon, *Programming Language Theory and Its Implementation* (Hoboken: Prentice Hall, 1988).\n These offensive aims can be understood as the offensive mirror image of the CIA's triad model of cybersecurity principles: confidentiality; integrity; and availability. See 'What Is Security Analysis?', <https: cia.htm=\"\" security=\"\" www.doc.ic.ac.uk=\"\" ~ajs300=\"\">, accessed 21 October 2021.</https:>\nJustin Bronk and Jack Watling\nnetwork. Therefore, having determined that a digital target exists, an attacker must seek to intrude into the network which contains it, and exfiltrate data to determine how that network is constructed and by what languages it is governed.\nA lack of information about a network makes designing penetrations that are difficult to detect almost impossible, just as it is very difficult for a non-native speaker of a language to pass as a native speaker.[14] For this reason, the initial penetration and mapping of networks involves an extensive reconnaissance effort. Attackers will often conduct a high volume of unsophisticated attacks on the basis that while only a few will make any headway into the network, they will generate valuable information about which nodes in the network hold administrative privileges and how the protocols that govern the network function.[15] Large-scale unsophisticated attacks produce a constant noise so that adversaries cannot necessarily determine what is being targeted. In many ways, this is because the purpose is to find what targets might be available. This is comparable to a reconnaissance by force, or advance to contact, rather than a deliberate reconnaissance. However, the defenders will try to identify who is perpetrating this reconnaissance in order to anticipate what subsequent, more sophisticated attacks might look like.[16]\nOnce the shape of a network and the location of data and privileges are identified, an attacker will begin to craft specialised attacks to gain access to those points. This will often require detailed information about the humans who govern these points in the network, and how they interact with it in the physical dimension, because this can provide valuable information about how to attack the system.[17] These deliberate attacks against identified nodes must be carried out without being detected. If an intrusion is detected, the defender can simply sever the node that has been penetrated or change the permissions to deny it any useful access to the rest of the network. At that point, the attacker must\n[14] Simon Müller, 'Discourse Makers in Native and Non-Native English Discourse', PhD submission to Justus Liebig University Giessen, Amsterdam, 2004; Melissa M Baese-Berk and Tuuli H Morrill, 'Speaking Rate Consistency in Native and Non-Native Speakers of English', *Journal of the Acoustical Society of America* (Vol. 138, No. 3, 2015), pp. 223–28.\n[15] H P Sanghvi and M S Dahiya, 'Cyber Reconnaissance: An Alarm Before Cyber Attack', *International Journal of Computer Applications* (Vol. 63, No. 6, 2013), pp. 36–38.\n[16] This is the purpose of cyber threat intelligence. See Henry Dalziel, *How to Define and Build an Effective Cyber Threat Intelligence Capability* (Waltham, MA: Syngress, 2015).\n[17] Micah Zenko, *Red Team: How to Succeed by Thinking Like the Enemy* (New York, NY: Basic Books, 2015), pp. 171–83.\nThe Slow and Imprecise Art of Cyber Warfare\nbegin from scratch against a defender that has gained information about the attacker's techniques and signature.\nAfter a critical node is penetrated, data from it must be exfiltrated and analysed to allow the attacker to see further into the network and target the next node up the chain. Ultimately, the aim is for the attacker to gain access to repositories of data, or to components of a system that can control other parts of the system. Whereas most parts of a network have the right to read a limited set of data, some administrative nodes have permission to rewrite the instructions governing the system. Attackers seek access to administrators because these accounts can change or destroy the data or physical infrastructure that constitute the enemy system. For example, an administrator for a fire control system might substitute an accurate range table for an inaccurate one, ensuring the artillery system as a whole misses any target it tries to engage. Alternatively, it could delete the range table so that the system cannot calculate firing solutions. The administrator could even delete the instructions for the system to read a range table, and then destroy the instructions for the system to accept new instructions so that the defender cannot simply upload a new range table when the data is found to be missing.\nAlmost all components of a network will be subject to varying levels of encryption which must be cracked or bypassed by an attacker at each stage. This could require the entry of a simple password, or for more sensitive and better defended systems, a three-part authentication comprising something known by the individual who owns the node (a password), something they have (a physical key), and something they are (biometric data). Passwords to confirm that someone requesting access to a system is the right individual can be cracked through a brute force (guessing all possible combinations) or analytical attack. The latter method can be invalidated by randomly generating passwords. In practice, any effectively defended system will have millions of possible solutions to passwords at each level, and incorrect entries will attract the attention of defenders. For this reason, attackers will endeavour to bypass passwords through hacking. Hacking involves the interrogation of the code to find ambiguities through which an attack can convince the system that a password is not necessary or has been entered when it has not.[18]\n[18] There is an alternative distinction drawn between hacking and cracking that is framed in ethical terms, with the former being constructive and the latter destructive. In practice, this ethical distinction – while important in the early days of the internet – has fragmented. See John P Carlin with Garrett M Graff, *Dawn of the Code War: America's Battle Against Russia, China, and the Rising Global Cyber Threat* (New York, NY: Public Affairs, 2018), chapter 1.\nJustin Bronk and Jack Watling\nTo envisage how a hack works, consider the consequences of someone using poor grammar, as in the sentence: 'Correct and verified, the user may decrypt the data'. In conversation, this can be understood to mean 'if the user has been correctly identified and verified, then they may decrypt the data'. However, the sentence could equally be literally interpreted as saying 'the user is correct and verified and may decrypt the data'. A hack would suggest to the system that it should proceed with the latter interpretation. Because complex code involves thousands of lines of instruction, often written by multiple people at different times, there will often be minor contradictions or ambiguities that can be discovered and then leveraged by an attacker.[19]\nWhen these ambiguities and contradictions are part of the code in a system, they are termed 'zero-days' because they are vulnerabilities that were introduced into the system by the way it was designed, and at the time of discovery represent an open vulnerability that has not been patched, leaving defenders with zero days to resolve the problem. By storing zero-day exploits which they discover through reconnaissance efforts, an attacker can subsequently employ them to bypass a system's defences. However, just as the poor grammar cited above can be clarified, so too can a defender clarify their coding to make a system more secure. If, therefore, they identify that a zero-day exploit has enabled penetration of their network, they can often patch the system to edit out and close the vulnerability, or else closely monitor it to gain intelligence on potential ongoing or future attacks. Consequently, attackers must make a trade-off between the value of accessing a system at any given time and the risk of losing the ability to bypass its encryption or being rapidly attributed and potentially counter-attacked if discovered.\nAttacking sensitive digital systems is further complicated by the fact that they are often air-gapped, meaning they are not susceptible to remote access. This means that, to attack them, an adversary must either create an artificial connection to the outside world or physically plug into the air-gapped network without being detected. This may require multiple physical penetrations since the first intrusion may simply allow the attacker to collect information about what language the system uses and how it is structured. They must then physically penetrate the system a second time to deliver a designed payload to attack it. If they do not wish to immediately activate the delivered payload, they may need to\n[19] A common issue is poor hygiene in compound coding for signifier/signified correlation. See Paolo Rocchi, 'The Concepts of Signifier/Signified Revisited', IBM, <http: dtmd=\"\" rocchi.pdf=\"\" presentations=\"\" mcs.open.ac.uk=\"\" session%202=\"\">, accessed 30 March 2021.</http:>\nThe Slow and Imprecise Art of Cyber Warfare\npenetrate the system a third time to trigger the attack at the desired point in time.\nA cyber attack may therefore be envisaged as comprising seven stages:\n1. Reconnaissance: to understand the target network.\n2. Weaponisation: designing a payload to exploit vulnerabilities.\n3. Delivery: insertion of the payload through the system.\n4. Exploitation: using new access to identify and target the key node.\n5. Installation: installing the payload at the target node of the system.\n6. Command and control: having a means of initiating the payload.\n7. Action on objectives: having the desired effect on the system.\nAttempting to gain entry to a complex defended system may require several iterations of this cycle as the attackers fight their way into the network. Against a complex network with multiple layers, which ultimately ends in an air-gapped component, working into a network may take between one and three years. While embedding malicious capabilities into public utilities or other legacy civilian systems may be more straightforward, attacking military systems is complex, sensitive and has a significant lead time, requiring payloads to be embedded during peacetime if they are to be available during war.\nIf a cyber attack is prosecuted in peacetime and the payload initiated before the outbreak of war, its effects will either be limited or escalatory. For example, to return to the artillery fire control system, if it were penetrated and the range tables altered prior to a conflict, this could mean that the change would be noticed during an exercise, the range tables corrected and the system security patched prior to a conflict. Alternatively, it could mean that during the same exercise the artillery kills friendly forces. This would lead to an investigation and, if the cause could be attributed to a hostile cyber attack, it would lead to a significant\n Joseph Raczynski, ‘Kill Chain: The 7 Stages of a Cyberattack’, *Thomson Reuters*, 12 October 2018.\n Author interview with a senior CTI director at a major bank, March 2021; author interview with a senior military cyber warfare officer, February 2021; author interview with a law enforcement officer specialising in counter-cyber operations, January 2021.\n House of Commons, ‘A Major Cyber Attack on the UK is a Matter of “When, Not If”’, Joint Committee on the National Security Strategy, 22 January 2018, <https: index.html=\"\" jcnss-cni-report=\"\" houseofcommons.shorthandstories.com=\"\">, accessed 30 March 2021.</https:>\nJustin Bronk and Jack Watling\nescalation in tensions or could even be interpreted by the victim as a casus belli.\nConversely, a cyber payload that sits dormant in a system until activated during a conflict presents other challenges. It must either be activated automatically when certain criteria are met or manually. The latter requires a sustained capacity to connect to the system at short notice to be maintained by the attacker. For military systems – given the changes that occur when a state transitions to war – this may be difficult, requiring the embedding of agents with knowledge of the penetration inside the enemy force. However, a payload that monitors the system so that it can activate under certain conditions is an active rather than passive insertion and is, therefore, more susceptible to detection. It could also activate under circumstances unforeseen by the attacker.\nThe final limitation of a military cyber capability is that cyber attacks function by inserting data into a system so that it is directed to behave in a specific manner. It is effective not in itself, but because of how the payload interacts with the rest of the system. Because the system is fabricated, however, and the language invented, it is subject to being expanded, divided, updated and changed in fundamental ways. Therefore, a payload that must remain dormant may be activated only to find that the surrounding environment has been altered to the extent that its code no longer makes any sense within the language with which it is supposed to interact. A well-defended system will be periodically patched so that changes like this should be routine. The result is that while militaries may spend years embedding capabilities into a network, they have no guarantees that when the time comes it will function as anticipated. Consequently, cyber attacks are unpredictable in their effects and are difficult to synchronise with established military planning and operations. This is a significant limitation, as the high lethality, mobility and relatively low quantities of most modern military capabilities mean that precise timing and coordination between different joint force elements are even more essential than they were in previous eras.\n## The Military Application of Cyber Weapons\nThere are limited scenarios in which a cyber attack can have a decisive operational or strategic effect when used in isolation. The most famous strategic cyber attack is the Stuxnet worm which formed part of a series of attacks on Iranian nuclear fuel enrichment centrifuges from 2008.\n Jens Stoltenberg, ‘NATO Will Defend Itself’, NATO, last updated 29 August 2019, <https: en=\"\" en=\"\" natohq=\"\" news_168435.htm?selectedlocale=\"en\" www.nato.int=\"\">, accessed 30 March 2021.</https:>\nThe Slow and Imprecise Art of Cyber Warfare\nEstimates vary but some suggest that enough disruption was caused to set back Iranian nuclear enrichment by 18 to 24 months. However, the system reconnaissance and infiltration process took years, having reportedly begun in 2005. Furthermore, when Stuxnet leaked accidentally beyond the air-gapped nuclear facility network, its code was subsequently identified and analysed by states and cyber security firms around the world. This resulted in public attribution of the Stuxnet attack itself to intelligence agencies in the US and Israel, as well as the probable attribution of other cyber weapons which appear to function in a similar manner. It also gave Iran and other national and civilian organisations the opportunity to examine a strategic cyber payload described by a senior cyber security professional as 'by far the most complex piece of code that we've looked at – in a completely different league from anything we'd ever seen before'.\nThe Stuxnet leak, and the US/Israeli cyber operations against Iran's uranium enrichment programme as a whole, illustrate some of the key practical characteristics of cyber warfare as a standalone tool of national power. Attacks on defended systems require years of preparation to identify, infiltrate and exploit weak points. Once triggered, even very sophisticated payloads will be discovered, analysed and ultimately identified. The effects created can only ever be temporary in isolation, as states will patch their systems and replace damaged machinery if not prevented from doing so by other means. When the payloads are ultimately identified and analysed, peer and near-peer states can use insights gained to ascribe probable attribution, and also potentially to develop or enhance their own offensive cyber capabilities.\nLess sophisticated cyber payloads than Stuxnet-type cyber weapons can still be highly effective in causing standalone disruption and potentially physical damage if conducted against less defended systems such as those which control civilian infrastructure. Examples include the attack on a German steel mill in 2014, and the WannaCry ransomware attacks which caused major disruption to the NHS in 2017. States such as Russia and\n David E Sanger, ‘Obama Order Sped Up Wave of Cyberattacks Against Iran’, *New York Times*, 1 June 2012.\n *Ibid.*\n Josh Fruhlinger, ‘What is Stuxnet, Who Created It and How Does It Work?’, *CSO Online*, 22 August 2017, <https: 3218104=\"\" article=\"\" what-is-stuxnet-who-created-it-and-how-does-it-work.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.\n *Ibid.*\n TrendMicro, ‘German Steel Plant Suffers Significant Damage from Targeted Attack’, 12 January 2015, <https: fr=\"\" security=\"\" news=\"\" cyber-attacks=\"\" german-steel-plant-suffers-significant-damage-from-targeted-attack=\"\" www.trendmicro.com=\"\" vinfo=\"\">, accessed 3 March 2021; Josh Fruhlinger, ‘What Is WannaCry Ransomware, How</https:></https:>\nJustin Bronk and Jack Watling\nNorth Korea regularly use quasi-criminal groups of hackers operating under loose state direction to demonstrate to expert communities their ability to disrupt and even directly damage civilian industry and critical national infrastructure (CNI). This capability is then tacitly leveraged to enhance deterrence messaging against potential state opponents. Some of these attacks exploit zero-day vulnerabilities, but most employ simple massed phishing attacks to infiltrate potential target networks. As such, they are much more effective against networks which rely on commercial operating systems which are well understood, do not use three-factor authentication security procedures and may be slow to implement security patches. The purpose of most attacks of this nature is also far less specific than strategic cyber weapons such as Stuxnet; either theft of information across a broad industrial sector, extortion or simply disruption for its own sake.\nFor most Western states, there are significant legal and ethical barriers to the use of offensive cyber capabilities against civilian targets, at least in any overt attempt at deterrence messaging. In any case, the ability to infiltrate civilian infrastructure and cause temporary disruption or even limited destructive effects is unlikely to deter a state opponent from conventional military action if it has already committed to such a high-risk course of action. The recent conflicts in eastern Ukraine and Nagorno-Karabakh provide compelling evidence that states are prepared to suffer extensive damage to both civilian and military targets without backing down from kinetic confrontations where national interests are clearly defined. As such, the immediate question for those who see the apocryphal cyber capability to 'turn out the lights in Moscow' as a cheaper replacement for conventional and nuclear deterrence tools is: what effect would such an attack have on a determined adversary, and for how long? It is perhaps ironic that hyperbolic narratives, such as that advanced by Nicole Perlroth, use Ukraine as the example of how devastating cyber attacks can be, while somehow overlooking the extent to which Ukraine has weathered and recovered from Russia's cyber onslaught.\nWhilst there are few situations in which cyber weapons can replace more traditional forms of military capability outright, there are many potential ways in which offensive cyber tools can be used as part of joint operations. For example, a previously inserted cyber payload might be\nDoes it Infect, and Who Was Responsible?, CSO Online, 30 August 2018, <https: 3227906=\"\" article=\"\" what-is-wannacry-ransomware-how-does-it-infect-and-who-was-responsible.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.\n Nicole Perlroth, This Is How They Tell Me the World Ends: The Cyberweapons Arms Race (London: Bloomsbury, 2021).</https:>\nThe Slow and Imprecise Art of Cyber Warfare\nused to disable or disrupt key adversary defence systems at a critical moment to enable a conventional attacking force to physically bypass or destroy them. Israel allegedly carried out just such an attack against the Syrian air defence network in 2007. The normally bristling air defence network was rendered blind to an Israeli Air Force strike package which entered Syrian airspace, bombed a nuclear facility and withdrew unchallenged. It is still unclear in the public domain whether this was a case of a cyber payload or advanced electronic warfare techniques opening the door for the Israeli aircraft. In general terms, whereas cyber attacks involve the theft, alteration or deletion of data, electronic warfare involves the detection or disruption of enemy sensors and the transmission of data using electromagnetic energy. While both rely on an attacker having knowledge of how a target system operates, electronic warfare can be applied as an active effect in real time without lengthy network reconnaissance, infiltration and payload activation. In practice, the line between the two techniques is increasingly blurring. For example, information about the exact software and hardware configurations of a radar, obtained via cyber attacks against the defence network which it sits within, might be used to tailor sophisticated electronic warfare attack options using digital emitters such as active electronically scanned array radar sets. In this context, however, the cyber attack would have occurred long before the electronic attack, with the theft of data enabling conventional electronic warfare capabilities. What is clear, however, is that the Israeli attack in 2007 was successful because it blended cyber and/or electronic attack with a precisely choreographed application of traditional firepower. The attack on the Syrian air defence network itself was not intended to create strategic effects, but as an enabling capability it greatly reduced the risk profile and increased the effectiveness of an otherwise conventional strike operation.\nThe use of cyber attacks to 'open the door' for conventional forces in this way is dependent on several key factors. First, that the potential target can be identified well in advance of any requirement to exploit a breach. This is to allow sufficient time for the required reconnaissance, penetration and delivery stages of cyber attack preparation to be conducted. Second, in the case of an attack against a target such as an integrated air defence system (IADS), this activity will have to be coordinated with traditional intelligence gathering about the physical\n Sharon Weinberger, 'How Israel Spoofed Syria's Air Defense System', WIRED, 4 October 2007.\n BBC News, 'Israel Admits Striking Suspected Syrian Nuclear Reactor in 2007', 21 March 2018.\nlocations, individual system capabilities and patterns of movement exhibited by the radars and missile launchers themselves. This is so that the required virtual effects can be identified in terms of practical effects in the physical dimension, and it requires in-depth intelligence which will need to be gathered in multiple domains. This in turn introduces a third dependency for using cyber weapons in this way to enable conventional attacks; permissions and security clearance levels. Continuing with the IADS example, the required physical and network reconnaissance and intelligence-gathering activities would likely draw on resources from air force(s), multiple intelligence agencies and special forces operations. Many of these assets will require very high-level authorisation for tasking, and the products generated will be highly classified and not widely distributed within the military as a whole. As such, the successful use of cyber attacks as a coordinated enabler for conventional military operations requires operational planners to be aware of the art of the possible, in areas where they are unlikely to be in most countries by default. The final major dependency for this sort of attack is a linked one. Imagine a case where a cyber capability has been successfully developed and implanted with a compatible activation mechanism in a specific adversary defence system, and an operational commander is aware of it. In order to employ it, that commander must be able to justify its use to enable their conventional operation, given that once the cyber weapon is used the adversary will rapidly reset their systems, discover the vulnerability and patch it. In the case of the 2007 attack by the Israeli Air Force on a Syrian nuclear reactor, head of state authorisation would almost certainly have been granted for the operation, and the expending of a developed cyber capability (if indeed it was one) embedded over several years in the Syrian IADS deemed worthwhile to enable it. However, for more routine or ongoing military operations, cyber weapons will likely remain a capability held for specific situations rather than a regular feature. Furthermore, if military operations take place in an unforeseen context, it is unlikely that sufficient time will be available to prepare as thoroughly as Israel was able to do against its traditional rival to the north.\nA more ad-hoc use of disruptive cyber operations against CNI and military enabling capabilities is more likely to characterise the routine use of cyber capabilities in warfare in the coming decade. If the requirement is not to create a catastrophic failure in key military systems at a specific point in time to directly enable conventional operations, then the\nThe Slow and Imprecise Art of Cyber Warfare\ndependencies placed on cyber specialists are less onerous. For example, Russia has conducted a range of cyber attacks against Ukrainian military and civilian systems as part of its hybrid war against the country since 2014. These have included attacks on Ukrainian military communications in coordination with intensive electronic warfare operations, as well as attacks on the national power grid and banking system. The result was to impose further disruption and costs on the government in Kyiv in conjunction with sustained direct and indirect military support to rebel groups in Donetsk and Luhansk oblasts. In other words, cyber warfare offers states another vector through which to pressure opposing states in conjunction with traditional hard and soft power tools. In a NATO context, obvious potential targets for Russian cyber attacks in the event of a major crisis or limited conflict would be the networks which control the civilian port and rail infrastructure which would be critical for mobilisation and the deployment of conventional military forces to eastern Europe. Such attacks could have significant or even decisive effects on the strategic picture for the Alliance if coupled with sustained conventional and nuclear force posturing. However, on their own, they would only delay rather than prevent military capabilities being brought to bear.\nIn considering the impact of cyber warfare on future operations, militaries are clearly correct to be taking the security of their systems seriously. Offensive cyber operations offer opportunities to gain contextual tactical advantage by disrupting the functioning of enemy systems and undermining the adversary's confidence in their equipment. They also allow for the shaping of the human terrain around which fighting takes place when aimed at civilian systems. Nevertheless, cyber attacks should not be seen as an alternative to hard power. Nor can cyber attacks function as a standalone solution.\nFinally, the opportunities offered by offensive cyber capabilities are difficult to guarantee at a specified time and place, and so cannot be relied on as a foundational capability in deterrence terms. Cyber warfare is real and cannot be ignored. But for now, it remains slow and imprecise compared to more traditional levers of military power.\n23",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 40,
        "success_occurrences": 40,
        "success_unique": 20,
        "bib_unique_total": 20,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 1.0,
        "success_percentage": 100.0,
        "style": "superscript"
      },
      "results": [
        {
          "index": 1,
          "intext_citation": "¹",
          "preceding_text": "",
          "footnote": "Sally Walker, 'Into the Grey Zone Podcast: Episode Five – Cyber Power (Part II)', Sky News, 3 June 2021, 06:00, <https: into-the-grey-zone-podcast-episode-five-cyber-power-part-ii-12212228=\"\" news.sky.com=\"\" story=\"\">, accessed 26 July 2021.",
          "position": 980
        },
        {
          "index": 2,
          "intext_citation": "²",
          "preceding_text": "",
          "footnote": "Ibid., 10:30.",
          "position": 1284
        },
        {
          "index": 3,
          "intext_citation": "³",
          "preceding_text": "",
          "footnote": "National Audit Office, Investigation: WannaCry Cyber Attack and the NHS, HC 414 (London: National Audit Office, 2018).",
          "position": 1492
        },
        {
          "index": 4,
          "intext_citation": "⁴",
          "preceding_text": "",
          "footnote": "This is visualised in Gartner, 'Gartner Hype Cycle', <https: gartner-hype-cycle=\"\" en=\"\" methodologies=\"\" research=\"\" www.gartner.com=\"\">, accessed 30 March 2021.</https:></https:>",
          "position": 1600
        },
        {
          "index": 1,
          "intext_citation": "¹",
          "preceding_text": "k of this inflated discourse,\n",
          "footnote": "Sally Walker, 'Into the Grey Zone Podcast: Episode Five – Cyber Power (Part II)', Sky News, 3 June 2021, 06:00, <https: into-the-grey-zone-podcast-episode-five-cyber-power-part-ii-12212228=\"\" news.sky.com=\"\" story=\"\">, accessed 26 July 2021.",
          "position": 2180
        },
        {
          "index": 2,
          "intext_citation": "²",
          "preceding_text": "",
          "footnote": "Ibid., 10:30.",
          "position": 2424
        },
        {
          "index": 3,
          "intext_citation": "³",
          "preceding_text": "",
          "footnote": "National Audit Office, Investigation: WannaCry Cyber Attack and the NHS, HC 414 (London: National Audit Office, 2018).",
          "position": 2440
        },
        {
          "index": 4,
          "intext_citation": "⁴",
          "preceding_text": "",
          "footnote": "This is visualised in Gartner, 'Gartner Hype Cycle', <https: gartner-hype-cycle=\"\" en=\"\" methodologies=\"\" research=\"\" www.gartner.com=\"\">, accessed 30 March 2021.</https:></https:>",
          "position": 2561
        },
        {
          "index": 10,
          "intext_citation": "¹⁰",
          "preceding_text": "ed with the virtual dimension,",
          "footnote": "Ministry of Defence, 'Joint Doctrine Publication 0-30: UK Air and Space Power', 2ⁿᵈ edition, December 2017, p. 17.",
          "position": 5936
        },
        {
          "index": 11,
          "intext_citation": "¹¹",
          "preceding_text": "",
          "footnote": "David J Peterson, *Art of Language Invention, The: From Horse-Lords to Dark Elves to Sand Worms, the Words Behind World-Building* (London: Penguin, 2015), pp. 21–22.",
          "position": 6002
        },
        {
          "index": 12,
          "intext_citation": "¹²",
          "preceding_text": "",
          "footnote": "The subset of invented languages used in computing comprises markup and programming languages. Markup languages allow the programming instructions to not be displayed when displaying data in a non-programming language. See Thomas Powell, *HTML &amp; XHTML: The Complete Reference* (New York, NY: McGraw-Hill, 2003), p. 25. Programming languages use imperative and declarative syntax to describe and command the execution of specified functions, see Michael Gordon, *Programming Language Theory and Its Implementation* (Hoboken: Prentice Hall, 1988).",
          "position": 6068
        },
        {
          "index": 13,
          "intext_citation": "¹³",
          "preceding_text": "",
          "footnote": "These offensive aims can be understood as the offensive mirror image of the CIA's triad model of cybersecurity principles: confidentiality; integrity; and availability. See 'What Is Security Analysis?', <https: cia.htm=\"\" security=\"\" www.doc.ic.ac.uk=\"\" ~ajs300=\"\">, accessed 21 October 2021.</https:>",
          "position": 6275
        },
        {
          "index": 10,
          "intext_citation": "¹⁰",
          "preceding_text": "",
          "footnote": "Ministry of Defence, 'Joint Doctrine Publication 0-30: UK Air and Space Power', 2ⁿᵈ edition, December 2017, p. 17.",
          "position": 7743
        },
        {
          "index": 11,
          "intext_citation": "¹¹",
          "preceding_text": "",
          "footnote": "David J Peterson, *Art of Language Invention, The: From Horse-Lords to Dark Elves to Sand Worms, the Words Behind World-Building* (London: Penguin, 2015), pp. 21–22.",
          "position": 7861
        },
        {
          "index": 12,
          "intext_citation": "¹²",
          "preceding_text": "",
          "footnote": "The subset of invented languages used in computing comprises markup and programming languages. Markup languages allow the programming instructions to not be displayed when displaying data in a non-programming language. See Thomas Powell, *HTML &amp; XHTML: The Complete Reference* (New York, NY: McGraw-Hill, 2003), p. 25. Programming languages use imperative and declarative syntax to describe and command the execution of specified functions, see Michael Gordon, *Programming Language Theory and Its Implementation* (Hoboken: Prentice Hall, 1988).",
          "position": 8030
        },
        {
          "index": 13,
          "intext_citation": "¹³",
          "preceding_text": "",
          "footnote": "These offensive aims can be understood as the offensive mirror image of the CIA's triad model of cybersecurity principles: confidentiality; integrity; and availability. See 'What Is Security Analysis?', <https: cia.htm=\"\" security=\"\" www.doc.ic.ac.uk=\"\" ~ajs300=\"\">, accessed 21 October 2021.</https:>",
          "position": 8583
        },
        {
          "index": 20,
          "intext_citation": "²⁰",
          "preceding_text": "",
          "footnote": "Joseph Raczynski, ‘Kill Chain: The 7 Stages of a Cyberattack’, *Thomson Reuters*, 12 October 2018.",
          "position": 18374
        },
        {
          "index": 21,
          "intext_citation": "²¹",
          "preceding_text": "",
          "footnote": "Author interview with a senior CTI director at a major bank, March 2021; author interview with a senior military cyber warfare officer, February 2021; author interview with a law enforcement officer specialising in counter-cyber operations, January 2021.",
          "position": 18685
        },
        {
          "index": 22,
          "intext_citation": "²²",
          "preceding_text": "s may be more straightforward,",
          "footnote": "House of Commons, ‘A Major Cyber Attack on the UK is a Matter of “When, Not If”’, Joint Committee on the National Security Strategy, 22 January 2018, <https: index.html=\"\" jcnss-cni-report=\"\" houseofcommons.shorthandstories.com=\"\">, accessed 30 March 2021.</https:>",
          "position": 18810
        },
        {
          "index": 20,
          "intext_citation": "²⁰",
          "preceding_text": "t would lead to a significant\n",
          "footnote": "Joseph Raczynski, ‘Kill Chain: The 7 Stages of a Cyberattack’, *Thomson Reuters*, 12 October 2018.",
          "position": 19645
        },
        {
          "index": 21,
          "intext_citation": "²¹",
          "preceding_text": "",
          "footnote": "Author interview with a senior CTI director at a major bank, March 2021; author interview with a senior military cyber warfare officer, February 2021; author interview with a law enforcement officer specialising in counter-cyber operations, January 2021.",
          "position": 19747
        },
        {
          "index": 22,
          "intext_citation": "²²",
          "preceding_text": "",
          "footnote": "House of Commons, ‘A Major Cyber Attack on the UK is a Matter of “When, Not If”’, Joint Committee on the National Security Strategy, 22 January 2018, <https: index.html=\"\" jcnss-cni-report=\"\" houseofcommons.shorthandstories.com=\"\">, accessed 30 March 2021.</https:>",
          "position": 20005
        },
        {
          "index": 23,
          "intext_citation": "²³",
          "preceding_text": "",
          "footnote": "Jens Stoltenberg, ‘NATO Will Defend Itself’, NATO, last updated 29 August 2019, <https: en=\"\" en=\"\" natohq=\"\" news_168435.htm?selectedlocale=\"en\" www.nato.int=\"\">, accessed 30 March 2021.</https:>",
          "position": 20387
        },
        {
          "index": 24,
          "intext_citation": "²⁴",
          "preceding_text": "",
          "footnote": "David E Sanger, ‘Obama Order Sped Up Wave of Cyberattacks Against Iran’, *New York Times*, 1 June 2012.",
          "position": 22849
        },
        {
          "index": 23,
          "intext_citation": "²³",
          "preceding_text": "²⁴",
          "footnote": "Jens Stoltenberg, ‘NATO Will Defend Itself’, NATO, last updated 29 August 2019, <https: en=\"\" en=\"\" natohq=\"\" news_168435.htm?selectedlocale=\"en\" www.nato.int=\"\">, accessed 30 March 2021.</https:>",
          "position": 22852
        },
        {
          "index": 25,
          "intext_citation": "²⁵",
          "preceding_text": "",
          "footnote": "*Ibid.*",
          "position": 23325
        },
        {
          "index": 26,
          "intext_citation": "²⁶",
          "preceding_text": "",
          "footnote": "Josh Fruhlinger, ‘What is Stuxnet, Who Created It and How Does It Work?’, *CSO Online*, 22 August 2017, <https: 3218104=\"\" article=\"\" what-is-stuxnet-who-created-it-and-how-does-it-work.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.",
          "position": 23741
        },
        {
          "index": 27,
          "intext_citation": "²⁷",
          "preceding_text": "",
          "footnote": "*Ibid.*",
          "position": 24046
        },
        {
          "index": 28,
          "intext_citation": "²⁸",
          "preceding_text": "",
          "footnote": "TrendMicro, ‘German Steel Plant Suffers Significant Damage from Targeted Attack’, 12 January 2015, <https: fr=\"\" security=\"\" news=\"\" cyber-attacks=\"\" german-steel-plant-suffers-significant-damage-from-targeted-attack=\"\" www.trendmicro.com=\"\" vinfo=\"\">, accessed 3 March 2021; Josh Fruhlinger, ‘What Is WannaCry Ransomware, How</https:></https:>",
          "position": 25279
        },
        {
          "index": 24,
          "intext_citation": "²⁴",
          "preceding_text": "²⁸ States such as Russia and",
          "footnote": "David E Sanger, ‘Obama Order Sped Up Wave of Cyberattacks Against Iran’, *New York Times*, 1 June 2012.",
          "position": 25308
        },
        {
          "index": 25,
          "intext_citation": "²⁵",
          "preceding_text": "",
          "footnote": "*Ibid.*",
          "position": 25415
        },
        {
          "index": 26,
          "intext_citation": "²⁶",
          "preceding_text": "*",
          "footnote": "Josh Fruhlinger, ‘What is Stuxnet, Who Created It and How Does It Work?’, *CSO Online*, 22 August 2017, <https: 3218104=\"\" article=\"\" what-is-stuxnet-who-created-it-and-how-does-it-work.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.",
          "position": 25426
        },
        {
          "index": 27,
          "intext_citation": "²⁷",
          "preceding_text": "",
          "footnote": "*Ibid.*",
          "position": 25669
        },
        {
          "index": 28,
          "intext_citation": "²⁸",
          "preceding_text": "*",
          "footnote": "TrendMicro, ‘German Steel Plant Suffers Significant Damage from Targeted Attack’, 12 January 2015, <https: fr=\"\" security=\"\" news=\"\" cyber-attacks=\"\" german-steel-plant-suffers-significant-damage-from-targeted-attack=\"\" www.trendmicro.com=\"\" vinfo=\"\">, accessed 3 March 2021; Josh Fruhlinger, ‘What Is WannaCry Ransomware, How</https:></https:>",
          "position": 25680
        },
        {
          "index": 29,
          "intext_citation": "²⁹",
          "preceding_text": "t advanced by Nicole Perlroth,",
          "footnote": "Nicole Perlroth, This Is How They Tell Me the World Ends: The Cyberweapons Arms Race (London: Bloomsbury, 2021).</https:>",
          "position": 28119
        },
        {
          "index": 29,
          "intext_citation": "²⁹",
          "preceding_text": "",
          "footnote": "Nicole Perlroth, This Is How They Tell Me the World Ends: The Cyberweapons Arms Race (London: Bloomsbury, 2021).</https:>",
          "position": 28811
        },
        {
          "index": 30,
          "intext_citation": "³⁰",
          "preceding_text": "",
          "footnote": "Sharon Weinberger, 'How Israel Spoofed Syria's Air Defense System', WIRED, 4 October 2007.",
          "position": 29233
        },
        {
          "index": 31,
          "intext_citation": "³¹",
          "preceding_text": "",
          "footnote": "BBC News, 'Israel Admits Striking Suspected Syrian Nuclear Reactor in 2007', 21 March 2018.",
          "position": 29420
        },
        {
          "index": 30,
          "intext_citation": "³⁰",
          "preceding_text": " gathering about the physical\n",
          "footnote": "Sharon Weinberger, 'How Israel Spoofed Syria's Air Defense System', WIRED, 4 October 2007.",
          "position": 31612
        },
        {
          "index": 31,
          "intext_citation": "³¹",
          "preceding_text": "",
          "footnote": "BBC News, 'Israel Admits Striking Suspected Syrian Nuclear Reactor in 2007', 21 March 2018.",
          "position": 31706
        }
      ],
      "flat_text": "Noosey Harcoins\nWhitehall Papers\nRoutledge Taylor &amp; Francis Group\nISSN: 0268-1307 (Print) 1754-5382 (Online) Journal homepage: www.tandfonline.com/journals/rwhi20\n# I. The Slow and Imprecise Art of Cyber Warfare\nJustin Bronk &amp; Jack Watling\nTo cite this article: Justin Bronk &amp; Jack Watling (2021) I. The Slow and Imprecise Art of Cyber Warfare, Whitehall Papers, 99:1, 11-23, DOI: 10.1080/02681307.2021.2005891\nTo link to this article: https://doi.org/10.1080/02681307.2021.2005891\nPublished online: 06 Dec 2021.\nSubmit your article to this journal\nArticle views: 536\nView related articles\nView Crossmark data\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rwhi20\n\nJUSTIN BRONK AND JACK WATLING\nSally Walker, former Director of Cyber at GCHQ, has stated that cyber attacks 'can have impact in the real world and you can do it at scale'. Because cyber attacks can target everything from financial systems and critical national infrastructure to political leaders and legal institutions – undermining trust and the rule of law – they can have an 'attrition' effect on the cohesion of states to which open societies 'are uniquely vulnerable'. Such warnings over the years, combined with high-profile incidents like the WannaCry ransomware attack against the NHS, have meant that military leaders have recognised the importance of the 'cyber domain'. When new forms of conflict first emerge, however, there is almost always a period of inflated expectation. For the small community within Defence who have worked in the margins to explore the novel capability, there is a tendency to hype its effects and downplay its limitations in order to gain the attention of the wider defence and security community and secure resources within the bureaucracy. For that wider community – lacking an understanding of the capability – it is often much easier to visualise the potential threats posed by novel weapons than the challenges involved in employing them effectively. Cyber warfare today is arguably at the peak of this inflated discourse,\n Sally Walker, 'Into the Grey Zone Podcast: Episode Five – Cyber Power (Part II)', Sky News, 3 June 2021, 06:00, <https: into-the-grey-zone-podcast-episode-five-cyber-power-part-ii-12212228=\"\" news.sky.com=\"\" story=\"\">, accessed 26 July 2021.\n Ibid., 10:30.\n National Audit Office, Investigation: WannaCry Cyber Attack and the NHS, HC 414 (London: National Audit Office, 2018).\n This is visualised in Gartner, 'Gartner Hype Cycle', <https: gartner-hype-cycle=\"\" en=\"\" methodologies=\"\" research=\"\" www.gartner.com=\"\">, accessed 30 March 2021.</https:></https:>\nJustin Bronk and Jack Watling\nwhere its importance is recognised but its implications remain poorly understood beyond the limited community of technical specialists.\nIn briefings, military commanders often characterise cyber capabilities by the speed, scale and sophistication of the effect. Outlining the challenge of 'convergence' between warfighting domains, Lieutenant General Eric Wesley described how 'cyber is moving at milliseconds, ships are moving at 30 knots, vehicles at 30 km. The ability to synchronise that might be a bit of a stretch'. As well as an expectation of near-instantaneous effects, there is a persistent fear of the devastation that could be wrought. General Wesley Clark, former NATO Supreme Commander Europe, warned that 'it's possible to shut down critical infrastructure, refineries, businesses, banks, transportation – but most importantly, the electricity grid. It's been done by the Russians in the Ukraine'. Finally, there is a great deal of anxiety in militaries about the sophistication of cyber effects against conventional military systems. General John Allen, for instance, hypothesised about an incident in which a US Navy vessel had its defensive systems rendered ineffective by cyber attack, making it vulnerable to conventional munitions.\nA more thorough examination of the mechanics of cyber warfare renders much of this military discourse highly hyperbolic. Although data can travel quickly, cyber attacks are slow to develop and deliver, and often unpredictable and isolated in their effects. The challenge with integrating cyber effects into multi-domain operations is the opposite of the problem suggested by Wesley – that cyber attacks take far too long to easily synchronise with conventional operations. As Walker noted, 'it just doesn't relate to conventional warfare'. A realistic appreciation of the impact of cyber capabilities on the future of warfare must begin with a concrete understanding of how cyber attacks work. Appreciating what is required to attack a digital system reveals its limitations and so allows for the potential impact of such techniques on warfare to be put into perspective. This chapter seeks to explain how cyber attacks function and suggests their likely trajectory on the future battlefield.[9]\n[5] US Department of Defense, 'AUSA Global Force Symposium: Day 3 – Opening Remarks and Keynote Speaker', 18 March 2021, 35:00, <https: dod.defense.gov=\"\" index?videoid=\"668339\" news=\"\" special-reports=\"\" videos=\"\">, accessed 26 July 2021.\n[6] Mandi Kogosowski, “We’re on the Brink of an Enormous Cyber Catastrophe”, *Israel Defense*, 4 June 2021, <https: 49194=\"\" en=\"\" node=\"\" www.israeldefense.co.il=\"\">, accessed 26 July 2021.\n[7] John R Allen and Amir Hussain, 'On Hyperwar', *Proceedings Magazine* (Vol. 143, No. 7, 2017), p. 1373.\n[8] Walker, 'Into the Grey Zone Podcast', 13:49.\n[9] Cyber practitioners are necessarily very precise in the language they employ. This chapter is intended to help non-cyber practitioners understand key concepts and</https:></https:>\nThe Slow and Imprecise Art of Cyber Warfare\n# The Anatomy of a Cyber Attack\nCyber activity is primarily concerned with the virtual dimension, which is characterised by its dependence on invented languages. Information encoded in these invented languages comprises data. Military cyber attacks seek to achieve at least one of three things: to access data that an adversary does not wish to share; to change the data that an adversary holds; or to destroy an adversary's data. The first requirement for conducting a cyber attack is to identify that an adversary holds data. For example, a range table for a munition in a printed handbook exists in the physical dimension as paper and in the cognitive dimension if it has been memorised by an operator, but not in the virtual dimension. If, however, the range table has been translated into data and is stored on a digital device, it exists in the virtual dimension and can be subjected to cyber attack. If this data is accessible as part of a fire control system supporting geographically dispersed artillery pieces, then that data must be remotely accessible via a network. It can therefore be attacked remotely.\nSince the virtual dimension is fabricated, it is usually not immediately apparent to an external party what systems have been digitised, what they are connected to, or what languages are used to store the data and manage the network. Furthermore, programming languages do not simply store information but also contain grammar for describing commands that the system can execute. These commands describe how the data is to be stored, who has permission to access it, and what checks are carried out to determine who each user is. All of these facets of a network are invisible to an intruder until they have interacted with part of that\nuses analogy and imprecise terms to aid accessibility. The authors apologise to specialists in the field for the resulting lack of precision.\n Ministry of Defence, 'Joint Doctrine Publication 0-30: UK Air and Space Power', 2ⁿᵈ edition, December 2017, p. 17.\n David J Peterson, *Art of Language Invention, The: From Horse-Lords to Dark Elves to Sand Worms, the Words Behind World-Building* (London: Penguin, 2015), pp. 21–22.\n The subset of invented languages used in computing comprises markup and programming languages. Markup languages allow the programming instructions to not be displayed when displaying data in a non-programming language. See Thomas Powell, *HTML &amp; XHTML: The Complete Reference* (New York, NY: McGraw-Hill, 2003), p. 25. Programming languages use imperative and declarative syntax to describe and command the execution of specified functions, see Michael Gordon, *Programming Language Theory and Its Implementation* (Hoboken: Prentice Hall, 1988).\n These offensive aims can be understood as the offensive mirror image of the CIA's triad model of cybersecurity principles: confidentiality; integrity; and availability. See 'What Is Security Analysis?', <https: cia.htm=\"\" security=\"\" www.doc.ic.ac.uk=\"\" ~ajs300=\"\">, accessed 21 October 2021.</https:>\nJustin Bronk and Jack Watling\nnetwork. Therefore, having determined that a digital target exists, an attacker must seek to intrude into the network which contains it, and exfiltrate data to determine how that network is constructed and by what languages it is governed.\nA lack of information about a network makes designing penetrations that are difficult to detect almost impossible, just as it is very difficult for a non-native speaker of a language to pass as a native speaker.[14] For this reason, the initial penetration and mapping of networks involves an extensive reconnaissance effort. Attackers will often conduct a high volume of unsophisticated attacks on the basis that while only a few will make any headway into the network, they will generate valuable information about which nodes in the network hold administrative privileges and how the protocols that govern the network function.[15] Large-scale unsophisticated attacks produce a constant noise so that adversaries cannot necessarily determine what is being targeted. In many ways, this is because the purpose is to find what targets might be available. This is comparable to a reconnaissance by force, or advance to contact, rather than a deliberate reconnaissance. However, the defenders will try to identify who is perpetrating this reconnaissance in order to anticipate what subsequent, more sophisticated attacks might look like.[16]\nOnce the shape of a network and the location of data and privileges are identified, an attacker will begin to craft specialised attacks to gain access to those points. This will often require detailed information about the humans who govern these points in the network, and how they interact with it in the physical dimension, because this can provide valuable information about how to attack the system.[17] These deliberate attacks against identified nodes must be carried out without being detected. If an intrusion is detected, the defender can simply sever the node that has been penetrated or change the permissions to deny it any useful access to the rest of the network. At that point, the attacker must\n[14] Simon Müller, 'Discourse Makers in Native and Non-Native English Discourse', PhD submission to Justus Liebig University Giessen, Amsterdam, 2004; Melissa M Baese-Berk and Tuuli H Morrill, 'Speaking Rate Consistency in Native and Non-Native Speakers of English', *Journal of the Acoustical Society of America* (Vol. 138, No. 3, 2015), pp. 223–28.\n[15] H P Sanghvi and M S Dahiya, 'Cyber Reconnaissance: An Alarm Before Cyber Attack', *International Journal of Computer Applications* (Vol. 63, No. 6, 2013), pp. 36–38.\n[16] This is the purpose of cyber threat intelligence. See Henry Dalziel, *How to Define and Build an Effective Cyber Threat Intelligence Capability* (Waltham, MA: Syngress, 2015).\n[17] Micah Zenko, *Red Team: How to Succeed by Thinking Like the Enemy* (New York, NY: Basic Books, 2015), pp. 171–83.\nThe Slow and Imprecise Art of Cyber Warfare\nbegin from scratch against a defender that has gained information about the attacker's techniques and signature.\nAfter a critical node is penetrated, data from it must be exfiltrated and analysed to allow the attacker to see further into the network and target the next node up the chain. Ultimately, the aim is for the attacker to gain access to repositories of data, or to components of a system that can control other parts of the system. Whereas most parts of a network have the right to read a limited set of data, some administrative nodes have permission to rewrite the instructions governing the system. Attackers seek access to administrators because these accounts can change or destroy the data or physical infrastructure that constitute the enemy system. For example, an administrator for a fire control system might substitute an accurate range table for an inaccurate one, ensuring the artillery system as a whole misses any target it tries to engage. Alternatively, it could delete the range table so that the system cannot calculate firing solutions. The administrator could even delete the instructions for the system to read a range table, and then destroy the instructions for the system to accept new instructions so that the defender cannot simply upload a new range table when the data is found to be missing.\nAlmost all components of a network will be subject to varying levels of encryption which must be cracked or bypassed by an attacker at each stage. This could require the entry of a simple password, or for more sensitive and better defended systems, a three-part authentication comprising something known by the individual who owns the node (a password), something they have (a physical key), and something they are (biometric data). Passwords to confirm that someone requesting access to a system is the right individual can be cracked through a brute force (guessing all possible combinations) or analytical attack. The latter method can be invalidated by randomly generating passwords. In practice, any effectively defended system will have millions of possible solutions to passwords at each level, and incorrect entries will attract the attention of defenders. For this reason, attackers will endeavour to bypass passwords through hacking. Hacking involves the interrogation of the code to find ambiguities through which an attack can convince the system that a password is not necessary or has been entered when it has not.[18]\n[18] There is an alternative distinction drawn between hacking and cracking that is framed in ethical terms, with the former being constructive and the latter destructive. In practice, this ethical distinction – while important in the early days of the internet – has fragmented. See John P Carlin with Garrett M Graff, *Dawn of the Code War: America's Battle Against Russia, China, and the Rising Global Cyber Threat* (New York, NY: Public Affairs, 2018), chapter 1.\nJustin Bronk and Jack Watling\nTo envisage how a hack works, consider the consequences of someone using poor grammar, as in the sentence: 'Correct and verified, the user may decrypt the data'. In conversation, this can be understood to mean 'if the user has been correctly identified and verified, then they may decrypt the data'. However, the sentence could equally be literally interpreted as saying 'the user is correct and verified and may decrypt the data'. A hack would suggest to the system that it should proceed with the latter interpretation. Because complex code involves thousands of lines of instruction, often written by multiple people at different times, there will often be minor contradictions or ambiguities that can be discovered and then leveraged by an attacker.[19]\nWhen these ambiguities and contradictions are part of the code in a system, they are termed 'zero-days' because they are vulnerabilities that were introduced into the system by the way it was designed, and at the time of discovery represent an open vulnerability that has not been patched, leaving defenders with zero days to resolve the problem. By storing zero-day exploits which they discover through reconnaissance efforts, an attacker can subsequently employ them to bypass a system's defences. However, just as the poor grammar cited above can be clarified, so too can a defender clarify their coding to make a system more secure. If, therefore, they identify that a zero-day exploit has enabled penetration of their network, they can often patch the system to edit out and close the vulnerability, or else closely monitor it to gain intelligence on potential ongoing or future attacks. Consequently, attackers must make a trade-off between the value of accessing a system at any given time and the risk of losing the ability to bypass its encryption or being rapidly attributed and potentially counter-attacked if discovered.\nAttacking sensitive digital systems is further complicated by the fact that they are often air-gapped, meaning they are not susceptible to remote access. This means that, to attack them, an adversary must either create an artificial connection to the outside world or physically plug into the air-gapped network without being detected. This may require multiple physical penetrations since the first intrusion may simply allow the attacker to collect information about what language the system uses and how it is structured. They must then physically penetrate the system a second time to deliver a designed payload to attack it. If they do not wish to immediately activate the delivered payload, they may need to\n[19] A common issue is poor hygiene in compound coding for signifier/signified correlation. See Paolo Rocchi, 'The Concepts of Signifier/Signified Revisited', IBM, <http: dtmd=\"\" rocchi.pdf=\"\" presentations=\"\" mcs.open.ac.uk=\"\" session%202=\"\">, accessed 30 March 2021.</http:>\nThe Slow and Imprecise Art of Cyber Warfare\npenetrate the system a third time to trigger the attack at the desired point in time.\nA cyber attack may therefore be envisaged as comprising seven stages:\n1. Reconnaissance: to understand the target network.\n2. Weaponisation: designing a payload to exploit vulnerabilities.\n3. Delivery: insertion of the payload through the system.\n4. Exploitation: using new access to identify and target the key node.\n5. Installation: installing the payload at the target node of the system.\n6. Command and control: having a means of initiating the payload.\n7. Action on objectives: having the desired effect on the system.\nAttempting to gain entry to a complex defended system may require several iterations of this cycle as the attackers fight their way into the network. Against a complex network with multiple layers, which ultimately ends in an air-gapped component, working into a network may take between one and three years. While embedding malicious capabilities into public utilities or other legacy civilian systems may be more straightforward, attacking military systems is complex, sensitive and has a significant lead time, requiring payloads to be embedded during peacetime if they are to be available during war.\nIf a cyber attack is prosecuted in peacetime and the payload initiated before the outbreak of war, its effects will either be limited or escalatory. For example, to return to the artillery fire control system, if it were penetrated and the range tables altered prior to a conflict, this could mean that the change would be noticed during an exercise, the range tables corrected and the system security patched prior to a conflict. Alternatively, it could mean that during the same exercise the artillery kills friendly forces. This would lead to an investigation and, if the cause could be attributed to a hostile cyber attack, it would lead to a significant\n Joseph Raczynski, ‘Kill Chain: The 7 Stages of a Cyberattack’, *Thomson Reuters*, 12 October 2018.\n Author interview with a senior CTI director at a major bank, March 2021; author interview with a senior military cyber warfare officer, February 2021; author interview with a law enforcement officer specialising in counter-cyber operations, January 2021.\n House of Commons, ‘A Major Cyber Attack on the UK is a Matter of “When, Not If”’, Joint Committee on the National Security Strategy, 22 January 2018, <https: index.html=\"\" jcnss-cni-report=\"\" houseofcommons.shorthandstories.com=\"\">, accessed 30 March 2021.</https:>\nJustin Bronk and Jack Watling\nescalation in tensions or could even be interpreted by the victim as a casus belli.\nConversely, a cyber payload that sits dormant in a system until activated during a conflict presents other challenges. It must either be activated automatically when certain criteria are met or manually. The latter requires a sustained capacity to connect to the system at short notice to be maintained by the attacker. For military systems – given the changes that occur when a state transitions to war – this may be difficult, requiring the embedding of agents with knowledge of the penetration inside the enemy force. However, a payload that monitors the system so that it can activate under certain conditions is an active rather than passive insertion and is, therefore, more susceptible to detection. It could also activate under circumstances unforeseen by the attacker.\nThe final limitation of a military cyber capability is that cyber attacks function by inserting data into a system so that it is directed to behave in a specific manner. It is effective not in itself, but because of how the payload interacts with the rest of the system. Because the system is fabricated, however, and the language invented, it is subject to being expanded, divided, updated and changed in fundamental ways. Therefore, a payload that must remain dormant may be activated only to find that the surrounding environment has been altered to the extent that its code no longer makes any sense within the language with which it is supposed to interact. A well-defended system will be periodically patched so that changes like this should be routine. The result is that while militaries may spend years embedding capabilities into a network, they have no guarantees that when the time comes it will function as anticipated. Consequently, cyber attacks are unpredictable in their effects and are difficult to synchronise with established military planning and operations. This is a significant limitation, as the high lethality, mobility and relatively low quantities of most modern military capabilities mean that precise timing and coordination between different joint force elements are even more essential than they were in previous eras.\n## The Military Application of Cyber Weapons\nThere are limited scenarios in which a cyber attack can have a decisive operational or strategic effect when used in isolation. The most famous strategic cyber attack is the Stuxnet worm which formed part of a series of attacks on Iranian nuclear fuel enrichment centrifuges from 2008.\n Jens Stoltenberg, ‘NATO Will Defend Itself’, NATO, last updated 29 August 2019, <https: en=\"\" en=\"\" natohq=\"\" news_168435.htm?selectedlocale=\"en\" www.nato.int=\"\">, accessed 30 March 2021.</https:>\nThe Slow and Imprecise Art of Cyber Warfare\nEstimates vary but some suggest that enough disruption was caused to set back Iranian nuclear enrichment by 18 to 24 months. However, the system reconnaissance and infiltration process took years, having reportedly begun in 2005. Furthermore, when Stuxnet leaked accidentally beyond the air-gapped nuclear facility network, its code was subsequently identified and analysed by states and cyber security firms around the world. This resulted in public attribution of the Stuxnet attack itself to intelligence agencies in the US and Israel, as well as the probable attribution of other cyber weapons which appear to function in a similar manner. It also gave Iran and other national and civilian organisations the opportunity to examine a strategic cyber payload described by a senior cyber security professional as 'by far the most complex piece of code that we've looked at – in a completely different league from anything we'd ever seen before'.\nThe Stuxnet leak, and the US/Israeli cyber operations against Iran's uranium enrichment programme as a whole, illustrate some of the key practical characteristics of cyber warfare as a standalone tool of national power. Attacks on defended systems require years of preparation to identify, infiltrate and exploit weak points. Once triggered, even very sophisticated payloads will be discovered, analysed and ultimately identified. The effects created can only ever be temporary in isolation, as states will patch their systems and replace damaged machinery if not prevented from doing so by other means. When the payloads are ultimately identified and analysed, peer and near-peer states can use insights gained to ascribe probable attribution, and also potentially to develop or enhance their own offensive cyber capabilities.\nLess sophisticated cyber payloads than Stuxnet-type cyber weapons can still be highly effective in causing standalone disruption and potentially physical damage if conducted against less defended systems such as those which control civilian infrastructure. Examples include the attack on a German steel mill in 2014, and the WannaCry ransomware attacks which caused major disruption to the NHS in 2017. States such as Russia and\n David E Sanger, ‘Obama Order Sped Up Wave of Cyberattacks Against Iran’, *New York Times*, 1 June 2012.\n *Ibid.*\n Josh Fruhlinger, ‘What is Stuxnet, Who Created It and How Does It Work?’, *CSO Online*, 22 August 2017, <https: 3218104=\"\" article=\"\" what-is-stuxnet-who-created-it-and-how-does-it-work.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.\n *Ibid.*\n TrendMicro, ‘German Steel Plant Suffers Significant Damage from Targeted Attack’, 12 January 2015, <https: fr=\"\" security=\"\" news=\"\" cyber-attacks=\"\" german-steel-plant-suffers-significant-damage-from-targeted-attack=\"\" www.trendmicro.com=\"\" vinfo=\"\">, accessed 3 March 2021; Josh Fruhlinger, ‘What Is WannaCry Ransomware, How</https:></https:>\nJustin Bronk and Jack Watling\nNorth Korea regularly use quasi-criminal groups of hackers operating under loose state direction to demonstrate to expert communities their ability to disrupt and even directly damage civilian industry and critical national infrastructure (CNI). This capability is then tacitly leveraged to enhance deterrence messaging against potential state opponents. Some of these attacks exploit zero-day vulnerabilities, but most employ simple massed phishing attacks to infiltrate potential target networks. As such, they are much more effective against networks which rely on commercial operating systems which are well understood, do not use three-factor authentication security procedures and may be slow to implement security patches. The purpose of most attacks of this nature is also far less specific than strategic cyber weapons such as Stuxnet; either theft of information across a broad industrial sector, extortion or simply disruption for its own sake.\nFor most Western states, there are significant legal and ethical barriers to the use of offensive cyber capabilities against civilian targets, at least in any overt attempt at deterrence messaging. In any case, the ability to infiltrate civilian infrastructure and cause temporary disruption or even limited destructive effects is unlikely to deter a state opponent from conventional military action if it has already committed to such a high-risk course of action. The recent conflicts in eastern Ukraine and Nagorno-Karabakh provide compelling evidence that states are prepared to suffer extensive damage to both civilian and military targets without backing down from kinetic confrontations where national interests are clearly defined. As such, the immediate question for those who see the apocryphal cyber capability to 'turn out the lights in Moscow' as a cheaper replacement for conventional and nuclear deterrence tools is: what effect would such an attack have on a determined adversary, and for how long? It is perhaps ironic that hyperbolic narratives, such as that advanced by Nicole Perlroth, use Ukraine as the example of how devastating cyber attacks can be, while somehow overlooking the extent to which Ukraine has weathered and recovered from Russia's cyber onslaught.\nWhilst there are few situations in which cyber weapons can replace more traditional forms of military capability outright, there are many potential ways in which offensive cyber tools can be used as part of joint operations. For example, a previously inserted cyber payload might be\nDoes it Infect, and Who Was Responsible?, CSO Online, 30 August 2018, <https: 3227906=\"\" article=\"\" what-is-wannacry-ransomware-how-does-it-infect-and-who-was-responsible.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.\n Nicole Perlroth, This Is How They Tell Me the World Ends: The Cyberweapons Arms Race (London: Bloomsbury, 2021).</https:>\nThe Slow and Imprecise Art of Cyber Warfare\nused to disable or disrupt key adversary defence systems at a critical moment to enable a conventional attacking force to physically bypass or destroy them. Israel allegedly carried out just such an attack against the Syrian air defence network in 2007. The normally bristling air defence network was rendered blind to an Israeli Air Force strike package which entered Syrian airspace, bombed a nuclear facility and withdrew unchallenged. It is still unclear in the public domain whether this was a case of a cyber payload or advanced electronic warfare techniques opening the door for the Israeli aircraft. In general terms, whereas cyber attacks involve the theft, alteration or deletion of data, electronic warfare involves the detection or disruption of enemy sensors and the transmission of data using electromagnetic energy. While both rely on an attacker having knowledge of how a target system operates, electronic warfare can be applied as an active effect in real time without lengthy network reconnaissance, infiltration and payload activation. In practice, the line between the two techniques is increasingly blurring. For example, information about the exact software and hardware configurations of a radar, obtained via cyber attacks against the defence network which it sits within, might be used to tailor sophisticated electronic warfare attack options using digital emitters such as active electronically scanned array radar sets. In this context, however, the cyber attack would have occurred long before the electronic attack, with the theft of data enabling conventional electronic warfare capabilities. What is clear, however, is that the Israeli attack in 2007 was successful because it blended cyber and/or electronic attack with a precisely choreographed application of traditional firepower. The attack on the Syrian air defence network itself was not intended to create strategic effects, but as an enabling capability it greatly reduced the risk profile and increased the effectiveness of an otherwise conventional strike operation.\nThe use of cyber attacks to 'open the door' for conventional forces in this way is dependent on several key factors. First, that the potential target can be identified well in advance of any requirement to exploit a breach. This is to allow sufficient time for the required reconnaissance, penetration and delivery stages of cyber attack preparation to be conducted. Second, in the case of an attack against a target such as an integrated air defence system (IADS), this activity will have to be coordinated with traditional intelligence gathering about the physical\n Sharon Weinberger, 'How Israel Spoofed Syria's Air Defense System', WIRED, 4 October 2007.\n BBC News, 'Israel Admits Striking Suspected Syrian Nuclear Reactor in 2007', 21 March 2018.\nlocations, individual system capabilities and patterns of movement exhibited by the radars and missile launchers themselves. This is so that the required virtual effects can be identified in terms of practical effects in the physical dimension, and it requires in-depth intelligence which will need to be gathered in multiple domains. This in turn introduces a third dependency for using cyber weapons in this way to enable conventional attacks; permissions and security clearance levels. Continuing with the IADS example, the required physical and network reconnaissance and intelligence-gathering activities would likely draw on resources from air force(s), multiple intelligence agencies and special forces operations. Many of these assets will require very high-level authorisation for tasking, and the products generated will be highly classified and not widely distributed within the military as a whole. As such, the successful use of cyber attacks as a coordinated enabler for conventional military operations requires operational planners to be aware of the art of the possible, in areas where they are unlikely to be in most countries by default. The final major dependency for this sort of attack is a linked one. Imagine a case where a cyber capability has been successfully developed and implanted with a compatible activation mechanism in a specific adversary defence system, and an operational commander is aware of it. In order to employ it, that commander must be able to justify its use to enable their conventional operation, given that once the cyber weapon is used the adversary will rapidly reset their systems, discover the vulnerability and patch it. In the case of the 2007 attack by the Israeli Air Force on a Syrian nuclear reactor, head of state authorisation would almost certainly have been granted for the operation, and the expending of a developed cyber capability (if indeed it was one) embedded over several years in the Syrian IADS deemed worthwhile to enable it. However, for more routine or ongoing military operations, cyber weapons will likely remain a capability held for specific situations rather than a regular feature. Furthermore, if military operations take place in an unforeseen context, it is unlikely that sufficient time will be available to prepare as thoroughly as Israel was able to do against its traditional rival to the north.\nA more ad-hoc use of disruptive cyber operations against CNI and military enabling capabilities is more likely to characterise the routine use of cyber capabilities in warfare in the coming decade. If the requirement is not to create a catastrophic failure in key military systems at a specific point in time to directly enable conventional operations, then the\nThe Slow and Imprecise Art of Cyber Warfare\ndependencies placed on cyber specialists are less onerous. For example, Russia has conducted a range of cyber attacks against Ukrainian military and civilian systems as part of its hybrid war against the country since 2014. These have included attacks on Ukrainian military communications in coordination with intensive electronic warfare operations, as well as attacks on the national power grid and banking system. The result was to impose further disruption and costs on the government in Kyiv in conjunction with sustained direct and indirect military support to rebel groups in Donetsk and Luhansk oblasts. In other words, cyber warfare offers states another vector through which to pressure opposing states in conjunction with traditional hard and soft power tools. In a NATO context, obvious potential targets for Russian cyber attacks in the event of a major crisis or limited conflict would be the networks which control the civilian port and rail infrastructure which would be critical for mobilisation and the deployment of conventional military forces to eastern Europe. Such attacks could have significant or even decisive effects on the strategic picture for the Alliance if coupled with sustained conventional and nuclear force posturing. However, on their own, they would only delay rather than prevent military capabilities being brought to bear.\nIn considering the impact of cyber warfare on future operations, militaries are clearly correct to be taking the security of their systems seriously. Offensive cyber operations offer opportunities to gain contextual tactical advantage by disrupting the functioning of enemy systems and undermining the adversary's confidence in their equipment. They also allow for the shaping of the human terrain around which fighting takes place when aimed at civilian systems. Nevertheless, cyber attacks should not be seen as an alternative to hard power. Nor can cyber attacks function as a standalone solution.\nFinally, the opportunities offered by offensive cyber capabilities are difficult to guarantee at a specified time and place, and so cannot be relied on as a foundational capability in deterrence terms. Cyber warfare is real and cannot be ignored. But for now, it remains slow and imprecise compared to more traditional levers of military power.\n23"
    },
    "numeric": {
      "total": {
        "intext_total": 18,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [
        {
          "index": "9",
          "intext_citation": "[9]",
          "preceding_text": "This chapter seeks to explain how cyber attacks function and suggests their likely trajectory on the future battlefield.",
          "footnote": null
        },
        {
          "index": "5",
          "intext_citation": "[5]",
          "preceding_text": "This chapter seeks to explain how cyber attacks function and suggests their likely trajectory on the future battlefield.[9]",
          "footnote": null
        },
        {
          "index": "6",
          "intext_citation": "[6]",
          "preceding_text": "",
          "footnote": null
        },
        {
          "index": "7",
          "intext_citation": "[7]",
          "preceding_text": "[6] Mandi Kogosowski, “We’re on the Brink of an Enormous Cyber Catastrophe”, *Israel Defense*, 4 June 2021, <https: 49194=\"\" en=\"\" node=\"\" www.israeldefense.co.il=\"\">, accessed 26 July 2021.",
          "footnote": null
        },
        {
          "index": "8",
          "intext_citation": "[8]",
          "preceding_text": "[7] John R Allen and Amir Hussain, 'On Hyperwar', *Proceedings Magazine* (Vol. 143, No. 7, 2017), p. 1373.",
          "footnote": null
        },
        {
          "index": "9",
          "intext_citation": "[9]",
          "preceding_text": "[8] Walker, 'Into the Grey Zone Podcast', 13:49.",
          "footnote": null
        },
        {
          "index": "14",
          "intext_citation": "[14]",
          "preceding_text": "A lack of information about a network makes designing penetrations that are difficult to detect almost impossible, just as it is very difficult for a non-native speaker of a language to pass as a native speaker.",
          "footnote": null
        },
        {
          "index": "15",
          "intext_citation": "[15]",
          "preceding_text": "hat while only a few will make any headway into the network, they will generate valuable information about which nodes in the network hold administrative privileges and how the protocols that govern the network function.",
          "footnote": null
        },
        {
          "index": "16",
          "intext_citation": "[16]",
          "preceding_text": "However, the defenders will try to identify who is perpetrating this reconnaissance in order to anticipate what subsequent, more sophisticated attacks might look like.",
          "footnote": null
        },
        {
          "index": "17",
          "intext_citation": "[17]",
          "preceding_text": "require detailed information about the humans who govern these points in the network, and how they interact with it in the physical dimension, because this can provide valuable information about how to attack the system.",
          "footnote": null
        },
        {
          "index": "14",
          "intext_citation": "[14]",
          "preceding_text": "At that point, the attacker must",
          "footnote": null
        },
        {
          "index": "15",
          "intext_citation": "[15]",
          "preceding_text": "138, No. 3, 2015), pp. 223–28.",
          "footnote": null
        },
        {
          "index": "16",
          "intext_citation": "[16]",
          "preceding_text": "[15] H P Sanghvi and M S Dahiya, 'Cyber Reconnaissance: An Alarm Before Cyber Attack', *International Journal of Computer Applications* (Vol. 63, No. 6, 2013), pp. 36–38.",
          "footnote": null
        },
        {
          "index": "17",
          "intext_citation": "[17]",
          "preceding_text": "[16] This is the purpose of cyber threat intelligence. See Henry Dalziel, *How to Define and Build an Effective Cyber Threat Intelligence Capability* (Waltham, MA: Syngress, 2015).",
          "footnote": null
        },
        {
          "index": "18",
          "intext_citation": "[18]",
          "preceding_text": "Hacking involves the interrogation of the code to find ambiguities through which an attack can convince the system that a password is not necessary or has been entered when it has not.",
          "footnote": null
        },
        {
          "index": "18",
          "intext_citation": "[18]",
          "preceding_text": "Hacking involves the interrogation of the code to find ambiguities through which an attack can convince the system that a password is not necessary or has been entered when it has not.[18]",
          "footnote": null
        },
        {
          "index": "19",
          "intext_citation": "[19]",
          "preceding_text": "plex code involves thousands of lines of instruction, often written by multiple people at different times, there will often be minor contradictions or ambiguities that can be discovered and then leveraged by an attacker.",
          "footnote": null
        },
        {
          "index": "19",
          "intext_citation": "[19]",
          "preceding_text": "They must then physically penetrate the system a second time to deliver a designed payload to attack it. If they do not wish to immediately activate the delivered payload, they may need to",
          "footnote": null
        }
      ],
      "flat_text": "Noosey Harcoins\nWhitehall Papers\nRoutledge Taylor &amp; Francis Group\nISSN: 0268-1307 (Print) 1754-5382 (Online) Journal homepage: www.tandfonline.com/journals/rwhi20\n# I. The Slow and Imprecise Art of Cyber Warfare\nJustin Bronk &amp; Jack Watling\nTo cite this article: Justin Bronk &amp; Jack Watling (2021) I. The Slow and Imprecise Art of Cyber Warfare, Whitehall Papers, 99:1, 11-23, DOI: 10.1080/02681307.2021.2005891\nTo link to this article: https://doi.org/10.1080/02681307.2021.2005891\nPublished online: 06 Dec 2021.\nSubmit your article to this journal\nArticle views: 536\nView related articles\nView Crossmark data\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rwhi20\n11\n# I. THE SLOW AND IMPRECISE ART OF CYBER WARFARE\nJUSTIN BRONK AND JACK WATLING\nSally Walker, former Director of Cyber at GCHQ, has stated that cyber attacks 'can have impact in the real world and you can do it at scale'.¹ Because cyber attacks can target everything from financial systems and critical national infrastructure to political leaders and legal institutions – undermining trust and the rule of law – they can have an 'attrition' effect on the cohesion of states to which open societies 'are uniquely vulnerable'.² Such warnings over the years, combined with high-profile incidents like the WannaCry ransomware attack against the NHS, have meant that military leaders have recognised the importance of the 'cyber domain'.³ When new forms of conflict first emerge, however, there is almost always a period of inflated expectation.⁴ For the small community within Defence who have worked in the margins to explore the novel capability, there is a tendency to hype its effects and downplay its limitations in order to gain the attention of the wider defence and security community and secure resources within the bureaucracy. For that wider community – lacking an understanding of the capability – it is often much easier to visualise the potential threats posed by novel weapons than the challenges involved in employing them effectively. Cyber warfare today is arguably at the peak of this inflated discourse,\n¹ Sally Walker, 'Into the Grey Zone Podcast: Episode Five – Cyber Power (Part II)', Sky News, 3 June 2021, 06:00, <https: into-the-grey-zone-podcast-episode-five-cyber-power-part-ii-12212228=\"\" news.sky.com=\"\" story=\"\">, accessed 26 July 2021.\n² Ibid., 10:30.\n³ National Audit Office, Investigation: WannaCry Cyber Attack and the NHS, HC 414 (London: National Audit Office, 2018).\n⁴ This is visualised in Gartner, 'Gartner Hype Cycle', <https: gartner-hype-cycle=\"\" en=\"\" methodologies=\"\" research=\"\" www.gartner.com=\"\">, accessed 30 March 2021.</https:></https:>\nJustin Bronk and Jack Watling\nwhere its importance is recognised but its implications remain poorly understood beyond the limited community of technical specialists.\nIn briefings, military commanders often characterise cyber capabilities by the speed, scale and sophistication of the effect. Outlining the challenge of 'convergence' between warfighting domains, Lieutenant General Eric Wesley described how 'cyber is moving at milliseconds, ships are moving at 30 knots, vehicles at 30 km. The ability to synchronise that might be a bit of a stretch'. As well as an expectation of near-instantaneous effects, there is a persistent fear of the devastation that could be wrought. General Wesley Clark, former NATO Supreme Commander Europe, warned that 'it's possible to shut down critical infrastructure, refineries, businesses, banks, transportation – but most importantly, the electricity grid. It's been done by the Russians in the Ukraine'. Finally, there is a great deal of anxiety in militaries about the sophistication of cyber effects against conventional military systems. General John Allen, for instance, hypothesised about an incident in which a US Navy vessel had its defensive systems rendered ineffective by cyber attack, making it vulnerable to conventional munitions.\nA more thorough examination of the mechanics of cyber warfare renders much of this military discourse highly hyperbolic. Although data can travel quickly, cyber attacks are slow to develop and deliver, and often unpredictable and isolated in their effects. The challenge with integrating cyber effects into multi-domain operations is the opposite of the problem suggested by Wesley – that cyber attacks take far too long to easily synchronise with conventional operations. As Walker noted, 'it just doesn't relate to conventional warfare'. A realistic appreciation of the impact of cyber capabilities on the future of warfare must begin with a concrete understanding of how cyber attacks work. Appreciating what is required to attack a digital system reveals its limitations and so allows for the potential impact of such techniques on warfare to be put into perspective. This chapter seeks to explain how cyber attacks function and suggests their likely trajectory on the future battlefield.\n US Department of Defense, 'AUSA Global Force Symposium: Day 3 – Opening Remarks and Keynote Speaker', 18 March 2021, 35:00, <https: dod.defense.gov=\"\" index?videoid=\"668339\" news=\"\" special-reports=\"\" videos=\"\">, accessed 26 July 2021.\n Mandi Kogosowski, “We’re on the Brink of an Enormous Cyber Catastrophe”, *Israel Defense*, 4 June 2021, <https: 49194=\"\" en=\"\" node=\"\" www.israeldefense.co.il=\"\">, accessed 26 July 2021.\n John R Allen and Amir Hussain, 'On Hyperwar', *Proceedings Magazine* (Vol. 143, No. 7, 2017), p. 1373.\n Walker, 'Into the Grey Zone Podcast', 13:49.\n Cyber practitioners are necessarily very precise in the language they employ. This chapter is intended to help non-cyber practitioners understand key concepts and</https:></https:>\nThe Slow and Imprecise Art of Cyber Warfare\n# The Anatomy of a Cyber Attack\nCyber activity is primarily concerned with the virtual dimension,¹⁰ which is characterised by its dependence on invented languages.¹¹ Information encoded in these invented languages comprises data.¹² Military cyber attacks seek to achieve at least one of three things: to access data that an adversary does not wish to share; to change the data that an adversary holds; or to destroy an adversary's data.¹³ The first requirement for conducting a cyber attack is to identify that an adversary holds data. For example, a range table for a munition in a printed handbook exists in the physical dimension as paper and in the cognitive dimension if it has been memorised by an operator, but not in the virtual dimension. If, however, the range table has been translated into data and is stored on a digital device, it exists in the virtual dimension and can be subjected to cyber attack. If this data is accessible as part of a fire control system supporting geographically dispersed artillery pieces, then that data must be remotely accessible via a network. It can therefore be attacked remotely.\nSince the virtual dimension is fabricated, it is usually not immediately apparent to an external party what systems have been digitised, what they are connected to, or what languages are used to store the data and manage the network. Furthermore, programming languages do not simply store information but also contain grammar for describing commands that the system can execute. These commands describe how the data is to be stored, who has permission to access it, and what checks are carried out to determine who each user is. All of these facets of a network are invisible to an intruder until they have interacted with part of that\nuses analogy and imprecise terms to aid accessibility. The authors apologise to specialists in the field for the resulting lack of precision.\n¹⁰ Ministry of Defence, 'Joint Doctrine Publication 0-30: UK Air and Space Power', 2ⁿᵈ edition, December 2017, p. 17.\n¹¹ David J Peterson, *Art of Language Invention, The: From Horse-Lords to Dark Elves to Sand Worms, the Words Behind World-Building* (London: Penguin, 2015), pp. 21–22.\n¹² The subset of invented languages used in computing comprises markup and programming languages. Markup languages allow the programming instructions to not be displayed when displaying data in a non-programming language. See Thomas Powell, *HTML &amp; XHTML: The Complete Reference* (New York, NY: McGraw-Hill, 2003), p. 25. Programming languages use imperative and declarative syntax to describe and command the execution of specified functions, see Michael Gordon, *Programming Language Theory and Its Implementation* (Hoboken: Prentice Hall, 1988).\n¹³ These offensive aims can be understood as the offensive mirror image of the CIA's triad model of cybersecurity principles: confidentiality; integrity; and availability. See 'What Is Security Analysis?', <https: cia.htm=\"\" security=\"\" www.doc.ic.ac.uk=\"\" ~ajs300=\"\">, accessed 21 October 2021.</https:>\nJustin Bronk and Jack Watling\nnetwork. Therefore, having determined that a digital target exists, an attacker must seek to intrude into the network which contains it, and exfiltrate data to determine how that network is constructed and by what languages it is governed.\nA lack of information about a network makes designing penetrations that are difficult to detect almost impossible, just as it is very difficult for a non-native speaker of a language to pass as a native speaker. For this reason, the initial penetration and mapping of networks involves an extensive reconnaissance effort. Attackers will often conduct a high volume of unsophisticated attacks on the basis that while only a few will make any headway into the network, they will generate valuable information about which nodes in the network hold administrative privileges and how the protocols that govern the network function. Large-scale unsophisticated attacks produce a constant noise so that adversaries cannot necessarily determine what is being targeted. In many ways, this is because the purpose is to find what targets might be available. This is comparable to a reconnaissance by force, or advance to contact, rather than a deliberate reconnaissance. However, the defenders will try to identify who is perpetrating this reconnaissance in order to anticipate what subsequent, more sophisticated attacks might look like.\nOnce the shape of a network and the location of data and privileges are identified, an attacker will begin to craft specialised attacks to gain access to those points. This will often require detailed information about the humans who govern these points in the network, and how they interact with it in the physical dimension, because this can provide valuable information about how to attack the system. These deliberate attacks against identified nodes must be carried out without being detected. If an intrusion is detected, the defender can simply sever the node that has been penetrated or change the permissions to deny it any useful access to the rest of the network. At that point, the attacker must\n Simon Müller, 'Discourse Makers in Native and Non-Native English Discourse', PhD submission to Justus Liebig University Giessen, Amsterdam, 2004; Melissa M Baese-Berk and Tuuli H Morrill, 'Speaking Rate Consistency in Native and Non-Native Speakers of English', *Journal of the Acoustical Society of America* (Vol. 138, No. 3, 2015), pp. 223–28.\n H P Sanghvi and M S Dahiya, 'Cyber Reconnaissance: An Alarm Before Cyber Attack', *International Journal of Computer Applications* (Vol. 63, No. 6, 2013), pp. 36–38.\n This is the purpose of cyber threat intelligence. See Henry Dalziel, *How to Define and Build an Effective Cyber Threat Intelligence Capability* (Waltham, MA: Syngress, 2015).\n Micah Zenko, *Red Team: How to Succeed by Thinking Like the Enemy* (New York, NY: Basic Books, 2015), pp. 171–83.\nThe Slow and Imprecise Art of Cyber Warfare\nbegin from scratch against a defender that has gained information about the attacker's techniques and signature.\nAfter a critical node is penetrated, data from it must be exfiltrated and analysed to allow the attacker to see further into the network and target the next node up the chain. Ultimately, the aim is for the attacker to gain access to repositories of data, or to components of a system that can control other parts of the system. Whereas most parts of a network have the right to read a limited set of data, some administrative nodes have permission to rewrite the instructions governing the system. Attackers seek access to administrators because these accounts can change or destroy the data or physical infrastructure that constitute the enemy system. For example, an administrator for a fire control system might substitute an accurate range table for an inaccurate one, ensuring the artillery system as a whole misses any target it tries to engage. Alternatively, it could delete the range table so that the system cannot calculate firing solutions. The administrator could even delete the instructions for the system to read a range table, and then destroy the instructions for the system to accept new instructions so that the defender cannot simply upload a new range table when the data is found to be missing.\nAlmost all components of a network will be subject to varying levels of encryption which must be cracked or bypassed by an attacker at each stage. This could require the entry of a simple password, or for more sensitive and better defended systems, a three-part authentication comprising something known by the individual who owns the node (a password), something they have (a physical key), and something they are (biometric data). Passwords to confirm that someone requesting access to a system is the right individual can be cracked through a brute force (guessing all possible combinations) or analytical attack. The latter method can be invalidated by randomly generating passwords. In practice, any effectively defended system will have millions of possible solutions to passwords at each level, and incorrect entries will attract the attention of defenders. For this reason, attackers will endeavour to bypass passwords through hacking. Hacking involves the interrogation of the code to find ambiguities through which an attack can convince the system that a password is not necessary or has been entered when it has not.\n There is an alternative distinction drawn between hacking and cracking that is framed in ethical terms, with the former being constructive and the latter destructive. In practice, this ethical distinction – while important in the early days of the internet – has fragmented. See John P Carlin with Garrett M Graff, *Dawn of the Code War: America's Battle Against Russia, China, and the Rising Global Cyber Threat* (New York, NY: Public Affairs, 2018), chapter 1.\nJustin Bronk and Jack Watling\nTo envisage how a hack works, consider the consequences of someone using poor grammar, as in the sentence: 'Correct and verified, the user may decrypt the data'. In conversation, this can be understood to mean 'if the user has been correctly identified and verified, then they may decrypt the data'. However, the sentence could equally be literally interpreted as saying 'the user is correct and verified and may decrypt the data'. A hack would suggest to the system that it should proceed with the latter interpretation. Because complex code involves thousands of lines of instruction, often written by multiple people at different times, there will often be minor contradictions or ambiguities that can be discovered and then leveraged by an attacker.\nWhen these ambiguities and contradictions are part of the code in a system, they are termed 'zero-days' because they are vulnerabilities that were introduced into the system by the way it was designed, and at the time of discovery represent an open vulnerability that has not been patched, leaving defenders with zero days to resolve the problem. By storing zero-day exploits which they discover through reconnaissance efforts, an attacker can subsequently employ them to bypass a system's defences. However, just as the poor grammar cited above can be clarified, so too can a defender clarify their coding to make a system more secure. If, therefore, they identify that a zero-day exploit has enabled penetration of their network, they can often patch the system to edit out and close the vulnerability, or else closely monitor it to gain intelligence on potential ongoing or future attacks. Consequently, attackers must make a trade-off between the value of accessing a system at any given time and the risk of losing the ability to bypass its encryption or being rapidly attributed and potentially counter-attacked if discovered.\nAttacking sensitive digital systems is further complicated by the fact that they are often air-gapped, meaning they are not susceptible to remote access. This means that, to attack them, an adversary must either create an artificial connection to the outside world or physically plug into the air-gapped network without being detected. This may require multiple physical penetrations since the first intrusion may simply allow the attacker to collect information about what language the system uses and how it is structured. They must then physically penetrate the system a second time to deliver a designed payload to attack it. If they do not wish to immediately activate the delivered payload, they may need to\n A common issue is poor hygiene in compound coding for signifier/signified correlation. See Paolo Rocchi, 'The Concepts of Signifier/Signified Revisited', IBM, <http: dtmd=\"\" rocchi.pdf=\"\" presentations=\"\" mcs.open.ac.uk=\"\" session%202=\"\">, accessed 30 March 2021.</http:>\nThe Slow and Imprecise Art of Cyber Warfare\npenetrate the system a third time to trigger the attack at the desired point in time.\nA cyber attack may therefore be envisaged as comprising seven stages:\n1. Reconnaissance: to understand the target network.\n2. Weaponisation: designing a payload to exploit vulnerabilities.\n3. Delivery: insertion of the payload through the system.\n4. Exploitation: using new access to identify and target the key node.\n5. Installation: installing the payload at the target node of the system.\n6. Command and control: having a means of initiating the payload.\n7. Action on objectives: having the desired effect on the system.²⁰\nAttempting to gain entry to a complex defended system may require several iterations of this cycle as the attackers fight their way into the network. Against a complex network with multiple layers, which ultimately ends in an air-gapped component, working into a network may take between one and three years.²¹ While embedding malicious capabilities into public utilities or other legacy civilian systems may be more straightforward,²² attacking military systems is complex, sensitive and has a significant lead time, requiring payloads to be embedded during peacetime if they are to be available during war.\nIf a cyber attack is prosecuted in peacetime and the payload initiated before the outbreak of war, its effects will either be limited or escalatory. For example, to return to the artillery fire control system, if it were penetrated and the range tables altered prior to a conflict, this could mean that the change would be noticed during an exercise, the range tables corrected and the system security patched prior to a conflict. Alternatively, it could mean that during the same exercise the artillery kills friendly forces. This would lead to an investigation and, if the cause could be attributed to a hostile cyber attack, it would lead to a significant\n²⁰ Joseph Raczynski, ‘Kill Chain: The 7 Stages of a Cyberattack’, *Thomson Reuters*, 12 October 2018.\n²¹ Author interview with a senior CTI director at a major bank, March 2021; author interview with a senior military cyber warfare officer, February 2021; author interview with a law enforcement officer specialising in counter-cyber operations, January 2021.\n²² House of Commons, ‘A Major Cyber Attack on the UK is a Matter of “When, Not If”’, Joint Committee on the National Security Strategy, 22 January 2018, <https: index.html=\"\" jcnss-cni-report=\"\" houseofcommons.shorthandstories.com=\"\">, accessed 30 March 2021.</https:>\nJustin Bronk and Jack Watling\nescalation in tensions or could even be interpreted by the victim as a casus belli.²³\nConversely, a cyber payload that sits dormant in a system until activated during a conflict presents other challenges. It must either be activated automatically when certain criteria are met or manually. The latter requires a sustained capacity to connect to the system at short notice to be maintained by the attacker. For military systems – given the changes that occur when a state transitions to war – this may be difficult, requiring the embedding of agents with knowledge of the penetration inside the enemy force. However, a payload that monitors the system so that it can activate under certain conditions is an active rather than passive insertion and is, therefore, more susceptible to detection. It could also activate under circumstances unforeseen by the attacker.\nThe final limitation of a military cyber capability is that cyber attacks function by inserting data into a system so that it is directed to behave in a specific manner. It is effective not in itself, but because of how the payload interacts with the rest of the system. Because the system is fabricated, however, and the language invented, it is subject to being expanded, divided, updated and changed in fundamental ways. Therefore, a payload that must remain dormant may be activated only to find that the surrounding environment has been altered to the extent that its code no longer makes any sense within the language with which it is supposed to interact. A well-defended system will be periodically patched so that changes like this should be routine. The result is that while militaries may spend years embedding capabilities into a network, they have no guarantees that when the time comes it will function as anticipated. Consequently, cyber attacks are unpredictable in their effects and are difficult to synchronise with established military planning and operations. This is a significant limitation, as the high lethality, mobility and relatively low quantities of most modern military capabilities mean that precise timing and coordination between different joint force elements are even more essential than they were in previous eras.\n## The Military Application of Cyber Weapons\nThere are limited scenarios in which a cyber attack can have a decisive operational or strategic effect when used in isolation. The most famous strategic cyber attack is the Stuxnet worm which formed part of a series of attacks on Iranian nuclear fuel enrichment centrifuges from 2008.²⁴\n²³ Jens Stoltenberg, ‘NATO Will Defend Itself’, NATO, last updated 29 August 2019, <https: en=\"\" en=\"\" natohq=\"\" news_168435.htm?selectedlocale=\"en\" www.nato.int=\"\">, accessed 30 March 2021.</https:>\nThe Slow and Imprecise Art of Cyber Warfare\nEstimates vary but some suggest that enough disruption was caused to set back Iranian nuclear enrichment by 18 to 24 months. However, the system reconnaissance and infiltration process took years, having reportedly begun in 2005.²⁵ Furthermore, when Stuxnet leaked accidentally beyond the air-gapped nuclear facility network, its code was subsequently identified and analysed by states and cyber security firms around the world. This resulted in public attribution of the Stuxnet attack itself to intelligence agencies in the US and Israel, as well as the probable attribution of other cyber weapons which appear to function in a similar manner.²⁶ It also gave Iran and other national and civilian organisations the opportunity to examine a strategic cyber payload described by a senior cyber security professional as 'by far the most complex piece of code that we've looked at – in a completely different league from anything we'd ever seen before'.²⁷\nThe Stuxnet leak, and the US/Israeli cyber operations against Iran's uranium enrichment programme as a whole, illustrate some of the key practical characteristics of cyber warfare as a standalone tool of national power. Attacks on defended systems require years of preparation to identify, infiltrate and exploit weak points. Once triggered, even very sophisticated payloads will be discovered, analysed and ultimately identified. The effects created can only ever be temporary in isolation, as states will patch their systems and replace damaged machinery if not prevented from doing so by other means. When the payloads are ultimately identified and analysed, peer and near-peer states can use insights gained to ascribe probable attribution, and also potentially to develop or enhance their own offensive cyber capabilities.\nLess sophisticated cyber payloads than Stuxnet-type cyber weapons can still be highly effective in causing standalone disruption and potentially physical damage if conducted against less defended systems such as those which control civilian infrastructure. Examples include the attack on a German steel mill in 2014, and the WannaCry ransomware attacks which caused major disruption to the NHS in 2017.²⁸ States such as Russia and\n²⁴ David E Sanger, ‘Obama Order Sped Up Wave of Cyberattacks Against Iran’, *New York Times*, 1 June 2012.\n²⁵ *Ibid.*\n²⁶ Josh Fruhlinger, ‘What is Stuxnet, Who Created It and How Does It Work?’, *CSO Online*, 22 August 2017, <https: 3218104=\"\" article=\"\" what-is-stuxnet-who-created-it-and-how-does-it-work.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.\n²⁷ *Ibid.*\n²⁸ TrendMicro, ‘German Steel Plant Suffers Significant Damage from Targeted Attack’, 12 January 2015, <https: fr=\"\" security=\"\" news=\"\" cyber-attacks=\"\" german-steel-plant-suffers-significant-damage-from-targeted-attack=\"\" www.trendmicro.com=\"\" vinfo=\"\">, accessed 3 March 2021; Josh Fruhlinger, ‘What Is WannaCry Ransomware, How</https:></https:>\nJustin Bronk and Jack Watling\nNorth Korea regularly use quasi-criminal groups of hackers operating under loose state direction to demonstrate to expert communities their ability to disrupt and even directly damage civilian industry and critical national infrastructure (CNI). This capability is then tacitly leveraged to enhance deterrence messaging against potential state opponents. Some of these attacks exploit zero-day vulnerabilities, but most employ simple massed phishing attacks to infiltrate potential target networks. As such, they are much more effective against networks which rely on commercial operating systems which are well understood, do not use three-factor authentication security procedures and may be slow to implement security patches. The purpose of most attacks of this nature is also far less specific than strategic cyber weapons such as Stuxnet; either theft of information across a broad industrial sector, extortion or simply disruption for its own sake.\nFor most Western states, there are significant legal and ethical barriers to the use of offensive cyber capabilities against civilian targets, at least in any overt attempt at deterrence messaging. In any case, the ability to infiltrate civilian infrastructure and cause temporary disruption or even limited destructive effects is unlikely to deter a state opponent from conventional military action if it has already committed to such a high-risk course of action. The recent conflicts in eastern Ukraine and Nagorno-Karabakh provide compelling evidence that states are prepared to suffer extensive damage to both civilian and military targets without backing down from kinetic confrontations where national interests are clearly defined. As such, the immediate question for those who see the apocryphal cyber capability to 'turn out the lights in Moscow' as a cheaper replacement for conventional and nuclear deterrence tools is: what effect would such an attack have on a determined adversary, and for how long? It is perhaps ironic that hyperbolic narratives, such as that advanced by Nicole Perlroth,²⁹ use Ukraine as the example of how devastating cyber attacks can be, while somehow overlooking the extent to which Ukraine has weathered and recovered from Russia's cyber onslaught.\nWhilst there are few situations in which cyber weapons can replace more traditional forms of military capability outright, there are many potential ways in which offensive cyber tools can be used as part of joint operations. For example, a previously inserted cyber payload might be\nDoes it Infect, and Who Was Responsible?, CSO Online, 30 August 2018, <https: 3227906=\"\" article=\"\" what-is-wannacry-ransomware-how-does-it-infect-and-who-was-responsible.html=\"\" www.csoonline.com=\"\">, accessed 3 March 2021.\n²⁹ Nicole Perlroth, This Is How They Tell Me the World Ends: The Cyberweapons Arms Race (London: Bloomsbury, 2021).</https:>\nThe Slow and Imprecise Art of Cyber Warfare\nused to disable or disrupt key adversary defence systems at a critical moment to enable a conventional attacking force to physically bypass or destroy them. Israel allegedly carried out just such an attack against the Syrian air defence network in 2007.³⁰ The normally bristling air defence network was rendered blind to an Israeli Air Force strike package which entered Syrian airspace, bombed a nuclear facility and withdrew unchallenged.³¹ It is still unclear in the public domain whether this was a case of a cyber payload or advanced electronic warfare techniques opening the door for the Israeli aircraft. In general terms, whereas cyber attacks involve the theft, alteration or deletion of data, electronic warfare involves the detection or disruption of enemy sensors and the transmission of data using electromagnetic energy. While both rely on an attacker having knowledge of how a target system operates, electronic warfare can be applied as an active effect in real time without lengthy network reconnaissance, infiltration and payload activation. In practice, the line between the two techniques is increasingly blurring. For example, information about the exact software and hardware configurations of a radar, obtained via cyber attacks against the defence network which it sits within, might be used to tailor sophisticated electronic warfare attack options using digital emitters such as active electronically scanned array radar sets. In this context, however, the cyber attack would have occurred long before the electronic attack, with the theft of data enabling conventional electronic warfare capabilities. What is clear, however, is that the Israeli attack in 2007 was successful because it blended cyber and/or electronic attack with a precisely choreographed application of traditional firepower. The attack on the Syrian air defence network itself was not intended to create strategic effects, but as an enabling capability it greatly reduced the risk profile and increased the effectiveness of an otherwise conventional strike operation.\nThe use of cyber attacks to 'open the door' for conventional forces in this way is dependent on several key factors. First, that the potential target can be identified well in advance of any requirement to exploit a breach. This is to allow sufficient time for the required reconnaissance, penetration and delivery stages of cyber attack preparation to be conducted. Second, in the case of an attack against a target such as an integrated air defence system (IADS), this activity will have to be coordinated with traditional intelligence gathering about the physical\n³⁰ Sharon Weinberger, 'How Israel Spoofed Syria's Air Defense System', WIRED, 4 October 2007.\n³¹ BBC News, 'Israel Admits Striking Suspected Syrian Nuclear Reactor in 2007', 21 March 2018.\nlocations, individual system capabilities and patterns of movement exhibited by the radars and missile launchers themselves. This is so that the required virtual effects can be identified in terms of practical effects in the physical dimension, and it requires in-depth intelligence which will need to be gathered in multiple domains. This in turn introduces a third dependency for using cyber weapons in this way to enable conventional attacks; permissions and security clearance levels. Continuing with the IADS example, the required physical and network reconnaissance and intelligence-gathering activities would likely draw on resources from air force(s), multiple intelligence agencies and special forces operations. Many of these assets will require very high-level authorisation for tasking, and the products generated will be highly classified and not widely distributed within the military as a whole. As such, the successful use of cyber attacks as a coordinated enabler for conventional military operations requires operational planners to be aware of the art of the possible, in areas where they are unlikely to be in most countries by default. The final major dependency for this sort of attack is a linked one. Imagine a case where a cyber capability has been successfully developed and implanted with a compatible activation mechanism in a specific adversary defence system, and an operational commander is aware of it. In order to employ it, that commander must be able to justify its use to enable their conventional operation, given that once the cyber weapon is used the adversary will rapidly reset their systems, discover the vulnerability and patch it. In the case of the 2007 attack by the Israeli Air Force on a Syrian nuclear reactor, head of state authorisation would almost certainly have been granted for the operation, and the expending of a developed cyber capability (if indeed it was one) embedded over several years in the Syrian IADS deemed worthwhile to enable it. However, for more routine or ongoing military operations, cyber weapons will likely remain a capability held for specific situations rather than a regular feature. Furthermore, if military operations take place in an unforeseen context, it is unlikely that sufficient time will be available to prepare as thoroughly as Israel was able to do against its traditional rival to the north.\nA more ad-hoc use of disruptive cyber operations against CNI and military enabling capabilities is more likely to characterise the routine use of cyber capabilities in warfare in the coming decade. If the requirement is not to create a catastrophic failure in key military systems at a specific point in time to directly enable conventional operations, then the\nThe Slow and Imprecise Art of Cyber Warfare\ndependencies placed on cyber specialists are less onerous. For example, Russia has conducted a range of cyber attacks against Ukrainian military and civilian systems as part of its hybrid war against the country since 2014. These have included attacks on Ukrainian military communications in coordination with intensive electronic warfare operations, as well as attacks on the national power grid and banking system. The result was to impose further disruption and costs on the government in Kyiv in conjunction with sustained direct and indirect military support to rebel groups in Donetsk and Luhansk oblasts. In other words, cyber warfare offers states another vector through which to pressure opposing states in conjunction with traditional hard and soft power tools. In a NATO context, obvious potential targets for Russian cyber attacks in the event of a major crisis or limited conflict would be the networks which control the civilian port and rail infrastructure which would be critical for mobilisation and the deployment of conventional military forces to eastern Europe. Such attacks could have significant or even decisive effects on the strategic picture for the Alliance if coupled with sustained conventional and nuclear force posturing. However, on their own, they would only delay rather than prevent military capabilities being brought to bear.\nIn considering the impact of cyber warfare on future operations, militaries are clearly correct to be taking the security of their systems seriously. Offensive cyber operations offer opportunities to gain contextual tactical advantage by disrupting the functioning of enemy systems and undermining the adversary's confidence in their equipment. They also allow for the shaping of the human terrain around which fighting takes place when aimed at civilian systems. Nevertheless, cyber attacks should not be seen as an alternative to hard power. Nor can cyber attacks function as a standalone solution.\nFinally, the opportunities offered by offensive cyber capabilities are difficult to guarantee at a specified time and place, and so cannot be relied on as a foundational capability in deterrence terms. Cyber warfare is real and cannot be ignored. But for now, it remains slow and imprecise compared to more traditional levers of military power.\n23"
    },
    "author_year": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 33,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "author_year"
      },
      "results": [],
      "flat_text": "Noosey Harcoins Whitehall Papers Routledge Taylor &amp; Francis Group ISSN: 0268-1307 (Print) 1754-5382 (Online) Journal homepage: www.tandfonline.com/journals/rwhi20 # I. The Slow and Imprecise Art of Cyber Warfare Justin Bronk &amp; Jack Watling To cite this article: Justin Bronk &amp; Jack Watling (2021) I. The Slow and Imprecise Art of Cyber Warfare, Whitehall Papers, 99:1, 11-23, DOI: 10.1080/02681307.2021.2005891 To link to this article: https://doi.org/10.1080/02681307.2021.2005891 Published online: 06 Dec 2021.\nSubmit your article to this journal Article views: 536 View related articles View Crossmark data Full Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rwhi20 JUSTIN BRONK AND JACK WATLING Sally Walker, former Director of Cyber at GCHQ, has stated that cyber attacks 'can have impact in the real world and you can do it at scale'.¹ Because cyber attacks can target everything from financial systems and critical national infrastructure to political leaders and legal institutions – undermining trust and the rule of law – they can have an 'attrition' effect on the cohesion of states to which open societies 'are uniquely vulnerable'.² Such warnings over the years, combined with high-profile incidents like the WannaCry ransomware attack against the NHS, have meant that military leaders have recognised the importance of the 'cyber domain'.³ When new forms of conflict first emerge, however, there is almost always a period of inflated expectation.⁴ For the small community within Defence who have worked in the margins to explore the novel capability, there is a tendency to hype its effects and downplay its limitations in order to gain the attention of the wider defence and security community and secure resources within the bureaucracy. For that wider community – lacking an understanding of the capability – it is often much easier to visualise the potential threats posed by novel weapons than the challenges involved in employing them effectively. Cyber warfare today is arguably at the peak of this inflated discourse, ¹ Sally Walker, 'Into the Grey Zone Podcast: Episode Five – Cyber Power (Part II)', Sky News, 3 June 2021, 06:00, <https: into-the-grey-zone-podcast-episode-five-cyber-power-part-ii-12212228=\"\"news.sky.com=\"\"story=\"\">, accessed 26 July 2021.\n² Ibid., 10:30.\n³ National Audit Office, Investigation: WannaCry Cyber Attack and the NHS, HC 414 (London: National Audit Office, 2018).\n⁴ This is visualised in Gartner, 'Gartner Hype Cycle', <https: gartner-hype-cycle=\"\"en=\"\"methodologies=\"\"research=\"\"www.gartner.com=\"\">, accessed 30 March 2021.</https:></https:> Justin Bronk and Jack Watling where its importance is recognised but its implications remain poorly understood beyond the limited community of technical specialists.\nIn briefings, military commanders often characterise cyber capabilities by the speed, scale and sophistication of the effect. Outlining the challenge of 'convergence' between warfighting domains, Lieutenant General Eric Wesley described how 'cyber is moving at milliseconds, ships are moving at 30 knots, vehicles at 30 km. The ability to synchronise that might be a bit of a stretch'. As well as an expectation of near-instantaneous effects, there is a persistent fear of the devastation that could be wrought. General Wesley Clark, former NATO Supreme Commander Europe, warned that 'it's possible to shut down critical infrastructure, refineries, businesses, banks, transportation – but most importantly, the electricity grid. It's been done by the Russians in the Ukraine'. Finally, there is a great deal of anxiety in militaries about the sophistication of cyber effects against conventional military systems. General John Allen, for instance, hypothesised about an incident in which a US Navy vessel had its defensive systems rendered ineffective by cyber attack, making it vulnerable to conventional munitions.\nA more thorough examination of the mechanics of cyber warfare renders much of this military discourse highly hyperbolic. Although data can travel quickly, cyber attacks are slow to develop and deliver, and often unpredictable and isolated in their effects. The challenge with integrating cyber effects into multi-domain operations is the opposite of the problem suggested by Wesley – that cyber attacks take far too long to easily synchronise with conventional operations. As Walker noted, 'it just doesn't relate to conventional warfare'. A realistic appreciation of the impact of cyber capabilities on the future of warfare must begin with a concrete understanding of how cyber attacks work. Appreciating what is required to attack a digital system reveals its limitations and so allows for the potential impact of such techniques on warfare to be put into perspective. This chapter seeks to explain how cyber attacks function and suggests their likely trajectory on the future battlefield.[9] [5] US Department of Defense, 'AUSA Global Force Symposium: Day 3 – Opening Remarks and Keynote Speaker', 18 March 2021, 35:00, <https: dod.defense.gov=\"\"index?videoid=\"668339\"news=\"\"special-reports=\"\"videos=\"\">, accessed 26 July 2021.\n[6] Mandi Kogosowski, “We’re on the Brink of an Enormous Cyber Catastrophe”, *Israel Defense*, 4 June 2021, <https: 49194=\"\"en=\"\"node=\"\"www.israeldefense.co.il=\"\">, accessed 26 July 2021.\n[7] John R Allen and Amir Hussain, 'On Hyperwar', *Proceedings Magazine* (Vol. 143, No. 7, 2017), p. 1373.\n[8] Walker, 'Into the Grey Zone Podcast', 13:49.\n[9] Cyber practitioners are necessarily very precise in the language they employ. This chapter is intended to help non-cyber practitioners understand key concepts and</https:></https:> The Slow and Imprecise Art of Cyber Warfare # The Anatomy of a Cyber Attack Cyber activity is primarily concerned with the virtual dimension,¹⁰ which is characterised by its dependence on invented languages.¹¹ Information encoded in these invented languages comprises data.¹² Military cyber attacks seek to achieve at least one of three things: to access data that an adversary does not wish to share; to change the data that an adversary holds; or to destroy an adversary's data.¹³ The first requirement for conducting a cyber attack is to identify that an adversary holds data. For example, a range table for a munition in a printed handbook exists in the physical dimension as paper and in the cognitive dimension if it has been memorised by an operator, but not in the virtual dimension. If, however, the range table has been translated into data and is stored on a digital device, it exists in the virtual dimension and can be subjected to cyber attack. If this data is accessible as part of a fire control system supporting geographically dispersed artillery pieces, then that data must be remotely accessible via a network. It can therefore be attacked remotely.\nSince the virtual dimension is fabricated, it is usually not immediately apparent to an external party what systems have been digitised, what they are connected to, or what languages are used to store the data and manage the network. Furthermore, programming languages do not simply store information but also contain grammar for describing commands that the system can execute. These commands describe how the data is to be stored, who has permission to access it, and what checks are carried out to determine who each user is. All of these facets of a network are invisible to an intruder until they have interacted with part of that uses analogy and imprecise terms to aid accessibility. The authors apologise to specialists in the field for the resulting lack of precision.\n¹⁰ Ministry of Defence, 'Joint Doctrine Publication 0-30: UK Air and Space Power', 2ⁿᵈ edition, December 2017, p. 17.\n¹¹ David J Peterson, *Art of Language Invention, The: From Horse-Lords to Dark Elves to Sand Worms, the Words Behind World-Building* (London: Penguin, 2015), pp. 21–22.\n¹² The subset of invented languages used in computing comprises markup and programming languages. Markup languages allow the programming instructions to not be displayed when displaying data in a non-programming language. See Thomas Powell, *HTML &amp; XHTML: The Complete Reference* (New York, NY: McGraw-Hill, 2003), p. 25. Programming languages use imperative and declarative syntax to describe and command the execution of specified functions, see Michael Gordon, *Programming Language Theory and Its Implementation* (Hoboken: Prentice Hall, 1988).\n¹³ These offensive aims can be understood as the offensive mirror image of the CIA's triad model of cybersecurity principles: confidentiality; integrity; and availability. See 'What Is Security Analysis?', <https: cia.htm=\"\"security=\"\"www.doc.ic.ac.uk=\"\"~ajs300=\"\">, accessed 21 October 2021.</https:> Justin Bronk and Jack Watling network. Therefore, having determined that a digital target exists, an attacker must seek to intrude into the network which contains it, and exfiltrate data to determine how that network is constructed and by what languages it is governed.\nA lack of information about a network makes designing penetrations that are difficult to detect almost impossible, just as it is very difficult for a non-native speaker of a language to pass as a native speaker.[14] For this reason, the initial penetration and mapping of networks involves an extensive reconnaissance effort. Attackers will often conduct a high volume of unsophisticated attacks on the basis that while only a few will make any headway into the network, they will generate valuable information about which nodes in the network hold administrative privileges and how the protocols that govern the network function.[15] Large-scale unsophisticated attacks produce a constant noise so that adversaries cannot necessarily determine what is being targeted. In many ways, this is because the purpose is to find what targets might be available. This is comparable to a reconnaissance by force, or advance to contact, rather than a deliberate reconnaissance. However, the defenders will try to identify who is perpetrating this reconnaissance in order to anticipate what subsequent, more sophisticated attacks might look like.[16] Once the shape of a network and the location of data and privileges are identified, an attacker will begin to craft specialised attacks to gain access to those points. This will often require detailed information about the humans who govern these points in the network, and how they interact with it in the physical dimension, because this can provide valuable information about how to attack the system.[17] These deliberate attacks against identified nodes must be carried out without being detected. If an intrusion is detected, the defender can simply sever the node that has been penetrated or change the permissions to deny it any useful access to the rest of the network. At that point, the attacker must [14] Simon Müller, 'Discourse Makers in Native and Non-Native English Discourse', PhD submission to Justus Liebig University Giessen, Amsterdam, 2004; Melissa M Baese-Berk and Tuuli H Morrill, 'Speaking Rate Consistency in Native and Non-Native Speakers of English', *Journal of the Acoustical Society of America* (Vol. 138, No. 3, 2015), pp. 223–28.\n[15] H P Sanghvi and M S Dahiya, 'Cyber Reconnaissance: An Alarm Before Cyber Attack', *International Journal of Computer Applications* (Vol. 63, No. 6, 2013), pp. 36–38.\n[16] This is the purpose of cyber threat intelligence. See Henry Dalziel, *How to Define and Build an Effective Cyber Threat Intelligence Capability* (Waltham, MA: Syngress, 2015).\n[17] Micah Zenko, *Red Team: How to Succeed by Thinking Like the Enemy* (New York, NY: Basic Books, 2015), pp. 171–83.\nThe Slow and Imprecise Art of Cyber Warfare begin from scratch against a defender that has gained information about the attacker's techniques and signature.\nAfter a critical node is penetrated, data from it must be exfiltrated and analysed to allow the attacker to see further into the network and target the next node up the chain. Ultimately, the aim is for the attacker to gain access to repositories of data, or to components of a system that can control other parts of the system. Whereas most parts of a network have the right to read a limited set of data, some administrative nodes have permission to rewrite the instructions governing the system. Attackers seek access to administrators because these accounts can change or destroy the data or physical infrastructure that constitute the enemy system. For example, an administrator for a fire control system might substitute an accurate range table for an inaccurate one, ensuring the artillery system as a whole misses any target it tries to engage. Alternatively, it could delete the range table so that the system cannot calculate firing solutions. The administrator could even delete the instructions for the system to read a range table, and then destroy the instructions for the system to accept new instructions so that the defender cannot simply upload a new range table when the data is found to be missing.\nAlmost all components of a network will be subject to varying levels of encryption which must be cracked or bypassed by an attacker at each stage. This could require the entry of a simple password, or for more sensitive and better defended systems, a three-part authentication comprising something known by the individual who owns the node (a password), something they have (a physical key), and something they are (biometric data). Passwords to confirm that someone requesting access to a system is the right individual can be cracked through a brute force (guessing all possible combinations) or analytical attack. The latter method can be invalidated by randomly generating passwords. In practice, any effectively defended system will have millions of possible solutions to passwords at each level, and incorrect entries will attract the attention of defenders. For this reason, attackers will endeavour to bypass passwords through hacking. Hacking involves the interrogation of the code to find ambiguities through which an attack can convince the system that a password is not necessary or has been entered when it has not.[18] [18] There is an alternative distinction drawn between hacking and cracking that is framed in ethical terms, with the former being constructive and the latter destructive. In practice, this ethical distinction – while important in the early days of the internet – has fragmented. See John P Carlin with Garrett M Graff, *Dawn of the Code War: America's Battle Against Russia, China, and the Rising Global Cyber Threat* (New York, NY: Public Affairs, 2018), chapter 1.\nJustin Bronk and Jack Watling To envisage how a hack works, consider the consequences of someone using poor grammar, as in the sentence: 'Correct and verified, the user may decrypt the data'. In conversation, this can be understood to mean 'if the user has been correctly identified and verified, then they may decrypt the data'. However, the sentence could equally be literally interpreted as saying 'the user is correct and verified and may decrypt the data'. A hack would suggest to the system that it should proceed with the latter interpretation. Because complex code involves thousands of lines of instruction, often written by multiple people at different times, there will often be minor contradictions or ambiguities that can be discovered and then leveraged by an attacker.[19] When these ambiguities and contradictions are part of the code in a system, they are termed 'zero-days' because they are vulnerabilities that were introduced into the system by the way it was designed, and at the time of discovery represent an open vulnerability that has not been patched, leaving defenders with zero days to resolve the problem. By storing zero-day exploits which they discover through reconnaissance efforts, an attacker can subsequently employ them to bypass a system's defences. However, just as the poor grammar cited above can be clarified, so too can a defender clarify their coding to make a system more secure. If, therefore, they identify that a zero-day exploit has enabled penetration of their network, they can often patch the system to edit out and close the vulnerability, or else closely monitor it to gain intelligence on potential ongoing or future attacks. Consequently, attackers must make a trade-off between the value of accessing a system at any given time and the risk of losing the ability to bypass its encryption or being rapidly attributed and potentially counter-attacked if discovered.\nAttacking sensitive digital systems is further complicated by the fact that they are often air-gapped, meaning they are not susceptible to remote access. This means that, to attack them, an adversary must either create an artificial connection to the outside world or physically plug into the air-gapped network without being detected. This may require multiple physical penetrations since the first intrusion may simply allow the attacker to collect information about what language the system uses and how it is structured. They must then physically penetrate the system a second time to deliver a designed payload to attack it. If they do not wish to immediately activate the delivered payload, they may need to [19] A common issue is poor hygiene in compound coding for signifier/signified correlation. See Paolo Rocchi, 'The Concepts of Signifier/Signified Revisited', IBM, <http: dtmd=\"\"rocchi.pdf=\"\"presentations=\"\"mcs.open.ac.uk=\"\"session%202=\"\">, accessed 30 March 2021.</http:> The Slow and Imprecise Art of Cyber Warfare penetrate the system a third time to trigger the attack at the desired point in time.\nA cyber attack may therefore be envisaged as comprising seven stages: Attempting to gain entry to a complex defended system may require several iterations of this cycle as the attackers fight their way into the network. Against a complex network with multiple layers, which ultimately ends in an air-gapped component, working into a network may take between one and three years.²¹ While embedding malicious capabilities into public utilities or other legacy civilian systems may be more straightforward,²² attacking military systems is complex, sensitive and has a significant lead time, requiring payloads to be embedded during peacetime if they are to be available during war.\nIf a cyber attack is prosecuted in peacetime and the payload initiated before the outbreak of war, its effects will either be limited or escalatory. For example, to return to the artillery fire control system, if it were penetrated and the range tables altered prior to a conflict, this could mean that the change would be noticed during an exercise, the range tables corrected and the system security patched prior to a conflict. Alternatively, it could mean that during the same exercise the artillery kills friendly forces. This would lead to an investigation and, if the cause could be attributed to a hostile cyber attack, it would lead to a significant ²⁰ Joseph Raczynski, ‘Kill Chain: The 7 Stages of a Cyberattack’, *Thomson Reuters*, 12 October 2018.\n²¹ Author interview with a senior CTI director at a major bank, March 2021; author interview with a senior military cyber warfare officer, February 2021; author interview with a law enforcement officer specialising in counter-cyber operations, January 2021.\n²² House of Commons, ‘A Major Cyber Attack on the UK is a Matter of “When, Not If”’, Joint Committee on the National Security Strategy, 22 January 2018, <https: index.html=\"\"jcnss-cni-report=\"\"houseofcommons.shorthandstories.com=\"\">, accessed 30 March 2021.</https:> Justin Bronk and Jack Watling escalation in tensions or could even be interpreted by the victim as a casus belli.²³ Conversely, a cyber payload that sits dormant in a system until activated during a conflict presents other challenges. It must either be activated automatically when certain criteria are met or manually. The latter requires a sustained capacity to connect to the system at short notice to be maintained by the attacker. For military systems – given the changes that occur when a state transitions to war – this may be difficult, requiring the embedding of agents with knowledge of the penetration inside the enemy force. However, a payload that monitors the system so that it can activate under certain conditions is an active rather than passive insertion and is, therefore, more susceptible to detection. It could also activate under circumstances unforeseen by the attacker.\nThe final limitation of a military cyber capability is that cyber attacks function by inserting data into a system so that it is directed to behave in a specific manner. It is effective not in itself, but because of how the payload interacts with the rest of the system. Because the system is fabricated, however, and the language invented, it is subject to being expanded, divided, updated and changed in fundamental ways. Therefore, a payload that must remain dormant may be activated only to find that the surrounding environment has been altered to the extent that its code no longer makes any sense within the language with which it is supposed to interact. A well-defended system will be periodically patched so that changes like this should be routine. The result is that while militaries may spend years embedding capabilities into a network, they have no guarantees that when the time comes it will function as anticipated. Consequently, cyber attacks are unpredictable in their effects and are difficult to synchronise with established military planning and operations. This is a significant limitation, as the high lethality, mobility and relatively low quantities of most modern military capabilities mean that precise timing and coordination between different joint force elements are even more essential than they were in previous eras.\n## The Military Application of Cyber Weapons There are limited scenarios in which a cyber attack can have a decisive operational or strategic effect when used in isolation. The most famous strategic cyber attack is the Stuxnet worm which formed part of a series of attacks on Iranian nuclear fuel enrichment centrifuges from 2008.²⁴ ²³ Jens Stoltenberg, ‘NATO Will Defend Itself’, NATO, last updated 29 August 2019, <https: en=\"\"en=\"\"natohq=\"\"news_168435.htm?selectedlocale=\"en\"www.nato.int=\"\">, accessed 30 March 2021.</https:> The Slow and Imprecise Art of Cyber Warfare Estimates vary but some suggest that enough disruption was caused to set back Iranian nuclear enrichment by 18 to 24 months. However, the system reconnaissance and infiltration process took years, having reportedly begun in 2005.²⁵ Furthermore, when Stuxnet leaked accidentally beyond the air-gapped nuclear facility network, its code was subsequently identified and analysed by states and cyber security firms around the world. This resulted in public attribution of the Stuxnet attack itself to intelligence agencies in the US and Israel, as well as the probable attribution of other cyber weapons which appear to function in a similar manner.²⁶ It also gave Iran and other national and civilian organisations the opportunity to examine a strategic cyber payload described by a senior cyber security professional as 'by far the most complex piece of code that we've looked at – in a completely different league from anything we'd ever seen before'.²⁷ The Stuxnet leak, and the US/Israeli cyber operations against Iran's uranium enrichment programme as a whole, illustrate some of the key practical characteristics of cyber warfare as a standalone tool of national power. Attacks on defended systems require years of preparation to identify, infiltrate and exploit weak points. Once triggered, even very sophisticated payloads will be discovered, analysed and ultimately identified. The effects created can only ever be temporary in isolation, as states will patch their systems and replace damaged machinery if not prevented from doing so by other means. When the payloads are ultimately identified and analysed, peer and near-peer states can use insights gained to ascribe probable attribution, and also potentially to develop or enhance their own offensive cyber capabilities.\nLess sophisticated cyber payloads than Stuxnet-type cyber weapons can still be highly effective in causing standalone disruption and potentially physical damage if conducted against less defended systems such as those which control civilian infrastructure. Examples include the attack on a German steel mill in 2014, and the WannaCry ransomware attacks which caused major disruption to the NHS in 2017.²⁸ States such as Russia and ²⁴ David E Sanger, ‘Obama Order Sped Up Wave of Cyberattacks Against Iran’, *New York Times*, 1 June 2012.\n²⁵ *Ibid.* ²⁶ Josh Fruhlinger, ‘What is Stuxnet, Who Created It and How Does It Work?’, *CSO Online*, 22 August 2017, <https: 3218104=\"\"article=\"\"what-is-stuxnet-who-created-it-and-how-does-it-work.html=\"\"www.csoonline.com=\"\">, accessed 3 March 2021.\n²⁷ *Ibid.* ²⁸ TrendMicro, ‘German Steel Plant Suffers Significant Damage from Targeted Attack’, 12 January 2015, <https: fr=\"\"security=\"\"news=\"\"cyber-attacks=\"\"german-steel-plant-suffers-significant-damage-from-targeted-attack=\"\"www.trendmicro.com=\"\"vinfo=\"\">, accessed 3 March 2021; Josh Fruhlinger, ‘What Is WannaCry Ransomware, How</https:></https:> Justin Bronk and Jack Watling North Korea regularly use quasi-criminal groups of hackers operating under loose state direction to demonstrate to expert communities their ability to disrupt and even directly damage civilian industry and critical national infrastructure (CNI). This capability is then tacitly leveraged to enhance deterrence messaging against potential state opponents. Some of these attacks exploit zero-day vulnerabilities, but most employ simple massed phishing attacks to infiltrate potential target networks. As such, they are much more effective against networks which rely on commercial operating systems which are well understood, do not use three-factor authentication security procedures and may be slow to implement security patches. The purpose of most attacks of this nature is also far less specific than strategic cyber weapons such as Stuxnet; either theft of information across a broad industrial sector, extortion or simply disruption for its own sake.\nFor most Western states, there are significant legal and ethical barriers to the use of offensive cyber capabilities against civilian targets, at least in any overt attempt at deterrence messaging. In any case, the ability to infiltrate civilian infrastructure and cause temporary disruption or even limited destructive effects is unlikely to deter a state opponent from conventional military action if it has already committed to such a high-risk course of action. The recent conflicts in eastern Ukraine and Nagorno-Karabakh provide compelling evidence that states are prepared to suffer extensive damage to both civilian and military targets without backing down from kinetic confrontations where national interests are clearly defined. As such, the immediate question for those who see the apocryphal cyber capability to 'turn out the lights in Moscow' as a cheaper replacement for conventional and nuclear deterrence tools is: what effect would such an attack have on a determined adversary, and for how long? It is perhaps ironic that hyperbolic narratives, such as that advanced by Nicole Perlroth,²⁹ use Ukraine as the example of how devastating cyber attacks can be, while somehow overlooking the extent to which Ukraine has weathered and recovered from Russia's cyber onslaught.\nWhilst there are few situations in which cyber weapons can replace more traditional forms of military capability outright, there are many potential ways in which offensive cyber tools can be used as part of joint operations. For example, a previously inserted cyber payload might be Does it Infect, and Who Was Responsible?, CSO Online, 30 August 2018, <https: 3227906=\"\"article=\"\"what-is-wannacry-ransomware-how-does-it-infect-and-who-was-responsible.html=\"\"www.csoonline.com=\"\">, accessed 3 March 2021.\n²⁹ Nicole Perlroth, This Is How They Tell Me the World Ends: The Cyberweapons Arms Race (London: Bloomsbury, 2021).</https:> The Slow and Imprecise Art of Cyber Warfare used to disable or disrupt key adversary defence systems at a critical moment to enable a conventional attacking force to physically bypass or destroy them. Israel allegedly carried out just such an attack against the Syrian air defence network in 2007.³⁰ The normally bristling air defence network was rendered blind to an Israeli Air Force strike package which entered Syrian airspace, bombed a nuclear facility and withdrew unchallenged.³¹ It is still unclear in the public domain whether this was a case of a cyber payload or advanced electronic warfare techniques opening the door for the Israeli aircraft. In general terms, whereas cyber attacks involve the theft, alteration or deletion of data, electronic warfare involves the detection or disruption of enemy sensors and the transmission of data using electromagnetic energy. While both rely on an attacker having knowledge of how a target system operates, electronic warfare can be applied as an active effect in real time without lengthy network reconnaissance, infiltration and payload activation. In practice, the line between the two techniques is increasingly blurring. For example, information about the exact software and hardware configurations of a radar, obtained via cyber attacks against the defence network which it sits within, might be used to tailor sophisticated electronic warfare attack options using digital emitters such as active electronically scanned array radar sets. In this context, however, the cyber attack would have occurred long before the electronic attack, with the theft of data enabling conventional electronic warfare capabilities. What is clear, however, is that the Israeli attack in 2007 was successful because it blended cyber and/or electronic attack with a precisely choreographed application of traditional firepower. The attack on the Syrian air defence network itself was not intended to create strategic effects, but as an enabling capability it greatly reduced the risk profile and increased the effectiveness of an otherwise conventional strike operation.\nThe use of cyber attacks to 'open the door' for conventional forces in this way is dependent on several key factors. First, that the potential target can be identified well in advance of any requirement to exploit a breach. This is to allow sufficient time for the required reconnaissance, penetration and delivery stages of cyber attack preparation to be conducted. Second, in the case of an attack against a target such as an integrated air defence system (IADS), this activity will have to be coordinated with traditional intelligence gathering about the physical ³⁰ Sharon Weinberger, 'How Israel Spoofed Syria's Air Defense System', WIRED, 4 October 2007.\n³¹ BBC News, 'Israel Admits Striking Suspected Syrian Nuclear Reactor in 2007', 21 March 2018.\nlocations, individual system capabilities and patterns of movement exhibited by the radars and missile launchers themselves. This is so that the required virtual effects can be identified in terms of practical effects in the physical dimension, and it requires in-depth intelligence which will need to be gathered in multiple domains. This in turn introduces a third dependency for using cyber weapons in this way to enable conventional attacks; permissions and security clearance levels. Continuing with the IADS example, the required physical and network reconnaissance and intelligence-gathering activities would likely draw on resources from air force(s), multiple intelligence agencies and special forces operations. Many of these assets will require very high-level authorisation for tasking, and the products generated will be highly classified and not widely distributed within the military as a whole. As such, the successful use of cyber attacks as a coordinated enabler for conventional military operations requires operational planners to be aware of the art of the possible, in areas where they are unlikely to be in most countries by default. The final major dependency for this sort of attack is a linked one. Imagine a case where a cyber capability has been successfully developed and implanted with a compatible activation mechanism in a specific adversary defence system, and an operational commander is aware of it. In order to employ it, that commander must be able to justify its use to enable their conventional operation, given that once the cyber weapon is used the adversary will rapidly reset their systems, discover the vulnerability and patch it. In the case of the 2007 attack by the Israeli Air Force on a Syrian nuclear reactor, head of state authorisation would almost certainly have been granted for the operation, and the expending of a developed cyber capability (if indeed it was one) embedded over several years in the Syrian IADS deemed worthwhile to enable it. However, for more routine or ongoing military operations, cyber weapons will likely remain a capability held for specific situations rather than a regular feature. Furthermore, if military operations take place in an unforeseen context, it is unlikely that sufficient time will be available to prepare as thoroughly as Israel was able to do against its traditional rival to the north.\nA more ad-hoc use of disruptive cyber operations against CNI and military enabling capabilities is more likely to characterise the routine use of cyber capabilities in warfare in the coming decade. If the requirement is not to create a catastrophic failure in key military systems at a specific point in time to directly enable conventional operations, then the The Slow and Imprecise Art of Cyber Warfare dependencies placed on cyber specialists are less onerous. For example, Russia has conducted a range of cyber attacks against Ukrainian military and civilian systems as part of its hybrid war against the country since 2014. These have included attacks on Ukrainian military communications in coordination with intensive electronic warfare operations, as well as attacks on the national power grid and banking system. The result was to impose further disruption and costs on the government in Kyiv in conjunction with sustained direct and indirect military support to rebel groups in Donetsk and Luhansk oblasts. In other words, cyber warfare offers states another vector through which to pressure opposing states in conjunction with traditional hard and soft power tools. In a NATO context, obvious potential targets for Russian cyber attacks in the event of a major crisis or limited conflict would be the networks which control the civilian port and rail infrastructure which would be critical for mobilisation and the deployment of conventional military forces to eastern Europe. Such attacks could have significant or even decisive effects on the strategic picture for the Alliance if coupled with sustained conventional and nuclear force posturing. However, on their own, they would only delay rather than prevent military capabilities being brought to bear.\nIn considering the impact of cyber warfare on future operations, militaries are clearly correct to be taking the security of their systems seriously. Offensive cyber operations offer opportunities to gain contextual tactical advantage by disrupting the functioning of enemy systems and undermining the adversary's confidence in their equipment. They also allow for the shaping of the human terrain around which fighting takes place when aimed at civilian systems. Nevertheless, cyber attacks should not be seen as an alternative to hard power. Nor can cyber attacks function as a standalone solution.\nFinally, the opportunities offered by offensive cyber capabilities are difficult to guarantee at a specified time and place, and so cannot be relied on as a foundational capability in deterrence terms. Cyber warfare is real and cannot be ignored. But for now, it remains slow and imprecise compared to more traditional levers of military power.\n23"
    }
  },
  "citation_summary": {
    "style": "superscript",
    "dominant_bucket": "tex",
    "dominant": {
      "intext_total": 40.0,
      "success_occurrences": 40.0,
      "success_unique": 20.0,
      "bib_unique_total": 20.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 1.0,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "superscript"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 40.0,
        "success_occurrences": 40.0,
        "success_unique": 20.0,
        "bib_unique_total": 20.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 1.0,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "superscript"
      },
      "numeric": {
        "intext_total": 18.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 33.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "I. The Slow and Imprecise Art of Cyber Warfare",
    "subtitle": "To cite this article: Justin Bronk & Jack Watling (2021) I. The Slow and Imprecise Art of Cyber Warfare, Whitehall Papers, 99:1, 11-23, DOI: 10.1080/02681307.2021.2005891",
    "document_type": "journal_article",
    "venue": "ISSN: 0268-1307 (Print) 1754-5382 (Online) Journal homepage: www.tandfonline.com/journals/rwhi20",
    "publication_year": 2018,
    "authors": [
      "Noosey Harcoins",
      "Routledge Taylor",
      "Francis Group",
      "Justin Bronk",
      "Jack Watling",
      "View Crossmark data"
    ],
    "affiliations": [],
    "emails": [],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "",
    "keywords": [],
    "publication_dates": {
      "published": "06 Dec 2021",
      "online": "06 Dec 2021"
    },
    "identifiers": {
      "doi": [
        "10.1080/02681307.2021.2005891"
      ],
      "issn": [
        "ISSN: 0268-1307"
      ],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "www.tandfonline.com/journals/rwhi20",
        "https://doi.org/10.1080/02681307.2021.2005891",
        "https://www.tandfonline.com/action/journalInformation?journalCode=rwhi20",
        "www.gartner.com",
        "www.israeldefense.co.il",
        "www.doc.ic.ac.uk",
        "www.nato.int",
        "www.csoonline.com",
        "www.trendmicro.com"
      ]
    },
    "references_block_count": 0,
    "references_entries_estimated": 0,
    "heading_count": 4,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "no_abstract"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 40,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 0.25,
      "footnote_coverage": 1.0,
      "unique_index_count": 20
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "superscript",
      "recommended_style": "superscript",
      "aligned": true,
      "signals": {
        "superscript_hits": 40,
        "superscript_definition_lines": 20,
        "numeric_bracket_hits": 18,
        "numeric_endnote_lines": 7,
        "author_year_hits": 0
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 20.0,
      "dominant_bib_coverage_rate": 1.0,
      "dominant_link_target": "footnotes",
      "dominant_unresolved_flag": "unresolved_footnote_links"
    },
    "heading_validation": {
      "heading_count": 4,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": false,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": false,
        "emails": false,
        "orcids": false,
        "abstract": false,
        "keywords": false,
        "venue": true,
        "persistent_identifier": true,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 6,
        "affiliations": 0,
        "emails": 0,
        "orcids": 0,
        "keywords": 0,
        "doi": 1,
        "issn": 1,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 9
      },
      "coverage": {
        "core_coverage": 0.6666666666666666,
        "email_author_link_rate": 0.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "no_abstract"
        ],
        "toc_dot_lines": 0
      },
      "flags": [
        "meta_missing_abstract_and_keywords"
      ]
    },
    "flags": [
      "missing_preceding_text",
      "missing_reference_heading",
      "meta_missing_abstract_and_keywords"
    ]
  },
  "updated_at_utc": "2026-02-14T08:27:58.219325+00:00"
}