{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\ADV4SJXL\\Baram and Sommer - 2019 - Covert or not covert national strategies during cyber conflict.pdf",
  "custom_id": "149",
  "response": {
    "id": "batch-b6235e9e-150-dd456edc-0992-4447-9c3e-2da54542c1d9",
    "custom_id": "149",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "2019 11th International Conference on Cyber Conflict: Silent Battle\nT. Minárik, S. Alatalu, S. Biondi, M. Signoretti, I. Tolga, G. Visky (Eds.)\n2019 © NATO CCD COE Publications, Tallinn\n\nPermission to make digital or hard copies of this publication for internal use within NATO and for personal or educational use when for non-profit or non-commercial purposes is granted providing that copies bear this notice and a full citation on the first page. Any other reproduction or transmission requires prior written permission by NATO CCD COE.\n\n# Covert or not Covert: National Strategies During Cyber Conflict\n\nGil Baram\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\ngilbaram@tauex.tau.ac.il\n\nUdi Sommer\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\nhttp://people.socsci.tau.ac.il/mu/udis\n\nAbstract: Anonymity is considered to be a key characteristic of cyber conflict. Indeed, existing accounts in the literature focus on the advantages of the non-disclosure of cyber attacks. Such focus inspires the expectation that countries would opt to maintain covertness. This hypothesis is rejected in an empirical investigation we conducted on victims' strategies during cyber conflict: in numerous cases, victim states choose to publicly reveal the fact that they had been attacked. These counterintuitive findings are important empirically, but even more so theoretically. They motivate an investigation into the decision to forsake covertness. What does actually motivate states to move into the international arena and publicly expose a cyber attack?\n\nThe goal of this paper is to understand why and under which geopolitical circumstances countries choose to give up the advantages of anonymity. Whether they wish to Name and Shame opponents for ignoring international norms or whether they try to avoid public humiliation, victims of cyber attacks occasionally reveal the fact that they had been attacked. There is tension between such motivations and the will to protect intelligence sources and the incentives to prevent escalation if an attack is revealed, even more so if the attacker is exposed. Indeed, we find that sunk costs, counterescalation risks and the need to signal resolve—while critical in motivating victims to keep cyber attacks secret—may not suffice under such specific circumstances. By focusing on the victim's side, we draw inspiration from data on real-world cyber attacks in order to place cyber operations in the larger context of secrecy and covert actions in the international arena. In so doing, the aim is to advance the use of empirical data\n\n* This research was supported by a research grant from the Blavatnik Interdisciplinary Cyber Research Center at Tel-Aviv University",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 1,
            "markdown": "for understanding the dynamics of cyber conflict and the decision-making process of states operating in this increasingly complex domain.\n\nKeywords: covert actions, cyber operations, national cyber strategies\n\n# 1. INTRODUCTION\n\nIn its 2019 Global Risks Report, the World Economic Forum ranked cyber attacks as one of the top ten risks, with respect to likelihood and impact (Myers and Whiting 2019). This concern is neither new nor surprising, given the anonymity that cyber attacks afford perpetrators and victims alike. By cyber attacks, which can be a part of an ongoing cyber operation, we mean both CNA (Computer Network Attack) and CNE (Computer Network Exploitation), as they cannot be fully separated (Siedler 2016).¹ Indeed, cyber technology enables countries to act covertly: the results of offensive actions in the cyber realm and their influence are not always exposed to the public eye. Furthermore, it is not always easy to identify who is behind a given attack. Even if the results of the attack are publicly observable—e.g., damage to a power grid leading to the severance of electricity supply—the victim can still dismiss these effects, arguing that they were the result of a technical fault. To date, our understanding of those strategic interactions between attacker and victim—and their decisions about whether or not to keep attacks covert—is theoretically and empirically limited.\n\nRecent work regarding covert actions in the international arena offers three mechanisms that make the use of covert actions preferable for countries: sunk costs, counter-escalation risks and signaling resolve (Carson 2016; Carson and Yarhi-Milo 2017). These mechanisms, to be discussed in detail in Section 3, suggest that countries have strong incentives to engage in covert actions and keep those actions away from the public eye, domestically as well as internationally.\n\nYet an empirical investigation conducted on states' strategies in the wake of cyber attacks reveals a different picture. Notwithstanding the advantages of maintaining secrecy, it is not uncommon for victims to reveal the fact that they have been attacked. What causes victims of cyber attacks to \"abandon\" the covert space and move to the public arena in the aftermath of an attack? Existing literature does not offer satisfying answers (for exceptions see Edwards, Furnas, Forrest and Axelrod 2017; Poznansky and Perkoski 2018). To understand the puzzling strategic choice to abandon the advantages of ambiguity in favor of a public strategy, we need to understand the tradeoffs between the strategies. As not all countries choose to either publicly reveal\n\n¹ As Libicki concluded, “as long as the methods of cyber espionage look like the methods of cyberattack the discovery of one will raise fears about the imminence of the other.” (Libicki 2018, 121)",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 2,
            "markdown": "the attack or to hide it, we recognized that the strategies of the victims vary between four possible approaches:\n\n(1) \"Pointing a finger\" – publicly disclosing that an attack occurred (revealing vulnerability) and publicly putting the responsibility on a specific attacker;\n(2) Admitting injury – publicly disclosing that an attack took place, while failing to identify an attacker;\n(3) Revealing damage – disclosing damage but denying that it had been caused by a deliberate hostile attack (claiming technical malfunctions, system “glitches” etc.);\n(4) Maintaining ambiguity – denying or downplaying any damage, thus reducing the chances that the attack would ever be divulged.\n\nTable 1 summarizes those four strategies with illustrations from cyber attacks in recent years.\nTABLE 1: VARIANCE IN VICTIM'S STRATEGIES DURING CYBER ATTACKS, WITH REAL-LIFE EXAMPLES\n\n|   | Publicized |   | Concealed  |   |\n| --- | --- | --- | --- | --- |\n|  Victim's Strategy: | (1) Publicizing the attack and blaming the attacker (Public Strategy #1) | (2) Publicizing the attack and not blaming the attacker (Public Strategy #2) | (3) Partial concealment (claim of fault) | (4) Full concealment of the attack  |\n|  Real-life Example: | DNC hack 2016 | SingHealth hack 2018 | USS John S McCain collision 2017 | ---  |\n\nOur discussion focuses on the first two options, where the victim decided to make the attack public and sometimes also to reveal the attacker's identity. The third option (partial concealment) deals with cases where the alleged victim claims that a certain event was the result of a technical problem and not due to a cyber attack. To illustrate this option in a nutshell—since we do not delve into its details in the paper—let us look at the summer 2017 case of the USS John S McCain, which collided with a merchant ship in the Straits of Malacca, resulting in the death of 10 sailors (Werner 2018). The Chief of Naval Operations argued that there was no evidence suggesting the accident was the result of a cyber attack. However, according to experts, since the destroyer had a large navigational team as well as another team in charge of radar, it was impossible that human error had led to the accident. In addition, both the destroyers USS McCain and the USS Fitzgerald, which had been hit in a similar incident in June 2017, belong to the Seventh Fleet. Experts believed these attacks may have been related to Chinese or Russian intervention (Mass 2017).²\n\nThe Navy's investigation found no evidence of a cyber attack (Tritten 2017; Navy Releases Collision Report 2017).",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 3,
            "markdown": "After discussing the place of attribution and secrecy in cyber operations and their impact on states' strategic calculations, we develop our theoretical framework and examine two cases – hacking into the Democratic National Committee in 2016 and the SingHealth hack in 2018. It is particularly in the analysis of those two well-studied cases that our theoretical framework helps to shed new light on the national and international considerations leading countries to give up secrecy. We highlight the taxonomy of the different prototypes of these strategies and help to identify when countries might choose each strategy.\n\n## 2. ATTRIBUTION AND SECRECY – AN INHERENT COMPONENT OF CYBER OPERATIONS?\n\nThe covertness of cyber attacks can be expressed in two ways. First, the attack itself is covert. Its technological characteristics enable an attacker to carry out the operation in a clandestine way, without revealing how it was carried out. The second aspect concerns the attackers themselves, who can maintain covertness.³ It is often difficult to point out the source of an attack and to attribute it to a particular attacker. This problem is known as the Attribution Problem.\n\nThe Attribution Problem arises when the victim identified the attack, but has yet to identify the attacker. The immediate effect of this lack of certainty raises questions concerning the feasibility of retaliation, and the desire for it. Such a situation creates uncertainty as to the attacker's demands. It can be difficult to determine by technical means the motivation for an attack (Wheeler and Larsen 2003, 1). So, as Rid and Buchanan argue, “attribution is what states make of it” (Rid and Buchanan 2015, 7).\n\nWhen an attribution process is conducted using intelligence sources and methods, it is difficult to expose it without endangering these sources. But if the domestic public—especially in a democratic polity—perceives the attribution as unreliable, the state may lose the legitimacy to retaliate (Lindsay 2015). An important part of the attribution process is its political implications. Indeed, “communicating attribution is part of attributing” (Rid and Buchanan 2015, 26). When an attack is executed, security researchers attempt to find out who is behind it. In order to do so, they examine the code, techniques and protocols that the attacker used. However, this is not considered legitimate proof in court and is seen, especially today, more as playing a “blame game” (Berghel 2017, 86).\n\nFaith-based attribution happens when actors blame other actors for an attack if they believe the former carried it out. This also happens in modern politics, where politicians knowingly make incorrect statements, simply because no one checks their\n\nOn the distinction between clandestine and covert operations, see Poznansky and Perkoski, 2018, 403.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 4,
            "markdown": "validity (Berghel 2017; Carr 2016). Healey (2013) also argues that scholarship should move forward from dealing with the attribution problem. Instead of asking “who is behind the attack?” the question should be “who is to blame for it?” (Healey 2013, 55) and what are the political consequences of blaming?\n\nThis study adopts Healey's approach in the sense that the technical attribution problem is not as crucial for our framework. In practice, countries routinely accuse each other even without disclosing the full technical process that led them to attribute the attack to a particular attacker. This was the case in the Sony hack (2014) and the \"WannaCry\" attack (2017) when the US blamed North Korea without fully disclosing technical evidence.\n\nDespite the inherent overlap between cyber operations and covert actions, the scholarship has not fully explored this connection and has studied these fields separately for the most part. On the one hand, the cyberwarfare scholarship in International Relations and Security Studies hardly deals with the different aspects of secrecy in cyber operations, and mainly accepts the assumption that anonymity is an immutable feature of cyberspace rather than something actors select into and which they can therefore forfeit (for exceptions see Lupovici 2016; Poznansky and Perkoski 2018). On the other hand, scholars dealing with covert operations largely tend not to include cyber operations in their analyses (for exceptions see Brecher 2012). This study is an important step towards merging these bodies of literature.\n\nRecent work regarding secrecy in cyberspace tends to study the considerations before the attack (Edwards, Furnas, Forrest and Axelrod 2017), the perpetrators' calculations (Poznansky and Perkoski 2018), and the effect of cyber attacks on democratic states' accountability to their citizens (Schulzk 2018). While these studies are an important step in combining the two literatures, more research is needed in order to understand cyber operations as covert actions and to investigate to what extent countries choose to use the advantages of this covertness or to give it up. In the following sections these considerations are examined from the victim's point of view. We focus on the victim, since in most circumstances the victim is the first to make a choice about whether to use covertness or forsake it.\n\n# 3. GIVING UP SECRECY AS A NATIONAL STRATEGY\n\nThree mechanisms are offered in the literature for making the use of covert actions preferable for countries. First are sunk costs, which refer to situations where states decide to take covert action because of non-recoverable resources: by choosing to use covert actions, leaders can employ a more \"creative\" way to address security threats",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 5,
            "markdown": "(Carson and Yarhi-Milo 2017, 135). Second are counter-escalation risks: using covert action can appear credible because of its impact on the risk of crisis escalation, since leaders using covert signaling tools can be free to engage in more aggressive behavior. This explanation is based mainly on the audience costs literature, which identifies a link between the type of action that the state takes and the costs the leader will have to bear as a result (see Fearon 1994; Tomz 2007). The last mechanism is signaling resolve: under certain conditions, the use of covert operations allows states to convey the desired message to their rivals, and therefore they do not have to act in the public arena (Carson 2016; Carson and Yarhi-Milo 2017, 134-135).\n\nBut it seems that during cyber attacks, that might be a part of an on-going operation or a one-time attack, the options available to the victim are different, and revealing the attack has its benefits. Generally, there are cases where the incentives to remain covert are not enough and decision-makers have other incentives—such as avoiding public humiliation, warning the attacker from taking future actions and more—that lead them to decide to publicly reveal the attack.\n\nOnce the victim has identified the attack and decides to use a public strategy, it has two major options as mentioned earlier: (1) reveal the attack and point a finger towards the attacker, or (2) reveal only the fact that the attack has occurred, without disclosing the identity of the alleged attacker. Figure 1 summarizes the strategies at earlier stages and as they lead up to the strategies at this stage.\n\n![img-0.jpeg](img-0.jpeg)\nFIGURE 1: VICTIM'S STRATEGIES DURING A CYBER ATTACK\n\nTo assess the conditions under which countries that have suffered a cyber attack choose to reveal the attack and go public, we examined all known cyber attacks between rival states from 2015 to mid-2018. The framework of the Dyadic Cyber Incident Dataset (DCID) v1.1 (Maness, Valeriano and Jensen 2017) was the basis for the coding, and",
            "images": [
              {
                "id": "img-0.jpeg",
                "top_left_x": 420,
                "top_left_y": 1079,
                "bottom_right_x": 911,
                "bottom_right_y": 1455,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 6,
            "markdown": "new attacks from the Council on Foreign Relation Cyber Operations Tracker were added (Segal 2017). The unit of analysis in both datasets is state-sponsored cyber attacks. $^{4}$  We focus on state-sponsored actors because our purpose is to identify when states and their proxies conduct cyber operations in pursuit of their foreign policy interests. New variables originally collected by us were added in order to examine the victims' strategies. All data collected are open source. $^{5}$\n\nOur data indicate that there is wide variation in the victims' strategies: Between 2015 and mid-2018, 75 cyber attacks were conducted between rival states. In 44, the victims chose to address the attack publicly. Of those, in 16 the victim revealed the attack and did not attribute it. In the remaining 28, the victim revealed the attack and publicly attributed it to a specific attacker (Figure 2). Out of the 28 cases where victims chose to publicly reveal the attack and the attacker, only three states were not democratic.[6]\n\nThe data suggest that states frequently choose public strategies. Although at first glance, revealing the attack might be perceived as exposing a country's weakness, there are several considerations with positive implications, which could lead the country to decide to reveal the attack. The question is: why do states act that way, and in the pursuit of which advantages?\n\n![img-1.jpeg](img-1.jpeg)\nFIGURE 2: VARIANCE IN VICTIMS' STRATEGIES BETWEEN 2015 AND MID-2018\n\n4 This paper focuses only on state-sponsored cyber attacks. Doing that allowed us to achieve in-depth insights regarding the ways countries operate during cyber conflict. Keeping out of the analysis other kinds of cyber attacks, such as multi-victim attacks and attacks against NGOs, might pose a methodological challenge. Due to the limited scope of this paper we do not treat these kinds of cyber attacks here, and will deal with them in future projects.\n5 The \"unknown-unknowns\" cyber attacks are the ones that are not known to the public. This paper deals only with cyber attacks that have been publicly revealed and that had sufficient data on them in order to code it in our dataset.\n6 According to Freedom House.",
            "images": [
              {
                "id": "img-1.jpeg",
                "top_left_x": 404,
                "top_left_y": 992,
                "bottom_right_x": 917,
                "bottom_right_y": 1387,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 7,
            "markdown": "8\n\n# Reasons to publicly reveal the attack\n\nIn most cyber attacks the victim does not have full confidence regarding the identity of the attacker. Furthermore, there are questions around to what extent a victim that chooses to accuse the attacker is certain of the accuracy of its identification. If it possesses technical evidence that can be exposed, the attacker will have more difficulty denying the charges. However, more often than not this is not the case. It is common for a victim to point a finger at a particular attacker even without disclosing the full technical evidence that led to that attribution.\n\nIn the political and technical landscapes of our time, it is important to consider cyber attacks in the broader geostrategic context. In many cases there is an ongoing political tension that means it is in the victim’s interests to reveal the aggressive actions of its adversary, a strategy known as Naming and Shaming. A Naming and Shaming strategy means publicly identifying perpetrators that are “doing wrong” and undermining international law and the rules-based order. This might look like the victim is admitting to its weakness. Yet, in a long-term cost-benefit analysis, sometimes it is better to “call out” the aggressor as violating international norms than to remain silent. This might help the victim and its allies to improve their cybersecurity readiness, while also reaffirming the victim’s commitment to law and norms (on publicizing states activities see Carnegie and Carson 2018).\n\nAn additional consideration in revealing attacks is the need to avoid public humiliation. The victim can decide to disclose the attack due to the desire to avoid humiliation and degradation, which will most likely accompany the publication of the said attack by the attacker or by a third party. In a post-Snowden reality, remaining covert is hard. The general public is more aware of state activities and has the means to publicize them via social media as well as in various other ways. As a result, the political costs of transparency may be less than those associated with hiding an attack. This minimizes the victim’s reputational damage and helps to improve overall cybersecurity of both victim and international allies alike.\n\nAnother goal may be showing strength in front of an international audience by warning the attacker against taking future actions. By disclosing the attack and accusing the attacker, the victim conveys a message that it has identified the attack and may intend to retaliate; plus, it has the technical know-how to identify the attack and point out the entity behind it. If the victim can say to the presumed attackers that it knows what they are up to, it implies that it also knows a lot more about the attackers’ operations and capabilities. This may introduce uncertainty into the decision-making process and induce a strategic effect. Such was the case with the Obama-Xi agreement from 2015 that reduced Chinese industrial cyber espionage for a limited period of time (Spetalnick and Martina 2015). A country that exposes the attack and points a finger",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 8,
            "markdown": "at the attacker, while showing its methods of coping and the ways in which it operates to strengthen its defense capabilities, is portrayed as a leader in the international arena in dealing with cyber attacks.7 Other countries will observe and learn from it, as was the case with the Democratic National Committee hack, which is discussed in detail later on.\n\n## Motivations not to reveal the attacker\n\nAssuming that the victim identified the attacker, there are at least two main reasons why the victim would not want to reveal the attacker’s identity in public:\n\n(1) Safety of intelligence sources. The desire to avoid exposing intelligence and sources is an important reason not to make the identity of the attacker public. This is even more acute in cyberspace, because it is difficult to identify the attacker only using technical tools. Therefore, it is often necessary to use intelligence of various kinds, such as advanced technological and even human resources to obtain the necessary information. These sources are considered highly important and valuable for the country’s intelligence services, and therefore it is essential to protect their safety and not to expose them.\n\n(2) Preventing escalation. There may be differences in the existing technological capabilities and power of the victim and the attacker. If this is the case, the victim might choose not to publicize the attack in order to avoid the chance that the exposure would lead to open confrontation. An aggressive public intervention by one country in another’s affairs poses a political-strategic challenge to the victim in the eyes of the domestic public and the international community, who are watching and waiting to see how it responds (Carson 2016). Not revealing the identity of the attacker allows the victim to refrain from the obligation to respond, contain the attack and prevent undesirable escalation.\n\nWe expect victims to choose to reveal the attack publicly and attribute it when (a) they want to expose the aggressor and blame them for violating international norms; (b) avoid international and domestic humiliation; (c) warn the attacker. However, by revealing the attack and not attributing it, the victim can also avoid humiliation and there are covert ways to convey a deterrent message. Therefore, we hypothesize that in this case key reasons for not attributing the attack are (a) the safety of intelligence sources; and (b) preventing escalation. The two cases tested in the next section will help examine these expectations.\n\n7 We are aware that there are other considerations for countries to reveal the attack, such as creating a false attribution for political reasons or faking non-existent capabilities by revealing; using the publicized attack for political reasons such as increase allied support; cases when there is a public leak and the victim is being forced to reveal the attack; internal political considerations and more. The scope of this paper will not allow us to deal with all these considerations but they will be taken into account in our larger research agenda.\n\n9",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 9,
            "markdown": "10\n\n# 4. GIVING UP SECRECY IN CYBER OPERATIONS – REAL-LIFE CASES\n\nTwo major cyber attacks that occurred in the past three years are examined. They allow us to illustrate the public strategies identified and described theoretically above.\n\n## Democratic National Committee Hack 2016\n\nIn April 2016, hackers gained access into the Democratic National Committee (DNC) network, stealing several gigabytes of data. From June-November 2016, WikiLeaks published 20,000 emails of DNC members, and in July 2016 the FBI began an investigation of the hack. The investigation revealed that in the months prior to the WikiLeaks releases, two groups of hackers operating under the auspices of the Russian government broke into the computers of the DNC and leaked the emails. This action was part of a broader Russian operation in the months before the presidential election in 2016, intended to influence the election results and to jeopardize the integrity of the democratic processes (Bump 2018).\n\nOn December 2016, President Obama publicly accused Russia of carrying out these attacks, warned that it must stop and said that the US had offensive cyber capabilities and it might respond. At the end of that month, President Obama ordered the expulsion of 35 Russian diplomats from the US, as well as the closure of sites which were used by the Russians to gather intelligence (Landler and Sanger 2016; Ryan, Nakashima and De Young 2016). The Department of Homeland Security (DHS) and the FBI published a joint statement describing the process of the Russian cyber attack, directly accusing military and civilian Russian intelligence agencies. According to the statement, “The US Intelligence Community is confident that the Russian Government directed the recent compromises of emails from US persons and institutions [...] only Russia’s senior-most officials could have authorized these activities.” (Department of Homeland Security 2016). The operations of Russian intelligence agencies included “spear phishing” attacks of entities in government agencies, critical infrastructure, think tanks, universities, political organizations, and more, in order to steal information (Masters 2018).\n\nThe fact that the US chose to publicly accuse Russia of the attack helped strengthen its international standing by calling out Russia’s undermining of the international order in trying to manipulate and sabotage democratic procedures. Such attempts to influence election results are perceived by Western democracies as damaging their political and institutional integrity. Other countries also saw and learned from the American experience. Following the exposure of the attack, the US became the focus of interest for other democratic countries—such as France and Germany—which were about to hold their own elections and feared Russian intervention. For example, the NSA",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 10,
            "markdown": "warned French officials that Russian hackers had compromised some elements of the election (Greenberg 2017).\n\nThe experience gained by the US in dealing with Russian activity enabled it to share information and assist other countries. The US became a role model for confronting Russian influence attempts and protecting election campaigns (Graham, 2017). This case demonstrates the value of our theoretical framework: by publicly revealing the attack, the US avoided public humiliation that could have happened if a third party or Russia itself had revealed the attack instead. Also, by conveying a deterrent message to the Russians, the US made a coercive threat and demonstrated resolve. It showed its will to spend valuable resources in order to make Russia pay a price for its offensive actions.\n\n# SingHealth Hack 2018\n\nOn 4 July 2018, data administrators detected unusual activity on one of SingHealth's IT databases. With more than two million patients, SingHealth is the largest health provider in Singapore. The security team immediately investigated the suspicious activity to determine its nature and whether it was malicious. On July 10th, after forensic investigations confirming it was a cyber attack, SingHealth, the Ministry of Health and the Cyber Security Agency (CSA) were informed (Tham 2018). The cyber attack resulted in the personal details of 1.5m SingHealth patients being accessed and copied; this included names, identification numbers, address, gender, race and date of birth, including the personal data of Singapore's Prime Minister. On July 20th, even while investigations were still under way, SingHealth and investigating authorities assessed that the situation had been stabilized and informed the public of the cyber attack, (Singapore Ministry of Health 2018).\n\nFollowing the attack, a public Committee of Inquiry was established. A senior counsel in the Ministry of Justice summarized in front of the committee how advanced, determined and disciplined the attackers were: \"The skill and sophistication used in the SingHealth attack highlights the challenges that cyber defenders face\" (Tham and Baharudin, 2018). Speaking at a press conference on July 20th 2018, the Chief Executive of the CSA, David Koh, confirmed that: \"We have determined that this is a deliberate, targeted and well-planned cyber attack, not the work of casual hackers [...] we are not able to reveal more because of operational security reasons\" (Koh 2018). From Koh's words it seems that for national security reasons the CSA wanted to keep its intelligence sources safe and did not reveal any information that could risk them.\n\nAlthough the head of the CSA estimated that a nation state was behind the attack, and many security analysts even estimated it was China, Singapore was careful not to reveal the identity of the attacker in public. The decision to make the attack public\n\n11",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 11,
            "markdown": "was based on two main considerations. The first derived from the theft of personal information that is critical for the daily life of citizens. As most activities that are essential to the daily lives of Singapore's citizens take place online, there was a concern that the attacker might want to use the data to gain access to additional personal details (Tham and Baharudin, 2018).\n\nAnother consideration for exposing the attack, but keeping the identity of the attacker undisclosed, was concern about public humiliation. If the attacker or a third party exposed the attack before the Singaporean authorities did, it could damage the reputation of the administration. In such circumstances, the administration would appear to have failed to protect its citizens and to have made an attempt to conceal it.\n\nWhile experts pointed fingers at China (Lee 2018), authorities remain tight-lipped. One explanation for that is the need to avoid escalation. China and Singapore have a close relationship, but differences have been experienced during numerous high-profile events, including Singapore's stance against China regarding the South China Sea dispute. The power differential between the two, and the will of Singapore not to take any steps that could risk this relationship and escalate the situation, seem to be among the main reasons why Singapore chose not to reveal the identity of the attacker. Further support for the decision not to reveal the identity of the attacker was given by the Minister-in-Charge of cybersecurity. In January 2019, the Minister stated that: \"Revealing the identity of the perpetrator would not be in the Republic's national interest [...] We've got nothing to hide here [...] the only part that's been held back are those that pertain to sensitive national security matters and also patient confidentiality\" (Nair 2019; Yufeng 2019).\n\n# 5. CONCLUSIONS\n\nReasons ranging from attempts to Name and Shame or avoid public humiliation, to incomplete confidence about the identity of the attacker may lead victims of cyber attacks to reveal the fact they had been attacked. There is tension, however, between such reasons and the motivation to protect the safety of intelligence sources and the will to prevent escalation if an attack is revealed and even more so if the attacker is exposed. The preliminary results and analyses presented here demonstrate that despite a range of reasons to remain covert, countries that suffered cyber attacks have sufficiently strong incentives to reveal the fact they had been attacked. The three mechanisms presented in the literature as motivating decision-makers to keep the attack covert—sunk costs, counter-escalation risks and signaling resolve—do not always suffice in the cyber reality. Not only would victims make the attack public, but",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 12,
            "markdown": "under certain circumstances, they would even expose the attacker. This finding is both unintuitive and largely undocumented in the literature.\n\nThe will to avoid domestic and international humiliation if the attack will be exposed by a third party leads countries to give up the advantages of secrecy in cyberspace and reveal the fact that they had been attacked. Furthermore, attributing the attack to a specific attacker helps the victim to warn the attacker from taking future actions and be model for other countries who deal with similar attacks. Such was the case in the DNC hack where the US not only set the standard for other countries in the West but also aided them in preventing potential threats to the integrity of their democratic process.\n\nNational security considerations such as keeping intelligence sources safe and avoiding escalation play an important part in the decision to reveal the attack without attributing it to a specific attacker. Such was the case in the SingHealth hack. To protect citizens' online identity and e-government business, the attack was made public by the government in Singapore. Yet, its source remained undisclosed, possibly to avoid causing a geostrategic threat of escalation.\n\nFuture research is essential. In particular, in this paper we limited the theoretical discussion and empirical work to public strategies exclusively. We did not deal with the other two options from Table 1 – partial concealment and full concealment of the attack and did not analyze the attackers’ strategies and the utility of the interaction between both sides.\n\n## Acknowledgments\n\nWe thank Dana Litman, Adi Lotan and Eden Poch for excellent research assistance.\n\n## REFERENCES\n\nBerghel, Hal. “On the Problem of (Cyber) Attribution.” *Computer 3*, no. 50 (2017): 84-89. https://www.computer.org/csdl/mags/co/2017/03/mco2017030084.pdf\n\nBrecher, Aaron. “Cyberattacks and the Covert Action Statute: Toward a Domestic Legal Framework for Offensive Cyberoperations.” *Michigan Law Review* (2012): 423-452. https://heinonline.org/HOL/Page?collection=journals&amp;handle=hein.journals/mlr111&amp;id=452&amp;men_tab=srchresults\n\nBump, Philip. 2018. “Timeline: How Russian agents allegedly hacked the DNC and Clinton’s campaign.” *Washington Post*, July 13, 2018. https://www.washingtonpost.com/news/politics/wp/2018/07/13/timeline-how-russian-agents-allegedly-hacked-the-dnc-and-clintons-campaign/?utm_term=.f7d3b8b7fe50\n\nCarnegie, Allison and Austin Carson. “The Spotlight’s Harsh Glare: Rethinking Publicity and International Order.” *International Organization* 72, no. 3 (2018): 627-657. https://doi.org/10.1017/S0020818318000176",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 13,
            "markdown": "14\n\nCarr, Jeffrey. 2016. \"Faith-based Attribution?\" *Medium*, July 10, 2016. https://medium.com/@jeffreyscarr/faith-based-attribution-30f4a658eabc\n\nCarson, Austin. \"Facing Off and Saving Face: Covert Intervention and Escalation Management in the Korean War.\" *International Organization* 70, no. 1 (2016): 103-131. https://doi.org/10.1017/S0020818315000284\n\nCarson, Austin and Keren Yarhi-Milo. \"Covert Communication: The Intelligibility and Credibility of Signaling in Secret.\" *Security Studies* 26, no. 1 (2017): 124-156. https://doi.org/10.1080/09636412.2017.1243921\n\nEdwards, Benjamin, Alexander Furnas, Stephanie Forrest and Robert Axelrod. \"Strategic Aspects of Cyberattack and Blame,\" *Proceedings of the National Academy of Sciences* 114, no. 11 (March, 2017): 2825-2850. https://doi.org/10.1073/pnas.1700442114\n\nFearon, James. \"Domestic Political Audiences and the Escalation of International Disputes.\" *American Political Science Review* 88, no. 3 (1994): 577-592. https://doi.org/10.2307/2944796\n\nGraham, Chris. 2017. \"French Election: Are Russian Hackers to Blame for Emmanuel Macron's Leaked Emails - and Could They Target UK Election?\" *The Telegraph*, May 6, 2017. https://www.telegraph.co.uk/news/2017/05/06/russian-hackers-blame-emmanuel-macrons-leaked-emails-could/\n\nGreenberg, Andy. 2017. \"The NSA Confirms it: Russia Hacked French Election 'Infrastructure'\", *Wired*, September 5, 2017. https://www.wired.com/2017/05/nsa-director-confirms-russia-hacked-french-election-infrastructure/\n\nHealey, Jason. \"The Spectrum of National Responsibility for Cyberattacks.\" *Brown Journal of World Affairs* 18, no. 1 (2013): 57-70. https://www.jstor.org/stable/24590776\n\nKoh, David. 2018. \"CSA on Investigations regarding the Deliberate Cyber Attack,\" YouTube video, 0:31, July 20, 2018. https://www.youtube.com/watch?v=toM_WXImOBc&amp;index=3&amp;list=PLH2CR4s1lqyiZZ1n6wVvW_uMMR4fFXrW4\n\nLandler, Mark and David Sanger. 2016. \"Obama Says He Told Putin: 'Cut it Out' on Hacking.\" *New York Times*, December 16, 2016. https://www.nytimes.com/2016/12/16/us/politics/obama-putin-hacking-news-conference.html\n\nLee, Justina. 2018. \"Suspected China cyberhack on Singapore is a wake-up call for Asia,\" *Nikkei Asian Review*, August 21, 2018. https://asia.nikkei.com/Spotlight/Asia-Insight/Suspected-China-cyberhack-on-Singapore-is-a-wake-up-call-for-Asia\n\nLibicki, Martin. 2018. \"Drawing Inferences from Cyber Espionage,\" *2018 10th International Conference on Cyber Conflict*, NATO CCD COE Publications, Tallinn. https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&amp;arnumber=8405013\n\nLindsay, Jon. \"Tipping the scales: the attribution problem and the feasibility of deterrence against cyberattack.\" *Journal of Cyber Security* 1, no 1 (2015): 53-67. https://doi.org/10.1093/cybsec/tyv003\n\nLupovici, Amir. \"The 'Attribution Problem' and the Social Construction of 'Violence': Taking Cyber Deterrence Literature a Step Forward.\" *International Studies Perspectives* 17, no. 3 (2016): 322-342. https://doi.org/10.1111/insp.12082\n\nManess, Rayn, Brandon Valeriano, and Benjamin Jensen. \"Codebook for the Dyadic Cyber Incident and Dispute Dataset Version 1.1.\" (2017). https://drryanmaness.wixsite.com/cyberconflict/cyber-conflict-dataset\n\nMass, Warren. 2017. \"Cyber Experts Believe Hacking may have Caused Collision of USS John S. McCain.\" *The New American*, August 22, 2017. https://www.thenewamerican.com/tech/computers/item/26753-cyber-experts-believe-hacking-may-have-caused-collision-of-uss-john-s-mccain\n\nMasters, Jonathan. 2018. \"Russia, Trump, and the 2016 U.S. Election.\" *Council on Foreign Relations*. February 26, 2018. https://www.cfr.org/backgrounder/russia-trump-and-2016-us-election.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 14,
            "markdown": "15\n\nMyers Joe and Kate Whiting. 2019. \"These are the biggest risks facing our world in 2019.\" *World Economic Forum*, January 16, 2019. https://www.weforum.org/agenda/2019/01/these-are-the-biggest-risks-facing-our-world-in-2019/\n\nNair, Suresh. 2019. \"Singapore Healthcare cyberattack: Not revealing hacker still a 'puzzler'.\" *The Independent*, January 16, 2019. http://theindependent.sg/singapore-healthcare-cyberattack-not-revealing-hacker-still-a-puzzler/\n\nNavy Office of Information. *Navy Releases Collision Report for USS Fitzgerald and USS John S McCain Collisions*, 2017. https://www.navy.mil/submit/display.asp?story_id=103130\n\nPoznansky, Michael and Evan Perkoski. \"Rethinking Secrecy in Cyberspace: The Politics of Voluntary Attribution.\" *Journal of Global Security Studies* 3, no. 4 (2018): 402-416. https://doi.org/10.1093/jogss/ogy022\n\nRid, Thomas and Ben Buchanan. \"Attributing Cyber Attacks.\" *Journal of Strategic Studies* 38, no. 1-2 (2015): 4-37. https://doi.org/10.1080/01402390.2014.977382\n\nRyan, Missy, Ellen Nakashima and Karen De Young. 2016. \"Obama administration announces measures to punish Russia for 2016 election interference.\" *The Washington Post*, December 29, 2016. https://www.washingtonpost.com/world/national-security/obama-administration-announces-measures-to-punish-russia-for-2016-election-interference/2016/12/29/311db9d6-cdde-11e6-a87f-b917067331bb_story.html?utm_term=.e4a51ff3e57d\n\nSchulzke, Marcus. \"The Politics of Attributing Blame for Cyberattacks and the Costs of Uncertainty.\" *Perspectives on Politics* 16, no. 4 (2018): 954-968. https://doi.org/10.1017/S153759271800110X\n\nSegal, Adam. 2017. *Tracking State-Sponsored Cyber Operations*, Council on Foreign Relations, November 6, 2017. https://www.cfr.org/blog/tracking-state-sponsored-cyber-operations\n\nSiedler, Endresen. \"Hard power in cyberspace: CNA as a political means.\" *2016 8th International Conference on Cyber Conflict (CyCon)*. IEEE, (2016). https://ieeexplore.ieee.org/abstract/document/7529424\n\nSingapore. Ministry of Health. *Cyberattack on SingHealth's IT System*. August 6, 2018. Accessed December 31, 2018. https://www.moh.gov.sg/news-highlights/details/cyberattack-on-singhealth's-it-system.\n\nSpetalnick, Matt and Michael Martina. 2015. \"Obama announces 'understanding' with China's Xi on cyber theft but remains wary.\" *Reuters*, September 26, 2015. https://www.reuters.com/article/us-usa-china/obama-announces-understanding-with-chinas-xi-on-cyber-theft-but-remains-wary-idUSKCN0RO2HQ20150926\n\nTham, Irene. 2018. \"Personal info of 1.5m SingHealth patients, including PM Lee, stolen in Singapore's worst cyberattack.\" *The Straits Times*, July 20, 2018. https://www.straitstimes.com/singapore/personal-info-of-15m-singhealth-patients-including-pm-lee-stolen-in-singapores-most\n\nTham, Irene and and Hariz Baharudin. 2018. \"Attempt on July 19 was detected and cut off on same day, thanks to heightened monitoring.\" *The Straits Times*, October 6, 2018. https://www.straitstimes.com/tech/hackers-made-another-intrusion-attempt-as-probe-was-under-way\n\nTomz, Michael. \"Domestic Audience Costs in International Relations: An Experimental Approach.\" *International Organization* 61, no. 4 (2007): 821-840. https://doi.org/10.1017/S0020818307070282\n\nTritten, Travis. 2017. \"Navy Chief: There's no evidence recent collisions were caused by hacking.\" *Business Insider*, August 30, 2017. https://www.businessinsider.com/navy-chief-no-evidence-recent-collisions-were-caused-by-hacking-2017-8\n\nUnited States. Department of Homeland Security. *Joint Statement from the Department of Homeland Security and Office of the Director of National Intelligence on Election Security: DHS Press Office*, October 7, 2016. https://www.dhs.gov/news/2016/10/07/joint-statement-department-homeland-security-and-office-director-national",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          },
          {
            "index": 15,
            "markdown": "16\n\nWerner, Ben. 2018. \"USS John S. McCain Collision, A Year Later.\" USNI News, August 21, 2018. https://news.usni.org/2018/08/21/35947.\n\nWheeler, David and Gregory Larsen. *Techniques for Cyber Attack Attribution*. Alexandria, VA, 2003. https://apps.dtic.mil/dtic/tr/fulltext/u2/a468859.pdf\n\nYufeng, Kok. 2019. \"SingHealth attacker known: Iswaran.\" The New Paper Singapore, January 16, 2019. https://www.tnp.sg/news/singapore/singhealth-attacker-known-iswaran",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1890,
              "width": 1339
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 16,
          "doc_size_bytes": 2123732
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "2019 11th International Conference on Cyber Conflict: Silent Battle\nT. Minárik, S. Alatalu, S. Biondi, M. Signoretti, I. Tolga, G. Visky (Eds.)\n2019 © NATO CCD COE Publications, Tallinn\nPermission to make digital or hard copies of this publication for internal use within NATO and for personal or educational use when for non-profit or non-commercial purposes is granted providing that copies bear this notice and a full citation on the first page. Any other reproduction or transmission requires prior written permission by NATO CCD COE.\n# Covert or not Covert: National Strategies During Cyber Conflict\nGil Baram\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\ngilbaram@tauex.tau.ac.il\nUdi Sommer\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\nhttp://people.socsci.tau.ac.il/mu/udis\nAbstract: Anonymity is considered to be a key characteristic of cyber conflict. Indeed, existing accounts in the literature focus on the advantages of the non-disclosure of cyber attacks. Such focus inspires the expectation that countries would opt to maintain covertness. This hypothesis is rejected in an empirical investigation we conducted on victims' strategies during cyber conflict: in numerous cases, victim states choose to publicly reveal the fact that they had been attacked. These counterintuitive findings are important empirically, but even more so theoretically. They motivate an investigation into the decision to forsake covertness. What does actually motivate states to move into the international arena and publicly expose a cyber attack?\nThe goal of this paper is to understand why and under which geopolitical circumstances countries choose to give up the advantages of anonymity. Whether they wish to Name and Shame opponents for ignoring international norms or whether they try to avoid public humiliation, victims of cyber attacks occasionally reveal the fact that they had been attacked. There is tension between such motivations and the will to protect intelligence sources and the incentives to prevent escalation if an attack is revealed, even more so if the attacker is exposed. Indeed, we find that sunk costs, counterescalation risks and the need to signal resolve—while critical in motivating victims to keep cyber attacks secret—may not suffice under such specific circumstances. By focusing on the victim's side, we draw inspiration from data on real-world cyber attacks in order to place cyber operations in the larger context of secrecy and covert actions in the international arena. In so doing, the aim is to advance the use of empirical data\n* This research was supported by a research grant from the Blavatnik Interdisciplinary Cyber Research Center at Tel-Aviv University\nfor understanding the dynamics of cyber conflict and the decision-making process of states operating in this increasingly complex domain.\nKeywords: covert actions, cyber operations, national cyber strategies\n# 1. INTRODUCTION\nIn its 2019 Global Risks Report, the World Economic Forum ranked cyber attacks as one of the top ten risks, with respect to likelihood and impact (Myers and Whiting 2019). This concern is neither new nor surprising, given the anonymity that cyber attacks afford perpetrators and victims alike. By cyber attacks, which can be a part of an ongoing cyber operation, we mean both CNA (Computer Network Attack) and CNE (Computer Network Exploitation), as they cannot be fully separated (Siedler 2016).¹ Indeed, cyber technology enables countries to act covertly: the results of offensive actions in the cyber realm and their influence are not always exposed to the public eye. Furthermore, it is not always easy to identify who is behind a given attack. Even if the results of the attack are publicly observable—e.g., damage to a power grid leading to the severance of electricity supply—the victim can still dismiss these effects, arguing that they were the result of a technical fault. To date, our understanding of those strategic interactions between attacker and victim—and their decisions about whether or not to keep attacks covert—is theoretically and empirically limited.\nRecent work regarding covert actions in the international arena offers three mechanisms that make the use of covert actions preferable for countries: sunk costs, counter-escalation risks and signaling resolve (Carson 2016; Carson and Yarhi-Milo 2017). These mechanisms, to be discussed in detail in Section 3, suggest that countries have strong incentives to engage in covert actions and keep those actions away from the public eye, domestically as well as internationally.\nYet an empirical investigation conducted on states' strategies in the wake of cyber attacks reveals a different picture. Notwithstanding the advantages of maintaining secrecy, it is not uncommon for victims to reveal the fact that they have been attacked. What causes victims of cyber attacks to \"abandon\" the covert space and move to the public arena in the aftermath of an attack? Existing literature does not offer satisfying answers (for exceptions see Edwards, Furnas, Forrest and Axelrod 2017; Poznansky and Perkoski 2018). To understand the puzzling strategic choice to abandon the advantages of ambiguity in favor of a public strategy, we need to understand the tradeoffs between the strategies. As not all countries choose to either publicly reveal\n¹ As Libicki concluded, “as long as the methods of cyber espionage look like the methods of cyberattack the discovery of one will raise fears about the imminence of the other.” (Libicki 2018, 121)\nthe attack or to hide it, we recognized that the strategies of the victims vary between four possible approaches:\n(1) \"Pointing a finger\" – publicly disclosing that an attack occurred (revealing vulnerability) and publicly putting the responsibility on a specific attacker;\n(2) Admitting injury – publicly disclosing that an attack took place, while failing to identify an attacker;\n(3) Revealing damage – disclosing damage but denying that it had been caused by a deliberate hostile attack (claiming technical malfunctions, system “glitches” etc.);\n(4) Maintaining ambiguity – denying or downplaying any damage, thus reducing the chances that the attack would ever be divulged.\nTable 1 summarizes those four strategies with illustrations from cyber attacks in recent years.\nTABLE 1: VARIANCE IN VICTIM'S STRATEGIES DURING CYBER ATTACKS, WITH REAL-LIFE EXAMPLES\n|   | Publicized |   | Concealed  |   |\n| --- | --- | --- | --- | --- |\n|  Victim's Strategy: | (1) Publicizing the attack and blaming the attacker (Public Strategy #1) | (2) Publicizing the attack and not blaming the attacker (Public Strategy #2) | (3) Partial concealment (claim of fault) | (4) Full concealment of the attack  |\n|  Real-life Example: | DNC hack 2016 | SingHealth hack 2018 | USS John S McCain collision 2017 | ---  |\nOur discussion focuses on the first two options, where the victim decided to make the attack public and sometimes also to reveal the attacker's identity. The third option (partial concealment) deals with cases where the alleged victim claims that a certain event was the result of a technical problem and not due to a cyber attack. To illustrate this option in a nutshell—since we do not delve into its details in the paper—let us look at the summer 2017 case of the USS John S McCain, which collided with a merchant ship in the Straits of Malacca, resulting in the death of 10 sailors (Werner 2018). The Chief of Naval Operations argued that there was no evidence suggesting the accident was the result of a cyber attack. However, according to experts, since the destroyer had a large navigational team as well as another team in charge of radar, it was impossible that human error had led to the accident. In addition, both the destroyers USS McCain and the USS Fitzgerald, which had been hit in a similar incident in June 2017, belong to the Seventh Fleet. Experts believed these attacks may have been related to Chinese or Russian intervention (Mass 2017).²\nThe Navy's investigation found no evidence of a cyber attack (Tritten 2017; Navy Releases Collision Report 2017).\nAfter discussing the place of attribution and secrecy in cyber operations and their impact on states' strategic calculations, we develop our theoretical framework and examine two cases – hacking into the Democratic National Committee in 2016 and the SingHealth hack in 2018. It is particularly in the analysis of those two well-studied cases that our theoretical framework helps to shed new light on the national and international considerations leading countries to give up secrecy. We highlight the taxonomy of the different prototypes of these strategies and help to identify when countries might choose each strategy.\n## 2. ATTRIBUTION AND SECRECY – AN INHERENT COMPONENT OF CYBER OPERATIONS?\nThe covertness of cyber attacks can be expressed in two ways. First, the attack itself is covert. Its technological characteristics enable an attacker to carry out the operation in a clandestine way, without revealing how it was carried out. The second aspect concerns the attackers themselves, who can maintain covertness.³ It is often difficult to point out the source of an attack and to attribute it to a particular attacker. This problem is known as the Attribution Problem.\nThe Attribution Problem arises when the victim identified the attack, but has yet to identify the attacker. The immediate effect of this lack of certainty raises questions concerning the feasibility of retaliation, and the desire for it. Such a situation creates uncertainty as to the attacker's demands. It can be difficult to determine by technical means the motivation for an attack (Wheeler and Larsen 2003, 1). So, as Rid and Buchanan argue, “attribution is what states make of it” (Rid and Buchanan 2015, 7).\nWhen an attribution process is conducted using intelligence sources and methods, it is difficult to expose it without endangering these sources. But if the domestic public—especially in a democratic polity—perceives the attribution as unreliable, the state may lose the legitimacy to retaliate (Lindsay 2015). An important part of the attribution process is its political implications. Indeed, “communicating attribution is part of attributing” (Rid and Buchanan 2015, 26). When an attack is executed, security researchers attempt to find out who is behind it. In order to do so, they examine the code, techniques and protocols that the attacker used. However, this is not considered legitimate proof in court and is seen, especially today, more as playing a “blame game” (Berghel 2017, 86).\nFaith-based attribution happens when actors blame other actors for an attack if they believe the former carried it out. This also happens in modern politics, where politicians knowingly make incorrect statements, simply because no one checks their\nOn the distinction between clandestine and covert operations, see Poznansky and Perkoski, 2018, 403.\nvalidity (Berghel 2017; Carr 2016). Healey (2013) also argues that scholarship should move forward from dealing with the attribution problem. Instead of asking “who is behind the attack?” the question should be “who is to blame for it?” (Healey 2013, 55) and what are the political consequences of blaming?\nThis study adopts Healey's approach in the sense that the technical attribution problem is not as crucial for our framework. In practice, countries routinely accuse each other even without disclosing the full technical process that led them to attribute the attack to a particular attacker. This was the case in the Sony hack (2014) and the \"WannaCry\" attack (2017) when the US blamed North Korea without fully disclosing technical evidence.\nDespite the inherent overlap between cyber operations and covert actions, the scholarship has not fully explored this connection and has studied these fields separately for the most part. On the one hand, the cyberwarfare scholarship in International Relations and Security Studies hardly deals with the different aspects of secrecy in cyber operations, and mainly accepts the assumption that anonymity is an immutable feature of cyberspace rather than something actors select into and which they can therefore forfeit (for exceptions see Lupovici 2016; Poznansky and Perkoski 2018). On the other hand, scholars dealing with covert operations largely tend not to include cyber operations in their analyses (for exceptions see Brecher 2012). This study is an important step towards merging these bodies of literature.\nRecent work regarding secrecy in cyberspace tends to study the considerations before the attack (Edwards, Furnas, Forrest and Axelrod 2017), the perpetrators' calculations (Poznansky and Perkoski 2018), and the effect of cyber attacks on democratic states' accountability to their citizens (Schulzk 2018). While these studies are an important step in combining the two literatures, more research is needed in order to understand cyber operations as covert actions and to investigate to what extent countries choose to use the advantages of this covertness or to give it up. In the following sections these considerations are examined from the victim's point of view. We focus on the victim, since in most circumstances the victim is the first to make a choice about whether to use covertness or forsake it.\n# 3. GIVING UP SECRECY AS A NATIONAL STRATEGY\nThree mechanisms are offered in the literature for making the use of covert actions preferable for countries. First are sunk costs, which refer to situations where states decide to take covert action because of non-recoverable resources: by choosing to use covert actions, leaders can employ a more \"creative\" way to address security threats\n(Carson and Yarhi-Milo 2017, 135). Second are counter-escalation risks: using covert action can appear credible because of its impact on the risk of crisis escalation, since leaders using covert signaling tools can be free to engage in more aggressive behavior. This explanation is based mainly on the audience costs literature, which identifies a link between the type of action that the state takes and the costs the leader will have to bear as a result (see Fearon 1994; Tomz 2007). The last mechanism is signaling resolve: under certain conditions, the use of covert operations allows states to convey the desired message to their rivals, and therefore they do not have to act in the public arena (Carson 2016; Carson and Yarhi-Milo 2017, 134-135).\nBut it seems that during cyber attacks, that might be a part of an on-going operation or a one-time attack, the options available to the victim are different, and revealing the attack has its benefits. Generally, there are cases where the incentives to remain covert are not enough and decision-makers have other incentives—such as avoiding public humiliation, warning the attacker from taking future actions and more—that lead them to decide to publicly reveal the attack.\nOnce the victim has identified the attack and decides to use a public strategy, it has two major options as mentioned earlier: (1) reveal the attack and point a finger towards the attacker, or (2) reveal only the fact that the attack has occurred, without disclosing the identity of the alleged attacker. Figure 1 summarizes the strategies at earlier stages and as they lead up to the strategies at this stage.\nFIGURE 1: VICTIM'S STRATEGIES DURING A CYBER ATTACK\nTo assess the conditions under which countries that have suffered a cyber attack choose to reveal the attack and go public, we examined all known cyber attacks between rival states from 2015 to mid-2018. The framework of the Dyadic Cyber Incident Dataset (DCID) v1.1 (Maness, Valeriano and Jensen 2017) was the basis for the coding, and\nnew attacks from the Council on Foreign Relation Cyber Operations Tracker were added (Segal 2017). The unit of analysis in both datasets is state-sponsored cyber attacks. $^{4}$  We focus on state-sponsored actors because our purpose is to identify when states and their proxies conduct cyber operations in pursuit of their foreign policy interests. New variables originally collected by us were added in order to examine the victims' strategies. All data collected are open source. $^{5}$\nOur data indicate that there is wide variation in the victims' strategies: Between 2015 and mid-2018, 75 cyber attacks were conducted between rival states. In 44, the victims chose to address the attack publicly. Of those, in 16 the victim revealed the attack and did not attribute it. In the remaining 28, the victim revealed the attack and publicly attributed it to a specific attacker (Figure 2). Out of the 28 cases where victims chose to publicly reveal the attack and the attacker, only three states were not democratic.[6]\nThe data suggest that states frequently choose public strategies. Although at first glance, revealing the attack might be perceived as exposing a country's weakness, there are several considerations with positive implications, which could lead the country to decide to reveal the attack. The question is: why do states act that way, and in the pursuit of which advantages?\nFIGURE 2: VARIANCE IN VICTIMS' STRATEGIES BETWEEN 2015 AND MID-2018\n4 This paper focuses only on state-sponsored cyber attacks. Doing that allowed us to achieve in-depth insights regarding the ways countries operate during cyber conflict. Keeping out of the analysis other kinds of cyber attacks, such as multi-victim attacks and attacks against NGOs, might pose a methodological challenge. Due to the limited scope of this paper we do not treat these kinds of cyber attacks here, and will deal with them in future projects.\n5 The \"unknown-unknowns\" cyber attacks are the ones that are not known to the public. This paper deals only with cyber attacks that have been publicly revealed and that had sufficient data on them in order to code it in our dataset.\n6 According to Freedom House.\n8\n# Reasons to publicly reveal the attack\nIn most cyber attacks the victim does not have full confidence regarding the identity of the attacker. Furthermore, there are questions around to what extent a victim that chooses to accuse the attacker is certain of the accuracy of its identification. If it possesses technical evidence that can be exposed, the attacker will have more difficulty denying the charges. However, more often than not this is not the case. It is common for a victim to point a finger at a particular attacker even without disclosing the full technical evidence that led to that attribution.\nIn the political and technical landscapes of our time, it is important to consider cyber attacks in the broader geostrategic context. In many cases there is an ongoing political tension that means it is in the victim’s interests to reveal the aggressive actions of its adversary, a strategy known as Naming and Shaming. A Naming and Shaming strategy means publicly identifying perpetrators that are “doing wrong” and undermining international law and the rules-based order. This might look like the victim is admitting to its weakness. Yet, in a long-term cost-benefit analysis, sometimes it is better to “call out” the aggressor as violating international norms than to remain silent. This might help the victim and its allies to improve their cybersecurity readiness, while also reaffirming the victim’s commitment to law and norms (on publicizing states activities see Carnegie and Carson 2018).\nAn additional consideration in revealing attacks is the need to avoid public humiliation. The victim can decide to disclose the attack due to the desire to avoid humiliation and degradation, which will most likely accompany the publication of the said attack by the attacker or by a third party. In a post-Snowden reality, remaining covert is hard. The general public is more aware of state activities and has the means to publicize them via social media as well as in various other ways. As a result, the political costs of transparency may be less than those associated with hiding an attack. This minimizes the victim’s reputational damage and helps to improve overall cybersecurity of both victim and international allies alike.\nAnother goal may be showing strength in front of an international audience by warning the attacker against taking future actions. By disclosing the attack and accusing the attacker, the victim conveys a message that it has identified the attack and may intend to retaliate; plus, it has the technical know-how to identify the attack and point out the entity behind it. If the victim can say to the presumed attackers that it knows what they are up to, it implies that it also knows a lot more about the attackers’ operations and capabilities. This may introduce uncertainty into the decision-making process and induce a strategic effect. Such was the case with the Obama-Xi agreement from 2015 that reduced Chinese industrial cyber espionage for a limited period of time (Spetalnick and Martina 2015). A country that exposes the attack and points a finger\nat the attacker, while showing its methods of coping and the ways in which it operates to strengthen its defense capabilities, is portrayed as a leader in the international arena in dealing with cyber attacks.7 Other countries will observe and learn from it, as was the case with the Democratic National Committee hack, which is discussed in detail later on.\n## Motivations not to reveal the attacker\nAssuming that the victim identified the attacker, there are at least two main reasons why the victim would not want to reveal the attacker’s identity in public:\n(1) Safety of intelligence sources. The desire to avoid exposing intelligence and sources is an important reason not to make the identity of the attacker public. This is even more acute in cyberspace, because it is difficult to identify the attacker only using technical tools. Therefore, it is often necessary to use intelligence of various kinds, such as advanced technological and even human resources to obtain the necessary information. These sources are considered highly important and valuable for the country’s intelligence services, and therefore it is essential to protect their safety and not to expose them.\n(2) Preventing escalation. There may be differences in the existing technological capabilities and power of the victim and the attacker. If this is the case, the victim might choose not to publicize the attack in order to avoid the chance that the exposure would lead to open confrontation. An aggressive public intervention by one country in another’s affairs poses a political-strategic challenge to the victim in the eyes of the domestic public and the international community, who are watching and waiting to see how it responds (Carson 2016). Not revealing the identity of the attacker allows the victim to refrain from the obligation to respond, contain the attack and prevent undesirable escalation.\nWe expect victims to choose to reveal the attack publicly and attribute it when (a) they want to expose the aggressor and blame them for violating international norms; (b) avoid international and domestic humiliation; (c) warn the attacker. However, by revealing the attack and not attributing it, the victim can also avoid humiliation and there are covert ways to convey a deterrent message. Therefore, we hypothesize that in this case key reasons for not attributing the attack are (a) the safety of intelligence sources; and (b) preventing escalation. The two cases tested in the next section will help examine these expectations.\n7 We are aware that there are other considerations for countries to reveal the attack, such as creating a false attribution for political reasons or faking non-existent capabilities by revealing; using the publicized attack for political reasons such as increase allied support; cases when there is a public leak and the victim is being forced to reveal the attack; internal political considerations and more. The scope of this paper will not allow us to deal with all these considerations but they will be taken into account in our larger research agenda.\n9\n10\n# 4. GIVING UP SECRECY IN CYBER OPERATIONS – REAL-LIFE CASES\nTwo major cyber attacks that occurred in the past three years are examined. They allow us to illustrate the public strategies identified and described theoretically above.\n## Democratic National Committee Hack 2016\nIn April 2016, hackers gained access into the Democratic National Committee (DNC) network, stealing several gigabytes of data. From June-November 2016, WikiLeaks published 20,000 emails of DNC members, and in July 2016 the FBI began an investigation of the hack. The investigation revealed that in the months prior to the WikiLeaks releases, two groups of hackers operating under the auspices of the Russian government broke into the computers of the DNC and leaked the emails. This action was part of a broader Russian operation in the months before the presidential election in 2016, intended to influence the election results and to jeopardize the integrity of the democratic processes (Bump 2018).\nOn December 2016, President Obama publicly accused Russia of carrying out these attacks, warned that it must stop and said that the US had offensive cyber capabilities and it might respond. At the end of that month, President Obama ordered the expulsion of 35 Russian diplomats from the US, as well as the closure of sites which were used by the Russians to gather intelligence (Landler and Sanger 2016; Ryan, Nakashima and De Young 2016). The Department of Homeland Security (DHS) and the FBI published a joint statement describing the process of the Russian cyber attack, directly accusing military and civilian Russian intelligence agencies. According to the statement, “The US Intelligence Community is confident that the Russian Government directed the recent compromises of emails from US persons and institutions [...] only Russia’s senior-most officials could have authorized these activities.” (Department of Homeland Security 2016). The operations of Russian intelligence agencies included “spear phishing” attacks of entities in government agencies, critical infrastructure, think tanks, universities, political organizations, and more, in order to steal information (Masters 2018).\nThe fact that the US chose to publicly accuse Russia of the attack helped strengthen its international standing by calling out Russia’s undermining of the international order in trying to manipulate and sabotage democratic procedures. Such attempts to influence election results are perceived by Western democracies as damaging their political and institutional integrity. Other countries also saw and learned from the American experience. Following the exposure of the attack, the US became the focus of interest for other democratic countries—such as France and Germany—which were about to hold their own elections and feared Russian intervention. For example, the NSA\nwarned French officials that Russian hackers had compromised some elements of the election (Greenberg 2017).\nThe experience gained by the US in dealing with Russian activity enabled it to share information and assist other countries. The US became a role model for confronting Russian influence attempts and protecting election campaigns (Graham, 2017). This case demonstrates the value of our theoretical framework: by publicly revealing the attack, the US avoided public humiliation that could have happened if a third party or Russia itself had revealed the attack instead. Also, by conveying a deterrent message to the Russians, the US made a coercive threat and demonstrated resolve. It showed its will to spend valuable resources in order to make Russia pay a price for its offensive actions.\n# SingHealth Hack 2018\nOn 4 July 2018, data administrators detected unusual activity on one of SingHealth's IT databases. With more than two million patients, SingHealth is the largest health provider in Singapore. The security team immediately investigated the suspicious activity to determine its nature and whether it was malicious. On July 10th, after forensic investigations confirming it was a cyber attack, SingHealth, the Ministry of Health and the Cyber Security Agency (CSA) were informed (Tham 2018). The cyber attack resulted in the personal details of 1.5m SingHealth patients being accessed and copied; this included names, identification numbers, address, gender, race and date of birth, including the personal data of Singapore's Prime Minister. On July 20th, even while investigations were still under way, SingHealth and investigating authorities assessed that the situation had been stabilized and informed the public of the cyber attack, (Singapore Ministry of Health 2018).\nFollowing the attack, a public Committee of Inquiry was established. A senior counsel in the Ministry of Justice summarized in front of the committee how advanced, determined and disciplined the attackers were: \"The skill and sophistication used in the SingHealth attack highlights the challenges that cyber defenders face\" (Tham and Baharudin, 2018). Speaking at a press conference on July 20th 2018, the Chief Executive of the CSA, David Koh, confirmed that: \"We have determined that this is a deliberate, targeted and well-planned cyber attack, not the work of casual hackers [...] we are not able to reveal more because of operational security reasons\" (Koh 2018). From Koh's words it seems that for national security reasons the CSA wanted to keep its intelligence sources safe and did not reveal any information that could risk them.\nAlthough the head of the CSA estimated that a nation state was behind the attack, and many security analysts even estimated it was China, Singapore was careful not to reveal the identity of the attacker in public. The decision to make the attack public\n11\nwas based on two main considerations. The first derived from the theft of personal information that is critical for the daily life of citizens. As most activities that are essential to the daily lives of Singapore's citizens take place online, there was a concern that the attacker might want to use the data to gain access to additional personal details (Tham and Baharudin, 2018).\nAnother consideration for exposing the attack, but keeping the identity of the attacker undisclosed, was concern about public humiliation. If the attacker or a third party exposed the attack before the Singaporean authorities did, it could damage the reputation of the administration. In such circumstances, the administration would appear to have failed to protect its citizens and to have made an attempt to conceal it.\nWhile experts pointed fingers at China (Lee 2018), authorities remain tight-lipped. One explanation for that is the need to avoid escalation. China and Singapore have a close relationship, but differences have been experienced during numerous high-profile events, including Singapore's stance against China regarding the South China Sea dispute. The power differential between the two, and the will of Singapore not to take any steps that could risk this relationship and escalate the situation, seem to be among the main reasons why Singapore chose not to reveal the identity of the attacker. Further support for the decision not to reveal the identity of the attacker was given by the Minister-in-Charge of cybersecurity. In January 2019, the Minister stated that: \"Revealing the identity of the perpetrator would not be in the Republic's national interest [...] We've got nothing to hide here [...] the only part that's been held back are those that pertain to sensitive national security matters and also patient confidentiality\" (Nair 2019; Yufeng 2019).\n# 5. CONCLUSIONS\nReasons ranging from attempts to Name and Shame or avoid public humiliation, to incomplete confidence about the identity of the attacker may lead victims of cyber attacks to reveal the fact they had been attacked. There is tension, however, between such reasons and the motivation to protect the safety of intelligence sources and the will to prevent escalation if an attack is revealed and even more so if the attacker is exposed. The preliminary results and analyses presented here demonstrate that despite a range of reasons to remain covert, countries that suffered cyber attacks have sufficiently strong incentives to reveal the fact they had been attacked. The three mechanisms presented in the literature as motivating decision-makers to keep the attack covert—sunk costs, counter-escalation risks and signaling resolve—do not always suffice in the cyber reality. Not only would victims make the attack public, but\nunder certain circumstances, they would even expose the attacker. This finding is both unintuitive and largely undocumented in the literature.\nThe will to avoid domestic and international humiliation if the attack will be exposed by a third party leads countries to give up the advantages of secrecy in cyberspace and reveal the fact that they had been attacked. Furthermore, attributing the attack to a specific attacker helps the victim to warn the attacker from taking future actions and be model for other countries who deal with similar attacks. Such was the case in the DNC hack where the US not only set the standard for other countries in the West but also aided them in preventing potential threats to the integrity of their democratic process.\nNational security considerations such as keeping intelligence sources safe and avoiding escalation play an important part in the decision to reveal the attack without attributing it to a specific attacker. Such was the case in the SingHealth hack. To protect citizens' online identity and e-government business, the attack was made public by the government in Singapore. Yet, its source remained undisclosed, possibly to avoid causing a geostrategic threat of escalation.\nFuture research is essential. In particular, in this paper we limited the theoretical discussion and empirical work to public strategies exclusively. We did not deal with the other two options from Table 1 – partial concealment and full concealment of the attack and did not analyze the attackers’ strategies and the utility of the interaction between both sides.\n## Acknowledgments\nWe thank Dana Litman, Adi Lotan and Eden Poch for excellent research assistance.",
  "references": [
    "## REFERENCES\nBerghel, Hal. “On the Problem of (Cyber) Attribution.” *Computer 3*, no. 50 (2017): 84-89. https://www.computer.org/csdl/mags/co/2017/03/mco2017030084.pdf\nBrecher, Aaron. “Cyberattacks and the Covert Action Statute: Toward a Domestic Legal Framework for Offensive Cyberoperations.” *Michigan Law Review* (2012): 423-452. https://heinonline.org/HOL/Page?collection=journals&amp;handle=hein.journals/mlr111&amp;id=452&amp;men_tab=srchresults\nBump, Philip. 2018. “Timeline: How Russian agents allegedly hacked the DNC and Clinton’s campaign.” *Washington Post*, July 13, 2018. https://www.washingtonpost.com/news/politics/wp/2018/07/13/timeline-how-russian-agents-allegedly-hacked-the-dnc-and-clintons-campaign/?utm_term=.f7d3b8b7fe50\nCarnegie, Allison and Austin Carson. “The Spotlight’s Harsh Glare: Rethinking Publicity and International Order.” *International Organization* 72, no. 3 (2018): 627-657. https://doi.org/10.1017/S0020818318000176\n14\nCarr, Jeffrey. 2016. \"Faith-based Attribution?\" *Medium*, July 10, 2016. https://medium.com/@jeffreyscarr/faith-based-attribution-30f4a658eabc\nCarson, Austin. \"Facing Off and Saving Face: Covert Intervention and Escalation Management in the Korean War.\" *International Organization* 70, no. 1 (2016): 103-131. https://doi.org/10.1017/S0020818315000284\nCarson, Austin and Keren Yarhi-Milo. \"Covert Communication: The Intelligibility and Credibility of Signaling in Secret.\" *Security Studies* 26, no. 1 (2017): 124-156. https://doi.org/10.1080/09636412.2017.1243921\nEdwards, Benjamin, Alexander Furnas, Stephanie Forrest and Robert Axelrod. \"Strategic Aspects of Cyberattack and Blame,\" *Proceedings of the National Academy of Sciences* 114, no. 11 (March, 2017): 2825-2850. https://doi.org/10.1073/pnas.1700442114\nFearon, James. \"Domestic Political Audiences and the Escalation of International Disputes.\" *American Political Science Review* 88, no. 3 (1994): 577-592. https://doi.org/10.2307/2944796\nGraham, Chris. 2017. \"French Election: Are Russian Hackers to Blame for Emmanuel Macron's Leaked Emails - and Could They Target UK Election?\" *The Telegraph*, May 6, 2017. https://www.telegraph.co.uk/news/2017/05/06/russian-hackers-blame-emmanuel-macrons-leaked-emails-could/\nGreenberg, Andy. 2017. \"The NSA Confirms it: Russia Hacked French Election 'Infrastructure'\", *Wired*, September 5, 2017. https://www.wired.com/2017/05/nsa-director-confirms-russia-hacked-french-election-infrastructure/\nHealey, Jason. \"The Spectrum of National Responsibility for Cyberattacks.\" *Brown Journal of World Affairs* 18, no. 1 (2013): 57-70. https://www.jstor.org/stable/24590776\nKoh, David. 2018. \"CSA on Investigations regarding the Deliberate Cyber Attack,\" YouTube video, 0:31, July 20, 2018. https://www.youtube.com/watch?v=toM_WXImOBc&amp;index=3&amp;list=PLH2CR4s1lqyiZZ1n6wVvW_uMMR4fFXrW4\nLandler, Mark and David Sanger. 2016. \"Obama Says He Told Putin: 'Cut it Out' on Hacking.\" *New York Times*, December 16, 2016. https://www.nytimes.com/2016/12/16/us/politics/obama-putin-hacking-news-conference.html\nLee, Justina. 2018. \"Suspected China cyberhack on Singapore is a wake-up call for Asia,\" *Nikkei Asian Review*, August 21, 2018. https://asia.nikkei.com/Spotlight/Asia-Insight/Suspected-China-cyberhack-on-Singapore-is-a-wake-up-call-for-Asia\nLibicki, Martin. 2018. \"Drawing Inferences from Cyber Espionage,\" *2018 10th International Conference on Cyber Conflict*, NATO CCD COE Publications, Tallinn. https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&amp;arnumber=8405013\nLindsay, Jon. \"Tipping the scales: the attribution problem and the feasibility of deterrence against cyberattack.\" *Journal of Cyber Security* 1, no 1 (2015): 53-67. https://doi.org/10.1093/cybsec/tyv003\nLupovici, Amir. \"The 'Attribution Problem' and the Social Construction of 'Violence': Taking Cyber Deterrence Literature a Step Forward.\" *International Studies Perspectives* 17, no. 3 (2016): 322-342. https://doi.org/10.1111/insp.12082\nManess, Rayn, Brandon Valeriano, and Benjamin Jensen. \"Codebook for the Dyadic Cyber Incident and Dispute Dataset Version 1.1.\" (2017). https://drryanmaness.wixsite.com/cyberconflict/cyber-conflict-dataset\nMass, Warren. 2017. \"Cyber Experts Believe Hacking may have Caused Collision of USS John S. McCain.\" *The New American*, August 22, 2017. https://www.thenewamerican.com/tech/computers/item/26753-cyber-experts-believe-hacking-may-have-caused-collision-of-uss-john-s-mccain\nMasters, Jonathan. 2018. \"Russia, Trump, and the 2016 U.S. Election.\" *Council on Foreign Relations*. February 26, 2018. https://www.cfr.org/backgrounder/russia-trump-and-2016-us-election.\n15\nMyers Joe and Kate Whiting. 2019. \"These are the biggest risks facing our world in 2019.\" *World Economic Forum*, January 16, 2019. https://www.weforum.org/agenda/2019/01/these-are-the-biggest-risks-facing-our-world-in-2019/\nNair, Suresh. 2019. \"Singapore Healthcare cyberattack: Not revealing hacker still a 'puzzler'.\" *The Independent*, January 16, 2019. http://theindependent.sg/singapore-healthcare-cyberattack-not-revealing-hacker-still-a-puzzler/\nNavy Office of Information. *Navy Releases Collision Report for USS Fitzgerald and USS John S McCain Collisions*, 2017. https://www.navy.mil/submit/display.asp?story_id=103130\nPoznansky, Michael and Evan Perkoski. \"Rethinking Secrecy in Cyberspace: The Politics of Voluntary Attribution.\" *Journal of Global Security Studies* 3, no. 4 (2018): 402-416. https://doi.org/10.1093/jogss/ogy022\nRid, Thomas and Ben Buchanan. \"Attributing Cyber Attacks.\" *Journal of Strategic Studies* 38, no. 1-2 (2015): 4-37. https://doi.org/10.1080/01402390.2014.977382\nRyan, Missy, Ellen Nakashima and Karen De Young. 2016. \"Obama administration announces measures to punish Russia for 2016 election interference.\" *The Washington Post*, December 29, 2016. https://www.washingtonpost.com/world/national-security/obama-administration-announces-measures-to-punish-russia-for-2016-election-interference/2016/12/29/311db9d6-cdde-11e6-a87f-b917067331bb_story.html?utm_term=.e4a51ff3e57d\nSchulzke, Marcus. \"The Politics of Attributing Blame for Cyberattacks and the Costs of Uncertainty.\" *Perspectives on Politics* 16, no. 4 (2018): 954-968. https://doi.org/10.1017/S153759271800110X\nSegal, Adam. 2017. *Tracking State-Sponsored Cyber Operations*, Council on Foreign Relations, November 6, 2017. https://www.cfr.org/blog/tracking-state-sponsored-cyber-operations\nSiedler, Endresen. \"Hard power in cyberspace: CNA as a political means.\" *2016 8th International Conference on Cyber Conflict (CyCon)*. IEEE, (2016). https://ieeexplore.ieee.org/abstract/document/7529424\nSingapore. Ministry of Health. *Cyberattack on SingHealth's IT System*. August 6, 2018. Accessed December 31, 2018. https://www.moh.gov.sg/news-highlights/details/cyberattack-on-singhealth's-it-system.\nSpetalnick, Matt and Michael Martina. 2015. \"Obama announces 'understanding' with China's Xi on cyber theft but remains wary.\" *Reuters*, September 26, 2015. https://www.reuters.com/article/us-usa-china/obama-announces-understanding-with-chinas-xi-on-cyber-theft-but-remains-wary-idUSKCN0RO2HQ20150926\nTham, Irene. 2018. \"Personal info of 1.5m SingHealth patients, including PM Lee, stolen in Singapore's worst cyberattack.\" *The Straits Times*, July 20, 2018. https://www.straitstimes.com/singapore/personal-info-of-15m-singhealth-patients-including-pm-lee-stolen-in-singapores-most\nTham, Irene and and Hariz Baharudin. 2018. \"Attempt on July 19 was detected and cut off on same day, thanks to heightened monitoring.\" *The Straits Times*, October 6, 2018. https://www.straitstimes.com/tech/hackers-made-another-intrusion-attempt-as-probe-was-under-way\nTomz, Michael. \"Domestic Audience Costs in International Relations: An Experimental Approach.\" *International Organization* 61, no. 4 (2007): 821-840. https://doi.org/10.1017/S0020818307070282\nTritten, Travis. 2017. \"Navy Chief: There's no evidence recent collisions were caused by hacking.\" *Business Insider*, August 30, 2017. https://www.businessinsider.com/navy-chief-no-evidence-recent-collisions-were-caused-by-hacking-2017-8\nUnited States. Department of Homeland Security. *Joint Statement from the Department of Homeland Security and Office of the Director of National Intelligence on Election Security: DHS Press Office*, October 7, 2016. https://www.dhs.gov/news/2016/10/07/joint-statement-department-homeland-security-and-office-director-national\n16\nWerner, Ben. 2018. \"USS John S. McCain Collision, A Year Later.\" USNI News, August 21, 2018. https://news.usni.org/2018/08/21/35947.\nWheeler, David and Gregory Larsen. *Techniques for Cyber Attack Attribution*. Alexandria, VA, 2003. https://apps.dtic.mil/dtic/tr/fulltext/u2/a468859.pdf\nYufeng, Kok. 2019. \"SingHealth attacker known: Iswaran.\" The New Paper Singapore, January 16, 2019. https://www.tnp.sg/news/singapore/singhealth-attacker-known-iswaran"
  ],
  "flat_text": "T. Minárik, S. Alatalu, S. Biondi, M. Signoretti, I. Tolga, G. Visky (Eds.)\n\nPermission to make digital or hard copies of this publication for internal use within NATO and for personal or educational use when for non-profit or non-commercial purposes is granted providing that copies bear this notice and a full citation on the first page. Any other reproduction or transmission requires prior written permission by NATO CCD COE.\n# Covert or not Covert: National Strategies During Cyber Conflict\nGil Baram\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\ngilbaram@tauex.tau.ac.il\nUdi Sommer\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\nhttp://people.socsci.tau.ac.il/mu/udis\nAbstract: Anonymity is considered to be a key characteristic of cyber conflict. Indeed, existing accounts in the literature focus on the advantages of the non-disclosure of cyber attacks. Such focus inspires the expectation that countries would opt to maintain covertness. This hypothesis is rejected in an empirical investigation we conducted on victims' strategies during cyber conflict: in numerous cases, victim states choose to publicly reveal the fact that they had been attacked. These counterintuitive findings are important empirically, but even more so theoretically. They motivate an investigation into the decision to forsake covertness. What does actually motivate states to move into the international arena and publicly expose a cyber attack?\nThe goal of this paper is to understand why and under which geopolitical circumstances countries choose to give up the advantages of anonymity. Whether they wish to Name and Shame opponents for ignoring international norms or whether they try to avoid public humiliation, victims of cyber attacks occasionally reveal the fact that they had been attacked. There is tension between such motivations and the will to protect intelligence sources and the incentives to prevent escalation if an attack is revealed, even more so if the attacker is exposed. Indeed, we find that sunk costs, counterescalation risks and the need to signal resolve—while critical in motivating victims to keep cyber attacks secret—may not suffice under such specific circumstances. By focusing on the victim's side, we draw inspiration from data on real-world cyber attacks in order to place cyber operations in the larger context of secrecy and covert actions in the international arena. In so doing, the aim is to advance the use of empirical data\n* This research was supported by a research grant from the Blavatnik Interdisciplinary Cyber Research Center at Tel-Aviv University\nfor understanding the dynamics of cyber conflict and the decision-making process of states operating in this increasingly complex domain.\nKeywords: covert actions, cyber operations, national cyber strategies\n# 1. INTRODUCTION\nIn its 2019 Global Risks Report, the World Economic Forum ranked cyber attacks as one of the top ten risks, with respect to likelihood and impact . This concern is neither new nor surprising, given the anonymity that cyber attacks afford perpetrators and victims alike. By cyber attacks, which can be a part of an ongoing cyber operation, we mean both CNA (Computer Network Attack) and CNE (Computer Network Exploitation), as they cannot be fully separated .¹ Indeed, cyber technology enables countries to act covertly: the results of offensive actions in the cyber realm and their influence are not always exposed to the public eye. Furthermore, it is not always easy to identify who is behind a given attack. Even if the results of the attack are publicly observable—e.g., damage to a power grid leading to the severance of electricity supply—the victim can still dismiss these effects, arguing that they were the result of a technical fault. To date, our understanding of those strategic interactions between attacker and victim—and their decisions about whether or not to keep attacks covert—is theoretically and empirically limited.\nRecent work regarding covert actions in the international arena offers three mechanisms that make the use of covert actions preferable for countries: sunk costs, counter-escalation risks and signaling resolve . These mechanisms, to be discussed in detail in Section 3, suggest that countries have strong incentives to engage in covert actions and keep those actions away from the public eye, domestically as well as internationally.\nYet an empirical investigation conducted on states' strategies in the wake of cyber attacks reveals a different picture. Notwithstanding the advantages of maintaining secrecy, it is not uncommon for victims to reveal the fact that they have been attacked. What causes victims of cyber attacks to \"abandon\" the covert space and move to the public arena in the aftermath of an attack? Existing literature does not offer satisfying answers (for exceptions see Edwards, Furnas, Forrest and Axelrod 2017; Poznansky and Perkoski 2018). To understand the puzzling strategic choice to abandon the advantages of ambiguity in favor of a public strategy, we need to understand the tradeoffs between the strategies. As not all countries choose to either publicly reveal\n¹ As Libicki concluded, “as long as the methods of cyber espionage look like the methods of cyberattack the discovery of one will raise fears about the imminence of the other.” the attack or to hide it, we recognized that the strategies of the victims vary between four possible approaches:\n(1) \"Pointing a finger\" – publicly disclosing that an attack occurred (revealing vulnerability) and publicly putting the responsibility on a specific attacker;\n(2) Admitting injury – publicly disclosing that an attack took place, while failing to identify an attacker;\n(3) Revealing damage – disclosing damage but denying that it had been caused by a deliberate hostile attack (claiming technical malfunctions, system “glitches” etc.);\n(4) Maintaining ambiguity – denying or downplaying any damage, thus reducing the chances that the attack would ever be divulged.\nTable 1 summarizes those four strategies with illustrations from cyber attacks in recent years.\nTABLE 1: VARIANCE IN VICTIM'S STRATEGIES DURING CYBER ATTACKS, WITH REAL-LIFE EXAMPLES\n|   | Publicized |   | Concealed  |   |\n| --- | --- | --- | --- | --- |\n|  Victim's Strategy: | (1) Publicizing the attack and blaming the attacker (Public Strategy #1) | (2) Publicizing the attack and not blaming the attacker (Public Strategy #2) | (3) Partial concealment (claim of fault) | (4) Full concealment of the attack  |\n|  Real-life Example: | DNC hack 2016 | SingHealth hack 2018 | USS John S McCain collision 2017 | ---  |\nOur discussion focuses on the first two options, where the victim decided to make the attack public and sometimes also to reveal the attacker's identity. The third option (partial concealment) deals with cases where the alleged victim claims that a certain event was the result of a technical problem and not due to a cyber attack. To illustrate this option in a nutshell—since we do not delve into its details in the paper—let us look at the summer 2017 case of the USS John S McCain, which collided with a merchant ship in the Straits of Malacca, resulting in the death of 10 sailors . The Chief of Naval Operations argued that there was no evidence suggesting the accident was the result of a cyber attack. However, according to experts, since the destroyer had a large navigational team as well as another team in charge of radar, it was impossible that human error had led to the accident. In addition, both the destroyers USS McCain and the USS Fitzgerald, which had been hit in a similar incident in June 2017, belong to the Seventh Fleet. Experts believed these attacks may have been related to Chinese or Russian intervention .²\nThe Navy's investigation found no evidence of a cyber attack .\nAfter discussing the place of attribution and secrecy in cyber operations and their impact on states' strategic calculations, we develop our theoretical framework and examine two cases – hacking into the Democratic National Committee in 2016 and the SingHealth hack in 2018. It is particularly in the analysis of those two well-studied cases that our theoretical framework helps to shed new light on the national and international considerations leading countries to give up secrecy. We highlight the taxonomy of the different prototypes of these strategies and help to identify when countries might choose each strategy.\n## 2. ATTRIBUTION AND SECRECY – AN INHERENT COMPONENT OF CYBER OPERATIONS?\nThe covertness of cyber attacks can be expressed in two ways. First, the attack itself is covert. Its technological characteristics enable an attacker to carry out the operation in a clandestine way, without revealing how it was carried out. The second aspect concerns the attackers themselves, who can maintain covertness.³ It is often difficult to point out the source of an attack and to attribute it to a particular attacker. This problem is known as the Attribution Problem.\nThe Attribution Problem arises when the victim identified the attack, but has yet to identify the attacker. The immediate effect of this lack of certainty raises questions concerning the feasibility of retaliation, and the desire for it. Such a situation creates uncertainty as to the attacker's demands. It can be difficult to determine by technical means the motivation for an attack . So, as Rid and Buchanan argue, “attribution is what states make of it” .\nWhen an attribution process is conducted using intelligence sources and methods, it is difficult to expose it without endangering these sources. But if the domestic public—especially in a democratic polity—perceives the attribution as unreliable, the state may lose the legitimacy to retaliate . An important part of the attribution process is its political implications. Indeed, “communicating attribution is part of attributing” . When an attack is executed, security researchers attempt to find out who is behind it. In order to do so, they examine the code, techniques and protocols that the attacker used. However, this is not considered legitimate proof in court and is seen, especially today, more as playing a “blame game” .\nFaith-based attribution happens when actors blame other actors for an attack if they believe the former carried it out. This also happens in modern politics, where politicians knowingly make incorrect statements, simply because no one checks their\nOn the distinction between clandestine and covert operations, see Poznansky and Perkoski, 2018, 403.\nvalidity . Healey (2013) also argues that scholarship should move forward from dealing with the attribution problem. Instead of asking “who is behind the attack?” the question should be “who is to blame for it?”  and what are the political consequences of blaming?\nThis study adopts Healey's approach in the sense that the technical attribution problem is not as crucial for our framework. In practice, countries routinely accuse each other even without disclosing the full technical process that led them to attribute the attack to a particular attacker. This was the case in the Sony hack (2014) and the \"WannaCry\" attack (2017) when the US blamed North Korea without fully disclosing technical evidence.\nDespite the inherent overlap between cyber operations and covert actions, the scholarship has not fully explored this connection and has studied these fields separately for the most part. On the one hand, the cyberwarfare scholarship in International Relations and Security Studies hardly deals with the different aspects of secrecy in cyber operations, and mainly accepts the assumption that anonymity is an immutable feature of cyberspace rather than something actors select into and which they can therefore forfeit (for exceptions see Lupovici 2016; Poznansky and Perkoski 2018). On the other hand, scholars dealing with covert operations largely tend not to include cyber operations in their analyses (for exceptions see Brecher 2012). This study is an important step towards merging these bodies of literature.\nRecent work regarding secrecy in cyberspace tends to study the considerations before the attack (Edwards, Furnas, Forrest and Axelrod 2017), the perpetrators' calculations , and the effect of cyber attacks on democratic states' accountability to their citizens . While these studies are an important step in combining the two literatures, more research is needed in order to understand cyber operations as covert actions and to investigate to what extent countries choose to use the advantages of this covertness or to give it up. In the following sections these considerations are examined from the victim's point of view. We focus on the victim, since in most circumstances the victim is the first to make a choice about whether to use covertness or forsake it.\n# 3. GIVING UP SECRECY AS A NATIONAL STRATEGY\nThree mechanisms are offered in the literature for making the use of covert actions preferable for countries. First are sunk costs, which refer to situations where states decide to take covert action because of non-recoverable resources: by choosing to use covert actions, leaders can employ a more \"creative\" way to address security threats\n. Second are counter-escalation risks: using covert action can appear credible because of its impact on the risk of crisis escalation, since leaders using covert signaling tools can be free to engage in more aggressive behavior. This explanation is based mainly on the audience costs literature, which identifies a link between the type of action that the state takes and the costs the leader will have to bear as a result (see Fearon 1994; Tomz 2007). The last mechanism is signaling resolve: under certain conditions, the use of covert operations allows states to convey the desired message to their rivals, and therefore they do not have to act in the public arena .\nBut it seems that during cyber attacks, that might be a part of an on-going operation or a one-time attack, the options available to the victim are different, and revealing the attack has its benefits. Generally, there are cases where the incentives to remain covert are not enough and decision-makers have other incentives—such as avoiding public humiliation, warning the attacker from taking future actions and more—that lead them to decide to publicly reveal the attack.\nOnce the victim has identified the attack and decides to use a public strategy, it has two major options as mentioned earlier: (1) reveal the attack and point a finger towards the attacker, or (2) reveal only the fact that the attack has occurred, without disclosing the identity of the alleged attacker. Figure 1 summarizes the strategies at earlier stages and as they lead up to the strategies at this stage.\nFIGURE 1: VICTIM'S STRATEGIES DURING A CYBER ATTACK\nTo assess the conditions under which countries that have suffered a cyber attack choose to reveal the attack and go public, we examined all known cyber attacks between rival states from 2015 to mid-2018. The framework of the Dyadic Cyber Incident Dataset (DCID) v1.1 (Maness, Valeriano and Jensen 2017) was the basis for the coding, and\nnew attacks from the Council on Foreign Relation Cyber Operations Tracker were added . The unit of analysis in both datasets is state-sponsored cyber attacks. $^{4}$  We focus on state-sponsored actors because our purpose is to identify when states and their proxies conduct cyber operations in pursuit of their foreign policy interests. New variables originally collected by us were added in order to examine the victims' strategies. All data collected are open source. $^{5}$\nOur data indicate that there is wide variation in the victims' strategies: Between 2015 and mid-2018, 75 cyber attacks were conducted between rival states. In 44, the victims chose to address the attack publicly. Of those, in 16 the victim revealed the attack and did not attribute it. In the remaining 28, the victim revealed the attack and publicly attributed it to a specific attacker (Figure 2). Out of the 28 cases where victims chose to publicly reveal the attack and the attacker, only three states were not democratic.[6]\nThe data suggest that states frequently choose public strategies. Although at first glance, revealing the attack might be perceived as exposing a country's weakness, there are several considerations with positive implications, which could lead the country to decide to reveal the attack. The question is: why do states act that way, and in the pursuit of which advantages?\nFIGURE 2: VARIANCE IN VICTIMS' STRATEGIES BETWEEN 2015 AND MID-2018\n\nIn most cyber attacks the victim does not have full confidence regarding the identity of the attacker. Furthermore, there are questions around to what extent a victim that chooses to accuse the attacker is certain of the accuracy of its identification. If it possesses technical evidence that can be exposed, the attacker will have more difficulty denying the charges. However, more often than not this is not the case. It is common for a victim to point a finger at a particular attacker even without disclosing the full technical evidence that led to that attribution.\nIn the political and technical landscapes of our time, it is important to consider cyber attacks in the broader geostrategic context. In many cases there is an ongoing political tension that means it is in the victim’s interests to reveal the aggressive actions of its adversary, a strategy known as Naming and Shaming. A Naming and Shaming strategy means publicly identifying perpetrators that are “doing wrong” and undermining international law and the rules-based order. This might look like the victim is admitting to its weakness. Yet, in a long-term cost-benefit analysis, sometimes it is better to “call out” the aggressor as violating international norms than to remain silent. This might help the victim and its allies to improve their cybersecurity readiness, while also reaffirming the victim’s commitment to law and norms (on publicizing states activities see Carnegie and Carson 2018).\nAn additional consideration in revealing attacks is the need to avoid public humiliation. The victim can decide to disclose the attack due to the desire to avoid humiliation and degradation, which will most likely accompany the publication of the said attack by the attacker or by a third party. In a post-Snowden reality, remaining covert is hard. The general public is more aware of state activities and has the means to publicize them via social media as well as in various other ways. As a result, the political costs of transparency may be less than those associated with hiding an attack. This minimizes the victim’s reputational damage and helps to improve overall cybersecurity of both victim and international allies alike.\nAnother goal may be showing strength in front of an international audience by warning the attacker against taking future actions. By disclosing the attack and accusing the attacker, the victim conveys a message that it has identified the attack and may intend to retaliate; plus, it has the technical know-how to identify the attack and point out the entity behind it. If the victim can say to the presumed attackers that it knows what they are up to, it implies that it also knows a lot more about the attackers’ operations and capabilities. This may introduce uncertainty into the decision-making process and induce a strategic effect. Such was the case with the Obama-Xi agreement from 2015 that reduced Chinese industrial cyber espionage for a limited period of time. A country that exposes the attack and points a finger at the attacker, while showing its methods of coping and the ways in which it operates to strengthen its defense capabilities, is portrayed as a leader in the international arena in dealing with cyber attacks.7 Other countries will observe and learn from it, as was the case with the Democratic National Committee hack, which is discussed in detail later on.\n## Motivations not to reveal the attacker Assuming that the victim identified the attacker, there are at least two main reasons why the victim would not want to reveal the attacker’s identity in public: (1) Safety of intelligence sources. The desire to avoid exposing intelligence and sources is an important reason not to make the identity of the attacker public. This is even more acute in cyberspace, because it is difficult to identify the attacker only using technical tools. Therefore, it is often necessary to use intelligence of various kinds, such as advanced technological and even human resources to obtain the necessary information. These sources are considered highly important and valuable for the country’s intelligence services, and therefore it is essential to protect their safety and not to expose them.\n(2) Preventing escalation. There may be differences in the existing technological capabilities and power of the victim and the attacker. If this is the case, the victim might choose not to publicize the attack in order to avoid the chance that the exposure would lead to open confrontation. An aggressive public intervention by one country in another’s affairs poses a political-strategic challenge to the victim in the eyes of the domestic public and the international community, who are watching and waiting to see how it responds. Not revealing the identity of the attacker allows the victim to refrain from the obligation to respond, contain the attack and prevent undesirable escalation.\nWe expect victims to choose to reveal the attack publicly and attribute it when (a) they want to expose the aggressor and blame them for violating international norms; (b) avoid international and domestic humiliation; (c) warn the attacker. However, by revealing the attack and not attributing it, the victim can also avoid humiliation and there are covert ways to convey a deterrent message. Therefore, we hypothesize that in this case key reasons for not attributing the attack are (a) the safety of intelligence sources; and (b) preventing escalation. The two cases tested in the next section will help examine these expectations.\n\n# 4. GIVING UP SECRECY IN CYBER OPERATIONS – REAL-LIFE CASES\nTwo major cyber attacks that occurred in the past three years are examined. They allow us to illustrate the public strategies identified and described theoretically above.\n## Democratic National Committee Hack 2016\nIn April 2016, hackers gained access into the Democratic National Committee (DNC) network, stealing several gigabytes of data. From June-November 2016, WikiLeaks published 20,000 emails of DNC members, and in July 2016 the FBI began an investigation of the hack. The investigation revealed that in the months prior to the WikiLeaks releases, two groups of hackers operating under the auspices of the Russian government broke into the computers of the DNC and leaked the emails. This action was part of a broader Russian operation in the months before the presidential election in 2016, intended to influence the election results and to jeopardize the integrity of the democratic processes .\nOn December 2016, President Obama publicly accused Russia of carrying out these attacks, warned that it must stop and said that the US had offensive cyber capabilities and it might respond. At the end of that month, President Obama ordered the expulsion of 35 Russian diplomats from the US, as well as the closure of sites which were used by the Russians to gather intelligence . The Department of Homeland Security (DHS) and the FBI published a joint statement describing the process of the Russian cyber attack, directly accusing military and civilian Russian intelligence agencies. According to the statement, “The US Intelligence Community is confident that the Russian Government directed the recent compromises of emails from US persons and institutions [...] only Russia’s senior-most officials could have authorized these activities.” (Department of Homeland Security 2016). The operations of Russian intelligence agencies included “spear phishing” attacks of entities in government agencies, critical infrastructure, think tanks, universities, political organizations, and more, in order to steal information .\nThe fact that the US chose to publicly accuse Russia of the attack helped strengthen its international standing by calling out Russia’s undermining of the international order in trying to manipulate and sabotage democratic procedures. Such attempts to influence election results are perceived by Western democracies as damaging their political and institutional integrity. Other countries also saw and learned from the American experience. Following the exposure of the attack, the US became the focus of interest for other democratic countries—such as France and Germany—which were about to hold their own elections and feared Russian intervention. For example, the NSA\nwarned French officials that Russian hackers had compromised some elements of the election .\nThe experience gained by the US in dealing with Russian activity enabled it to share information and assist other countries. The US became a role model for confronting Russian influence attempts and protecting election campaigns . This case demonstrates the value of our theoretical framework: by publicly revealing the attack, the US avoided public humiliation that could have happened if a third party or Russia itself had revealed the attack instead. Also, by conveying a deterrent message to the Russians, the US made a coercive threat and demonstrated resolve. It showed its will to spend valuable resources in order to make Russia pay a price for its offensive actions.\n# SingHealth Hack 2018\nOn 4 July 2018, data administrators detected unusual activity on one of SingHealth's IT databases. With more than two million patients, SingHealth is the largest health provider in Singapore. The security team immediately investigated the suspicious activity to determine its nature and whether it was malicious. On July 10th, after forensic investigations confirming it was a cyber attack, SingHealth, the Ministry of Health and the Cyber Security Agency (CSA) were informed . The cyber attack resulted in the personal details of 1.5m SingHealth patients being accessed and copied; this included names, identification numbers, address, gender, race and date of birth, including the personal data of Singapore's Prime Minister. On July 20th, even while investigations were still under way, SingHealth and investigating authorities assessed that the situation had been stabilized and informed the public of the cyber attack, (Singapore Ministry of Health 2018).\nFollowing the attack, a public Committee of Inquiry was established. A senior counsel in the Ministry of Justice summarized in front of the committee how advanced, determined and disciplined the attackers were: \"The skill and sophistication used in the SingHealth attack highlights the challenges that cyber defenders face\" . Speaking at a press conference on July 20th 2018, the Chief Executive of the CSA, David Koh, confirmed that: \"We have determined that this is a deliberate, targeted and well-planned cyber attack, not the work of casual hackers [...] we are not able to reveal more because of operational security reasons\" . From Koh's words it seems that for national security reasons the CSA wanted to keep its intelligence sources safe and did not reveal any information that could risk them.\nAlthough the head of the CSA estimated that a nation state was behind the attack, and many security analysts even estimated it was China, Singapore was careful not to reveal the identity of the attacker in public. The decision to make the attack public\n\nAnother consideration for exposing the attack, but keeping the identity of the attacker undisclosed, was concern about public humiliation. If the attacker or a third party exposed the attack before the Singaporean authorities did, it could damage the reputation of the administration. In such circumstances, the administration would appear to have failed to protect its citizens and to have made an attempt to conceal it.\nWhile experts pointed fingers at China, authorities remain tight-lipped. One explanation for that is the need to avoid escalation. China and Singapore have a close relationship, but differences have been experienced during numerous high-profile events, including Singapore's stance against China regarding the South China Sea dispute. The power differential between the two, and the will of Singapore not to take any steps that could risk this relationship and escalate the situation, seem to be among the main reasons why Singapore chose not to reveal the identity of the attacker. Further support for the decision not to reveal the identity of the attacker was given by the Minister-in-Charge of cybersecurity. In January 2019, the Minister stated that:\"Revealing the identity of the perpetrator would not be in the Republic's national interest [...] We've got nothing to hide here [...] the only part that's been held back are those that pertain to sensitive national security matters and also patient confidentiality\".\n# 5. CONCLUSIONS Reasons ranging from attempts to Name and Shame or avoid public humiliation, to incomplete confidence about the identity of the attacker may lead victims of cyber attacks to reveal the fact they had been attacked. There is tension, however, between such reasons and the motivation to protect the safety of intelligence sources and the will to prevent escalation if an attack is revealed and even more so if the attacker is exposed. The preliminary results and analyses presented here demonstrate that despite a range of reasons to remain covert, countries that suffered cyber attacks have sufficiently strong incentives to reveal the fact they had been attacked. The three mechanisms presented in the literature as motivating decision-makers to keep the attack covert—sunk costs, counter-escalation risks and signaling resolve—do not always suffice in the cyber reality. Not only would victims make the attack public, but under certain circumstances, they would even expose the attacker. This finding is both unintuitive and largely undocumented in the literature.\nThe will to avoid domestic and international humiliation if the attack will be exposed by a third party leads countries to give up the advantages of secrecy in cyberspace and reveal the fact that they had been attacked. Furthermore, attributing the attack to a specific attacker helps the victim to warn the attacker from taking future actions and be model for other countries who deal with similar attacks. Such was the case in the DNC hack where the US not only set the standard for other countries in the West but also aided them in preventing potential threats to the integrity of their democratic process.\nNational security considerations such as keeping intelligence sources safe and avoiding escalation play an important part in the decision to reveal the attack without attributing it to a specific attacker. Such was the case in the SingHealth hack. To protect citizens' online identity and e-government business, the attack was made public by the government in Singapore. Yet, its source remained undisclosed, possibly to avoid causing a geostrategic threat of escalation.\nFuture research is essential. In particular, in this paper we limited the theoretical discussion and empirical work to public strategies exclusively. We did not deal with the other two options from Table 1 – partial concealment and full concealment of the attack and did not analyze the attackers’ strategies and the utility of the interaction between both sides.\n## Acknowledgments We thank Dana Litman, Adi Lotan and Eden Poch for excellent research assistance.",
  "citations": {
    "style": "author_year",
    "flat_text": "T. Minárik, S. Alatalu, S. Biondi, M. Signoretti, I. Tolga, G. Visky (Eds.)\n\nPermission to make digital or hard copies of this publication for internal use within NATO and for personal or educational use when for non-profit or non-commercial purposes is granted providing that copies bear this notice and a full citation on the first page. Any other reproduction or transmission requires prior written permission by NATO CCD COE.\n# Covert or not Covert: National Strategies During Cyber Conflict\nGil Baram\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\ngilbaram@tauex.tau.ac.il\nUdi Sommer\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\nhttp://people.socsci.tau.ac.il/mu/udis\nAbstract: Anonymity is considered to be a key characteristic of cyber conflict. Indeed, existing accounts in the literature focus on the advantages of the non-disclosure of cyber attacks. Such focus inspires the expectation that countries would opt to maintain covertness. This hypothesis is rejected in an empirical investigation we conducted on victims' strategies during cyber conflict: in numerous cases, victim states choose to publicly reveal the fact that they had been attacked. These counterintuitive findings are important empirically, but even more so theoretically. They motivate an investigation into the decision to forsake covertness. What does actually motivate states to move into the international arena and publicly expose a cyber attack?\nThe goal of this paper is to understand why and under which geopolitical circumstances countries choose to give up the advantages of anonymity. Whether they wish to Name and Shame opponents for ignoring international norms or whether they try to avoid public humiliation, victims of cyber attacks occasionally reveal the fact that they had been attacked. There is tension between such motivations and the will to protect intelligence sources and the incentives to prevent escalation if an attack is revealed, even more so if the attacker is exposed. Indeed, we find that sunk costs, counterescalation risks and the need to signal resolve—while critical in motivating victims to keep cyber attacks secret—may not suffice under such specific circumstances. By focusing on the victim's side, we draw inspiration from data on real-world cyber attacks in order to place cyber operations in the larger context of secrecy and covert actions in the international arena. In so doing, the aim is to advance the use of empirical data\n* This research was supported by a research grant from the Blavatnik Interdisciplinary Cyber Research Center at Tel-Aviv University\nfor understanding the dynamics of cyber conflict and the decision-making process of states operating in this increasingly complex domain.\nKeywords: covert actions, cyber operations, national cyber strategies\n# 1. INTRODUCTION\nIn its 2019 Global Risks Report, the World Economic Forum ranked cyber attacks as one of the top ten risks, with respect to likelihood and impact . This concern is neither new nor surprising, given the anonymity that cyber attacks afford perpetrators and victims alike. By cyber attacks, which can be a part of an ongoing cyber operation, we mean both CNA (Computer Network Attack) and CNE (Computer Network Exploitation), as they cannot be fully separated .¹ Indeed, cyber technology enables countries to act covertly: the results of offensive actions in the cyber realm and their influence are not always exposed to the public eye. Furthermore, it is not always easy to identify who is behind a given attack. Even if the results of the attack are publicly observable—e.g., damage to a power grid leading to the severance of electricity supply—the victim can still dismiss these effects, arguing that they were the result of a technical fault. To date, our understanding of those strategic interactions between attacker and victim—and their decisions about whether or not to keep attacks covert—is theoretically and empirically limited.\nRecent work regarding covert actions in the international arena offers three mechanisms that make the use of covert actions preferable for countries: sunk costs, counter-escalation risks and signaling resolve . These mechanisms, to be discussed in detail in Section 3, suggest that countries have strong incentives to engage in covert actions and keep those actions away from the public eye, domestically as well as internationally.\nYet an empirical investigation conducted on states' strategies in the wake of cyber attacks reveals a different picture. Notwithstanding the advantages of maintaining secrecy, it is not uncommon for victims to reveal the fact that they have been attacked. What causes victims of cyber attacks to \"abandon\" the covert space and move to the public arena in the aftermath of an attack? Existing literature does not offer satisfying answers (for exceptions see Edwards, Furnas, Forrest and Axelrod 2017; Poznansky and Perkoski 2018). To understand the puzzling strategic choice to abandon the advantages of ambiguity in favor of a public strategy, we need to understand the tradeoffs between the strategies. As not all countries choose to either publicly reveal\n¹ As Libicki concluded, “as long as the methods of cyber espionage look like the methods of cyberattack the discovery of one will raise fears about the imminence of the other.” the attack or to hide it, we recognized that the strategies of the victims vary between four possible approaches:\n(1) \"Pointing a finger\" – publicly disclosing that an attack occurred (revealing vulnerability) and publicly putting the responsibility on a specific attacker;\n(2) Admitting injury – publicly disclosing that an attack took place, while failing to identify an attacker;\n(3) Revealing damage – disclosing damage but denying that it had been caused by a deliberate hostile attack (claiming technical malfunctions, system “glitches” etc.);\n(4) Maintaining ambiguity – denying or downplaying any damage, thus reducing the chances that the attack would ever be divulged.\nTable 1 summarizes those four strategies with illustrations from cyber attacks in recent years.\nTABLE 1: VARIANCE IN VICTIM'S STRATEGIES DURING CYBER ATTACKS, WITH REAL-LIFE EXAMPLES\n|   | Publicized |   | Concealed  |   |\n| --- | --- | --- | --- | --- |\n|  Victim's Strategy: | (1) Publicizing the attack and blaming the attacker (Public Strategy #1) | (2) Publicizing the attack and not blaming the attacker (Public Strategy #2) | (3) Partial concealment (claim of fault) | (4) Full concealment of the attack  |\n|  Real-life Example: | DNC hack 2016 | SingHealth hack 2018 | USS John S McCain collision 2017 | ---  |\nOur discussion focuses on the first two options, where the victim decided to make the attack public and sometimes also to reveal the attacker's identity. The third option (partial concealment) deals with cases where the alleged victim claims that a certain event was the result of a technical problem and not due to a cyber attack. To illustrate this option in a nutshell—since we do not delve into its details in the paper—let us look at the summer 2017 case of the USS John S McCain, which collided with a merchant ship in the Straits of Malacca, resulting in the death of 10 sailors . The Chief of Naval Operations argued that there was no evidence suggesting the accident was the result of a cyber attack. However, according to experts, since the destroyer had a large navigational team as well as another team in charge of radar, it was impossible that human error had led to the accident. In addition, both the destroyers USS McCain and the USS Fitzgerald, which had been hit in a similar incident in June 2017, belong to the Seventh Fleet. Experts believed these attacks may have been related to Chinese or Russian intervention .²\nThe Navy's investigation found no evidence of a cyber attack .\nAfter discussing the place of attribution and secrecy in cyber operations and their impact on states' strategic calculations, we develop our theoretical framework and examine two cases – hacking into the Democratic National Committee in 2016 and the SingHealth hack in 2018. It is particularly in the analysis of those two well-studied cases that our theoretical framework helps to shed new light on the national and international considerations leading countries to give up secrecy. We highlight the taxonomy of the different prototypes of these strategies and help to identify when countries might choose each strategy.\n## 2. ATTRIBUTION AND SECRECY – AN INHERENT COMPONENT OF CYBER OPERATIONS?\nThe covertness of cyber attacks can be expressed in two ways. First, the attack itself is covert. Its technological characteristics enable an attacker to carry out the operation in a clandestine way, without revealing how it was carried out. The second aspect concerns the attackers themselves, who can maintain covertness.³ It is often difficult to point out the source of an attack and to attribute it to a particular attacker. This problem is known as the Attribution Problem.\nThe Attribution Problem arises when the victim identified the attack, but has yet to identify the attacker. The immediate effect of this lack of certainty raises questions concerning the feasibility of retaliation, and the desire for it. Such a situation creates uncertainty as to the attacker's demands. It can be difficult to determine by technical means the motivation for an attack . So, as Rid and Buchanan argue, “attribution is what states make of it” .\nWhen an attribution process is conducted using intelligence sources and methods, it is difficult to expose it without endangering these sources. But if the domestic public—especially in a democratic polity—perceives the attribution as unreliable, the state may lose the legitimacy to retaliate . An important part of the attribution process is its political implications. Indeed, “communicating attribution is part of attributing” . When an attack is executed, security researchers attempt to find out who is behind it. In order to do so, they examine the code, techniques and protocols that the attacker used. However, this is not considered legitimate proof in court and is seen, especially today, more as playing a “blame game” .\nFaith-based attribution happens when actors blame other actors for an attack if they believe the former carried it out. This also happens in modern politics, where politicians knowingly make incorrect statements, simply because no one checks their\nOn the distinction between clandestine and covert operations, see Poznansky and Perkoski, 2018, 403.\nvalidity . Healey (2013) also argues that scholarship should move forward from dealing with the attribution problem. Instead of asking “who is behind the attack?” the question should be “who is to blame for it?”  and what are the political consequences of blaming?\nThis study adopts Healey's approach in the sense that the technical attribution problem is not as crucial for our framework. In practice, countries routinely accuse each other even without disclosing the full technical process that led them to attribute the attack to a particular attacker. This was the case in the Sony hack (2014) and the \"WannaCry\" attack (2017) when the US blamed North Korea without fully disclosing technical evidence.\nDespite the inherent overlap between cyber operations and covert actions, the scholarship has not fully explored this connection and has studied these fields separately for the most part. On the one hand, the cyberwarfare scholarship in International Relations and Security Studies hardly deals with the different aspects of secrecy in cyber operations, and mainly accepts the assumption that anonymity is an immutable feature of cyberspace rather than something actors select into and which they can therefore forfeit (for exceptions see Lupovici 2016; Poznansky and Perkoski 2018). On the other hand, scholars dealing with covert operations largely tend not to include cyber operations in their analyses (for exceptions see Brecher 2012). This study is an important step towards merging these bodies of literature.\nRecent work regarding secrecy in cyberspace tends to study the considerations before the attack (Edwards, Furnas, Forrest and Axelrod 2017), the perpetrators' calculations , and the effect of cyber attacks on democratic states' accountability to their citizens . While these studies are an important step in combining the two literatures, more research is needed in order to understand cyber operations as covert actions and to investigate to what extent countries choose to use the advantages of this covertness or to give it up. In the following sections these considerations are examined from the victim's point of view. We focus on the victim, since in most circumstances the victim is the first to make a choice about whether to use covertness or forsake it.\n# 3. GIVING UP SECRECY AS A NATIONAL STRATEGY\nThree mechanisms are offered in the literature for making the use of covert actions preferable for countries. First are sunk costs, which refer to situations where states decide to take covert action because of non-recoverable resources: by choosing to use covert actions, leaders can employ a more \"creative\" way to address security threats\n. Second are counter-escalation risks: using covert action can appear credible because of its impact on the risk of crisis escalation, since leaders using covert signaling tools can be free to engage in more aggressive behavior. This explanation is based mainly on the audience costs literature, which identifies a link between the type of action that the state takes and the costs the leader will have to bear as a result (see Fearon 1994; Tomz 2007). The last mechanism is signaling resolve: under certain conditions, the use of covert operations allows states to convey the desired message to their rivals, and therefore they do not have to act in the public arena .\nBut it seems that during cyber attacks, that might be a part of an on-going operation or a one-time attack, the options available to the victim are different, and revealing the attack has its benefits. Generally, there are cases where the incentives to remain covert are not enough and decision-makers have other incentives—such as avoiding public humiliation, warning the attacker from taking future actions and more—that lead them to decide to publicly reveal the attack.\nOnce the victim has identified the attack and decides to use a public strategy, it has two major options as mentioned earlier: (1) reveal the attack and point a finger towards the attacker, or (2) reveal only the fact that the attack has occurred, without disclosing the identity of the alleged attacker. Figure 1 summarizes the strategies at earlier stages and as they lead up to the strategies at this stage.\nFIGURE 1: VICTIM'S STRATEGIES DURING A CYBER ATTACK\nTo assess the conditions under which countries that have suffered a cyber attack choose to reveal the attack and go public, we examined all known cyber attacks between rival states from 2015 to mid-2018. The framework of the Dyadic Cyber Incident Dataset (DCID) v1.1 (Maness, Valeriano and Jensen 2017) was the basis for the coding, and\nnew attacks from the Council on Foreign Relation Cyber Operations Tracker were added . The unit of analysis in both datasets is state-sponsored cyber attacks. $^{4}$  We focus on state-sponsored actors because our purpose is to identify when states and their proxies conduct cyber operations in pursuit of their foreign policy interests. New variables originally collected by us were added in order to examine the victims' strategies. All data collected are open source. $^{5}$\nOur data indicate that there is wide variation in the victims' strategies: Between 2015 and mid-2018, 75 cyber attacks were conducted between rival states. In 44, the victims chose to address the attack publicly. Of those, in 16 the victim revealed the attack and did not attribute it. In the remaining 28, the victim revealed the attack and publicly attributed it to a specific attacker (Figure 2). Out of the 28 cases where victims chose to publicly reveal the attack and the attacker, only three states were not democratic.[6]\nThe data suggest that states frequently choose public strategies. Although at first glance, revealing the attack might be perceived as exposing a country's weakness, there are several considerations with positive implications, which could lead the country to decide to reveal the attack. The question is: why do states act that way, and in the pursuit of which advantages?\nFIGURE 2: VARIANCE IN VICTIMS' STRATEGIES BETWEEN 2015 AND MID-2018\n\nIn most cyber attacks the victim does not have full confidence regarding the identity of the attacker. Furthermore, there are questions around to what extent a victim that chooses to accuse the attacker is certain of the accuracy of its identification. If it possesses technical evidence that can be exposed, the attacker will have more difficulty denying the charges. However, more often than not this is not the case. It is common for a victim to point a finger at a particular attacker even without disclosing the full technical evidence that led to that attribution.\nIn the political and technical landscapes of our time, it is important to consider cyber attacks in the broader geostrategic context. In many cases there is an ongoing political tension that means it is in the victim’s interests to reveal the aggressive actions of its adversary, a strategy known as Naming and Shaming. A Naming and Shaming strategy means publicly identifying perpetrators that are “doing wrong” and undermining international law and the rules-based order. This might look like the victim is admitting to its weakness. Yet, in a long-term cost-benefit analysis, sometimes it is better to “call out” the aggressor as violating international norms than to remain silent. This might help the victim and its allies to improve their cybersecurity readiness, while also reaffirming the victim’s commitment to law and norms (on publicizing states activities see Carnegie and Carson 2018).\nAn additional consideration in revealing attacks is the need to avoid public humiliation. The victim can decide to disclose the attack due to the desire to avoid humiliation and degradation, which will most likely accompany the publication of the said attack by the attacker or by a third party. In a post-Snowden reality, remaining covert is hard. The general public is more aware of state activities and has the means to publicize them via social media as well as in various other ways. As a result, the political costs of transparency may be less than those associated with hiding an attack. This minimizes the victim’s reputational damage and helps to improve overall cybersecurity of both victim and international allies alike.\nAnother goal may be showing strength in front of an international audience by warning the attacker against taking future actions. By disclosing the attack and accusing the attacker, the victim conveys a message that it has identified the attack and may intend to retaliate; plus, it has the technical know-how to identify the attack and point out the entity behind it. If the victim can say to the presumed attackers that it knows what they are up to, it implies that it also knows a lot more about the attackers’ operations and capabilities. This may introduce uncertainty into the decision-making process and induce a strategic effect. Such was the case with the Obama-Xi agreement from 2015 that reduced Chinese industrial cyber espionage for a limited period of time. A country that exposes the attack and points a finger at the attacker, while showing its methods of coping and the ways in which it operates to strengthen its defense capabilities, is portrayed as a leader in the international arena in dealing with cyber attacks.7 Other countries will observe and learn from it, as was the case with the Democratic National Committee hack, which is discussed in detail later on.\n## Motivations not to reveal the attacker Assuming that the victim identified the attacker, there are at least two main reasons why the victim would not want to reveal the attacker’s identity in public: (1) Safety of intelligence sources. The desire to avoid exposing intelligence and sources is an important reason not to make the identity of the attacker public. This is even more acute in cyberspace, because it is difficult to identify the attacker only using technical tools. Therefore, it is often necessary to use intelligence of various kinds, such as advanced technological and even human resources to obtain the necessary information. These sources are considered highly important and valuable for the country’s intelligence services, and therefore it is essential to protect their safety and not to expose them.\n(2) Preventing escalation. There may be differences in the existing technological capabilities and power of the victim and the attacker. If this is the case, the victim might choose not to publicize the attack in order to avoid the chance that the exposure would lead to open confrontation. An aggressive public intervention by one country in another’s affairs poses a political-strategic challenge to the victim in the eyes of the domestic public and the international community, who are watching and waiting to see how it responds. Not revealing the identity of the attacker allows the victim to refrain from the obligation to respond, contain the attack and prevent undesirable escalation.\nWe expect victims to choose to reveal the attack publicly and attribute it when (a) they want to expose the aggressor and blame them for violating international norms; (b) avoid international and domestic humiliation; (c) warn the attacker. However, by revealing the attack and not attributing it, the victim can also avoid humiliation and there are covert ways to convey a deterrent message. Therefore, we hypothesize that in this case key reasons for not attributing the attack are (a) the safety of intelligence sources; and (b) preventing escalation. The two cases tested in the next section will help examine these expectations.\n\n# 4. GIVING UP SECRECY IN CYBER OPERATIONS – REAL-LIFE CASES\nTwo major cyber attacks that occurred in the past three years are examined. They allow us to illustrate the public strategies identified and described theoretically above.\n## Democratic National Committee Hack 2016\nIn April 2016, hackers gained access into the Democratic National Committee (DNC) network, stealing several gigabytes of data. From June-November 2016, WikiLeaks published 20,000 emails of DNC members, and in July 2016 the FBI began an investigation of the hack. The investigation revealed that in the months prior to the WikiLeaks releases, two groups of hackers operating under the auspices of the Russian government broke into the computers of the DNC and leaked the emails. This action was part of a broader Russian operation in the months before the presidential election in 2016, intended to influence the election results and to jeopardize the integrity of the democratic processes .\nOn December 2016, President Obama publicly accused Russia of carrying out these attacks, warned that it must stop and said that the US had offensive cyber capabilities and it might respond. At the end of that month, President Obama ordered the expulsion of 35 Russian diplomats from the US, as well as the closure of sites which were used by the Russians to gather intelligence . The Department of Homeland Security (DHS) and the FBI published a joint statement describing the process of the Russian cyber attack, directly accusing military and civilian Russian intelligence agencies. According to the statement, “The US Intelligence Community is confident that the Russian Government directed the recent compromises of emails from US persons and institutions [...] only Russia’s senior-most officials could have authorized these activities.” (Department of Homeland Security 2016). The operations of Russian intelligence agencies included “spear phishing” attacks of entities in government agencies, critical infrastructure, think tanks, universities, political organizations, and more, in order to steal information .\nThe fact that the US chose to publicly accuse Russia of the attack helped strengthen its international standing by calling out Russia’s undermining of the international order in trying to manipulate and sabotage democratic procedures. Such attempts to influence election results are perceived by Western democracies as damaging their political and institutional integrity. Other countries also saw and learned from the American experience. Following the exposure of the attack, the US became the focus of interest for other democratic countries—such as France and Germany—which were about to hold their own elections and feared Russian intervention. For example, the NSA\nwarned French officials that Russian hackers had compromised some elements of the election .\nThe experience gained by the US in dealing with Russian activity enabled it to share information and assist other countries. The US became a role model for confronting Russian influence attempts and protecting election campaigns . This case demonstrates the value of our theoretical framework: by publicly revealing the attack, the US avoided public humiliation that could have happened if a third party or Russia itself had revealed the attack instead. Also, by conveying a deterrent message to the Russians, the US made a coercive threat and demonstrated resolve. It showed its will to spend valuable resources in order to make Russia pay a price for its offensive actions.\n# SingHealth Hack 2018\nOn 4 July 2018, data administrators detected unusual activity on one of SingHealth's IT databases. With more than two million patients, SingHealth is the largest health provider in Singapore. The security team immediately investigated the suspicious activity to determine its nature and whether it was malicious. On July 10th, after forensic investigations confirming it was a cyber attack, SingHealth, the Ministry of Health and the Cyber Security Agency (CSA) were informed . The cyber attack resulted in the personal details of 1.5m SingHealth patients being accessed and copied; this included names, identification numbers, address, gender, race and date of birth, including the personal data of Singapore's Prime Minister. On July 20th, even while investigations were still under way, SingHealth and investigating authorities assessed that the situation had been stabilized and informed the public of the cyber attack, (Singapore Ministry of Health 2018).\nFollowing the attack, a public Committee of Inquiry was established. A senior counsel in the Ministry of Justice summarized in front of the committee how advanced, determined and disciplined the attackers were: \"The skill and sophistication used in the SingHealth attack highlights the challenges that cyber defenders face\" . Speaking at a press conference on July 20th 2018, the Chief Executive of the CSA, David Koh, confirmed that: \"We have determined that this is a deliberate, targeted and well-planned cyber attack, not the work of casual hackers [...] we are not able to reveal more because of operational security reasons\" . From Koh's words it seems that for national security reasons the CSA wanted to keep its intelligence sources safe and did not reveal any information that could risk them.\nAlthough the head of the CSA estimated that a nation state was behind the attack, and many security analysts even estimated it was China, Singapore was careful not to reveal the identity of the attacker in public. The decision to make the attack public\n\nAnother consideration for exposing the attack, but keeping the identity of the attacker undisclosed, was concern about public humiliation. If the attacker or a third party exposed the attack before the Singaporean authorities did, it could damage the reputation of the administration. In such circumstances, the administration would appear to have failed to protect its citizens and to have made an attempt to conceal it.\nWhile experts pointed fingers at China, authorities remain tight-lipped. One explanation for that is the need to avoid escalation. China and Singapore have a close relationship, but differences have been experienced during numerous high-profile events, including Singapore's stance against China regarding the South China Sea dispute. The power differential between the two, and the will of Singapore not to take any steps that could risk this relationship and escalate the situation, seem to be among the main reasons why Singapore chose not to reveal the identity of the attacker. Further support for the decision not to reveal the identity of the attacker was given by the Minister-in-Charge of cybersecurity. In January 2019, the Minister stated that:\"Revealing the identity of the perpetrator would not be in the Republic's national interest [...] We've got nothing to hide here [...] the only part that's been held back are those that pertain to sensitive national security matters and also patient confidentiality\".\n# 5. CONCLUSIONS Reasons ranging from attempts to Name and Shame or avoid public humiliation, to incomplete confidence about the identity of the attacker may lead victims of cyber attacks to reveal the fact they had been attacked. There is tension, however, between such reasons and the motivation to protect the safety of intelligence sources and the will to prevent escalation if an attack is revealed and even more so if the attacker is exposed. The preliminary results and analyses presented here demonstrate that despite a range of reasons to remain covert, countries that suffered cyber attacks have sufficiently strong incentives to reveal the fact they had been attacked. The three mechanisms presented in the literature as motivating decision-makers to keep the attack covert—sunk costs, counter-escalation risks and signaling resolve—do not always suffice in the cyber reality. Not only would victims make the attack public, but under certain circumstances, they would even expose the attacker. This finding is both unintuitive and largely undocumented in the literature.\nThe will to avoid domestic and international humiliation if the attack will be exposed by a third party leads countries to give up the advantages of secrecy in cyberspace and reveal the fact that they had been attacked. Furthermore, attributing the attack to a specific attacker helps the victim to warn the attacker from taking future actions and be model for other countries who deal with similar attacks. Such was the case in the DNC hack where the US not only set the standard for other countries in the West but also aided them in preventing potential threats to the integrity of their democratic process.\nNational security considerations such as keeping intelligence sources safe and avoiding escalation play an important part in the decision to reveal the attack without attributing it to a specific attacker. Such was the case in the SingHealth hack. To protect citizens' online identity and e-government business, the attack was made public by the government in Singapore. Yet, its source remained undisclosed, possibly to avoid causing a geostrategic threat of escalation.\nFuture research is essential. In particular, in this paper we limited the theoretical discussion and empirical work to public strategies exclusively. We did not deal with the other two options from Table 1 – partial concealment and full concealment of the attack and did not analyze the attackers’ strategies and the utility of the interaction between both sides.\n## Acknowledgments We thank Dana Litman, Adi Lotan and Eden Poch for excellent research assistance.",
    "footnotes": {
      "items": {},
      "intext": [
        {
          "index": "4",
          "intext_citation": "$^{4}$",
          "preceding_text": "",
          "footnote": null
        },
        {
          "index": "5",
          "intext_citation": "$^{5}$",
          "preceding_text": "",
          "footnote": null
        }
      ],
      "stats": {
        "intext_total": 2,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 3,
        "missing_intext_indices": [
          1,
          2,
          3
        ],
        "highest_intext_index": 5,
        "missing_footnotes_for_seen_total": 2,
        "missing_footnotes_for_seen_intext": [
          4,
          5
        ],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 2,
        "success_occurrences": 2,
        "success_unique": 2,
        "bib_unique_total": 2,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 1.0,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 3,
        "missing_intext_indices": [
          1,
          2,
          3
        ],
        "highest_intext_index": 5,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "tex_superscript"
      },
      "results": [
        {
          "index": "4",
          "intext_citation": "${ }^{4}$",
          "preceding_text": "adic Cyber Incident Dataset (DCID) v1.1 (Maness, Valeriano and Jensen 2017) was the basis for the coding, and new attacks from the Council on Foreign Relation Cyber Operations Tracker were added (Segal 2017). The unit of analysis in both datasets is state-sponsored cyber attacks.",
          "footnote": "This paper focuses only on state-sponsored cyber attacks. Doing that allowed us to achieve in-depth insights regarding the ways countries operate during cyber conflict. Keeping out of the analysis other kinds of cyber attacks, such as multi-victim attacks and attacks against NGOs, might pose a methodological challenge. Due to the limited scope of this paper we do not treat these kinds of cyber attacks here, and will deal with them in future projects."
        },
        {
          "index": "5",
          "intext_citation": "${ }^{5}$",
          "preceding_text": "ored actors because our purpose is to identify when states and their proxies conduct cyber operations in pursuit of their foreign policy interests. New variables originally collected by us were added in order to examine the victims' strategies. All data collected are open source.",
          "footnote": "The \"unknown-unknowns\" cyber attacks are the ones that are not known to the public. This paper deals only with cyber attacks that have been publicly revealed and that had sufficient data on them in order to code it in our dataset."
        }
      ],
      "flat_text": "T. Minárik, S. Alatalu, S. Biondi, M. Signoretti, I. Tolga, G. Visky (Eds.)\n\nPermission to make digital or hard copies of this publication for internal use within NATO and for personal or educational use when for non-profit or non-commercial purposes is granted providing that copies bear this notice and a full citation on the first page. Any other reproduction or transmission requires prior written permission by NATO CCD COE.\n# Covert or not Covert: National Strategies During Cyber Conflict\nGil Baram\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\ngilbaram@tauex.tau.ac.il\nUdi Sommer\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\nhttp://people.socsci.tau.ac.il/mu/udis\nAbstract: Anonymity is considered to be a key characteristic of cyber conflict. Indeed, existing accounts in the literature focus on the advantages of the non-disclosure of cyber attacks. Such focus inspires the expectation that countries would opt to maintain covertness. This hypothesis is rejected in an empirical investigation we conducted on victims' strategies during cyber conflict: in numerous cases, victim states choose to publicly reveal the fact that they had been attacked. These counterintuitive findings are important empirically, but even more so theoretically. They motivate an investigation into the decision to forsake covertness. What does actually motivate states to move into the international arena and publicly expose a cyber attack?\nThe goal of this paper is to understand why and under which geopolitical circumstances countries choose to give up the advantages of anonymity. Whether they wish to Name and Shame opponents for ignoring international norms or whether they try to avoid public humiliation, victims of cyber attacks occasionally reveal the fact that they had been attacked. There is tension between such motivations and the will to protect intelligence sources and the incentives to prevent escalation if an attack is revealed, even more so if the attacker is exposed. Indeed, we find that sunk costs, counterescalation risks and the need to signal resolve—while critical in motivating victims to keep cyber attacks secret—may not suffice under such specific circumstances. By focusing on the victim's side, we draw inspiration from data on real-world cyber attacks in order to place cyber operations in the larger context of secrecy and covert actions in the international arena. In so doing, the aim is to advance the use of empirical data\n* This research was supported by a research grant from the Blavatnik Interdisciplinary Cyber Research Center at Tel-Aviv University\nfor understanding the dynamics of cyber conflict and the decision-making process of states operating in this increasingly complex domain.\nKeywords: covert actions, cyber operations, national cyber strategies\n# 1. INTRODUCTION\nIn its 2019 Global Risks Report, the World Economic Forum ranked cyber attacks as one of the top ten risks, with respect to likelihood and impact (Myers and Whiting 2019). This concern is neither new nor surprising, given the anonymity that cyber attacks afford perpetrators and victims alike. By cyber attacks, which can be a part of an ongoing cyber operation, we mean both CNA (Computer Network Attack) and CNE (Computer Network Exploitation), as they cannot be fully separated (Siedler 2016).¹ Indeed, cyber technology enables countries to act covertly: the results of offensive actions in the cyber realm and their influence are not always exposed to the public eye. Furthermore, it is not always easy to identify who is behind a given attack. Even if the results of the attack are publicly observable—e.g., damage to a power grid leading to the severance of electricity supply—the victim can still dismiss these effects, arguing that they were the result of a technical fault. To date, our understanding of those strategic interactions between attacker and victim—and their decisions about whether or not to keep attacks covert—is theoretically and empirically limited.\nRecent work regarding covert actions in the international arena offers three mechanisms that make the use of covert actions preferable for countries: sunk costs, counter-escalation risks and signaling resolve (Carson 2016; Carson and Yarhi-Milo 2017). These mechanisms, to be discussed in detail in Section 3, suggest that countries have strong incentives to engage in covert actions and keep those actions away from the public eye, domestically as well as internationally.\nYet an empirical investigation conducted on states' strategies in the wake of cyber attacks reveals a different picture. Notwithstanding the advantages of maintaining secrecy, it is not uncommon for victims to reveal the fact that they have been attacked. What causes victims of cyber attacks to \"abandon\" the covert space and move to the public arena in the aftermath of an attack? Existing literature does not offer satisfying answers (for exceptions see Edwards, Furnas, Forrest and Axelrod 2017; Poznansky and Perkoski 2018). To understand the puzzling strategic choice to abandon the advantages of ambiguity in favor of a public strategy, we need to understand the tradeoffs between the strategies. As not all countries choose to either publicly reveal\n¹ As Libicki concluded, “as long as the methods of cyber espionage look like the methods of cyberattack the discovery of one will raise fears about the imminence of the other.” (Libicki 2018, 121)\nthe attack or to hide it, we recognized that the strategies of the victims vary between four possible approaches:\n(1) \"Pointing a finger\" – publicly disclosing that an attack occurred (revealing vulnerability) and publicly putting the responsibility on a specific attacker;\n(2) Admitting injury – publicly disclosing that an attack took place, while failing to identify an attacker;\n(3) Revealing damage – disclosing damage but denying that it had been caused by a deliberate hostile attack (claiming technical malfunctions, system “glitches” etc.);\n(4) Maintaining ambiguity – denying or downplaying any damage, thus reducing the chances that the attack would ever be divulged.\nTable 1 summarizes those four strategies with illustrations from cyber attacks in recent years.\nTABLE 1: VARIANCE IN VICTIM'S STRATEGIES DURING CYBER ATTACKS, WITH REAL-LIFE EXAMPLES\n|   | Publicized |   | Concealed  |   |\n| --- | --- | --- | --- | --- |\n|  Victim's Strategy: | (1) Publicizing the attack and blaming the attacker (Public Strategy #1) | (2) Publicizing the attack and not blaming the attacker (Public Strategy #2) | (3) Partial concealment (claim of fault) | (4) Full concealment of the attack  |\n|  Real-life Example: | DNC hack 2016 | SingHealth hack 2018 | USS John S McCain collision 2017 | ---  |\nOur discussion focuses on the first two options, where the victim decided to make the attack public and sometimes also to reveal the attacker's identity. The third option (partial concealment) deals with cases where the alleged victim claims that a certain event was the result of a technical problem and not due to a cyber attack. To illustrate this option in a nutshell—since we do not delve into its details in the paper—let us look at the summer 2017 case of the USS John S McCain, which collided with a merchant ship in the Straits of Malacca, resulting in the death of 10 sailors (Werner 2018). The Chief of Naval Operations argued that there was no evidence suggesting the accident was the result of a cyber attack. However, according to experts, since the destroyer had a large navigational team as well as another team in charge of radar, it was impossible that human error had led to the accident. In addition, both the destroyers USS McCain and the USS Fitzgerald, which had been hit in a similar incident in June 2017, belong to the Seventh Fleet. Experts believed these attacks may have been related to Chinese or Russian intervention (Mass 2017).²\nThe Navy's investigation found no evidence of a cyber attack (Tritten 2017; Navy Releases Collision Report 2017).\nAfter discussing the place of attribution and secrecy in cyber operations and their impact on states' strategic calculations, we develop our theoretical framework and examine two cases – hacking into the Democratic National Committee in 2016 and the SingHealth hack in 2018. It is particularly in the analysis of those two well-studied cases that our theoretical framework helps to shed new light on the national and international considerations leading countries to give up secrecy. We highlight the taxonomy of the different prototypes of these strategies and help to identify when countries might choose each strategy.\n## 2. ATTRIBUTION AND SECRECY – AN INHERENT COMPONENT OF CYBER OPERATIONS?\nThe covertness of cyber attacks can be expressed in two ways. First, the attack itself is covert. Its technological characteristics enable an attacker to carry out the operation in a clandestine way, without revealing how it was carried out. The second aspect concerns the attackers themselves, who can maintain covertness.³ It is often difficult to point out the source of an attack and to attribute it to a particular attacker. This problem is known as the Attribution Problem.\nThe Attribution Problem arises when the victim identified the attack, but has yet to identify the attacker. The immediate effect of this lack of certainty raises questions concerning the feasibility of retaliation, and the desire for it. Such a situation creates uncertainty as to the attacker's demands. It can be difficult to determine by technical means the motivation for an attack (Wheeler and Larsen 2003, 1). So, as Rid and Buchanan argue, “attribution is what states make of it” (Rid and Buchanan 2015, 7).\nWhen an attribution process is conducted using intelligence sources and methods, it is difficult to expose it without endangering these sources. But if the domestic public—especially in a democratic polity—perceives the attribution as unreliable, the state may lose the legitimacy to retaliate (Lindsay 2015). An important part of the attribution process is its political implications. Indeed, “communicating attribution is part of attributing” (Rid and Buchanan 2015, 26). When an attack is executed, security researchers attempt to find out who is behind it. In order to do so, they examine the code, techniques and protocols that the attacker used. However, this is not considered legitimate proof in court and is seen, especially today, more as playing a “blame game” (Berghel 2017, 86).\nFaith-based attribution happens when actors blame other actors for an attack if they believe the former carried it out. This also happens in modern politics, where politicians knowingly make incorrect statements, simply because no one checks their\nOn the distinction between clandestine and covert operations, see Poznansky and Perkoski, 2018, 403.\nvalidity (Berghel 2017; Carr 2016). Healey (2013) also argues that scholarship should move forward from dealing with the attribution problem. Instead of asking “who is behind the attack?” the question should be “who is to blame for it?” (Healey 2013, 55) and what are the political consequences of blaming?\nThis study adopts Healey's approach in the sense that the technical attribution problem is not as crucial for our framework. In practice, countries routinely accuse each other even without disclosing the full technical process that led them to attribute the attack to a particular attacker. This was the case in the Sony hack (2014) and the \"WannaCry\" attack (2017) when the US blamed North Korea without fully disclosing technical evidence.\nDespite the inherent overlap between cyber operations and covert actions, the scholarship has not fully explored this connection and has studied these fields separately for the most part. On the one hand, the cyberwarfare scholarship in International Relations and Security Studies hardly deals with the different aspects of secrecy in cyber operations, and mainly accepts the assumption that anonymity is an immutable feature of cyberspace rather than something actors select into and which they can therefore forfeit (for exceptions see Lupovici 2016; Poznansky and Perkoski 2018). On the other hand, scholars dealing with covert operations largely tend not to include cyber operations in their analyses (for exceptions see Brecher 2012). This study is an important step towards merging these bodies of literature.\nRecent work regarding secrecy in cyberspace tends to study the considerations before the attack (Edwards, Furnas, Forrest and Axelrod 2017), the perpetrators' calculations (Poznansky and Perkoski 2018), and the effect of cyber attacks on democratic states' accountability to their citizens (Schulzk 2018). While these studies are an important step in combining the two literatures, more research is needed in order to understand cyber operations as covert actions and to investigate to what extent countries choose to use the advantages of this covertness or to give it up. In the following sections these considerations are examined from the victim's point of view. We focus on the victim, since in most circumstances the victim is the first to make a choice about whether to use covertness or forsake it.\n# 3. GIVING UP SECRECY AS A NATIONAL STRATEGY\nThree mechanisms are offered in the literature for making the use of covert actions preferable for countries. First are sunk costs, which refer to situations where states decide to take covert action because of non-recoverable resources: by choosing to use covert actions, leaders can employ a more \"creative\" way to address security threats\n(Carson and Yarhi-Milo 2017, 135). Second are counter-escalation risks: using covert action can appear credible because of its impact on the risk of crisis escalation, since leaders using covert signaling tools can be free to engage in more aggressive behavior. This explanation is based mainly on the audience costs literature, which identifies a link between the type of action that the state takes and the costs the leader will have to bear as a result (see Fearon 1994; Tomz 2007). The last mechanism is signaling resolve: under certain conditions, the use of covert operations allows states to convey the desired message to their rivals, and therefore they do not have to act in the public arena (Carson 2016; Carson and Yarhi-Milo 2017, 134-135).\nBut it seems that during cyber attacks, that might be a part of an on-going operation or a one-time attack, the options available to the victim are different, and revealing the attack has its benefits. Generally, there are cases where the incentives to remain covert are not enough and decision-makers have other incentives—such as avoiding public humiliation, warning the attacker from taking future actions and more—that lead them to decide to publicly reveal the attack.\nOnce the victim has identified the attack and decides to use a public strategy, it has two major options as mentioned earlier: (1) reveal the attack and point a finger towards the attacker, or (2) reveal only the fact that the attack has occurred, without disclosing the identity of the alleged attacker. Figure 1 summarizes the strategies at earlier stages and as they lead up to the strategies at this stage.\nFIGURE 1: VICTIM'S STRATEGIES DURING A CYBER ATTACK\nTo assess the conditions under which countries that have suffered a cyber attack choose to reveal the attack and go public, we examined all known cyber attacks between rival states from 2015 to mid-2018. The framework of the Dyadic Cyber Incident Dataset (DCID) v1.1 (Maness, Valeriano and Jensen 2017) was the basis for the coding, and\nnew attacks from the Council on Foreign Relation Cyber Operations Tracker were added (Segal 2017). The unit of analysis in both datasets is state-sponsored cyber attacks. $^{4}$  We focus on state-sponsored actors because our purpose is to identify when states and their proxies conduct cyber operations in pursuit of their foreign policy interests. New variables originally collected by us were added in order to examine the victims' strategies. All data collected are open source. $^{5}$\nOur data indicate that there is wide variation in the victims' strategies: Between 2015 and mid-2018, 75 cyber attacks were conducted between rival states. In 44, the victims chose to address the attack publicly. Of those, in 16 the victim revealed the attack and did not attribute it. In the remaining 28, the victim revealed the attack and publicly attributed it to a specific attacker (Figure 2). Out of the 28 cases where victims chose to publicly reveal the attack and the attacker, only three states were not democratic.[6]\nThe data suggest that states frequently choose public strategies. Although at first glance, revealing the attack might be perceived as exposing a country's weakness, there are several considerations with positive implications, which could lead the country to decide to reveal the attack. The question is: why do states act that way, and in the pursuit of which advantages?\nFIGURE 2: VARIANCE IN VICTIMS' STRATEGIES BETWEEN 2015 AND MID-2018\n\nIn most cyber attacks the victim does not have full confidence regarding the identity of the attacker. Furthermore, there are questions around to what extent a victim that chooses to accuse the attacker is certain of the accuracy of its identification. If it possesses technical evidence that can be exposed, the attacker will have more difficulty denying the charges. However, more often than not this is not the case. It is common for a victim to point a finger at a particular attacker even without disclosing the full technical evidence that led to that attribution.\nIn the political and technical landscapes of our time, it is important to consider cyber attacks in the broader geostrategic context. In many cases there is an ongoing political tension that means it is in the victim’s interests to reveal the aggressive actions of its adversary, a strategy known as Naming and Shaming. A Naming and Shaming strategy means publicly identifying perpetrators that are “doing wrong” and undermining international law and the rules-based order. This might look like the victim is admitting to its weakness. Yet, in a long-term cost-benefit analysis, sometimes it is better to “call out” the aggressor as violating international norms than to remain silent. This might help the victim and its allies to improve their cybersecurity readiness, while also reaffirming the victim’s commitment to law and norms (on publicizing states activities see Carnegie and Carson 2018).\nAn additional consideration in revealing attacks is the need to avoid public humiliation. The victim can decide to disclose the attack due to the desire to avoid humiliation and degradation, which will most likely accompany the publication of the said attack by the attacker or by a third party. In a post-Snowden reality, remaining covert is hard. The general public is more aware of state activities and has the means to publicize them via social media as well as in various other ways. As a result, the political costs of transparency may be less than those associated with hiding an attack. This minimizes the victim’s reputational damage and helps to improve overall cybersecurity of both victim and international allies alike.\nAnother goal may be showing strength in front of an international audience by warning the attacker against taking future actions. By disclosing the attack and accusing the attacker, the victim conveys a message that it has identified the attack and may intend to retaliate; plus, it has the technical know-how to identify the attack and point out the entity behind it. If the victim can say to the presumed attackers that it knows what they are up to, it implies that it also knows a lot more about the attackers’ operations and capabilities. This may introduce uncertainty into the decision-making process and induce a strategic effect. Such was the case with the Obama-Xi agreement from 2015 that reduced Chinese industrial cyber espionage for a limited period of time (Spetalnick and Martina 2015). A country that exposes the attack and points a finger at the attacker, while showing its methods of coping and the ways in which it operates to strengthen its defense capabilities, is portrayed as a leader in the international arena in dealing with cyber attacks.7 Other countries will observe and learn from it, as was the case with the Democratic National Committee hack, which is discussed in detail later on.\n## Motivations not to reveal the attacker Assuming that the victim identified the attacker, there are at least two main reasons why the victim would not want to reveal the attacker’s identity in public: (1) Safety of intelligence sources. The desire to avoid exposing intelligence and sources is an important reason not to make the identity of the attacker public. This is even more acute in cyberspace, because it is difficult to identify the attacker only using technical tools. Therefore, it is often necessary to use intelligence of various kinds, such as advanced technological and even human resources to obtain the necessary information. These sources are considered highly important and valuable for the country’s intelligence services, and therefore it is essential to protect their safety and not to expose them.\n(2) Preventing escalation. There may be differences in the existing technological capabilities and power of the victim and the attacker. If this is the case, the victim might choose not to publicize the attack in order to avoid the chance that the exposure would lead to open confrontation. An aggressive public intervention by one country in another’s affairs poses a political-strategic challenge to the victim in the eyes of the domestic public and the international community, who are watching and waiting to see how it responds (Carson 2016). Not revealing the identity of the attacker allows the victim to refrain from the obligation to respond, contain the attack and prevent undesirable escalation.\nWe expect victims to choose to reveal the attack publicly and attribute it when (a) they want to expose the aggressor and blame them for violating international norms; (b) avoid international and domestic humiliation; (c) warn the attacker. However, by revealing the attack and not attributing it, the victim can also avoid humiliation and there are covert ways to convey a deterrent message. Therefore, we hypothesize that in this case key reasons for not attributing the attack are (a) the safety of intelligence sources; and (b) preventing escalation. The two cases tested in the next section will help examine these expectations.\n\n# 4. GIVING UP SECRECY IN CYBER OPERATIONS – REAL-LIFE CASES\nTwo major cyber attacks that occurred in the past three years are examined. They allow us to illustrate the public strategies identified and described theoretically above.\n## Democratic National Committee Hack 2016\nIn April 2016, hackers gained access into the Democratic National Committee (DNC) network, stealing several gigabytes of data. From June-November 2016, WikiLeaks published 20,000 emails of DNC members, and in July 2016 the FBI began an investigation of the hack. The investigation revealed that in the months prior to the WikiLeaks releases, two groups of hackers operating under the auspices of the Russian government broke into the computers of the DNC and leaked the emails. This action was part of a broader Russian operation in the months before the presidential election in 2016, intended to influence the election results and to jeopardize the integrity of the democratic processes (Bump 2018).\nOn December 2016, President Obama publicly accused Russia of carrying out these attacks, warned that it must stop and said that the US had offensive cyber capabilities and it might respond. At the end of that month, President Obama ordered the expulsion of 35 Russian diplomats from the US, as well as the closure of sites which were used by the Russians to gather intelligence (Landler and Sanger 2016; Ryan, Nakashima and De Young 2016). The Department of Homeland Security (DHS) and the FBI published a joint statement describing the process of the Russian cyber attack, directly accusing military and civilian Russian intelligence agencies. According to the statement, “The US Intelligence Community is confident that the Russian Government directed the recent compromises of emails from US persons and institutions [...] only Russia’s senior-most officials could have authorized these activities.” (Department of Homeland Security 2016). The operations of Russian intelligence agencies included “spear phishing” attacks of entities in government agencies, critical infrastructure, think tanks, universities, political organizations, and more, in order to steal information (Masters 2018).\nThe fact that the US chose to publicly accuse Russia of the attack helped strengthen its international standing by calling out Russia’s undermining of the international order in trying to manipulate and sabotage democratic procedures. Such attempts to influence election results are perceived by Western democracies as damaging their political and institutional integrity. Other countries also saw and learned from the American experience. Following the exposure of the attack, the US became the focus of interest for other democratic countries—such as France and Germany—which were about to hold their own elections and feared Russian intervention. For example, the NSA\nwarned French officials that Russian hackers had compromised some elements of the election (Greenberg 2017).\nThe experience gained by the US in dealing with Russian activity enabled it to share information and assist other countries. The US became a role model for confronting Russian influence attempts and protecting election campaigns (Graham, 2017). This case demonstrates the value of our theoretical framework: by publicly revealing the attack, the US avoided public humiliation that could have happened if a third party or Russia itself had revealed the attack instead. Also, by conveying a deterrent message to the Russians, the US made a coercive threat and demonstrated resolve. It showed its will to spend valuable resources in order to make Russia pay a price for its offensive actions.\n# SingHealth Hack 2018\nOn 4 July 2018, data administrators detected unusual activity on one of SingHealth's IT databases. With more than two million patients, SingHealth is the largest health provider in Singapore. The security team immediately investigated the suspicious activity to determine its nature and whether it was malicious. On July 10th, after forensic investigations confirming it was a cyber attack, SingHealth, the Ministry of Health and the Cyber Security Agency (CSA) were informed (Tham 2018). The cyber attack resulted in the personal details of 1.5m SingHealth patients being accessed and copied; this included names, identification numbers, address, gender, race and date of birth, including the personal data of Singapore's Prime Minister. On July 20th, even while investigations were still under way, SingHealth and investigating authorities assessed that the situation had been stabilized and informed the public of the cyber attack, (Singapore Ministry of Health 2018).\nFollowing the attack, a public Committee of Inquiry was established. A senior counsel in the Ministry of Justice summarized in front of the committee how advanced, determined and disciplined the attackers were: \"The skill and sophistication used in the SingHealth attack highlights the challenges that cyber defenders face\" (Tham and Baharudin, 2018). Speaking at a press conference on July 20th 2018, the Chief Executive of the CSA, David Koh, confirmed that: \"We have determined that this is a deliberate, targeted and well-planned cyber attack, not the work of casual hackers [...] we are not able to reveal more because of operational security reasons\" (Koh 2018). From Koh's words it seems that for national security reasons the CSA wanted to keep its intelligence sources safe and did not reveal any information that could risk them.\nAlthough the head of the CSA estimated that a nation state was behind the attack, and many security analysts even estimated it was China, Singapore was careful not to reveal the identity of the attacker in public. The decision to make the attack public\n\nAnother consideration for exposing the attack, but keeping the identity of the attacker undisclosed, was concern about public humiliation. If the attacker or a third party exposed the attack before the Singaporean authorities did, it could damage the reputation of the administration. In such circumstances, the administration would appear to have failed to protect its citizens and to have made an attempt to conceal it.\nWhile experts pointed fingers at China (Lee 2018), authorities remain tight-lipped. One explanation for that is the need to avoid escalation. China and Singapore have a close relationship, but differences have been experienced during numerous high-profile events, including Singapore's stance against China regarding the South China Sea dispute. The power differential between the two, and the will of Singapore not to take any steps that could risk this relationship and escalate the situation, seem to be among the main reasons why Singapore chose not to reveal the identity of the attacker. Further support for the decision not to reveal the identity of the attacker was given by the Minister-in-Charge of cybersecurity. In January 2019, the Minister stated that:\"Revealing the identity of the perpetrator would not be in the Republic's national interest [...] We've got nothing to hide here [...] the only part that's been held back are those that pertain to sensitive national security matters and also patient confidentiality\"(Nair 2019; Yufeng 2019).\n# 5. CONCLUSIONS Reasons ranging from attempts to Name and Shame or avoid public humiliation, to incomplete confidence about the identity of the attacker may lead victims of cyber attacks to reveal the fact they had been attacked. There is tension, however, between such reasons and the motivation to protect the safety of intelligence sources and the will to prevent escalation if an attack is revealed and even more so if the attacker is exposed. The preliminary results and analyses presented here demonstrate that despite a range of reasons to remain covert, countries that suffered cyber attacks have sufficiently strong incentives to reveal the fact they had been attacked. The three mechanisms presented in the literature as motivating decision-makers to keep the attack covert—sunk costs, counter-escalation risks and signaling resolve—do not always suffice in the cyber reality. Not only would victims make the attack public, but under certain circumstances, they would even expose the attacker. This finding is both unintuitive and largely undocumented in the literature.\nThe will to avoid domestic and international humiliation if the attack will be exposed by a third party leads countries to give up the advantages of secrecy in cyberspace and reveal the fact that they had been attacked. Furthermore, attributing the attack to a specific attacker helps the victim to warn the attacker from taking future actions and be model for other countries who deal with similar attacks. Such was the case in the DNC hack where the US not only set the standard for other countries in the West but also aided them in preventing potential threats to the integrity of their democratic process.\nNational security considerations such as keeping intelligence sources safe and avoiding escalation play an important part in the decision to reveal the attack without attributing it to a specific attacker. Such was the case in the SingHealth hack. To protect citizens' online identity and e-government business, the attack was made public by the government in Singapore. Yet, its source remained undisclosed, possibly to avoid causing a geostrategic threat of escalation.\nFuture research is essential. In particular, in this paper we limited the theoretical discussion and empirical work to public strategies exclusively. We did not deal with the other two options from Table 1 – partial concealment and full concealment of the attack and did not analyze the attackers’ strategies and the utility of the interaction between both sides.\n## Acknowledgments We thank Dana Litman, Adi Lotan and Eden Poch for excellent research assistance."
    },
    "numeric": {
      "total": {
        "intext_total": 1,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [
        {
          "index": "6",
          "intext_citation": "[6]",
          "preceding_text": "Out of the 28 cases where victims chose to publicly reveal the attack and the attacker, only three states were not democratic.",
          "footnote": null
        }
      ],
      "flat_text": "2019 11th International Conference on Cyber Conflict: Silent Battle\nT. Minárik, S. Alatalu, S. Biondi, M. Signoretti, I. Tolga, G. Visky (Eds.)\n2019 © NATO CCD COE Publications, Tallinn\nPermission to make digital or hard copies of this publication for internal use within NATO and for personal or educational use when for non-profit or non-commercial purposes is granted providing that copies bear this notice and a full citation on the first page. Any other reproduction or transmission requires prior written permission by NATO CCD COE.\n# Covert or not Covert: National Strategies During Cyber Conflict\nGil Baram\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\ngilbaram@tauex.tau.ac.il\nUdi Sommer\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\nhttp://people.socsci.tau.ac.il/mu/udis\nAbstract: Anonymity is considered to be a key characteristic of cyber conflict. Indeed, existing accounts in the literature focus on the advantages of the non-disclosure of cyber attacks. Such focus inspires the expectation that countries would opt to maintain covertness. This hypothesis is rejected in an empirical investigation we conducted on victims' strategies during cyber conflict: in numerous cases, victim states choose to publicly reveal the fact that they had been attacked. These counterintuitive findings are important empirically, but even more so theoretically. They motivate an investigation into the decision to forsake covertness. What does actually motivate states to move into the international arena and publicly expose a cyber attack?\nThe goal of this paper is to understand why and under which geopolitical circumstances countries choose to give up the advantages of anonymity. Whether they wish to Name and Shame opponents for ignoring international norms or whether they try to avoid public humiliation, victims of cyber attacks occasionally reveal the fact that they had been attacked. There is tension between such motivations and the will to protect intelligence sources and the incentives to prevent escalation if an attack is revealed, even more so if the attacker is exposed. Indeed, we find that sunk costs, counterescalation risks and the need to signal resolve—while critical in motivating victims to keep cyber attacks secret—may not suffice under such specific circumstances. By focusing on the victim's side, we draw inspiration from data on real-world cyber attacks in order to place cyber operations in the larger context of secrecy and covert actions in the international arena. In so doing, the aim is to advance the use of empirical data\n* This research was supported by a research grant from the Blavatnik Interdisciplinary Cyber Research Center at Tel-Aviv University\nfor understanding the dynamics of cyber conflict and the decision-making process of states operating in this increasingly complex domain.\nKeywords: covert actions, cyber operations, national cyber strategies\n# 1. INTRODUCTION\nIn its 2019 Global Risks Report, the World Economic Forum ranked cyber attacks as one of the top ten risks, with respect to likelihood and impact (Myers and Whiting 2019). This concern is neither new nor surprising, given the anonymity that cyber attacks afford perpetrators and victims alike. By cyber attacks, which can be a part of an ongoing cyber operation, we mean both CNA (Computer Network Attack) and CNE (Computer Network Exploitation), as they cannot be fully separated (Siedler 2016).¹ Indeed, cyber technology enables countries to act covertly: the results of offensive actions in the cyber realm and their influence are not always exposed to the public eye. Furthermore, it is not always easy to identify who is behind a given attack. Even if the results of the attack are publicly observable—e.g., damage to a power grid leading to the severance of electricity supply—the victim can still dismiss these effects, arguing that they were the result of a technical fault. To date, our understanding of those strategic interactions between attacker and victim—and their decisions about whether or not to keep attacks covert—is theoretically and empirically limited.\nRecent work regarding covert actions in the international arena offers three mechanisms that make the use of covert actions preferable for countries: sunk costs, counter-escalation risks and signaling resolve (Carson 2016; Carson and Yarhi-Milo 2017). These mechanisms, to be discussed in detail in Section 3, suggest that countries have strong incentives to engage in covert actions and keep those actions away from the public eye, domestically as well as internationally.\nYet an empirical investigation conducted on states' strategies in the wake of cyber attacks reveals a different picture. Notwithstanding the advantages of maintaining secrecy, it is not uncommon for victims to reveal the fact that they have been attacked. What causes victims of cyber attacks to \"abandon\" the covert space and move to the public arena in the aftermath of an attack? Existing literature does not offer satisfying answers (for exceptions see Edwards, Furnas, Forrest and Axelrod 2017; Poznansky and Perkoski 2018). To understand the puzzling strategic choice to abandon the advantages of ambiguity in favor of a public strategy, we need to understand the tradeoffs between the strategies. As not all countries choose to either publicly reveal\n¹ As Libicki concluded, “as long as the methods of cyber espionage look like the methods of cyberattack the discovery of one will raise fears about the imminence of the other.” (Libicki 2018, 121)\nthe attack or to hide it, we recognized that the strategies of the victims vary between four possible approaches:\n(1) \"Pointing a finger\" – publicly disclosing that an attack occurred (revealing vulnerability) and publicly putting the responsibility on a specific attacker;\n(2) Admitting injury – publicly disclosing that an attack took place, while failing to identify an attacker;\n(3) Revealing damage – disclosing damage but denying that it had been caused by a deliberate hostile attack (claiming technical malfunctions, system “glitches” etc.);\n(4) Maintaining ambiguity – denying or downplaying any damage, thus reducing the chances that the attack would ever be divulged.\nTable 1 summarizes those four strategies with illustrations from cyber attacks in recent years.\nTABLE 1: VARIANCE IN VICTIM'S STRATEGIES DURING CYBER ATTACKS, WITH REAL-LIFE EXAMPLES\n|   | Publicized |   | Concealed  |   |\n| --- | --- | --- | --- | --- |\n|  Victim's Strategy: | (1) Publicizing the attack and blaming the attacker (Public Strategy #1) | (2) Publicizing the attack and not blaming the attacker (Public Strategy #2) | (3) Partial concealment (claim of fault) | (4) Full concealment of the attack  |\n|  Real-life Example: | DNC hack 2016 | SingHealth hack 2018 | USS John S McCain collision 2017 | ---  |\nOur discussion focuses on the first two options, where the victim decided to make the attack public and sometimes also to reveal the attacker's identity. The third option (partial concealment) deals with cases where the alleged victim claims that a certain event was the result of a technical problem and not due to a cyber attack. To illustrate this option in a nutshell—since we do not delve into its details in the paper—let us look at the summer 2017 case of the USS John S McCain, which collided with a merchant ship in the Straits of Malacca, resulting in the death of 10 sailors (Werner 2018). The Chief of Naval Operations argued that there was no evidence suggesting the accident was the result of a cyber attack. However, according to experts, since the destroyer had a large navigational team as well as another team in charge of radar, it was impossible that human error had led to the accident. In addition, both the destroyers USS McCain and the USS Fitzgerald, which had been hit in a similar incident in June 2017, belong to the Seventh Fleet. Experts believed these attacks may have been related to Chinese or Russian intervention (Mass 2017).²\nThe Navy's investigation found no evidence of a cyber attack (Tritten 2017; Navy Releases Collision Report 2017).\nAfter discussing the place of attribution and secrecy in cyber operations and their impact on states' strategic calculations, we develop our theoretical framework and examine two cases – hacking into the Democratic National Committee in 2016 and the SingHealth hack in 2018. It is particularly in the analysis of those two well-studied cases that our theoretical framework helps to shed new light on the national and international considerations leading countries to give up secrecy. We highlight the taxonomy of the different prototypes of these strategies and help to identify when countries might choose each strategy.\n## 2. ATTRIBUTION AND SECRECY – AN INHERENT COMPONENT OF CYBER OPERATIONS?\nThe covertness of cyber attacks can be expressed in two ways. First, the attack itself is covert. Its technological characteristics enable an attacker to carry out the operation in a clandestine way, without revealing how it was carried out. The second aspect concerns the attackers themselves, who can maintain covertness.³ It is often difficult to point out the source of an attack and to attribute it to a particular attacker. This problem is known as the Attribution Problem.\nThe Attribution Problem arises when the victim identified the attack, but has yet to identify the attacker. The immediate effect of this lack of certainty raises questions concerning the feasibility of retaliation, and the desire for it. Such a situation creates uncertainty as to the attacker's demands. It can be difficult to determine by technical means the motivation for an attack (Wheeler and Larsen 2003, 1). So, as Rid and Buchanan argue, “attribution is what states make of it” (Rid and Buchanan 2015, 7).\nWhen an attribution process is conducted using intelligence sources and methods, it is difficult to expose it without endangering these sources. But if the domestic public—especially in a democratic polity—perceives the attribution as unreliable, the state may lose the legitimacy to retaliate (Lindsay 2015). An important part of the attribution process is its political implications. Indeed, “communicating attribution is part of attributing” (Rid and Buchanan 2015, 26). When an attack is executed, security researchers attempt to find out who is behind it. In order to do so, they examine the code, techniques and protocols that the attacker used. However, this is not considered legitimate proof in court and is seen, especially today, more as playing a “blame game” (Berghel 2017, 86).\nFaith-based attribution happens when actors blame other actors for an attack if they believe the former carried it out. This also happens in modern politics, where politicians knowingly make incorrect statements, simply because no one checks their\nOn the distinction between clandestine and covert operations, see Poznansky and Perkoski, 2018, 403.\nvalidity (Berghel 2017; Carr 2016). Healey (2013) also argues that scholarship should move forward from dealing with the attribution problem. Instead of asking “who is behind the attack?” the question should be “who is to blame for it?” (Healey 2013, 55) and what are the political consequences of blaming?\nThis study adopts Healey's approach in the sense that the technical attribution problem is not as crucial for our framework. In practice, countries routinely accuse each other even without disclosing the full technical process that led them to attribute the attack to a particular attacker. This was the case in the Sony hack (2014) and the \"WannaCry\" attack (2017) when the US blamed North Korea without fully disclosing technical evidence.\nDespite the inherent overlap between cyber operations and covert actions, the scholarship has not fully explored this connection and has studied these fields separately for the most part. On the one hand, the cyberwarfare scholarship in International Relations and Security Studies hardly deals with the different aspects of secrecy in cyber operations, and mainly accepts the assumption that anonymity is an immutable feature of cyberspace rather than something actors select into and which they can therefore forfeit (for exceptions see Lupovici 2016; Poznansky and Perkoski 2018). On the other hand, scholars dealing with covert operations largely tend not to include cyber operations in their analyses (for exceptions see Brecher 2012). This study is an important step towards merging these bodies of literature.\nRecent work regarding secrecy in cyberspace tends to study the considerations before the attack (Edwards, Furnas, Forrest and Axelrod 2017), the perpetrators' calculations (Poznansky and Perkoski 2018), and the effect of cyber attacks on democratic states' accountability to their citizens (Schulzk 2018). While these studies are an important step in combining the two literatures, more research is needed in order to understand cyber operations as covert actions and to investigate to what extent countries choose to use the advantages of this covertness or to give it up. In the following sections these considerations are examined from the victim's point of view. We focus on the victim, since in most circumstances the victim is the first to make a choice about whether to use covertness or forsake it.\n# 3. GIVING UP SECRECY AS A NATIONAL STRATEGY\nThree mechanisms are offered in the literature for making the use of covert actions preferable for countries. First are sunk costs, which refer to situations where states decide to take covert action because of non-recoverable resources: by choosing to use covert actions, leaders can employ a more \"creative\" way to address security threats\n(Carson and Yarhi-Milo 2017, 135). Second are counter-escalation risks: using covert action can appear credible because of its impact on the risk of crisis escalation, since leaders using covert signaling tools can be free to engage in more aggressive behavior. This explanation is based mainly on the audience costs literature, which identifies a link between the type of action that the state takes and the costs the leader will have to bear as a result (see Fearon 1994; Tomz 2007). The last mechanism is signaling resolve: under certain conditions, the use of covert operations allows states to convey the desired message to their rivals, and therefore they do not have to act in the public arena (Carson 2016; Carson and Yarhi-Milo 2017, 134-135).\nBut it seems that during cyber attacks, that might be a part of an on-going operation or a one-time attack, the options available to the victim are different, and revealing the attack has its benefits. Generally, there are cases where the incentives to remain covert are not enough and decision-makers have other incentives—such as avoiding public humiliation, warning the attacker from taking future actions and more—that lead them to decide to publicly reveal the attack.\nOnce the victim has identified the attack and decides to use a public strategy, it has two major options as mentioned earlier: (1) reveal the attack and point a finger towards the attacker, or (2) reveal only the fact that the attack has occurred, without disclosing the identity of the alleged attacker. Figure 1 summarizes the strategies at earlier stages and as they lead up to the strategies at this stage.\nFIGURE 1: VICTIM'S STRATEGIES DURING A CYBER ATTACK\nTo assess the conditions under which countries that have suffered a cyber attack choose to reveal the attack and go public, we examined all known cyber attacks between rival states from 2015 to mid-2018. The framework of the Dyadic Cyber Incident Dataset (DCID) v1.1 (Maness, Valeriano and Jensen 2017) was the basis for the coding, and\nnew attacks from the Council on Foreign Relation Cyber Operations Tracker were added (Segal 2017). The unit of analysis in both datasets is state-sponsored cyber attacks. $^{4}$  We focus on state-sponsored actors because our purpose is to identify when states and their proxies conduct cyber operations in pursuit of their foreign policy interests. New variables originally collected by us were added in order to examine the victims' strategies. All data collected are open source. $^{5}$\nOur data indicate that there is wide variation in the victims' strategies: Between 2015 and mid-2018, 75 cyber attacks were conducted between rival states. In 44, the victims chose to address the attack publicly. Of those, in 16 the victim revealed the attack and did not attribute it. In the remaining 28, the victim revealed the attack and publicly attributed it to a specific attacker (Figure 2). Out of the 28 cases where victims chose to publicly reveal the attack and the attacker, only three states were not democratic.\nThe data suggest that states frequently choose public strategies. Although at first glance, revealing the attack might be perceived as exposing a country's weakness, there are several considerations with positive implications, which could lead the country to decide to reveal the attack. The question is: why do states act that way, and in the pursuit of which advantages?\nFIGURE 2: VARIANCE IN VICTIMS' STRATEGIES BETWEEN 2015 AND MID-2018\n4 This paper focuses only on state-sponsored cyber attacks. Doing that allowed us to achieve in-depth insights regarding the ways countries operate during cyber conflict. Keeping out of the analysis other kinds of cyber attacks, such as multi-victim attacks and attacks against NGOs, might pose a methodological challenge. Due to the limited scope of this paper we do not treat these kinds of cyber attacks here, and will deal with them in future projects.\n5 The \"unknown-unknowns\" cyber attacks are the ones that are not known to the public. This paper deals only with cyber attacks that have been publicly revealed and that had sufficient data on them in order to code it in our dataset.\n6 According to Freedom House.\n8\n# Reasons to publicly reveal the attack\nIn most cyber attacks the victim does not have full confidence regarding the identity of the attacker. Furthermore, there are questions around to what extent a victim that chooses to accuse the attacker is certain of the accuracy of its identification. If it possesses technical evidence that can be exposed, the attacker will have more difficulty denying the charges. However, more often than not this is not the case. It is common for a victim to point a finger at a particular attacker even without disclosing the full technical evidence that led to that attribution.\nIn the political and technical landscapes of our time, it is important to consider cyber attacks in the broader geostrategic context. In many cases there is an ongoing political tension that means it is in the victim’s interests to reveal the aggressive actions of its adversary, a strategy known as Naming and Shaming. A Naming and Shaming strategy means publicly identifying perpetrators that are “doing wrong” and undermining international law and the rules-based order. This might look like the victim is admitting to its weakness. Yet, in a long-term cost-benefit analysis, sometimes it is better to “call out” the aggressor as violating international norms than to remain silent. This might help the victim and its allies to improve their cybersecurity readiness, while also reaffirming the victim’s commitment to law and norms (on publicizing states activities see Carnegie and Carson 2018).\nAn additional consideration in revealing attacks is the need to avoid public humiliation. The victim can decide to disclose the attack due to the desire to avoid humiliation and degradation, which will most likely accompany the publication of the said attack by the attacker or by a third party. In a post-Snowden reality, remaining covert is hard. The general public is more aware of state activities and has the means to publicize them via social media as well as in various other ways. As a result, the political costs of transparency may be less than those associated with hiding an attack. This minimizes the victim’s reputational damage and helps to improve overall cybersecurity of both victim and international allies alike.\nAnother goal may be showing strength in front of an international audience by warning the attacker against taking future actions. By disclosing the attack and accusing the attacker, the victim conveys a message that it has identified the attack and may intend to retaliate; plus, it has the technical know-how to identify the attack and point out the entity behind it. If the victim can say to the presumed attackers that it knows what they are up to, it implies that it also knows a lot more about the attackers’ operations and capabilities. This may introduce uncertainty into the decision-making process and induce a strategic effect. Such was the case with the Obama-Xi agreement from 2015 that reduced Chinese industrial cyber espionage for a limited period of time (Spetalnick and Martina 2015). A country that exposes the attack and points a finger\nat the attacker, while showing its methods of coping and the ways in which it operates to strengthen its defense capabilities, is portrayed as a leader in the international arena in dealing with cyber attacks.7 Other countries will observe and learn from it, as was the case with the Democratic National Committee hack, which is discussed in detail later on.\n## Motivations not to reveal the attacker\nAssuming that the victim identified the attacker, there are at least two main reasons why the victim would not want to reveal the attacker’s identity in public:\n(1) Safety of intelligence sources. The desire to avoid exposing intelligence and sources is an important reason not to make the identity of the attacker public. This is even more acute in cyberspace, because it is difficult to identify the attacker only using technical tools. Therefore, it is often necessary to use intelligence of various kinds, such as advanced technological and even human resources to obtain the necessary information. These sources are considered highly important and valuable for the country’s intelligence services, and therefore it is essential to protect their safety and not to expose them.\n(2) Preventing escalation. There may be differences in the existing technological capabilities and power of the victim and the attacker. If this is the case, the victim might choose not to publicize the attack in order to avoid the chance that the exposure would lead to open confrontation. An aggressive public intervention by one country in another’s affairs poses a political-strategic challenge to the victim in the eyes of the domestic public and the international community, who are watching and waiting to see how it responds (Carson 2016). Not revealing the identity of the attacker allows the victim to refrain from the obligation to respond, contain the attack and prevent undesirable escalation.\nWe expect victims to choose to reveal the attack publicly and attribute it when (a) they want to expose the aggressor and blame them for violating international norms; (b) avoid international and domestic humiliation; (c) warn the attacker. However, by revealing the attack and not attributing it, the victim can also avoid humiliation and there are covert ways to convey a deterrent message. Therefore, we hypothesize that in this case key reasons for not attributing the attack are (a) the safety of intelligence sources; and (b) preventing escalation. The two cases tested in the next section will help examine these expectations.\n7 We are aware that there are other considerations for countries to reveal the attack, such as creating a false attribution for political reasons or faking non-existent capabilities by revealing; using the publicized attack for political reasons such as increase allied support; cases when there is a public leak and the victim is being forced to reveal the attack; internal political considerations and more. The scope of this paper will not allow us to deal with all these considerations but they will be taken into account in our larger research agenda.\n9\n10\n# 4. GIVING UP SECRECY IN CYBER OPERATIONS – REAL-LIFE CASES\nTwo major cyber attacks that occurred in the past three years are examined. They allow us to illustrate the public strategies identified and described theoretically above.\n## Democratic National Committee Hack 2016\nIn April 2016, hackers gained access into the Democratic National Committee (DNC) network, stealing several gigabytes of data. From June-November 2016, WikiLeaks published 20,000 emails of DNC members, and in July 2016 the FBI began an investigation of the hack. The investigation revealed that in the months prior to the WikiLeaks releases, two groups of hackers operating under the auspices of the Russian government broke into the computers of the DNC and leaked the emails. This action was part of a broader Russian operation in the months before the presidential election in 2016, intended to influence the election results and to jeopardize the integrity of the democratic processes (Bump 2018).\nOn December 2016, President Obama publicly accused Russia of carrying out these attacks, warned that it must stop and said that the US had offensive cyber capabilities and it might respond. At the end of that month, President Obama ordered the expulsion of 35 Russian diplomats from the US, as well as the closure of sites which were used by the Russians to gather intelligence (Landler and Sanger 2016; Ryan, Nakashima and De Young 2016). The Department of Homeland Security (DHS) and the FBI published a joint statement describing the process of the Russian cyber attack, directly accusing military and civilian Russian intelligence agencies. According to the statement, “The US Intelligence Community is confident that the Russian Government directed the recent compromises of emails from US persons and institutions [...] only Russia’s senior-most officials could have authorized these activities.” (Department of Homeland Security 2016). The operations of Russian intelligence agencies included “spear phishing” attacks of entities in government agencies, critical infrastructure, think tanks, universities, political organizations, and more, in order to steal information (Masters 2018).\nThe fact that the US chose to publicly accuse Russia of the attack helped strengthen its international standing by calling out Russia’s undermining of the international order in trying to manipulate and sabotage democratic procedures. Such attempts to influence election results are perceived by Western democracies as damaging their political and institutional integrity. Other countries also saw and learned from the American experience. Following the exposure of the attack, the US became the focus of interest for other democratic countries—such as France and Germany—which were about to hold their own elections and feared Russian intervention. For example, the NSA\nwarned French officials that Russian hackers had compromised some elements of the election (Greenberg 2017).\nThe experience gained by the US in dealing with Russian activity enabled it to share information and assist other countries. The US became a role model for confronting Russian influence attempts and protecting election campaigns (Graham, 2017). This case demonstrates the value of our theoretical framework: by publicly revealing the attack, the US avoided public humiliation that could have happened if a third party or Russia itself had revealed the attack instead. Also, by conveying a deterrent message to the Russians, the US made a coercive threat and demonstrated resolve. It showed its will to spend valuable resources in order to make Russia pay a price for its offensive actions.\n# SingHealth Hack 2018\nOn 4 July 2018, data administrators detected unusual activity on one of SingHealth's IT databases. With more than two million patients, SingHealth is the largest health provider in Singapore. The security team immediately investigated the suspicious activity to determine its nature and whether it was malicious. On July 10th, after forensic investigations confirming it was a cyber attack, SingHealth, the Ministry of Health and the Cyber Security Agency (CSA) were informed (Tham 2018). The cyber attack resulted in the personal details of 1.5m SingHealth patients being accessed and copied; this included names, identification numbers, address, gender, race and date of birth, including the personal data of Singapore's Prime Minister. On July 20th, even while investigations were still under way, SingHealth and investigating authorities assessed that the situation had been stabilized and informed the public of the cyber attack, (Singapore Ministry of Health 2018).\nFollowing the attack, a public Committee of Inquiry was established. A senior counsel in the Ministry of Justice summarized in front of the committee how advanced, determined and disciplined the attackers were: \"The skill and sophistication used in the SingHealth attack highlights the challenges that cyber defenders face\" (Tham and Baharudin, 2018). Speaking at a press conference on July 20th 2018, the Chief Executive of the CSA, David Koh, confirmed that: \"We have determined that this is a deliberate, targeted and well-planned cyber attack, not the work of casual hackers [...] we are not able to reveal more because of operational security reasons\" (Koh 2018). From Koh's words it seems that for national security reasons the CSA wanted to keep its intelligence sources safe and did not reveal any information that could risk them.\nAlthough the head of the CSA estimated that a nation state was behind the attack, and many security analysts even estimated it was China, Singapore was careful not to reveal the identity of the attacker in public. The decision to make the attack public\n11\nwas based on two main considerations. The first derived from the theft of personal information that is critical for the daily life of citizens. As most activities that are essential to the daily lives of Singapore's citizens take place online, there was a concern that the attacker might want to use the data to gain access to additional personal details (Tham and Baharudin, 2018).\nAnother consideration for exposing the attack, but keeping the identity of the attacker undisclosed, was concern about public humiliation. If the attacker or a third party exposed the attack before the Singaporean authorities did, it could damage the reputation of the administration. In such circumstances, the administration would appear to have failed to protect its citizens and to have made an attempt to conceal it.\nWhile experts pointed fingers at China (Lee 2018), authorities remain tight-lipped. One explanation for that is the need to avoid escalation. China and Singapore have a close relationship, but differences have been experienced during numerous high-profile events, including Singapore's stance against China regarding the South China Sea dispute. The power differential between the two, and the will of Singapore not to take any steps that could risk this relationship and escalate the situation, seem to be among the main reasons why Singapore chose not to reveal the identity of the attacker. Further support for the decision not to reveal the identity of the attacker was given by the Minister-in-Charge of cybersecurity. In January 2019, the Minister stated that: \"Revealing the identity of the perpetrator would not be in the Republic's national interest [...] We've got nothing to hide here [...] the only part that's been held back are those that pertain to sensitive national security matters and also patient confidentiality\" (Nair 2019; Yufeng 2019).\n# 5. CONCLUSIONS\nReasons ranging from attempts to Name and Shame or avoid public humiliation, to incomplete confidence about the identity of the attacker may lead victims of cyber attacks to reveal the fact they had been attacked. There is tension, however, between such reasons and the motivation to protect the safety of intelligence sources and the will to prevent escalation if an attack is revealed and even more so if the attacker is exposed. The preliminary results and analyses presented here demonstrate that despite a range of reasons to remain covert, countries that suffered cyber attacks have sufficiently strong incentives to reveal the fact they had been attacked. The three mechanisms presented in the literature as motivating decision-makers to keep the attack covert—sunk costs, counter-escalation risks and signaling resolve—do not always suffice in the cyber reality. Not only would victims make the attack public, but\nunder certain circumstances, they would even expose the attacker. This finding is both unintuitive and largely undocumented in the literature.\nThe will to avoid domestic and international humiliation if the attack will be exposed by a third party leads countries to give up the advantages of secrecy in cyberspace and reveal the fact that they had been attacked. Furthermore, attributing the attack to a specific attacker helps the victim to warn the attacker from taking future actions and be model for other countries who deal with similar attacks. Such was the case in the DNC hack where the US not only set the standard for other countries in the West but also aided them in preventing potential threats to the integrity of their democratic process.\nNational security considerations such as keeping intelligence sources safe and avoiding escalation play an important part in the decision to reveal the attack without attributing it to a specific attacker. Such was the case in the SingHealth hack. To protect citizens' online identity and e-government business, the attack was made public by the government in Singapore. Yet, its source remained undisclosed, possibly to avoid causing a geostrategic threat of escalation.\nFuture research is essential. In particular, in this paper we limited the theoretical discussion and empirical work to public strategies exclusively. We did not deal with the other two options from Table 1 – partial concealment and full concealment of the attack and did not analyze the attackers’ strategies and the utility of the interaction between both sides.\n## Acknowledgments\nWe thank Dana Litman, Adi Lotan and Eden Poch for excellent research assistance."
    },
    "author_year": {
      "total": {
        "intext_total": 32,
        "success_occurrences": 32,
        "success_unique": 26,
        "bib_unique_total": 73,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.3561643835616438,
        "success_percentage": 100.0,
        "style": "author_year"
      },
      "results": [
        {
          "index": "myers|2019",
          "intext_citation": "(Myers and Whiting 2019)",
          "preceding_text": "In its 2019 Global Risks Report, the World Economic Forum ranked cyber attacks as one of the top ten risks, with respect to likelihood and impact",
          "footnote": "Myers Joe and Kate Whiting. 2019. \"These are the biggest risks facing our world in 2019.\" *World Economic Forum*, January 16, 2019. https://www.weforum.org/agenda/2019/01/these-are-the-biggest-risks-facing-our-world-in-2019/"
        },
        {
          "index": "siedler|2016",
          "intext_citation": "(Siedler 2016)",
          "preceding_text": "By cyber attacks, which can be a part of an ongoing cyber operation, we mean both CNA (Computer Network Attack) and CNE (Computer Network Exploitation), as they cannot be fully separated",
          "footnote": "Siedler, Endresen. \"Hard power in cyberspace: CNA as a political means.\" *2016 8th International Conference on Cyber Conflict (CyCon)*. IEEE, (2016). https://ieeexplore.ieee.org/abstract/document/7529424"
        },
        {
          "index": "carson|2016",
          "intext_citation": "(Carson 2016; Carson and Yarhi-Milo 2017)",
          "preceding_text": "Recent work regarding covert actions in the international arena offers three mechanisms that make the use of covert actions preferable for countries: sunk costs, counter-escalation risks and signaling resolve",
          "footnote": "Carson, Austin. \"Facing Off and Saving Face: Covert Intervention and Escalation Management in the Korean War.\" *International Organization* 70, no. 1 (2016): 103-131. https://doi.org/10.1017/S0020818315000284"
        },
        {
          "index": "libicki|2018",
          "intext_citation": "(Libicki 2018, 121)",
          "preceding_text": "¹ As Libicki concluded, “as long as the methods of cyber espionage look like the methods of cyberattack the discovery of one will raise fears about the imminence of the other.”",
          "footnote": "Libicki, Martin. 2018. \"Drawing Inferences from Cyber Espionage,\" *2018 10th International Conference on Cyber Conflict*, NATO CCD COE Publications, Tallinn. https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&amp;arnumber=8405013"
        },
        {
          "index": "werner|2018",
          "intext_citation": "(Werner 2018)",
          "preceding_text": "tack. To illustrate this option in a nutshell—since we do not delve into its details in the paper—let us look at the summer 2017 case of the USS John S McCain, which collided with a merchant ship in the Straits of Malacca, resulting in the death of 10 sailors",
          "footnote": "Werner, Ben. 2018. \"USS John S. McCain Collision, A Year Later.\" USNI News, August 21, 2018. https://news.usni.org/2018/08/21/35947."
        },
        {
          "index": "mass|2017",
          "intext_citation": "(Mass 2017)",
          "preceding_text": "Experts believed these attacks may have been related to Chinese or Russian intervention",
          "footnote": "Mass, Warren. 2017. \"Cyber Experts Believe Hacking may have Caused Collision of USS John S. McCain.\" *The New American*, August 22, 2017. https://www.thenewamerican.com/tech/computers/item/26753-cyber-experts-believe-hacking-may-have-caused-collision-of-uss-john-s-mccain"
        },
        {
          "index": "tritten|2017",
          "intext_citation": "(Tritten 2017; Navy Releases Collision Report 2017)",
          "preceding_text": "The Navy's investigation found no evidence of a cyber attack",
          "footnote": "Tritten, Travis. 2017. \"Navy Chief: There's no evidence recent collisions were caused by hacking.\" *Business Insider*, August 30, 2017. https://www.businessinsider.com/navy-chief-no-evidence-recent-collisions-were-caused-by-hacking-2017-8"
        },
        {
          "index": "wheeler|2003",
          "intext_citation": "(Wheeler and Larsen 2003, 1)",
          "preceding_text": "Such a situation creates uncertainty as to the attacker's demands. It can be difficult to determine by technical means the motivation for an attack",
          "footnote": "Wheeler, David and Gregory Larsen. *Techniques for Cyber Attack Attribution*. Alexandria, VA, 2003. https://apps.dtic.mil/dtic/tr/fulltext/u2/a468859.pdf"
        },
        {
          "index": "rid|2015",
          "intext_citation": "(Rid and Buchanan 2015, 7)",
          "preceding_text": "It can be difficult to determine by technical means the motivation for an attack (Wheeler and Larsen 2003, 1). So, as Rid and Buchanan argue, “attribution is what states make of it”",
          "footnote": "Rid, Thomas and Ben Buchanan. \"Attributing Cyber Attacks.\" *Journal of Strategic Studies* 38, no. 1-2 (2015): 4-37. https://doi.org/10.1080/01402390.2014.977382"
        },
        {
          "index": "lindsay|2015",
          "intext_citation": "(Lindsay 2015)",
          "preceding_text": "But if the domestic public—especially in a democratic polity—perceives the attribution as unreliable, the state may lose the legitimacy to retaliate",
          "footnote": "Lindsay, Jon. \"Tipping the scales: the attribution problem and the feasibility of deterrence against cyberattack.\" *Journal of Cyber Security* 1, no 1 (2015): 53-67. https://doi.org/10.1093/cybsec/tyv003"
        },
        {
          "index": "rid|2015",
          "intext_citation": "(Rid and Buchanan 2015, 26)",
          "preceding_text": "An important part of the attribution process is its political implications. Indeed, “communicating attribution is part of attributing”",
          "footnote": "Rid, Thomas and Ben Buchanan. \"Attributing Cyber Attacks.\" *Journal of Strategic Studies* 38, no. 1-2 (2015): 4-37. https://doi.org/10.1080/01402390.2014.977382"
        },
        {
          "index": "berghel|2017",
          "intext_citation": "(Berghel 2017, 86)",
          "preceding_text": "However, this is not considered legitimate proof in court and is seen, especially today, more as playing a “blame game”",
          "footnote": "Berghel, Hal. “On the Problem of (Cyber) Attribution.” *Computer 3*, no. 50 (2017): 84-89. https://www.computer.org/csdl/mags/co/2017/03/mco2017030084.pdf"
        },
        {
          "index": "berghel|2017",
          "intext_citation": "(Berghel 2017; Carr 2016)",
          "preceding_text": "validity",
          "footnote": "Berghel, Hal. “On the Problem of (Cyber) Attribution.” *Computer 3*, no. 50 (2017): 84-89. https://www.computer.org/csdl/mags/co/2017/03/mco2017030084.pdf"
        },
        {
          "index": "healey|2013",
          "intext_citation": "(Healey 2013, 55)",
          "preceding_text": "Instead of asking “who is behind the attack?” the question should be “who is to blame for it?”",
          "footnote": "Healey, Jason. \"The Spectrum of National Responsibility for Cyberattacks.\" *Brown Journal of World Affairs* 18, no. 1 (2013): 57-70. https://www.jstor.org/stable/24590776"
        },
        {
          "index": "poznansky|2018",
          "intext_citation": "(Poznansky and Perkoski 2018)",
          "preceding_text": "Recent work regarding secrecy in cyberspace tends to study the considerations before the attack (Edwards, Furnas, Forrest and Axelrod 2017), the perpetrators' calculations",
          "footnote": "Poznansky, Michael and Evan Perkoski. \"Rethinking Secrecy in Cyberspace: The Politics of Voluntary Attribution.\" *Journal of Global Security Studies* 3, no. 4 (2018): 402-416. https://doi.org/10.1093/jogss/ogy022"
        },
        {
          "index": "schulzk|2018",
          "intext_citation": "(Schulzk 2018)",
          "preceding_text": "in cyberspace tends to study the considerations before the attack (Edwards, Furnas, Forrest and Axelrod 2017), the perpetrators' calculations (Poznansky and Perkoski 2018), and the effect of cyber attacks on democratic states' accountability to their citizens",
          "footnote": "Schulzke, Marcus. \"The Politics of Attributing Blame for Cyberattacks and the Costs of Uncertainty.\" *Perspectives on Politics* 16, no. 4 (2018): 954-968. https://doi.org/10.1017/S153759271800110X"
        },
        {
          "index": "carson|2017",
          "intext_citation": "(Carson and Yarhi-Milo 2017, 135)",
          "preceding_text": "",
          "footnote": "Carson, Austin and Keren Yarhi-Milo. \"Covert Communication: The Intelligibility and Credibility of Signaling in Secret.\" *Security Studies* 26, no. 1 (2017): 124-156. https://doi.org/10.1080/09636412.2017.1243921"
        },
        {
          "index": "carson|2016",
          "intext_citation": "(Carson 2016; Carson and Yarhi-Milo 2017, 134-135)",
          "preceding_text": "ar as a result (see Fearon 1994; Tomz 2007). The last mechanism is signaling resolve: under certain conditions, the use of covert operations allows states to convey the desired message to their rivals, and therefore they do not have to act in the public arena",
          "footnote": "Carson, Austin. \"Facing Off and Saving Face: Covert Intervention and Escalation Management in the Korean War.\" *International Organization* 70, no. 1 (2016): 103-131. https://doi.org/10.1017/S0020818315000284"
        },
        {
          "index": "segal|2017",
          "intext_citation": "(Segal 2017)",
          "preceding_text": "new attacks from the Council on Foreign Relation Cyber Operations Tracker were added",
          "footnote": "Segal, Adam. 2017. *Tracking State-Sponsored Cyber Operations*, Council on Foreign Relations, November 6, 2017. https://www.cfr.org/blog/tracking-state-sponsored-cyber-operations"
        },
        {
          "index": "spetalnick|2015",
          "intext_citation": "(Spetalnick and Martina 2015)",
          "preceding_text": "Such was the case with the Obama-Xi agreement from 2015 that reduced Chinese industrial cyber espionage for a limited period of time",
          "footnote": "Spetalnick, Matt and Michael Martina. 2015. \"Obama announces 'understanding' with China's Xi on cyber theft but remains wary.\" *Reuters*, September 26, 2015. https://www.reuters.com/article/us-usa-china/obama-announces-understanding-with-chinas-xi-on-cyber-theft-but-remains-wary-idUSKCN0RO2HQ20150926"
        },
        {
          "index": "carson|2016",
          "intext_citation": "(Carson 2016)",
          "preceding_text": "en confrontation. An aggressive public intervention by one country in another’s affairs poses a political-strategic challenge to the victim in the eyes of the domestic public and the international community, who are watching and waiting to see how it responds",
          "footnote": "Carson, Austin. \"Facing Off and Saving Face: Covert Intervention and Escalation Management in the Korean War.\" *International Organization* 70, no. 1 (2016): 103-131. https://doi.org/10.1017/S0020818315000284"
        },
        {
          "index": "bump|2018",
          "intext_citation": "(Bump 2018)",
          "preceding_text": "the computers of the DNC and leaked the emails. This action was part of a broader Russian operation in the months before the presidential election in 2016, intended to influence the election results and to jeopardize the integrity of the democratic processes",
          "footnote": "Bump, Philip. 2018. “Timeline: How Russian agents allegedly hacked the DNC and Clinton’s campaign.” *Washington Post*, July 13, 2018. https://www.washingtonpost.com/news/politics/wp/2018/07/13/timeline-how-russian-agents-allegedly-hacked-the-dnc-and-clintons-campaign/?utm_term=.f7d3b8b7fe50"
        },
        {
          "index": "landler|2016",
          "intext_citation": "(Landler and Sanger 2016; Ryan, Nakashima and De Young 2016)",
          "preceding_text": "At the end of that month, President Obama ordered the expulsion of 35 Russian diplomats from the US, as well as the closure of sites which were used by the Russians to gather intelligence",
          "footnote": "Landler, Mark and David Sanger. 2016. \"Obama Says He Told Putin: 'Cut it Out' on Hacking.\" *New York Times*, December 16, 2016. https://www.nytimes.com/2016/12/16/us/politics/obama-putin-hacking-news-conference.html"
        },
        {
          "index": "masters|2018",
          "intext_citation": "(Masters 2018)",
          "preceding_text": "Homeland Security 2016). The operations of Russian intelligence agencies included “spear phishing” attacks of entities in government agencies, critical infrastructure, think tanks, universities, political organizations, and more, in order to steal information",
          "footnote": "Masters, Jonathan. 2018. \"Russia, Trump, and the 2016 U.S. Election.\" *Council on Foreign Relations*. February 26, 2018. https://www.cfr.org/backgrounder/russia-trump-and-2016-us-election."
        },
        {
          "index": "greenberg|2017",
          "intext_citation": "(Greenberg 2017)",
          "preceding_text": "warned French officials that Russian hackers had compromised some elements of the election",
          "footnote": "Greenberg, Andy. 2017. \"The NSA Confirms it: Russia Hacked French Election 'Infrastructure'\", *Wired*, September 5, 2017. https://www.wired.com/2017/05/nsa-director-confirms-russia-hacked-french-election-infrastructure/"
        },
        {
          "index": "graham|2017",
          "intext_citation": "(Graham, 2017)",
          "preceding_text": "The US became a role model for confronting Russian influence attempts and protecting election campaigns",
          "footnote": "Graham, Chris. 2017. \"French Election: Are Russian Hackers to Blame for Emmanuel Macron's Leaked Emails - and Could They Target UK Election?\" *The Telegraph*, May 6, 2017. https://www.telegraph.co.uk/news/2017/05/06/russian-hackers-blame-emmanuel-macrons-leaked-emails-could/"
        },
        {
          "index": "tham|2018",
          "intext_citation": "(Tham 2018)",
          "preceding_text": "On July 10th, after forensic investigations confirming it was a cyber attack, SingHealth, the Ministry of Health and the Cyber Security Agency (CSA) were informed",
          "footnote": "Tham, Irene. 2018. \"Personal info of 1.5m SingHealth patients, including PM Lee, stolen in Singapore's worst cyberattack.\" *The Straits Times*, July 20, 2018. https://www.straitstimes.com/singapore/personal-info-of-15m-singhealth-patients-including-pm-lee-stolen-in-singapores-most"
        },
        {
          "index": "tham|2018",
          "intext_citation": "(Tham and Baharudin, 2018)",
          "preceding_text": "hed. A senior counsel in the Ministry of Justice summarized in front of the committee how advanced, determined and disciplined the attackers were: \"The skill and sophistication used in the SingHealth attack highlights the challenges that cyber defenders face\"",
          "footnote": "Tham, Irene. 2018. \"Personal info of 1.5m SingHealth patients, including PM Lee, stolen in Singapore's worst cyberattack.\" *The Straits Times*, July 20, 2018. https://www.straitstimes.com/singapore/personal-info-of-15m-singhealth-patients-including-pm-lee-stolen-in-singapores-most"
        },
        {
          "index": "koh|2018",
          "intext_citation": "(Koh 2018)",
          "preceding_text": "018, the Chief Executive of the CSA, David Koh, confirmed that: \"We have determined that this is a deliberate, targeted and well-planned cyber attack, not the work of casual hackers [...] we are not able to reveal more because of operational security reasons\"",
          "footnote": "Koh, David. 2018. \"CSA on Investigations regarding the Deliberate Cyber Attack,\" YouTube video, 0:31, July 20, 2018. https://www.youtube.com/watch?v=toM_WXImOBc&amp;index=3&amp;list=PLH2CR4s1lqyiZZ1n6wVvW_uMMR4fFXrW4"
        },
        {
          "index": "tham|2018",
          "intext_citation": "(Tham and Baharudin, 2018)",
          "preceding_text": "that is critical for the daily life of citizens. As most activities that are essential to the daily lives of Singapore's citizens take place online, there was a concern that the attacker might want to use the data to gain access to additional personal details",
          "footnote": "Tham, Irene. 2018. \"Personal info of 1.5m SingHealth patients, including PM Lee, stolen in Singapore's worst cyberattack.\" *The Straits Times*, July 20, 2018. https://www.straitstimes.com/singapore/personal-info-of-15m-singhealth-patients-including-pm-lee-stolen-in-singapores-most"
        },
        {
          "index": "lee|2018",
          "intext_citation": "(Lee 2018)",
          "preceding_text": "While experts pointed fingers at China",
          "footnote": "Lee, Justina. 2018. \"Suspected China cyberhack on Singapore is a wake-up call for Asia,\" *Nikkei Asian Review*, August 21, 2018. https://asia.nikkei.com/Spotlight/Asia-Insight/Suspected-China-cyberhack-on-Singapore-is-a-wake-up-call-for-Asia"
        },
        {
          "index": "nair|2019",
          "intext_citation": "(Nair 2019; Yufeng 2019)",
          "preceding_text": "ing the identity of the perpetrator would not be in the Republic's national interest [...] We've got nothing to hide here [...] the only part that's been held back are those that pertain to sensitive national security matters and also patient confidentiality\"",
          "footnote": "Nair, Suresh. 2019. \"Singapore Healthcare cyberattack: Not revealing hacker still a 'puzzler'.\" *The Independent*, January 16, 2019. http://theindependent.sg/singapore-healthcare-cyberattack-not-revealing-hacker-still-a-puzzler/"
        }
      ],
      "flat_text": "T. Minárik, S. Alatalu, S. Biondi, M. Signoretti, I. Tolga, G. Visky (Eds.)\n\nPermission to make digital or hard copies of this publication for internal use within NATO and for personal or educational use when for non-profit or non-commercial purposes is granted providing that copies bear this notice and a full citation on the first page. Any other reproduction or transmission requires prior written permission by NATO CCD COE.\n# Covert or not Covert: National Strategies During Cyber Conflict\nGil Baram\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\ngilbaram@tauex.tau.ac.il\nUdi Sommer\nSchool of Political Science\nTel Aviv University\nTel-Aviv, Israel\nhttp://people.socsci.tau.ac.il/mu/udis\nAbstract: Anonymity is considered to be a key characteristic of cyber conflict. Indeed, existing accounts in the literature focus on the advantages of the non-disclosure of cyber attacks. Such focus inspires the expectation that countries would opt to maintain covertness. This hypothesis is rejected in an empirical investigation we conducted on victims' strategies during cyber conflict: in numerous cases, victim states choose to publicly reveal the fact that they had been attacked. These counterintuitive findings are important empirically, but even more so theoretically. They motivate an investigation into the decision to forsake covertness. What does actually motivate states to move into the international arena and publicly expose a cyber attack?\nThe goal of this paper is to understand why and under which geopolitical circumstances countries choose to give up the advantages of anonymity. Whether they wish to Name and Shame opponents for ignoring international norms or whether they try to avoid public humiliation, victims of cyber attacks occasionally reveal the fact that they had been attacked. There is tension between such motivations and the will to protect intelligence sources and the incentives to prevent escalation if an attack is revealed, even more so if the attacker is exposed. Indeed, we find that sunk costs, counterescalation risks and the need to signal resolve—while critical in motivating victims to keep cyber attacks secret—may not suffice under such specific circumstances. By focusing on the victim's side, we draw inspiration from data on real-world cyber attacks in order to place cyber operations in the larger context of secrecy and covert actions in the international arena. In so doing, the aim is to advance the use of empirical data\n* This research was supported by a research grant from the Blavatnik Interdisciplinary Cyber Research Center at Tel-Aviv University\nfor understanding the dynamics of cyber conflict and the decision-making process of states operating in this increasingly complex domain.\nKeywords: covert actions, cyber operations, national cyber strategies\n# 1. INTRODUCTION\nIn its 2019 Global Risks Report, the World Economic Forum ranked cyber attacks as one of the top ten risks, with respect to likelihood and impact . This concern is neither new nor surprising, given the anonymity that cyber attacks afford perpetrators and victims alike. By cyber attacks, which can be a part of an ongoing cyber operation, we mean both CNA (Computer Network Attack) and CNE (Computer Network Exploitation), as they cannot be fully separated .¹ Indeed, cyber technology enables countries to act covertly: the results of offensive actions in the cyber realm and their influence are not always exposed to the public eye. Furthermore, it is not always easy to identify who is behind a given attack. Even if the results of the attack are publicly observable—e.g., damage to a power grid leading to the severance of electricity supply—the victim can still dismiss these effects, arguing that they were the result of a technical fault. To date, our understanding of those strategic interactions between attacker and victim—and their decisions about whether or not to keep attacks covert—is theoretically and empirically limited.\nRecent work regarding covert actions in the international arena offers three mechanisms that make the use of covert actions preferable for countries: sunk costs, counter-escalation risks and signaling resolve . These mechanisms, to be discussed in detail in Section 3, suggest that countries have strong incentives to engage in covert actions and keep those actions away from the public eye, domestically as well as internationally.\nYet an empirical investigation conducted on states' strategies in the wake of cyber attacks reveals a different picture. Notwithstanding the advantages of maintaining secrecy, it is not uncommon for victims to reveal the fact that they have been attacked. What causes victims of cyber attacks to \"abandon\" the covert space and move to the public arena in the aftermath of an attack? Existing literature does not offer satisfying answers (for exceptions see Edwards, Furnas, Forrest and Axelrod 2017; Poznansky and Perkoski 2018). To understand the puzzling strategic choice to abandon the advantages of ambiguity in favor of a public strategy, we need to understand the tradeoffs between the strategies. As not all countries choose to either publicly reveal\n¹ As Libicki concluded, “as long as the methods of cyber espionage look like the methods of cyberattack the discovery of one will raise fears about the imminence of the other.” the attack or to hide it, we recognized that the strategies of the victims vary between four possible approaches:\n(1) \"Pointing a finger\" – publicly disclosing that an attack occurred (revealing vulnerability) and publicly putting the responsibility on a specific attacker;\n(2) Admitting injury – publicly disclosing that an attack took place, while failing to identify an attacker;\n(3) Revealing damage – disclosing damage but denying that it had been caused by a deliberate hostile attack (claiming technical malfunctions, system “glitches” etc.);\n(4) Maintaining ambiguity – denying or downplaying any damage, thus reducing the chances that the attack would ever be divulged.\nTable 1 summarizes those four strategies with illustrations from cyber attacks in recent years.\nTABLE 1: VARIANCE IN VICTIM'S STRATEGIES DURING CYBER ATTACKS, WITH REAL-LIFE EXAMPLES\n|   | Publicized |   | Concealed  |   |\n| --- | --- | --- | --- | --- |\n|  Victim's Strategy: | (1) Publicizing the attack and blaming the attacker (Public Strategy #1) | (2) Publicizing the attack and not blaming the attacker (Public Strategy #2) | (3) Partial concealment (claim of fault) | (4) Full concealment of the attack  |\n|  Real-life Example: | DNC hack 2016 | SingHealth hack 2018 | USS John S McCain collision 2017 | ---  |\nOur discussion focuses on the first two options, where the victim decided to make the attack public and sometimes also to reveal the attacker's identity. The third option (partial concealment) deals with cases where the alleged victim claims that a certain event was the result of a technical problem and not due to a cyber attack. To illustrate this option in a nutshell—since we do not delve into its details in the paper—let us look at the summer 2017 case of the USS John S McCain, which collided with a merchant ship in the Straits of Malacca, resulting in the death of 10 sailors . The Chief of Naval Operations argued that there was no evidence suggesting the accident was the result of a cyber attack. However, according to experts, since the destroyer had a large navigational team as well as another team in charge of radar, it was impossible that human error had led to the accident. In addition, both the destroyers USS McCain and the USS Fitzgerald, which had been hit in a similar incident in June 2017, belong to the Seventh Fleet. Experts believed these attacks may have been related to Chinese or Russian intervention .²\nThe Navy's investigation found no evidence of a cyber attack .\nAfter discussing the place of attribution and secrecy in cyber operations and their impact on states' strategic calculations, we develop our theoretical framework and examine two cases – hacking into the Democratic National Committee in 2016 and the SingHealth hack in 2018. It is particularly in the analysis of those two well-studied cases that our theoretical framework helps to shed new light on the national and international considerations leading countries to give up secrecy. We highlight the taxonomy of the different prototypes of these strategies and help to identify when countries might choose each strategy.\n## 2. ATTRIBUTION AND SECRECY – AN INHERENT COMPONENT OF CYBER OPERATIONS?\nThe covertness of cyber attacks can be expressed in two ways. First, the attack itself is covert. Its technological characteristics enable an attacker to carry out the operation in a clandestine way, without revealing how it was carried out. The second aspect concerns the attackers themselves, who can maintain covertness.³ It is often difficult to point out the source of an attack and to attribute it to a particular attacker. This problem is known as the Attribution Problem.\nThe Attribution Problem arises when the victim identified the attack, but has yet to identify the attacker. The immediate effect of this lack of certainty raises questions concerning the feasibility of retaliation, and the desire for it. Such a situation creates uncertainty as to the attacker's demands. It can be difficult to determine by technical means the motivation for an attack . So, as Rid and Buchanan argue, “attribution is what states make of it” .\nWhen an attribution process is conducted using intelligence sources and methods, it is difficult to expose it without endangering these sources. But if the domestic public—especially in a democratic polity—perceives the attribution as unreliable, the state may lose the legitimacy to retaliate . An important part of the attribution process is its political implications. Indeed, “communicating attribution is part of attributing” . When an attack is executed, security researchers attempt to find out who is behind it. In order to do so, they examine the code, techniques and protocols that the attacker used. However, this is not considered legitimate proof in court and is seen, especially today, more as playing a “blame game” .\nFaith-based attribution happens when actors blame other actors for an attack if they believe the former carried it out. This also happens in modern politics, where politicians knowingly make incorrect statements, simply because no one checks their\nOn the distinction between clandestine and covert operations, see Poznansky and Perkoski, 2018, 403.\nvalidity . Healey (2013) also argues that scholarship should move forward from dealing with the attribution problem. Instead of asking “who is behind the attack?” the question should be “who is to blame for it?”  and what are the political consequences of blaming?\nThis study adopts Healey's approach in the sense that the technical attribution problem is not as crucial for our framework. In practice, countries routinely accuse each other even without disclosing the full technical process that led them to attribute the attack to a particular attacker. This was the case in the Sony hack (2014) and the \"WannaCry\" attack (2017) when the US blamed North Korea without fully disclosing technical evidence.\nDespite the inherent overlap between cyber operations and covert actions, the scholarship has not fully explored this connection and has studied these fields separately for the most part. On the one hand, the cyberwarfare scholarship in International Relations and Security Studies hardly deals with the different aspects of secrecy in cyber operations, and mainly accepts the assumption that anonymity is an immutable feature of cyberspace rather than something actors select into and which they can therefore forfeit (for exceptions see Lupovici 2016; Poznansky and Perkoski 2018). On the other hand, scholars dealing with covert operations largely tend not to include cyber operations in their analyses (for exceptions see Brecher 2012). This study is an important step towards merging these bodies of literature.\nRecent work regarding secrecy in cyberspace tends to study the considerations before the attack (Edwards, Furnas, Forrest and Axelrod 2017), the perpetrators' calculations , and the effect of cyber attacks on democratic states' accountability to their citizens . While these studies are an important step in combining the two literatures, more research is needed in order to understand cyber operations as covert actions and to investigate to what extent countries choose to use the advantages of this covertness or to give it up. In the following sections these considerations are examined from the victim's point of view. We focus on the victim, since in most circumstances the victim is the first to make a choice about whether to use covertness or forsake it.\n# 3. GIVING UP SECRECY AS A NATIONAL STRATEGY\nThree mechanisms are offered in the literature for making the use of covert actions preferable for countries. First are sunk costs, which refer to situations where states decide to take covert action because of non-recoverable resources: by choosing to use covert actions, leaders can employ a more \"creative\" way to address security threats\n. Second are counter-escalation risks: using covert action can appear credible because of its impact on the risk of crisis escalation, since leaders using covert signaling tools can be free to engage in more aggressive behavior. This explanation is based mainly on the audience costs literature, which identifies a link between the type of action that the state takes and the costs the leader will have to bear as a result (see Fearon 1994; Tomz 2007). The last mechanism is signaling resolve: under certain conditions, the use of covert operations allows states to convey the desired message to their rivals, and therefore they do not have to act in the public arena .\nBut it seems that during cyber attacks, that might be a part of an on-going operation or a one-time attack, the options available to the victim are different, and revealing the attack has its benefits. Generally, there are cases where the incentives to remain covert are not enough and decision-makers have other incentives—such as avoiding public humiliation, warning the attacker from taking future actions and more—that lead them to decide to publicly reveal the attack.\nOnce the victim has identified the attack and decides to use a public strategy, it has two major options as mentioned earlier: (1) reveal the attack and point a finger towards the attacker, or (2) reveal only the fact that the attack has occurred, without disclosing the identity of the alleged attacker. Figure 1 summarizes the strategies at earlier stages and as they lead up to the strategies at this stage.\nFIGURE 1: VICTIM'S STRATEGIES DURING A CYBER ATTACK\nTo assess the conditions under which countries that have suffered a cyber attack choose to reveal the attack and go public, we examined all known cyber attacks between rival states from 2015 to mid-2018. The framework of the Dyadic Cyber Incident Dataset (DCID) v1.1 (Maness, Valeriano and Jensen 2017) was the basis for the coding, and\nnew attacks from the Council on Foreign Relation Cyber Operations Tracker were added . The unit of analysis in both datasets is state-sponsored cyber attacks. $^{4}$  We focus on state-sponsored actors because our purpose is to identify when states and their proxies conduct cyber operations in pursuit of their foreign policy interests. New variables originally collected by us were added in order to examine the victims' strategies. All data collected are open source. $^{5}$\nOur data indicate that there is wide variation in the victims' strategies: Between 2015 and mid-2018, 75 cyber attacks were conducted between rival states. In 44, the victims chose to address the attack publicly. Of those, in 16 the victim revealed the attack and did not attribute it. In the remaining 28, the victim revealed the attack and publicly attributed it to a specific attacker (Figure 2). Out of the 28 cases where victims chose to publicly reveal the attack and the attacker, only three states were not democratic.[6]\nThe data suggest that states frequently choose public strategies. Although at first glance, revealing the attack might be perceived as exposing a country's weakness, there are several considerations with positive implications, which could lead the country to decide to reveal the attack. The question is: why do states act that way, and in the pursuit of which advantages?\nFIGURE 2: VARIANCE IN VICTIMS' STRATEGIES BETWEEN 2015 AND MID-2018\n\nIn most cyber attacks the victim does not have full confidence regarding the identity of the attacker. Furthermore, there are questions around to what extent a victim that chooses to accuse the attacker is certain of the accuracy of its identification. If it possesses technical evidence that can be exposed, the attacker will have more difficulty denying the charges. However, more often than not this is not the case. It is common for a victim to point a finger at a particular attacker even without disclosing the full technical evidence that led to that attribution.\nIn the political and technical landscapes of our time, it is important to consider cyber attacks in the broader geostrategic context. In many cases there is an ongoing political tension that means it is in the victim’s interests to reveal the aggressive actions of its adversary, a strategy known as Naming and Shaming. A Naming and Shaming strategy means publicly identifying perpetrators that are “doing wrong” and undermining international law and the rules-based order. This might look like the victim is admitting to its weakness. Yet, in a long-term cost-benefit analysis, sometimes it is better to “call out” the aggressor as violating international norms than to remain silent. This might help the victim and its allies to improve their cybersecurity readiness, while also reaffirming the victim’s commitment to law and norms (on publicizing states activities see Carnegie and Carson 2018).\nAn additional consideration in revealing attacks is the need to avoid public humiliation. The victim can decide to disclose the attack due to the desire to avoid humiliation and degradation, which will most likely accompany the publication of the said attack by the attacker or by a third party. In a post-Snowden reality, remaining covert is hard. The general public is more aware of state activities and has the means to publicize them via social media as well as in various other ways. As a result, the political costs of transparency may be less than those associated with hiding an attack. This minimizes the victim’s reputational damage and helps to improve overall cybersecurity of both victim and international allies alike.\nAnother goal may be showing strength in front of an international audience by warning the attacker against taking future actions. By disclosing the attack and accusing the attacker, the victim conveys a message that it has identified the attack and may intend to retaliate; plus, it has the technical know-how to identify the attack and point out the entity behind it. If the victim can say to the presumed attackers that it knows what they are up to, it implies that it also knows a lot more about the attackers’ operations and capabilities. This may introduce uncertainty into the decision-making process and induce a strategic effect. Such was the case with the Obama-Xi agreement from 2015 that reduced Chinese industrial cyber espionage for a limited period of time. A country that exposes the attack and points a finger at the attacker, while showing its methods of coping and the ways in which it operates to strengthen its defense capabilities, is portrayed as a leader in the international arena in dealing with cyber attacks.7 Other countries will observe and learn from it, as was the case with the Democratic National Committee hack, which is discussed in detail later on.\n## Motivations not to reveal the attacker Assuming that the victim identified the attacker, there are at least two main reasons why the victim would not want to reveal the attacker’s identity in public: (1) Safety of intelligence sources. The desire to avoid exposing intelligence and sources is an important reason not to make the identity of the attacker public. This is even more acute in cyberspace, because it is difficult to identify the attacker only using technical tools. Therefore, it is often necessary to use intelligence of various kinds, such as advanced technological and even human resources to obtain the necessary information. These sources are considered highly important and valuable for the country’s intelligence services, and therefore it is essential to protect their safety and not to expose them.\n(2) Preventing escalation. There may be differences in the existing technological capabilities and power of the victim and the attacker. If this is the case, the victim might choose not to publicize the attack in order to avoid the chance that the exposure would lead to open confrontation. An aggressive public intervention by one country in another’s affairs poses a political-strategic challenge to the victim in the eyes of the domestic public and the international community, who are watching and waiting to see how it responds. Not revealing the identity of the attacker allows the victim to refrain from the obligation to respond, contain the attack and prevent undesirable escalation.\nWe expect victims to choose to reveal the attack publicly and attribute it when (a) they want to expose the aggressor and blame them for violating international norms; (b) avoid international and domestic humiliation; (c) warn the attacker. However, by revealing the attack and not attributing it, the victim can also avoid humiliation and there are covert ways to convey a deterrent message. Therefore, we hypothesize that in this case key reasons for not attributing the attack are (a) the safety of intelligence sources; and (b) preventing escalation. The two cases tested in the next section will help examine these expectations.\n\n# 4. GIVING UP SECRECY IN CYBER OPERATIONS – REAL-LIFE CASES\nTwo major cyber attacks that occurred in the past three years are examined. They allow us to illustrate the public strategies identified and described theoretically above.\n## Democratic National Committee Hack 2016\nIn April 2016, hackers gained access into the Democratic National Committee (DNC) network, stealing several gigabytes of data. From June-November 2016, WikiLeaks published 20,000 emails of DNC members, and in July 2016 the FBI began an investigation of the hack. The investigation revealed that in the months prior to the WikiLeaks releases, two groups of hackers operating under the auspices of the Russian government broke into the computers of the DNC and leaked the emails. This action was part of a broader Russian operation in the months before the presidential election in 2016, intended to influence the election results and to jeopardize the integrity of the democratic processes .\nOn December 2016, President Obama publicly accused Russia of carrying out these attacks, warned that it must stop and said that the US had offensive cyber capabilities and it might respond. At the end of that month, President Obama ordered the expulsion of 35 Russian diplomats from the US, as well as the closure of sites which were used by the Russians to gather intelligence . The Department of Homeland Security (DHS) and the FBI published a joint statement describing the process of the Russian cyber attack, directly accusing military and civilian Russian intelligence agencies. According to the statement, “The US Intelligence Community is confident that the Russian Government directed the recent compromises of emails from US persons and institutions [...] only Russia’s senior-most officials could have authorized these activities.” (Department of Homeland Security 2016). The operations of Russian intelligence agencies included “spear phishing” attacks of entities in government agencies, critical infrastructure, think tanks, universities, political organizations, and more, in order to steal information .\nThe fact that the US chose to publicly accuse Russia of the attack helped strengthen its international standing by calling out Russia’s undermining of the international order in trying to manipulate and sabotage democratic procedures. Such attempts to influence election results are perceived by Western democracies as damaging their political and institutional integrity. Other countries also saw and learned from the American experience. Following the exposure of the attack, the US became the focus of interest for other democratic countries—such as France and Germany—which were about to hold their own elections and feared Russian intervention. For example, the NSA\nwarned French officials that Russian hackers had compromised some elements of the election .\nThe experience gained by the US in dealing with Russian activity enabled it to share information and assist other countries. The US became a role model for confronting Russian influence attempts and protecting election campaigns . This case demonstrates the value of our theoretical framework: by publicly revealing the attack, the US avoided public humiliation that could have happened if a third party or Russia itself had revealed the attack instead. Also, by conveying a deterrent message to the Russians, the US made a coercive threat and demonstrated resolve. It showed its will to spend valuable resources in order to make Russia pay a price for its offensive actions.\n# SingHealth Hack 2018\nOn 4 July 2018, data administrators detected unusual activity on one of SingHealth's IT databases. With more than two million patients, SingHealth is the largest health provider in Singapore. The security team immediately investigated the suspicious activity to determine its nature and whether it was malicious. On July 10th, after forensic investigations confirming it was a cyber attack, SingHealth, the Ministry of Health and the Cyber Security Agency (CSA) were informed . The cyber attack resulted in the personal details of 1.5m SingHealth patients being accessed and copied; this included names, identification numbers, address, gender, race and date of birth, including the personal data of Singapore's Prime Minister. On July 20th, even while investigations were still under way, SingHealth and investigating authorities assessed that the situation had been stabilized and informed the public of the cyber attack, (Singapore Ministry of Health 2018).\nFollowing the attack, a public Committee of Inquiry was established. A senior counsel in the Ministry of Justice summarized in front of the committee how advanced, determined and disciplined the attackers were: \"The skill and sophistication used in the SingHealth attack highlights the challenges that cyber defenders face\" . Speaking at a press conference on July 20th 2018, the Chief Executive of the CSA, David Koh, confirmed that: \"We have determined that this is a deliberate, targeted and well-planned cyber attack, not the work of casual hackers [...] we are not able to reveal more because of operational security reasons\" . From Koh's words it seems that for national security reasons the CSA wanted to keep its intelligence sources safe and did not reveal any information that could risk them.\nAlthough the head of the CSA estimated that a nation state was behind the attack, and many security analysts even estimated it was China, Singapore was careful not to reveal the identity of the attacker in public. The decision to make the attack public\n\nAnother consideration for exposing the attack, but keeping the identity of the attacker undisclosed, was concern about public humiliation. If the attacker or a third party exposed the attack before the Singaporean authorities did, it could damage the reputation of the administration. In such circumstances, the administration would appear to have failed to protect its citizens and to have made an attempt to conceal it.\nWhile experts pointed fingers at China, authorities remain tight-lipped. One explanation for that is the need to avoid escalation. China and Singapore have a close relationship, but differences have been experienced during numerous high-profile events, including Singapore's stance against China regarding the South China Sea dispute. The power differential between the two, and the will of Singapore not to take any steps that could risk this relationship and escalate the situation, seem to be among the main reasons why Singapore chose not to reveal the identity of the attacker. Further support for the decision not to reveal the identity of the attacker was given by the Minister-in-Charge of cybersecurity. In January 2019, the Minister stated that:\"Revealing the identity of the perpetrator would not be in the Republic's national interest [...] We've got nothing to hide here [...] the only part that's been held back are those that pertain to sensitive national security matters and also patient confidentiality\".\n# 5. CONCLUSIONS Reasons ranging from attempts to Name and Shame or avoid public humiliation, to incomplete confidence about the identity of the attacker may lead victims of cyber attacks to reveal the fact they had been attacked. There is tension, however, between such reasons and the motivation to protect the safety of intelligence sources and the will to prevent escalation if an attack is revealed and even more so if the attacker is exposed. The preliminary results and analyses presented here demonstrate that despite a range of reasons to remain covert, countries that suffered cyber attacks have sufficiently strong incentives to reveal the fact they had been attacked. The three mechanisms presented in the literature as motivating decision-makers to keep the attack covert—sunk costs, counter-escalation risks and signaling resolve—do not always suffice in the cyber reality. Not only would victims make the attack public, but under certain circumstances, they would even expose the attacker. This finding is both unintuitive and largely undocumented in the literature.\nThe will to avoid domestic and international humiliation if the attack will be exposed by a third party leads countries to give up the advantages of secrecy in cyberspace and reveal the fact that they had been attacked. Furthermore, attributing the attack to a specific attacker helps the victim to warn the attacker from taking future actions and be model for other countries who deal with similar attacks. Such was the case in the DNC hack where the US not only set the standard for other countries in the West but also aided them in preventing potential threats to the integrity of their democratic process.\nNational security considerations such as keeping intelligence sources safe and avoiding escalation play an important part in the decision to reveal the attack without attributing it to a specific attacker. Such was the case in the SingHealth hack. To protect citizens' online identity and e-government business, the attack was made public by the government in Singapore. Yet, its source remained undisclosed, possibly to avoid causing a geostrategic threat of escalation.\nFuture research is essential. In particular, in this paper we limited the theoretical discussion and empirical work to public strategies exclusively. We did not deal with the other two options from Table 1 – partial concealment and full concealment of the attack and did not analyze the attackers’ strategies and the utility of the interaction between both sides.\n## Acknowledgments We thank Dana Litman, Adi Lotan and Eden Poch for excellent research assistance."
    }
  },
  "citation_summary": {
    "style": "author_year",
    "dominant_bucket": "author_year",
    "dominant": {
      "intext_total": 32.0,
      "success_occurrences": 32.0,
      "success_unique": 26.0,
      "bib_unique_total": 73.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 0.3561643835616438,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "author_year"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 2.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 3.0,
        "highest_intext_index": 5.0,
        "missing_footnotes_for_seen_total": 2.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 2.0,
        "success_occurrences": 2.0,
        "success_unique": 2.0,
        "bib_unique_total": 2.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 1.0,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 3.0,
        "highest_intext_index": 5.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "tex_superscript"
      },
      "numeric": {
        "intext_total": 1.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 32.0,
        "success_occurrences": 32.0,
        "success_unique": 26.0,
        "bib_unique_total": 73.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.3561643835616438,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "Covert or not Covert: National Strategies During Cyber Conflict",
    "subtitle": "School of Political Science",
    "document_type": "conference_paper",
    "venue": "2019 11th International Conference on Cyber Conflict: Silent Battle",
    "publication_year": 2019,
    "authors": [
      "Gil Baram",
      "Udi Sommer"
    ],
    "affiliations": [
      "School of Political Science",
      "Tel Aviv University",
      "This research was supported by a research grant from the Blavatnik Interdisciplinary Cyber Research Center at Tel-Aviv University"
    ],
    "emails": [
      "gilbaram@tauex.tau.ac.il"
    ],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "Anonymity is considered to be a key characteristic of cyber conflict. Indeed, existing accounts in the literature focus on the advantages of the non-disclosure of cyber attacks. Such focus inspires the expectation that countries would opt to maintain covertness. This hypothesis is rejected in an empirical investigation we conducted on victims' strategies during cyber conflict: in numerous cases, victim states choose to publicly reveal the fact that they had been attacked. These counterintuitive findings are important empirically, but even more so theoretically. They motivate an investigation into the decision to forsake covertness. What does actually motivate states to move into the international arena and publicly expose a cyber attack?",
    "keywords": [
      "covert actions",
      "cyber operations",
      "national cyber strategies"
    ],
    "publication_dates": {},
    "identifiers": {
      "doi": [
        "10.1017/S0020818318000176",
        "10.1017/S0020818315000284",
        "10.1080/09636412.2017.1243921",
        "10.1073/pnas.1700442114",
        "10.2307/2944796",
        "10.1093/cybsec/tyv003",
        "10.1111/insp.12082",
        "10.1093/jogss/ogy022",
        "10.1080/01402390.2014.977382",
        "10.1017/S153759271800110X",
        "10.1017/S0020818307070282"
      ],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "http://people.socsci.tau.ac.il/mu/udis"
      ]
    },
    "references_block_count": 1,
    "references_entries_estimated": 36,
    "heading_count": 12,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 32,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 0.96875,
      "footnote_coverage": 1.0,
      "unique_index_count": 26
    },
    "footnotes_quality": {
      "intext_total": 2,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 2,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "author_year",
      "recommended_style": "unknown",
      "aligned": true,
      "signals": {
        "superscript_hits": 4,
        "superscript_definition_lines": 1,
        "numeric_bracket_hits": 1,
        "numeric_endnote_lines": 0,
        "author_year_hits": 1
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 73.0,
      "dominant_bib_coverage_rate": 0.3561643835616438,
      "dominant_link_target": "bibliography",
      "dominant_unresolved_flag": "unresolved_reference_links"
    },
    "heading_validation": {
      "heading_count": 12,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": true,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": true,
        "emails": true,
        "orcids": false,
        "abstract": true,
        "keywords": true,
        "venue": true,
        "persistent_identifier": true,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 2,
        "affiliations": 3,
        "emails": 1,
        "orcids": 0,
        "keywords": 3,
        "doi": 11,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 1
      },
      "coverage": {
        "core_coverage": 1.0,
        "email_author_link_rate": 1.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [],
        "toc_dot_lines": 0
      },
      "flags": []
    },
    "flags": [
      "missing_preceding_text",
      "low_bib_coverage",
      "footnotes_bucket_unresolved"
    ]
  },
  "updated_at_utc": "2026-02-14T08:28:03.943848+00:00"
}