{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\SM27LBGY\\Taillat - 2019 - Disrupt and restraint the evolution of cyber conflict and the implications for collective security.pdf",
  "custom_id": "432",
  "response": {
    "id": "batch-b6235e9e-433-b0917b04-e87c-4548-b5a6-5aa53b07713d",
    "custom_id": "432",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "Check here\n\nContemporary Security Policy\n\nR\n\nRoutledge Taylor &amp; Francis Group\n\nISSN: 1352-3260 (Print) 1743-8764 (Online) Journal homepage: www.tandfonline.com/journals/fcsp20\n\n# Disrupt and restraint: The evolution of cyber conflict and the implications for collective security\n\nStéphane Taillat\n\nTo cite this article: Stéphane Taillat (2019) Disrupt and restraint: The evolution of cyber conflict and the implications for collective security, Contemporary Security Policy, 40:3, 368-381, DOI: 10.1080/13523260.2019.1581458\n\nTo link to this article: https://doi.org/10.1080/13523260.2019.1581458\n\nPublished online: 26 Feb 2019.\n\nSubmit your article to this journal\n\nArticle views: 1931\n\nView related articles\n\nView Crossmark data\n\nCiting articles: 2 View citing articles\n\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=fcsp20",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2314,
              "width": 1762
            }
          },
          {
            "index": 1,
            "markdown": "CONTEMPORARY SECURITY POLICY\n\n2019, VOL. 40, NO. 3, 368-381\n\nhttps://doi.org/10.1080/13523260.2019.1581458\n\nRoutledge\n\nTaylor &amp; Francis Group\n\nCheck for updates\n\n# Disrupt and restraint: The evolution of cyber conflict and the implications for collective security\n\nStéphane Taillat\n\nInternational Relations and Strategic Studies, St Cyr French Army Academy, Guer, France\n\n# ABSTRACT\n\nIn the last decade, cyber conflict has become a main feature of international politics and a growing concern for strategic stability and collective security. Unfortunately, cyber conflict suffers from a lack of conceptual clarity about its impact on collective security and a lack of consensus among international actors on how to interpret it. This article proposes to understand cyber conflict as an evolving process driven by two factors: the way in which digital space is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber have been included in the field of national and international security. Both tend to encourage offensive behavior but also demonstrate features pointing to restraint.\n\nKEYWORDS Collective security; cyber conflict; international security\n\nCyber conflict suffers from a lack of conceptual clarity and a lack of consensus among key international actors on how to interpret it. For years, academics have struggled to account for the potentialities and effects of digital technologies on conflict dynamics. The debate has focused on the inclusion of cyber conflict in the Clausewitzian conceptualization of war (Rid, 2012; Stone, 2013). Several researchers have taken into account the specificities of cyber confrontation but have also sought to explain the gaps between expectations and behaviors, whether in terms of attribution (Rid &amp; Buchanan, 2015), deterrence (Fischerkeller &amp; Harknett, 2017; Libicki, 2009; Nye, 2016/2017), escalation dynamics (Lin, 2012; Valeriano, Jensen, &amp; Maness, 2018), coercion (Borghard &amp; Lonergan, 2017; Gartzke &amp; Lindsay, 2016; Sharp, 2017), and the offensive-dominant character of conflict in cyberspace (Gartzke &amp; Lindsay, 2015).\n\nOthers have attempted to account for the empirical evolution of cyber conflict toward restraint or aggression below the threshold of armed force (Steiger, Harnisch, Zettl, &amp; Lohmann, 2018; Valeriano &amp; Maness, 2015) or to question these dynamics through the prism of covert actions and deniability (Joseph &amp; Poznansky, 2017; Poznansky &amp; Perkoski, 2018). Finally, the\n\nCONTACT Stéphane Taillat stephane.taillat@st-cyr.terre-net.defense.gouv.fr\n\n© 2019 Informa UK Limited, trading as Taylor &amp; Francis Group",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 2,
            "markdown": "debates have focused on the relevance and methods of social sciences for analysing cyber conflict (Kello, 2013, 2014, 2017; Valeriano & Maness, 2014). Jurists have also examined the particularities of cyberspace and cyber operations to assess the possible application of legal categories, without reaching consensus or formally guiding governments (Schmitt, 2013, 2017).\n\nIn addition to these academic debates, there are divergent representations between the main powers concerning the challenges and threats related to the cyber domain in the context of a growing opposition between their interests. These divergences stem from the conceptualization of cyberspace. For China and Russia, for example, the information space includes all digital networks but also the political and social sphere. The main threat therefore stems from the ability of opponents (mainly the United States and Western countries) to destabilize these political regimes and threaten their control over society. For the United States and many European states, cyberspace mainly includes computer networks and the economic, industrial, or military activities that depend on them. The threat is therefore more about a competitor's ability to exploit the high digitization of these societies to gain an asymmetric advantage or cause catastrophic damage.\n\nThere is therefore a heterogeneity of values and interests, fueled by the logics of their long-term strategic competition. As a result, this heterogeneous feature of the international system results in the absence of a framework of shared meanings to limit tensions, manage conflicts, and control the risk of escalation. Moreover, the possibility of exploiting cyberspace from an asymmetrical perspective contributes to emboldening revolutionary or revisionist actors, as evidenced by the shift towards increasingly risky modes of action and strategies that contribute to disrupting the entire international normative system in peacetime.\n\nThe difficulty of defining cyber conflict and establishing international rules is problematic from the point of view of collective security. This difficulty is part of a more general evolution toward the blurring of conventional categories on conflicts, war and warfare. The purpose of this article is not to resolve these differences or to synthesize these conceptual approaches. In this article, I postulate that war and conflict are categories that depend on how actors interpret and integrate them into their practices and strategies. Thus, the current heterogeneity of the international system is fueled and in turn feeds these divergences of interpretation and the polarization of rivalries. Therefore, it is not possible to objectively define contemporary cyber conflict.\n\nCyber conflict is subject to changing evolutions and characteristics. I thus propose to understand these changing evolutions and characteristics through an analytical framework structured around two processes: the way in which digital domain is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber security have been included in the field of national and international security. This has two",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 3,
            "markdown": "consequences for collective security. First, the configuration of the cyber domain produces incentives for offensive action but within a framework characterized by low operational efficiency. Second, cyber conflict is particularly dependent on interactions between actors and therefore on strategic contexts such as long-term strategic competition.\n\nThis article will proceed in two steps. First, it will focus on how the configuration of the cyber domain affects the incentive to act offensively while remaining below a certain threshold of aggression. Second, it will analyze how cyber capabilities have been included in national and international security issues, generating a strong sensitivity to cyber security issues.\n\n## Strategic opportunities and challenges in the digital domain\n\nCyberspace is a field of confrontation, a challenge, and a means by which rivalries can be expressed. It covers an increasingly broad range of economic, political, social, cultural and security dimensions and activities, creating interdependence between them at every geopolitical level. This field is characterized by the interaction between technologies, uses, power rivalries and the increasing integration of private and public, military and civil, national, transnational, regional, and international dimensions. Cyberspace is therefore the result of a historical and socio-political process that in turn sets out a space of strategic choices, which shapes the behavior of both state and non-state actors.\n\n### The ubiquity of vulnerabilities\n\nThe pervasiveness of vulnerabilities is the main feature of cyberspace (Libicki, 2009, p. xiv). Thus, this space is marked by a large number of targets, entry points, and attack vectors. However, the distribution of potential targets is uneven. The traditional division into physical, logical, informational, and social layers provides a first framework for analysis. But it is possible to specify it with other frameworks.\n\nFirst, the type of infrastructure. As Smeets (2018) shows, vulnerabilities can be hardware, software, networks, and communication protocols between machines as well as individuals or organizations. He proposes to classify them according to the potential to exploit them on the one hand, and the potential to remedy them on the other. Software vulnerabilities are easier to exploit than hardware or network vulnerabilities, but also easier to patch once discovered (pp. 13--14). Human vulnerabilities also appear to be more related to organizational cultures and procedures than to individual cognitive biases (PROOFPOINT, 2018; Schneier, 2008; Weber & Jean-Philippe, 2018).\n\nSecond, not all targeted systems are accessible in the same way. A system can be accessible through the global Internet network or from a system in a closed network that requires access to this network first. Kello (2017) proposes",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 4,
            "markdown": "to map cyberspace by distinguishing between the global network (the Internet), the WorldWideWeb, and a “cyber archipelago” composed of the “air gaped” networks (p. 45). The latter are not inaccessible but require more resources and effort or even risks taking. Third, the geopolitical distribution of assets, digital infrastructures, or legal architectures determines resources and vulnerabilities. The geography of transoceanic cables invites us to think of cyberspace in terms of chokepoints or according to a logic of interdependence (Starosielski, 2018). The same applies to the location of data centers or the legislative requirement for Web companies to host national user data on national soil. Hence the strategic implications of a potential “Internet Balkanization”: a political fragmentation of the Internet but also the creation of a striated space limiting the capacities of access, maneuver, and the production of operational effects.\n\nThis mapping thus delimits a space for the strategic choices of the actors. It also helps to better explain the frequency of low-intensity attacks against soft targets and the relative difficulty of putting critical infrastructure at risk. Nevertheless, it also shows why no intrusion is insignificant in terms of these crucial issues and assets for national security and collective security.\n\n### Security and strategic dilemmas\n\nTechnologies contribute to uncertainty about the identity and intentions of an attacker. There is therefore a security dilemma specific to cyber conflict. This is based on the difficulty in interpreting intrusions and interference either as operational preparation, as intelligence collection, or as hold at risk operation. At the same time, the specificities of cyber operations encourage penetration of others' networks and interference in their processes (Buchanan, 2017a). The increase in cyberspace-related issues (see below) contributes to these dynamics. This explains the importance of the attribution process, which Rid and Buchanan (2015) have shown to be ambiguous and of a political and strategic nature.\n\nImputing an action to an author is made more complex and time-consuming due to technical factors allowing relative anonymity, organizational factors allowing not to acknowledge responsibility but also political factors. Therefore, a victim's probability of attributing and responding depends on his or her cost structure, that is what is at stake for the victim. However, from the point of view of the attacker, it is not possible to quantify exactly those elements which may contain material or symbolic aspects, but which also depend on the context in which the decision-makers are placed. In the case of issues considered important or even existential, the trade-off between the urgency of attributing and responding and the risks associated with incomplete communication or hasty response is less acute than in the case of less important issues. The propensity of decision-makers to take",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 5,
            "markdown": "risks is therefore an important variable, both for the victim and for the current or potential aggressor.\n\nThe complexity of the attribution process results in a latency period with a significant impact on the credibility of deterrence. Besides, the nature of the information making it possible to conclude that an actor is liable requires compromises between preserving the capacities that made it possible to collect these elements and presenting the case with the most indisputable evidence possible. As a result, the attribution process weakens an actor's ability to demonstrate resolution and keep aggressors at bay.\n\nDigitization therefore increases the margin of maneuver below the threshold of the use of force. This therefore allows actors to pursue several of their objectives without incurring the penalties associated with the use of aggression, or at least by limiting these risks. Nevertheless, this freedom of action is hampered in practice because of its dependence on three factors. First, by the type of weapon or tactic used. On the one hand, offensive means are unevenly distributed between a small number of weapons or targeted actions (of which Stuxnet is an archetype) (Zetter, 2015) and a very large number of more indiscriminate tools (Distributed Denial of Service attacks for example) (Rid & McBurney, 2012; Smeets, 2018). On the other hand, this situation reflects the difficulty of producing the desired effects either on the targeted social groups or organizations or on the targeted digital systems. The question of force control and its effects is therefore particularly acute when the action can produce side effects or backfires. Unless the initiator of the attack seeks to produce such indiscriminate effects, takes the risk of their probability or can exploit them in a timely manner to increase his or her reputation for resolution or capacity, this first factor produces a negative incentive to take risks.\n\nSecond, the margin for maneuver depends on the organizational sophistication of the attacker. This includes the available resources, the ability to mobilize and exploit them to produce the desired results and the propensity to limit errors and friction at least in planning and managing the operation (Buchanan, 2017b). This point highlights the dilemmas and challenges characteristic of a cyber operation: It requires time, it is guided by the issue of operational security, it requires flexibility and the ability to seize opportunities that develop in interaction with the adversary and the environment.\n\nThird, it depends on the target's behavior, either in previous attacks or through the precedent resulting from its own offensive operations. These successive behaviors shape expectations and beliefs, but also future norms. The case of the United States is particularly enlightening. Stuxnet may have set a precedent for offensive or even disruptive actions by others, either in retaliation or to prevent further operations (the Iranians and the Shamoon virus against Saudi Aramco in August 2012 or the multiple operations carried out against the banking system, universities or certain actors in the American",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 6,
            "markdown": "energy sector since 2013), or as justification (the use of the BlackEnergy malware against Ukrainian power plants in December 2015 attributed to Russia). On the contrary, the Obama administration's relative restraint in the face of the increase in attacks below the threshold for the use of armed force may have been interpreted as weakness and an incentive to take more risks.\n\nThis configuration is therefore a framework through which it is possible to weigh the constraints and opportunities of actions in relation to the effects to be achieved. Two contradictory trends emerge. On the one hand, cyber operations have a relative value to produce the expected effects. On the other hand, there is an incentive to act below a certain threshold. The result is the possibility of unexpected and counterproductive effects that suggest that the question should be considered in terms of strategic objectives and issues.\n\n## Diverging issues and conflicting practices in national and international security\n\nThe representations of issues, threats, and opportunities partly explain how key actors have integrated cyber security, cyber warfare, and cyber policy issues into their strategies and in their relationships with others. This integration process is therefore not only functional but also corresponds to political and social logics. From this perspective, setting a precedent obviously matters insofar as it has an impact on the perceptions and calculations of other actors. Thus, the role of the United States, Russia, and China since the late-1990s has helped to shape debates, mechanisms, and practices in this field. But the integration of digital technologies and risks into international strategic relations has also depended on other categories of actors and their uses, as well as their role in the regulation or deregulation of cyber conflict.\n\n### Cyber as a national security issue\n\nThe use of cyber operations in times of crisis, in negotiations or for national security reasons has become routine for states. Jensen (2017) refers to “21st Century Political Warfare” to characterize the return to “coercive diplomacy in the shadows” (p. 159) despite the limitations of cyber operations to persuade, compel or influence the behavior of other states (Jensen & Work, 2018; Valeriano et al. 2018, p. 226). At the same time, there is no strong consensus or even shared understanding about the application of existing standards. The case of the United Nations Group of Governmental Experts on the Developments in the field of information and telecommunications in the context of international security (UN GGE) is instructive. Convened following a series of annual resolutions proposed by Russia to the United",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 7,
            "markdown": "Nations General Assembly since 1998, this group, which included representatives of 15 and then 20 governments, reached non-binding consensus agreements in 2010. These reports respectively engaged states in defining common terms and challenges while encouraging dialogue; affirmed the applicability of international law and in particular the UN Charter in cyberspace and consolidated a core of standards of responsible behavior for states in cyberspace.\n\nThe 2016--2017 round of negotiations failed in June 2017 on the question of the legal options available to states to respond to hostile activities, with the United States wanting a right to self-defense to apply while Cuba feared that it would be used to justify unilateral punitive actions (Grisby, 2017). At the same time, the member states of the Shanghai Cooperation Organization proposed a code of conduct in 2011 and then in 2015, but without success. In October 2018, Russia and the United States proposed competing resolutions to relaunch the UN GGE process (Grisby, 2018). These behaviors can be explained not only by diverging interests but also by opposing representations about international relations, cyber security issues and the modes of governance they induce.\n\nTwo aspects accentuate this pluralism. On the one hand, the blurring of the categories between war and peace, but also of the criteria that make it possible to qualify an act of aggression in an indisputable way. On the other hand, the distinction between governmental and non-state actors is becoming blurred. However, the question of governance arises between the promoters of a multilateral approach and those of an approach that includes all stakeholders (DeNardis, 2014; Mueller, 2017). At the same time, initiatives are emerging in the private sector, as illustrated by Microsoft's initiatives for a Digital Geneva Convention (2017) and a Cyber Security Tech Accord (2018).\n\nThe 2010s can be characterized, so far, by the progressive rise of security issues related to cyber, from computer security to national security (Balzacq & Dunn-Cavelty, 2016; Dunn-Cavelty, 2007; Nissenbaum, 2005). This is partly due to the simultaneous growth of the digital domain and of vulnerabilities that could potentially cause systemic damage. But this is also due to the diversification and diffusion of certain modes of action (DDoS, ransomwares) (Buchanan, 2016). Finally, this is tied to the interpretation of certain precedents (Stuxnet, the DDoS attack on Estonia in 2007, the use of cyber operations by Russians against Georgia in 2008 or in Ukraine since 2014) as well as recurrent behaviors (the combination of criminal and political behavior by North Korean hackers, industrial and intellectual espionage by Chinese hackers).\n\nAnother more fundamental reason is the gradual construction of a threat discourse by both governments and security actors (government agencies, security companies) in a context of increasing competition among key international actors. Cybersecurity is therefore linked to existential threats to political regimes, the status of states on the international scene, social cohesion",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 8,
            "markdown": "and economic prosperity. This process is intertwined with the divergence of representations between the main powers. While the United States insists on the strategic threat posed by China through its espionage campaigns in 2010--2015 and again since 2018, both China and Russia present United States' discourses, practices and military doctrines as fundamentally in conflict with their interpretation of sovereignty, both in domestic and international politics. This escalation of the stakes has profound consequences for the implementation of strategies and mechanisms designed to secure cyberspace or parts of it, to deal with threats or to modify existing power relations.\n\n### Practices of cyber conflict\n\nGovernment agencies and national security elites appear to have adopted the necessity of offensive doctrines and strategies to disrupt, coerce, and deter. In the United States, a proposed bill allowing companies to operate outside their networks (active cyber defense) illustrates the possible frustration with the failure of traditional deterrence policies, as does the shift in terminology within the Department of Defense to a “defend forward” posture defined as “confronting threats before they reach U.S. Networks” (Department of Defense, 2018; Lin & Smeets, 2018; Lyu, 2018; Sanger, 2018). More broadly, operational constraints alone are not enough to explain the practice of maintaining a presence in the digital networks of other states to hold certain targets at risk as a deterrent. Some governments have tried to influence constituencies in foreign countries through social media (Lapowski, 2018; Solon, 2018). Finally, other actors are carrying out disruptive actions towards the industrial and financial sectors, with much more destabilizing and insecure consequences.\n\nAmong these practices, those surrounding the research, development, accumulation and dissemination of zero-days, exploits and malware are worrying, as illustrated by the case of the EternalBlue exploit, developed by the United States National Security Agency (NSA), stolen and auctioned by a group of hackers suspected of being linked to Russian military intelligence and used in Wannacry and NotPetya. This case illustrates the risk of proliferation of cyber weapons, but also the risk of loss of control by their designers or owners. In this field, there is no consensual and shared policy to regulate these practices and ensure that states do not compromise all users. The segmentation of the effort to control the proliferation of the most dangerous exploits--because they are likely to cause the most damage--is even potentially counterproductive insofar as it can generate tensions and risks.\n\nThe intermingling between private and public, civil and military actors is also problematic. Some governments rely on state-sponsored actors to share technical and human resources but also to increase their ability to deny",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 9,
            "markdown": "responsibility (Healey, 2012; Maurer, 2017). However, this approach poses the classic dilemmas of the principal-agent type. Increased control by policy makers or government agencies reduces effectiveness and operational flexibility and reduces the ability to deny responsibility for an attack. The relaxation of this control by the principal increases tactical flexibility and adaptability but creates risks of escalation or misperception due to divergent or even competing agendas on the part of the agent.\n\nIn most European and North American countries, Internet hardware and software infrastructures are operated and maintained by the private sector. Thus, part of this sector is involved in security through software solutions or in the Threat Intelligence and Threat Analysis process. In addition, the private sector and the public sphere often appear as soft targets as part of indirect strategies seeking to modify power relations at the margins. Consequently, defense in depth would benefit from greater cooperation between the private and public sectors (information sharing, resource sharing, responsiveness), or even through integration or even control. Nevertheless, in addition to the costs of an approach of enrolling private sector forces in national security under government authority (which also depend on political cultures and institutions), there are also risks associated with identifying these actors with policy makers (increased by attribution issues). Moreover, the logic of the sovereign and those of these actors can come into confrontation and accentuate the politicization of private organizations. However, this is a means by which a multi-stakeholder approach or inclusive multilateralism can be deployed (Cattaruzza, Danet, Taillat, & Laudrain, 2016).\n\nIssues related to cyber security and digital technologies therefore have an undeniable strategic impact that is incommensurate with the relative utility of cyber capabilities. This phenomenon has continued to grow in a dialectic between the United States and its rivals on the one hand, and between the United States and the rest of the cyber conflict actors on the other. The result is a potentially unstable process because it is particularly sensitive to the behavior of major international security actors and, in particular, to misperceptions. The future evolution of cyber conflict is thus closely dependent on the propensity of actors to take risks or hold at risk the infrastructures and standards on which they nevertheless depend. Cyber conflict is particularly sensitive to the structuring of issues in a long-term strategic competition but also to a sudden change resulting from the risky behavior of an actor.\n\n## Conclusion\n\nThe impact of digital and cyber-conflict technologies on international security depends both on the technical and operational characteristics of the cyber domain and on what states make of it. Interactions between states, and the rationales underlying their actions, are therefore affected by their perceptions",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 10,
            "markdown": "of opportunities and vulnerabilities. In return, their strategic choices and the dilemmas that accompany them create potential for escalation and misperceptions that most want to avoid.\n\nThis raises the issue of collective security in a new way. Collective security depends on two factors: the establishment of a shared regime to regulate the use of digital technologies, and the ability of the main powers that guarantee the international political order to reach an agreement to fight against disruptive and revolutionary actors. The contemporary context of eroding trust between states and in the benefits of the international order would rather invite pessimism. Since the security dilemma feeds on uncertainty about the intentions of the actors, it produces even more instability if the latter are asymmetrical in terms of maintaining versus challenging the international political order. It is even more so when the legitimacy of the rules of the international game is called into question, especially when other actors contribute to the marginalization of states.\n\n## Notes\n\nFor example, in the spring and early summer of 2017, Wannacry and NotPetya helped to paralyze many organizations around the world. The damage was not only financial but also showed the fragility of many economic or social activities, not to mention the destruction of a large volume of data. The presence of malware in the Industrial Control Systems (ICS) of certain power plants or oil installations in the Middle East, the United States or South Korea represents significant dangers because of the precedents they could set. Finally, the Distributed Denial of Service (DDoS) attacks against DynDNS (October 2016) using the Botnet Mirai also show the fragility of the entire Internet architecture.Thus, the expansion of the digital domain contributes to the global dynamic density. Meijer and Jensen (2018) have shown the dilemmas that this dynamic presents to strategists.It could be added that the vulnerability of the continental United States -- connected to the Internet by several dozens of these submarine cables -- is not the same as that of Georgia, which wanted to free itself from the legacy of Soviet-era networks and depends on a single cable from Bulgaria.It can thus be hypothesized that the perpetrators of the hacking, data theft, data destruction and blackmail operation against Sony Entertainment in 2014 did not appreciate what was at stake for President Obama in this case at that moment. Faced with accusations from Congress, because of the link between this case and freedom of expression, and in an asymmetrical configuration with North Korea, the President was able to publicly attribute and respond to the attack. An alternative hypothesis is to say that the hackers did not consider the stakes of the American administration in their calculations and were taking all the risks to produce effects whose impact remains to be determined today. See for example Sharp (2017).Although programed to activate only when a specific hardware and software configuration is present, Stuxnet has infected several tens of thousands of computer workstations, mainly in Asia. The NotPetya campaign attributed to",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 11,
            "markdown": "Russia by the Five Eyes governments in the autumn and winter of 2017/2018 was aimed mainly at Ukraine but also caused damage to some Russian actors such as the oil company Rosneft.In 2008--2009, the US federal government developed a Vulnerabilities Equities Process but it remains partially confidential and controversial due to the opacity of its mechanisms and its unilateral nature. In Europe, the debate is more recent but remains marked by the difficulty of coordinating government actions and harmonizing practices. See Delcheva & Soesanto, 2018.\n\n## Disclosure statement\n\nNo potential conflict of interest was reported by the author.\n\n## Notes on contributor\n\nStéphane Taillat is Associate Professor of War and Strategic Studies in the Department of International Relations, St Cyr French Army Academy and a researcher at the Geopolitics of Datasphere Centre of Excellence.\n\n## ORCID\n\nStéphane Taillat http://orcid.org/0000-0002-8337-7190\n\n## Reference list\n\nBalzacq, T. & Dunn-Cavelty, M. (2016). A theory of actor-network for cyber-security. European Journal of International Security, 1(2), 176--198. doi:10.1017/eis.2016.8\n\nBorghard, E. D. & Lonergan, S. W. (2017). The logic of coercion in cyberspace. Journal of Security Studies, 26, 452--481. doi:10.1080/09636412.2017.1306396\n\nBuchanan, B. (2016). The life cycle of cyber threats. Survival, 58(1), 39--58. doi:10.1080/00396338.2016.1142093\n\nBuchanan, B. (2017a). The cybersecurity dilemma. Hacking, trust and fear between nations. Oxford: Oxford University Press.\n\nBuchanan, B. (2017b). The legend of sophistication in cyber operations. Cambridge, MA: Harvard Belfer Center for Science and International Affairs.\n\nCattaruzza, A. Danet, D. Taillat, S. & Laudrain, A. (2016). Sovereignty in cyberspace: Balkanization or democratization. 2016 International Conference on Cyber Conflict (CyCon U.S.). doi:10.1109/CYCONUS.2016.7836628\n\nDelcheva, T. & Soesanto, S. (2018, March 21). Time to talk: Europe and the vulnerabilities equities process. European Council on Foreign Relations. Retrieved from https://www.ecfr.eu/article/commentary_time_to_talk_europe_and_the_vulnerability_equities_process\n\nDeNardis, L. (2014). The global war for internet governance. Cambridge, MA: Yale University Press.\n\nDepartement of Defense. (2018). 2018 DoD cyber strategy and cyber posture review. Fact Sheet. Retrieved from https://media.defense.gov/2018/Sep/18/2002041659/-1/-1/1/Factsheet_for_Strategy_and_CPR_FINAL.pdf",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 12,
            "markdown": "CONTEMPORARY SECURITY POLICY\n\nDunn-Cavelty, M. (2007). Cyber-security and threat politics: US efforts to secure the information age. London: Routledge.\n\nFischerkeller, P., &amp; Harknett, R. (2017). Deterrence is not a credible strategy for cyberspace. *Orbis*, 61, 381–393. doi:10.106/j.orbis.2017.05.003\n\nGartzke, E., &amp; Lindsay, J. R. (2015). Weaving tangled webs: Offense, defense, and deception in cyberspace. *Journal of Strategic Studies*, 24, 316–348. doi:10.1080/09636412.2015.1038188\n\nGartzke, E., &amp; Lindsay, J. R. (2016). Coercion through cyberspace: The stability-instability paradox revisited. In K. Greenhill &amp; P. Krause (Eds.), *The power to hurt: Coercion in international politics* (pp. 179–203). Oxford: Oxford University Press.\n\nGrisby, A. (2017). The end of cyber norms. *Survival*, 59(6), 109–122. doi:10.1080/00396338.2017.1399730\n\nGrisby, A. (2018, October 29). Unpacking the competing Russian and U.S. cyberspace resolutions at the United Nations. *Council on Foreign Relations* blog. Retrieved from https://www.cfr.org/blog/unpacking-competing-russian-and-us-cyberspace-resolutions-united-nations\n\nHealey, J. (2012, February 22). Beyond attribution: Seeking national responsibility for cyber attacks. The Atlantic Council Issue Brief. Retrieved from http://www.atlanticcouncil.org/images/files/publication_pdfs/403/022212_ACUS_NatlResponsibilityCyber.PDF\n\nJensen, B. (2017). The cyber character of political warfare. *Brown Journal of World Affairs*, 24(1), 159–171. Retrieved from http://bjwa.brown.edu/24-1/benjamin-jensen-the-cyber-character-of-political-warfare/\n\nJensen, B., &amp; Work, J. D. (2018, September 4). Cyber civil-military relations: Balancing interests on the digital frontier. *War on the Rocks*. Retrieved from https://warontherocks.com/2018/09/cyber-civil-military-relations-balancing-interests-on-the-digital-frontier/\n\nJoseph, M., &amp; Poznansky, M. (2017). Media technology, covert action, and the politics of exposure. *Journal of Peace Research*, 55, 320–335. doi:10.1177/0022343317731508\n\nKello, L. (2013). The meaning of the cyber revolution: Perils to theory and statecraft. *International Security*, 38(2), 7–40. doi:10.1162/ISEC_a_00138\n\nKello, L. (2014). Les cyberarmes: dilemmes et futurs possibles [The virtual weapon: Dilemmas and future scenarios]. *Politique Etrangère*, Winter(4), 139–150. doi:10.3917/pe.144.0139\n\nKello, L. (2017). The virtual weapon and international order. New-Haven, CT: Yale University Press.\n\nLapowski, I. (2018, October 26). Iran’s new Facebook trolls are using Russia’s playbook. *Wired*. Retrieved from https://www.wired.com/story/iran-facebook-trolls-using-russia-playbook/\n\nLibicki, M. (2009). Cyberdeterrence and Cyberwar. Santa Monica, CA: RAND Corporation.\n\nLin, H. (2012). Escalation dynamics and conflict termination in cyberspace. *Strategic Studies Quarterly*, 6(3), 46–70.\n\nLin, H., &amp; Smeets, M. (2018, May 3). What is absent from the U.S. cyber command ‘vision’. *Lawfare*. Retrieved from https://www.lawfareblog.com/what-absent-us-cyber-command-vision#\n\nLyu, J. (2018, October 19). A Chinese perspective on the pentagon’s cyber strategy: From ‘active cyber defense’ to ‘defend forward’. *Lawfare*. Retrieved from https://",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 13,
            "markdown": "380\nS. TAILLAT\n\nwww.lawfareblog.com/chinese-perspective-pentagons-cyber-strategy-active-cyber-defense-defending-forward\n\nMaurer, T. (2017). Cyber mercenaries. The state, hackers and power. Cambridge: Cambridge University Press.\n\nMeijer, H., &amp; Jensen, B. (2018). The strategist’s dilemma: Global dynamic density and the making of US ‘China policy’. European Journal of International Security, 3, 211–234. doi:10.1017/eis.2017.17\n\nMueller, M. (2017). Will the internet fragment? Sovereignty, globalization and cyberspace. Cambridge: Polity Press.\n\nNissenbaum, H. (2005). When computer security meets national security. Ethics and Information Technology, 7(2), 61–73. doi:10.1007/s10676-005-4582-3\n\nNye, J. (2016/2017). Deterrence and dissuasion in cyberspace. International Security, 41(3), 44–71. doi:10.1162/ISEC_a_00266\n\nPoznansky, M., &amp; Perkoski, E. (2018). Rethinking secrecy in cyberspace: The politics of voluntary attribution. Journal of Global Security Studies, 3, 402–416. doi:10.1093/jogss/ogy022\n\nPROOFPOINT. (2018). The Human Factor 2018 Report. Retrieved from https://www.proofpoint.com/sites/default/files/pfpt-uk-tr-the-human-factor-2018.pdf\n\nRid, T. (2012). Cyber war will not take place. Journal of Strategic Studies, 35(1), 5–32. doi:10.1080/01402390.2011.608939\n\nRid, T., &amp; Buchanan, B. (2015). Attributing cyber attacks. Journal of Strategic Studies, 38(1-2), 4–37. doi:10.1080/01402390.2014.977382\n\nRid, T., &amp; McBurney, P. (2012). Cyber-weapons. The RUSI Journal, 157(1), 6–13. doi:10.1080/03071847.2012.664354\n\nSanger, D. (2018, June 17). Pentagon puts cyberwarriors on the offensive, increasing the risk of conflict. The New-York Times. Retrieved from https://www.nytimes.com/2018/06/17/us/politics/cyber-command-trump.html\n\nSchmitt, M. (Ed.). (2013). Tallinn manual on the international law applicable to cyber warfare. Cambridge: Cambridge University Press.\n\nSchmitt, M. (Ed.). (2017). Tallinn manual 2.0 on the international law applicable to cyber operations. Cambridge: Cambridge University Press.\n\nSchneier, B. (2008). The psychology of security. In S. Vaudenay (Ed.), Progress in cryptology – AFRICACRPT 2008. Lecture notes in computer science (Vol. 5023, pp. 50–79). Berlin: Springer.\n\nSharp, T. (2017). Theorizing cyber coercion: The 2014 North Korean operation against Sony. Journal of Strategic Studies, 40, 898–926. doi:10.1080/01402390.2017.1307741\n\nSmeets, M. (2018). A matter of time: On the transitory nature of cyberweapons. Journal of Strategic Studies, 41(1-2), 6–32. doi:10.1080/01402390.2017.1288107\n\nSolon, A. (2018, August 22). Facebook removes 652 fake accounts and pages meant to influence world politics. The Guardian. Retrieved from https://www.theguardian.com/technology/2018/aug/21/facebook-pages-accounts-removed-russia-iran\n\nStarosielski, N. (2018). Strangling the internet. Limn, 10. Retrieved from https://limn.it/articles/strangling-the-internet/\n\nSteiger, S., Harnisch, S., Zettl, K., &amp; Lohmann, J. (2018). Conceptualising conflicts in cyberspace. Journal of Cyber Policy, 3(1), 77–95. doi:10.1080/23738871.2018.1453526\n\nStone, J. (2013). Cyber war will take place!. Journal of Strategic Studies, 36(1), 101–108. doi:10.1080/01402390.2012.730485",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          },
          {
            "index": 14,
            "markdown": "CONTEMPORARY SECURITY POLICY\n\n381\n\nValeriano, B., &amp; Maness, R. (2014). The dynamics of conflicts between rival antagonists, 2001-2011. Journal of Peace Research, 51, 347–360. doi:10.1177/0022343313518940\n\nValeriano, B., Jensen, B., &amp; Maness, R. (2018). Cyber strategy. The evolving character of power and coercion. Oxford: Oxford University Press.\n\nValeriano, B., &amp; Maness, R. (2015). Cyber war versus cyber realities. Cyber conflict in the international system. Oxford: Oxford University Press.\n\nWeber, C., &amp; Jean-Philippe. (2018). La place de l'homme dans les enjeux de cybersécurité [Human in cybersecurity issues]. *Stratégique*, 117(4), 83–98. Retrieved from https://www.cairn.info/revue-strategique-2017-4-page-83.htm\n\nZetter, K. (2015). Countdown to zero day: Stuxnet and the launch of the world's first digital weapon. New-York, NY: Crown Publishing.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1843,
              "width": 1229
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 15,
          "doc_size_bytes": 1392798
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "Check here\nContemporary Security Policy\nR\nRoutledge Taylor &amp; Francis Group\nISSN: 1352-3260 (Print) 1743-8764 (Online) Journal homepage: www.tandfonline.com/journals/fcsp20\n# Disrupt and restraint: The evolution of cyber conflict and the implications for collective security\nStéphane Taillat\nTo cite this article: Stéphane Taillat (2019) Disrupt and restraint: The evolution of cyber conflict and the implications for collective security, Contemporary Security Policy, 40:3, 368-381, DOI: 10.1080/13523260.2019.1581458\nTo link to this article: https://doi.org/10.1080/13523260.2019.1581458\nPublished online: 26 Feb 2019.\nSubmit your article to this journal\nArticle views: 1931\nView related articles\nView Crossmark data\nCiting articles: 2 View citing articles\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=fcsp20\nCONTEMPORARY SECURITY POLICY\n2019, VOL. 40, NO. 3, 368-381\nhttps://doi.org/10.1080/13523260.2019.1581458\nRoutledge\nTaylor &amp; Francis Group\nCheck for updates\n# Disrupt and restraint: The evolution of cyber conflict and the implications for collective security\nStéphane Taillat\nInternational Relations and Strategic Studies, St Cyr French Army Academy, Guer, France\n# ABSTRACT\nIn the last decade, cyber conflict has become a main feature of international politics and a growing concern for strategic stability and collective security. Unfortunately, cyber conflict suffers from a lack of conceptual clarity about its impact on collective security and a lack of consensus among international actors on how to interpret it. This article proposes to understand cyber conflict as an evolving process driven by two factors: the way in which digital space is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber have been included in the field of national and international security. Both tend to encourage offensive behavior but also demonstrate features pointing to restraint.\nKEYWORDS Collective security; cyber conflict; international security\nCyber conflict suffers from a lack of conceptual clarity and a lack of consensus among key international actors on how to interpret it. For years, academics have struggled to account for the potentialities and effects of digital technologies on conflict dynamics. The debate has focused on the inclusion of cyber conflict in the Clausewitzian conceptualization of war (Rid, 2012; Stone, 2013). Several researchers have taken into account the specificities of cyber confrontation but have also sought to explain the gaps between expectations and behaviors, whether in terms of attribution (Rid &amp; Buchanan, 2015), deterrence (Fischerkeller &amp; Harknett, 2017; Libicki, 2009; Nye, 2016/2017), escalation dynamics (Lin, 2012; Valeriano, Jensen, &amp; Maness, 2018), coercion (Borghard &amp; Lonergan, 2017; Gartzke &amp; Lindsay, 2016; Sharp, 2017), and the offensive-dominant character of conflict in cyberspace (Gartzke &amp; Lindsay, 2015).\nOthers have attempted to account for the empirical evolution of cyber conflict toward restraint or aggression below the threshold of armed force (Steiger, Harnisch, Zettl, &amp; Lohmann, 2018; Valeriano &amp; Maness, 2015) or to question these dynamics through the prism of covert actions and deniability (Joseph &amp; Poznansky, 2017; Poznansky &amp; Perkoski, 2018). Finally, the\nCONTACT Stéphane Taillat stephane.taillat@st-cyr.terre-net.defense.gouv.fr\n© 2019 Informa UK Limited, trading as Taylor &amp; Francis Group\ndebates have focused on the relevance and methods of social sciences for analysing cyber conflict (Kello, 2013, 2014, 2017; Valeriano & Maness, 2014). Jurists have also examined the particularities of cyberspace and cyber operations to assess the possible application of legal categories, without reaching consensus or formally guiding governments (Schmitt, 2013, 2017).\nIn addition to these academic debates, there are divergent representations between the main powers concerning the challenges and threats related to the cyber domain in the context of a growing opposition between their interests. These divergences stem from the conceptualization of cyberspace. For China and Russia, for example, the information space includes all digital networks but also the political and social sphere. The main threat therefore stems from the ability of opponents (mainly the United States and Western countries) to destabilize these political regimes and threaten their control over society. For the United States and many European states, cyberspace mainly includes computer networks and the economic, industrial, or military activities that depend on them. The threat is therefore more about a competitor's ability to exploit the high digitization of these societies to gain an asymmetric advantage or cause catastrophic damage.\nThere is therefore a heterogeneity of values and interests, fueled by the logics of their long-term strategic competition. As a result, this heterogeneous feature of the international system results in the absence of a framework of shared meanings to limit tensions, manage conflicts, and control the risk of escalation. Moreover, the possibility of exploiting cyberspace from an asymmetrical perspective contributes to emboldening revolutionary or revisionist actors, as evidenced by the shift towards increasingly risky modes of action and strategies that contribute to disrupting the entire international normative system in peacetime.\nThe difficulty of defining cyber conflict and establishing international rules is problematic from the point of view of collective security. This difficulty is part of a more general evolution toward the blurring of conventional categories on conflicts, war and warfare. The purpose of this article is not to resolve these differences or to synthesize these conceptual approaches. In this article, I postulate that war and conflict are categories that depend on how actors interpret and integrate them into their practices and strategies. Thus, the current heterogeneity of the international system is fueled and in turn feeds these divergences of interpretation and the polarization of rivalries. Therefore, it is not possible to objectively define contemporary cyber conflict.\nCyber conflict is subject to changing evolutions and characteristics. I thus propose to understand these changing evolutions and characteristics through an analytical framework structured around two processes: the way in which digital domain is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber security have been included in the field of national and international security. This has two\nconsequences for collective security. First, the configuration of the cyber domain produces incentives for offensive action but within a framework characterized by low operational efficiency. Second, cyber conflict is particularly dependent on interactions between actors and therefore on strategic contexts such as long-term strategic competition.\nThis article will proceed in two steps. First, it will focus on how the configuration of the cyber domain affects the incentive to act offensively while remaining below a certain threshold of aggression. Second, it will analyze how cyber capabilities have been included in national and international security issues, generating a strong sensitivity to cyber security issues.\n## Strategic opportunities and challenges in the digital domain\nCyberspace is a field of confrontation, a challenge, and a means by which rivalries can be expressed. It covers an increasingly broad range of economic, political, social, cultural and security dimensions and activities, creating interdependence between them at every geopolitical level. This field is characterized by the interaction between technologies, uses, power rivalries and the increasing integration of private and public, military and civil, national, transnational, regional, and international dimensions. Cyberspace is therefore the result of a historical and socio-political process that in turn sets out a space of strategic choices, which shapes the behavior of both state and non-state actors.\n### The ubiquity of vulnerabilities\nThe pervasiveness of vulnerabilities is the main feature of cyberspace (Libicki, 2009, p. xiv). Thus, this space is marked by a large number of targets, entry points, and attack vectors. However, the distribution of potential targets is uneven. The traditional division into physical, logical, informational, and social layers provides a first framework for analysis. But it is possible to specify it with other frameworks.\nFirst, the type of infrastructure. As Smeets (2018) shows, vulnerabilities can be hardware, software, networks, and communication protocols between machines as well as individuals or organizations. He proposes to classify them according to the potential to exploit them on the one hand, and the potential to remedy them on the other. Software vulnerabilities are easier to exploit than hardware or network vulnerabilities, but also easier to patch once discovered (pp. 13--14). Human vulnerabilities also appear to be more related to organizational cultures and procedures than to individual cognitive biases (PROOFPOINT, 2018; Schneier, 2008; Weber & Jean-Philippe, 2018).\nSecond, not all targeted systems are accessible in the same way. A system can be accessible through the global Internet network or from a system in a closed network that requires access to this network first. Kello (2017) proposes\nto map cyberspace by distinguishing between the global network (the Internet), the WorldWideWeb, and a “cyber archipelago” composed of the “air gaped” networks (p. 45). The latter are not inaccessible but require more resources and effort or even risks taking. Third, the geopolitical distribution of assets, digital infrastructures, or legal architectures determines resources and vulnerabilities. The geography of transoceanic cables invites us to think of cyberspace in terms of chokepoints or according to a logic of interdependence (Starosielski, 2018). The same applies to the location of data centers or the legislative requirement for Web companies to host national user data on national soil. Hence the strategic implications of a potential “Internet Balkanization”: a political fragmentation of the Internet but also the creation of a striated space limiting the capacities of access, maneuver, and the production of operational effects.\nThis mapping thus delimits a space for the strategic choices of the actors. It also helps to better explain the frequency of low-intensity attacks against soft targets and the relative difficulty of putting critical infrastructure at risk. Nevertheless, it also shows why no intrusion is insignificant in terms of these crucial issues and assets for national security and collective security.\n### Security and strategic dilemmas\nTechnologies contribute to uncertainty about the identity and intentions of an attacker. There is therefore a security dilemma specific to cyber conflict. This is based on the difficulty in interpreting intrusions and interference either as operational preparation, as intelligence collection, or as hold at risk operation. At the same time, the specificities of cyber operations encourage penetration of others' networks and interference in their processes (Buchanan, 2017a). The increase in cyberspace-related issues (see below) contributes to these dynamics. This explains the importance of the attribution process, which Rid and Buchanan (2015) have shown to be ambiguous and of a political and strategic nature.\nImputing an action to an author is made more complex and time-consuming due to technical factors allowing relative anonymity, organizational factors allowing not to acknowledge responsibility but also political factors. Therefore, a victim's probability of attributing and responding depends on his or her cost structure, that is what is at stake for the victim. However, from the point of view of the attacker, it is not possible to quantify exactly those elements which may contain material or symbolic aspects, but which also depend on the context in which the decision-makers are placed. In the case of issues considered important or even existential, the trade-off between the urgency of attributing and responding and the risks associated with incomplete communication or hasty response is less acute than in the case of less important issues. The propensity of decision-makers to take\nrisks is therefore an important variable, both for the victim and for the current or potential aggressor.\nThe complexity of the attribution process results in a latency period with a significant impact on the credibility of deterrence. Besides, the nature of the information making it possible to conclude that an actor is liable requires compromises between preserving the capacities that made it possible to collect these elements and presenting the case with the most indisputable evidence possible. As a result, the attribution process weakens an actor's ability to demonstrate resolution and keep aggressors at bay.\nDigitization therefore increases the margin of maneuver below the threshold of the use of force. This therefore allows actors to pursue several of their objectives without incurring the penalties associated with the use of aggression, or at least by limiting these risks. Nevertheless, this freedom of action is hampered in practice because of its dependence on three factors. First, by the type of weapon or tactic used. On the one hand, offensive means are unevenly distributed between a small number of weapons or targeted actions (of which Stuxnet is an archetype) (Zetter, 2015) and a very large number of more indiscriminate tools (Distributed Denial of Service attacks for example) (Rid & McBurney, 2012; Smeets, 2018). On the other hand, this situation reflects the difficulty of producing the desired effects either on the targeted social groups or organizations or on the targeted digital systems. The question of force control and its effects is therefore particularly acute when the action can produce side effects or backfires. Unless the initiator of the attack seeks to produce such indiscriminate effects, takes the risk of their probability or can exploit them in a timely manner to increase his or her reputation for resolution or capacity, this first factor produces a negative incentive to take risks.\nSecond, the margin for maneuver depends on the organizational sophistication of the attacker. This includes the available resources, the ability to mobilize and exploit them to produce the desired results and the propensity to limit errors and friction at least in planning and managing the operation (Buchanan, 2017b). This point highlights the dilemmas and challenges characteristic of a cyber operation: It requires time, it is guided by the issue of operational security, it requires flexibility and the ability to seize opportunities that develop in interaction with the adversary and the environment.\nThird, it depends on the target's behavior, either in previous attacks or through the precedent resulting from its own offensive operations. These successive behaviors shape expectations and beliefs, but also future norms. The case of the United States is particularly enlightening. Stuxnet may have set a precedent for offensive or even disruptive actions by others, either in retaliation or to prevent further operations (the Iranians and the Shamoon virus against Saudi Aramco in August 2012 or the multiple operations carried out against the banking system, universities or certain actors in the American\nenergy sector since 2013), or as justification (the use of the BlackEnergy malware against Ukrainian power plants in December 2015 attributed to Russia). On the contrary, the Obama administration's relative restraint in the face of the increase in attacks below the threshold for the use of armed force may have been interpreted as weakness and an incentive to take more risks.\nThis configuration is therefore a framework through which it is possible to weigh the constraints and opportunities of actions in relation to the effects to be achieved. Two contradictory trends emerge. On the one hand, cyber operations have a relative value to produce the expected effects. On the other hand, there is an incentive to act below a certain threshold. The result is the possibility of unexpected and counterproductive effects that suggest that the question should be considered in terms of strategic objectives and issues.\n## Diverging issues and conflicting practices in national and international security\nThe representations of issues, threats, and opportunities partly explain how key actors have integrated cyber security, cyber warfare, and cyber policy issues into their strategies and in their relationships with others. This integration process is therefore not only functional but also corresponds to political and social logics. From this perspective, setting a precedent obviously matters insofar as it has an impact on the perceptions and calculations of other actors. Thus, the role of the United States, Russia, and China since the late-1990s has helped to shape debates, mechanisms, and practices in this field. But the integration of digital technologies and risks into international strategic relations has also depended on other categories of actors and their uses, as well as their role in the regulation or deregulation of cyber conflict.\n### Cyber as a national security issue\nThe use of cyber operations in times of crisis, in negotiations or for national security reasons has become routine for states. Jensen (2017) refers to “21st Century Political Warfare” to characterize the return to “coercive diplomacy in the shadows” (p. 159) despite the limitations of cyber operations to persuade, compel or influence the behavior of other states (Jensen & Work, 2018; Valeriano et al. 2018, p. 226). At the same time, there is no strong consensus or even shared understanding about the application of existing standards. The case of the United Nations Group of Governmental Experts on the Developments in the field of information and telecommunications in the context of international security (UN GGE) is instructive. Convened following a series of annual resolutions proposed by Russia to the United\nNations General Assembly since 1998, this group, which included representatives of 15 and then 20 governments, reached non-binding consensus agreements in 2010. These reports respectively engaged states in defining common terms and challenges while encouraging dialogue; affirmed the applicability of international law and in particular the UN Charter in cyberspace and consolidated a core of standards of responsible behavior for states in cyberspace.\nThe 2016--2017 round of negotiations failed in June 2017 on the question of the legal options available to states to respond to hostile activities, with the United States wanting a right to self-defense to apply while Cuba feared that it would be used to justify unilateral punitive actions (Grisby, 2017). At the same time, the member states of the Shanghai Cooperation Organization proposed a code of conduct in 2011 and then in 2015, but without success. In October 2018, Russia and the United States proposed competing resolutions to relaunch the UN GGE process (Grisby, 2018). These behaviors can be explained not only by diverging interests but also by opposing representations about international relations, cyber security issues and the modes of governance they induce.\nTwo aspects accentuate this pluralism. On the one hand, the blurring of the categories between war and peace, but also of the criteria that make it possible to qualify an act of aggression in an indisputable way. On the other hand, the distinction between governmental and non-state actors is becoming blurred. However, the question of governance arises between the promoters of a multilateral approach and those of an approach that includes all stakeholders (DeNardis, 2014; Mueller, 2017). At the same time, initiatives are emerging in the private sector, as illustrated by Microsoft's initiatives for a Digital Geneva Convention (2017) and a Cyber Security Tech Accord (2018).\nThe 2010s can be characterized, so far, by the progressive rise of security issues related to cyber, from computer security to national security (Balzacq & Dunn-Cavelty, 2016; Dunn-Cavelty, 2007; Nissenbaum, 2005). This is partly due to the simultaneous growth of the digital domain and of vulnerabilities that could potentially cause systemic damage. But this is also due to the diversification and diffusion of certain modes of action (DDoS, ransomwares) (Buchanan, 2016). Finally, this is tied to the interpretation of certain precedents (Stuxnet, the DDoS attack on Estonia in 2007, the use of cyber operations by Russians against Georgia in 2008 or in Ukraine since 2014) as well as recurrent behaviors (the combination of criminal and political behavior by North Korean hackers, industrial and intellectual espionage by Chinese hackers).\nAnother more fundamental reason is the gradual construction of a threat discourse by both governments and security actors (government agencies, security companies) in a context of increasing competition among key international actors. Cybersecurity is therefore linked to existential threats to political regimes, the status of states on the international scene, social cohesion\nand economic prosperity. This process is intertwined with the divergence of representations between the main powers. While the United States insists on the strategic threat posed by China through its espionage campaigns in 2010--2015 and again since 2018, both China and Russia present United States' discourses, practices and military doctrines as fundamentally in conflict with their interpretation of sovereignty, both in domestic and international politics. This escalation of the stakes has profound consequences for the implementation of strategies and mechanisms designed to secure cyberspace or parts of it, to deal with threats or to modify existing power relations.\n### Practices of cyber conflict\nGovernment agencies and national security elites appear to have adopted the necessity of offensive doctrines and strategies to disrupt, coerce, and deter. In the United States, a proposed bill allowing companies to operate outside their networks (active cyber defense) illustrates the possible frustration with the failure of traditional deterrence policies, as does the shift in terminology within the Department of Defense to a “defend forward” posture defined as “confronting threats before they reach U.S. Networks” (Department of Defense, 2018; Lin & Smeets, 2018; Lyu, 2018; Sanger, 2018). More broadly, operational constraints alone are not enough to explain the practice of maintaining a presence in the digital networks of other states to hold certain targets at risk as a deterrent. Some governments have tried to influence constituencies in foreign countries through social media (Lapowski, 2018; Solon, 2018). Finally, other actors are carrying out disruptive actions towards the industrial and financial sectors, with much more destabilizing and insecure consequences.\nAmong these practices, those surrounding the research, development, accumulation and dissemination of zero-days, exploits and malware are worrying, as illustrated by the case of the EternalBlue exploit, developed by the United States National Security Agency (NSA), stolen and auctioned by a group of hackers suspected of being linked to Russian military intelligence and used in Wannacry and NotPetya. This case illustrates the risk of proliferation of cyber weapons, but also the risk of loss of control by their designers or owners. In this field, there is no consensual and shared policy to regulate these practices and ensure that states do not compromise all users. The segmentation of the effort to control the proliferation of the most dangerous exploits--because they are likely to cause the most damage--is even potentially counterproductive insofar as it can generate tensions and risks.\nThe intermingling between private and public, civil and military actors is also problematic. Some governments rely on state-sponsored actors to share technical and human resources but also to increase their ability to deny\nresponsibility (Healey, 2012; Maurer, 2017). However, this approach poses the classic dilemmas of the principal-agent type. Increased control by policy makers or government agencies reduces effectiveness and operational flexibility and reduces the ability to deny responsibility for an attack. The relaxation of this control by the principal increases tactical flexibility and adaptability but creates risks of escalation or misperception due to divergent or even competing agendas on the part of the agent.\nIn most European and North American countries, Internet hardware and software infrastructures are operated and maintained by the private sector. Thus, part of this sector is involved in security through software solutions or in the Threat Intelligence and Threat Analysis process. In addition, the private sector and the public sphere often appear as soft targets as part of indirect strategies seeking to modify power relations at the margins. Consequently, defense in depth would benefit from greater cooperation between the private and public sectors (information sharing, resource sharing, responsiveness), or even through integration or even control. Nevertheless, in addition to the costs of an approach of enrolling private sector forces in national security under government authority (which also depend on political cultures and institutions), there are also risks associated with identifying these actors with policy makers (increased by attribution issues). Moreover, the logic of the sovereign and those of these actors can come into confrontation and accentuate the politicization of private organizations. However, this is a means by which a multi-stakeholder approach or inclusive multilateralism can be deployed (Cattaruzza, Danet, Taillat, & Laudrain, 2016).\nIssues related to cyber security and digital technologies therefore have an undeniable strategic impact that is incommensurate with the relative utility of cyber capabilities. This phenomenon has continued to grow in a dialectic between the United States and its rivals on the one hand, and between the United States and the rest of the cyber conflict actors on the other. The result is a potentially unstable process because it is particularly sensitive to the behavior of major international security actors and, in particular, to misperceptions. The future evolution of cyber conflict is thus closely dependent on the propensity of actors to take risks or hold at risk the infrastructures and standards on which they nevertheless depend. Cyber conflict is particularly sensitive to the structuring of issues in a long-term strategic competition but also to a sudden change resulting from the risky behavior of an actor.\n## Conclusion\nThe impact of digital and cyber-conflict technologies on international security depends both on the technical and operational characteristics of the cyber domain and on what states make of it. Interactions between states, and the rationales underlying their actions, are therefore affected by their perceptions\nof opportunities and vulnerabilities. In return, their strategic choices and the dilemmas that accompany them create potential for escalation and misperceptions that most want to avoid.\nThis raises the issue of collective security in a new way. Collective security depends on two factors: the establishment of a shared regime to regulate the use of digital technologies, and the ability of the main powers that guarantee the international political order to reach an agreement to fight against disruptive and revolutionary actors. The contemporary context of eroding trust between states and in the benefits of the international order would rather invite pessimism. Since the security dilemma feeds on uncertainty about the intentions of the actors, it produces even more instability if the latter are asymmetrical in terms of maintaining versus challenging the international political order. It is even more so when the legitimacy of the rules of the international game is called into question, especially when other actors contribute to the marginalization of states.",
  "references": [
    "## Notes\nFor example, in the spring and early summer of 2017, Wannacry and NotPetya helped to paralyze many organizations around the world. The damage was not only financial but also showed the fragility of many economic or social activities, not to mention the destruction of a large volume of data. The presence of malware in the Industrial Control Systems (ICS) of certain power plants or oil installations in the Middle East, the United States or South Korea represents significant dangers because of the precedents they could set. Finally, the Distributed Denial of Service (DDoS) attacks against DynDNS (October 2016) using the Botnet Mirai also show the fragility of the entire Internet architecture.Thus, the expansion of the digital domain contributes to the global dynamic density. Meijer and Jensen (2018) have shown the dilemmas that this dynamic presents to strategists.It could be added that the vulnerability of the continental United States -- connected to the Internet by several dozens of these submarine cables -- is not the same as that of Georgia, which wanted to free itself from the legacy of Soviet-era networks and depends on a single cable from Bulgaria.It can thus be hypothesized that the perpetrators of the hacking, data theft, data destruction and blackmail operation against Sony Entertainment in 2014 did not appreciate what was at stake for President Obama in this case at that moment. Faced with accusations from Congress, because of the link between this case and freedom of expression, and in an asymmetrical configuration with North Korea, the President was able to publicly attribute and respond to the attack. An alternative hypothesis is to say that the hackers did not consider the stakes of the American administration in their calculations and were taking all the risks to produce effects whose impact remains to be determined today. See for example Sharp (2017).Although programed to activate only when a specific hardware and software configuration is present, Stuxnet has infected several tens of thousands of computer workstations, mainly in Asia. The NotPetya campaign attributed to\nRussia by the Five Eyes governments in the autumn and winter of 2017/2018 was aimed mainly at Ukraine but also caused damage to some Russian actors such as the oil company Rosneft.In 2008--2009, the US federal government developed a Vulnerabilities Equities Process but it remains partially confidential and controversial due to the opacity of its mechanisms and its unilateral nature. In Europe, the debate is more recent but remains marked by the difficulty of coordinating government actions and harmonizing practices. See Delcheva & Soesanto, 2018.\n## Disclosure statement\nNo potential conflict of interest was reported by the author.\n## Notes on contributor\nStéphane Taillat is Associate Professor of War and Strategic Studies in the Department of International Relations, St Cyr French Army Academy and a researcher at the Geopolitics of Datasphere Centre of Excellence.\n## ORCID\nStéphane Taillat http://orcid.org/0000-0002-8337-7190\n## Reference list\nBalzacq, T. & Dunn-Cavelty, M. (2016). A theory of actor-network for cyber-security. European Journal of International Security, 1(2), 176--198. doi:10.1017/eis.2016.8\nBorghard, E. D. & Lonergan, S. W. (2017). The logic of coercion in cyberspace. Journal of Security Studies, 26, 452--481. doi:10.1080/09636412.2017.1306396\nBuchanan, B. (2016). The life cycle of cyber threats. Survival, 58(1), 39--58. doi:10.1080/00396338.2016.1142093\nBuchanan, B. (2017a). The cybersecurity dilemma. Hacking, trust and fear between nations. Oxford: Oxford University Press.\nBuchanan, B. (2017b). The legend of sophistication in cyber operations. Cambridge, MA: Harvard Belfer Center for Science and International Affairs.\nCattaruzza, A. Danet, D. Taillat, S. & Laudrain, A. (2016). Sovereignty in cyberspace: Balkanization or democratization. 2016 International Conference on Cyber Conflict (CyCon U.S.). doi:10.1109/CYCONUS.2016.7836628\nDelcheva, T. & Soesanto, S. (2018, March 21). Time to talk: Europe and the vulnerabilities equities process. European Council on Foreign Relations. Retrieved from https://www.ecfr.eu/article/commentary_time_to_talk_europe_and_the_vulnerability_equities_process\nDeNardis, L. (2014). The global war for internet governance. Cambridge, MA: Yale University Press.\nDepartement of Defense. (2018). 2018 DoD cyber strategy and cyber posture review. Fact Sheet. Retrieved from https://media.defense.gov/2018/Sep/18/2002041659/-1/-1/1/Factsheet_for_Strategy_and_CPR_FINAL.pdf\nCONTEMPORARY SECURITY POLICY\nDunn-Cavelty, M. (2007). Cyber-security and threat politics: US efforts to secure the information age. London: Routledge.\nFischerkeller, P., &amp; Harknett, R. (2017). Deterrence is not a credible strategy for cyberspace. *Orbis*, 61, 381–393. doi:10.106/j.orbis.2017.05.003\nGartzke, E., &amp; Lindsay, J. R. (2015). Weaving tangled webs: Offense, defense, and deception in cyberspace. *Journal of Strategic Studies*, 24, 316–348. doi:10.1080/09636412.2015.1038188\nGartzke, E., &amp; Lindsay, J. R. (2016). Coercion through cyberspace: The stability-instability paradox revisited. In K. Greenhill &amp; P. Krause (Eds.), *The power to hurt: Coercion in international politics* (pp. 179–203). Oxford: Oxford University Press.\nGrisby, A. (2017). The end of cyber norms. *Survival*, 59(6), 109–122. doi:10.1080/00396338.2017.1399730\nGrisby, A. (2018, October 29). Unpacking the competing Russian and U.S. cyberspace resolutions at the United Nations. *Council on Foreign Relations* blog. Retrieved from https://www.cfr.org/blog/unpacking-competing-russian-and-us-cyberspace-resolutions-united-nations\nHealey, J. (2012, February 22). Beyond attribution: Seeking national responsibility for cyber attacks. The Atlantic Council Issue Brief. Retrieved from http://www.atlanticcouncil.org/images/files/publication_pdfs/403/022212_ACUS_NatlResponsibilityCyber.PDF\nJensen, B. (2017). The cyber character of political warfare. *Brown Journal of World Affairs*, 24(1), 159–171. Retrieved from http://bjwa.brown.edu/24-1/benjamin-jensen-the-cyber-character-of-political-warfare/\nJensen, B., &amp; Work, J. D. (2018, September 4). Cyber civil-military relations: Balancing interests on the digital frontier. *War on the Rocks*. Retrieved from https://warontherocks.com/2018/09/cyber-civil-military-relations-balancing-interests-on-the-digital-frontier/\nJoseph, M., &amp; Poznansky, M. (2017). Media technology, covert action, and the politics of exposure. *Journal of Peace Research*, 55, 320–335. doi:10.1177/0022343317731508\nKello, L. (2013). The meaning of the cyber revolution: Perils to theory and statecraft. *International Security*, 38(2), 7–40. doi:10.1162/ISEC_a_00138\nKello, L. (2014). Les cyberarmes: dilemmes et futurs possibles [The virtual weapon: Dilemmas and future scenarios]. *Politique Etrangère*, Winter(4), 139–150. doi:10.3917/pe.144.0139\nKello, L. (2017). The virtual weapon and international order. New-Haven, CT: Yale University Press.\nLapowski, I. (2018, October 26). Iran’s new Facebook trolls are using Russia’s playbook. *Wired*. Retrieved from https://www.wired.com/story/iran-facebook-trolls-using-russia-playbook/\nLibicki, M. (2009). Cyberdeterrence and Cyberwar. Santa Monica, CA: RAND Corporation.\nLin, H. (2012). Escalation dynamics and conflict termination in cyberspace. *Strategic Studies Quarterly*, 6(3), 46–70.\nLin, H., &amp; Smeets, M. (2018, May 3). What is absent from the U.S. cyber command ‘vision’. *Lawfare*. Retrieved from https://www.lawfareblog.com/what-absent-us-cyber-command-vision#\nLyu, J. (2018, October 19). A Chinese perspective on the pentagon’s cyber strategy: From ‘active cyber defense’ to ‘defend forward’. *Lawfare*. Retrieved from https://\n380\nS. TAILLAT\nwww.lawfareblog.com/chinese-perspective-pentagons-cyber-strategy-active-cyber-defense-defending-forward\nMaurer, T. (2017). Cyber mercenaries. The state, hackers and power. Cambridge: Cambridge University Press.\nMeijer, H., &amp; Jensen, B. (2018). The strategist’s dilemma: Global dynamic density and the making of US ‘China policy’. European Journal of International Security, 3, 211–234. doi:10.1017/eis.2017.17\nMueller, M. (2017). Will the internet fragment? Sovereignty, globalization and cyberspace. Cambridge: Polity Press.\nNissenbaum, H. (2005). When computer security meets national security. Ethics and Information Technology, 7(2), 61–73. doi:10.1007/s10676-005-4582-3\nNye, J. (2016/2017). Deterrence and dissuasion in cyberspace. International Security, 41(3), 44–71. doi:10.1162/ISEC_a_00266\nPoznansky, M., &amp; Perkoski, E. (2018). Rethinking secrecy in cyberspace: The politics of voluntary attribution. Journal of Global Security Studies, 3, 402–416. doi:10.1093/jogss/ogy022\nPROOFPOINT. (2018). The Human Factor 2018 Report. Retrieved from https://www.proofpoint.com/sites/default/files/pfpt-uk-tr-the-human-factor-2018.pdf\nRid, T. (2012). Cyber war will not take place. Journal of Strategic Studies, 35(1), 5–32. doi:10.1080/01402390.2011.608939\nRid, T., &amp; Buchanan, B. (2015). Attributing cyber attacks. Journal of Strategic Studies, 38(1-2), 4–37. doi:10.1080/01402390.2014.977382\nRid, T., &amp; McBurney, P. (2012). Cyber-weapons. The RUSI Journal, 157(1), 6–13. doi:10.1080/03071847.2012.664354\nSanger, D. (2018, June 17). Pentagon puts cyberwarriors on the offensive, increasing the risk of conflict. The New-York Times. Retrieved from https://www.nytimes.com/2018/06/17/us/politics/cyber-command-trump.html\nSchmitt, M. (Ed.). (2013). Tallinn manual on the international law applicable to cyber warfare. Cambridge: Cambridge University Press.\nSchmitt, M. (Ed.). (2017). Tallinn manual 2.0 on the international law applicable to cyber operations. Cambridge: Cambridge University Press.\nSchneier, B. (2008). The psychology of security. In S. Vaudenay (Ed.), Progress in cryptology – AFRICACRPT 2008. Lecture notes in computer science (Vol. 5023, pp. 50–79). Berlin: Springer.\nSharp, T. (2017). Theorizing cyber coercion: The 2014 North Korean operation against Sony. Journal of Strategic Studies, 40, 898–926. doi:10.1080/01402390.2017.1307741\nSmeets, M. (2018). A matter of time: On the transitory nature of cyberweapons. Journal of Strategic Studies, 41(1-2), 6–32. doi:10.1080/01402390.2017.1288107\nSolon, A. (2018, August 22). Facebook removes 652 fake accounts and pages meant to influence world politics. The Guardian. Retrieved from https://www.theguardian.com/technology/2018/aug/21/facebook-pages-accounts-removed-russia-iran\nStarosielski, N. (2018). Strangling the internet. Limn, 10. Retrieved from https://limn.it/articles/strangling-the-internet/\nSteiger, S., Harnisch, S., Zettl, K., &amp; Lohmann, J. (2018). Conceptualising conflicts in cyberspace. Journal of Cyber Policy, 3(1), 77–95. doi:10.1080/23738871.2018.1453526\nStone, J. (2013). Cyber war will take place!. Journal of Strategic Studies, 36(1), 101–108. doi:10.1080/01402390.2012.730485\nCONTEMPORARY SECURITY POLICY\n381\nValeriano, B., &amp; Maness, R. (2014). The dynamics of conflicts between rival antagonists, 2001-2011. Journal of Peace Research, 51, 347–360. doi:10.1177/0022343313518940\nValeriano, B., Jensen, B., &amp; Maness, R. (2018). Cyber strategy. The evolving character of power and coercion. Oxford: Oxford University Press.\nValeriano, B., &amp; Maness, R. (2015). Cyber war versus cyber realities. Cyber conflict in the international system. Oxford: Oxford University Press.\nWeber, C., &amp; Jean-Philippe. (2018). La place de l'homme dans les enjeux de cybersécurité [Human in cybersecurity issues]. *Stratégique*, 117(4), 83–98. Retrieved from https://www.cairn.info/revue-strategique-2017-4-page-83.htm\nZetter, K. (2015). Countdown to zero day: Stuxnet and the launch of the world's first digital weapon. New-York, NY: Crown Publishing."
  ],
  "flat_text": "Check here Contemporary Security Policy R Routledge Taylor &amp; Francis Group ISSN: 1352-3260 (Print) 1743-8764 (Online) Journal homepage: www.tandfonline.com/journals/fcsp20 # Disrupt and restraint: The evolution of cyber conflict and the implications for collective security Stéphane Taillat To cite this article: Stéphane Taillat (2019) Disrupt and restraint: The evolution of cyber conflict and the implications for collective security, Contemporary Security Policy, 40:3, 368-381, DOI: 10.1080/13523260.2019.1581458 To link to this article: https://doi.org/10.1080/13523260.2019.1581458 Published online: 26 Feb 2019.\nSubmit your article to this journal Article views: 1931 View related articles View Crossmark data Citing articles: 2 View citing articles Full Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=fcsp20 CONTEMPORARY SECURITY POLICY 2019, VOL. 40, NO. 3, 368-381 https://doi.org/10.1080/13523260.2019.1581458 Routledge Taylor &amp; Francis Group Check for updates # Disrupt and restraint: The evolution of cyber conflict and the implications for collective security Stéphane Taillat International Relations and Strategic Studies, St Cyr French Army Academy, Guer, France # ABSTRACT In the last decade, cyber conflict has become a main feature of international politics and a growing concern for strategic stability and collective security. Unfortunately, cyber conflict suffers from a lack of conceptual clarity about its impact on collective security and a lack of consensus among international actors on how to interpret it. This article proposes to understand cyber conflict as an evolving process driven by two factors: the way in which digital space is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber have been included in the field of national and international security. Both tend to encourage offensive behavior but also demonstrate features pointing to restraint.\nKEYWORDS Collective security; cyber conflict; international security Cyber conflict suffers from a lack of conceptual clarity and a lack of consensus among key international actors on how to interpret it. For years, academics have struggled to account for the potentialities and effects of digital technologies on conflict dynamics. The debate has focused on the inclusion of cyber conflict in the Clausewitzian conceptualization of war. Several researchers have taken into account the specificities of cyber confrontation but have also sought to explain the gaps between expectations and behaviors, whether in terms of attribution (Rid &amp; Buchanan, 2015), deterrence (Fischerkeller &amp; Harknett, 2017; Libicki, 2009; Nye, 2016/2017), escalation dynamics, coercion (Borghard &amp; Lonergan, 2017; Gartzke &amp; Lindsay, 2016; Sharp, 2017), and the offensive-dominant character of conflict in cyberspace (Gartzke &amp; Lindsay, 2015).\nOthers have attempted to account for the empirical evolution of cyber conflict toward restraint or aggression below the threshold of armed force (Steiger, Harnisch, Zettl, &amp; Lohmann, 2018; Valeriano &amp; Maness, 2015) or to question these dynamics through the prism of covert actions and deniability (Joseph &amp; Poznansky, 2017; Poznansky &amp; Perkoski, 2018). Finally, the CONTACT Stéphane Taillat stephane.taillat@st-cyr.terre-net.defense.gouv.fr © 2019 Informa UK Limited, trading as Taylor &amp; Francis Group debates have focused on the relevance and methods of social sciences for analysing cyber conflict. Jurists have also examined the particularities of cyberspace and cyber operations to assess the possible application of legal categories, without reaching consensus or formally guiding governments.\nIn addition to these academic debates, there are divergent representations between the main powers concerning the challenges and threats related to the cyber domain in the context of a growing opposition between their interests. These divergences stem from the conceptualization of cyberspace. For China and Russia, for example, the information space includes all digital networks but also the political and social sphere. The main threat therefore stems from the ability of opponents (mainly the United States and Western countries) to destabilize these political regimes and threaten their control over society. For the United States and many European states, cyberspace mainly includes computer networks and the economic, industrial, or military activities that depend on them. The threat is therefore more about a competitor's ability to exploit the high digitization of these societies to gain an asymmetric advantage or cause catastrophic damage.\nThere is therefore a heterogeneity of values and interests, fueled by the logics of their long-term strategic competition. As a result, this heterogeneous feature of the international system results in the absence of a framework of shared meanings to limit tensions, manage conflicts, and control the risk of escalation. Moreover, the possibility of exploiting cyberspace from an asymmetrical perspective contributes to emboldening revolutionary or revisionist actors, as evidenced by the shift towards increasingly risky modes of action and strategies that contribute to disrupting the entire international normative system in peacetime.\nThe difficulty of defining cyber conflict and establishing international rules is problematic from the point of view of collective security. This difficulty is part of a more general evolution toward the blurring of conventional categories on conflicts, war and warfare. The purpose of this article is not to resolve these differences or to synthesize these conceptual approaches. In this article, I postulate that war and conflict are categories that depend on how actors interpret and integrate them into their practices and strategies. Thus, the current heterogeneity of the international system is fueled and in turn feeds these divergences of interpretation and the polarization of rivalries. Therefore, it is not possible to objectively define contemporary cyber conflict.\nCyber conflict is subject to changing evolutions and characteristics. I thus propose to understand these changing evolutions and characteristics through an analytical framework structured around two processes: the way in which digital domain is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber security have been included in the field of national and international security. This has two consequences for collective security. First, the configuration of the cyber domain produces incentives for offensive action but within a framework characterized by low operational efficiency. Second, cyber conflict is particularly dependent on interactions between actors and therefore on strategic contexts such as long-term strategic competition.\nThis article will proceed in two steps. First, it will focus on how the configuration of the cyber domain affects the incentive to act offensively while remaining below a certain threshold of aggression. Second, it will analyze how cyber capabilities have been included in national and international security issues, generating a strong sensitivity to cyber security issues.\n## Strategic opportunities and challenges in the digital domain Cyberspace is a field of confrontation, a challenge, and a means by which rivalries can be expressed. It covers an increasingly broad range of economic, political, social, cultural and security dimensions and activities, creating interdependence between them at every geopolitical level. This field is characterized by the interaction between technologies, uses, power rivalries and the increasing integration of private and public, military and civil, national, transnational, regional, and international dimensions. Cyberspace is therefore the result of a historical and socio-political process that in turn sets out a space of strategic choices, which shapes the behavior of both state and non-state actors.\n### The ubiquity of vulnerabilities The pervasiveness of vulnerabilities is the main feature of cyberspace. Thus, this space is marked by a large number of targets, entry points, and attack vectors. However, the distribution of potential targets is uneven. The traditional division into physical, logical, informational, and social layers provides a first framework for analysis. But it is possible to specify it with other frameworks.\nFirst, the type of infrastructure. As Smeets (2018) shows, vulnerabilities can be hardware, software, networks, and communication protocols between machines as well as individuals or organizations. He proposes to classify them according to the potential to exploit them on the one hand, and the potential to remedy them on the other. Software vulnerabilities are easier to exploit than hardware or network vulnerabilities, but also easier to patch once discovered (pp. 13--14). Human vulnerabilities also appear to be more related to organizational cultures and procedures than to individual cognitive biases.\nSecond, not all targeted systems are accessible in the same way. A system can be accessible through the global Internet network or from a system in a closed network that requires access to this network first. Kello (2017) proposes to map cyberspace by distinguishing between the global network (the Internet), the WorldWideWeb, and a “cyber archipelago” composed of the “air gaped” networks (p. 45). The latter are not inaccessible but require more resources and effort or even risks taking. Third, the geopolitical distribution of assets, digital infrastructures, or legal architectures determines resources and vulnerabilities. The geography of transoceanic cables invites us to think of cyberspace in terms of chokepoints or according to a logic of interdependence. The same applies to the location of data centers or the legislative requirement for Web companies to host national user data on national soil. Hence the strategic implications of a potential “Internet Balkanization”: a political fragmentation of the Internet but also the creation of a striated space limiting the capacities of access, maneuver, and the production of operational effects.\nThis mapping thus delimits a space for the strategic choices of the actors. It also helps to better explain the frequency of low-intensity attacks against soft targets and the relative difficulty of putting critical infrastructure at risk. Nevertheless, it also shows why no intrusion is insignificant in terms of these crucial issues and assets for national security and collective security.\n### Security and strategic dilemmas Technologies contribute to uncertainty about the identity and intentions of an attacker. There is therefore a security dilemma specific to cyber conflict. This is based on the difficulty in interpreting intrusions and interference either as operational preparation, as intelligence collection, or as hold at risk operation. At the same time, the specificities of cyber operations encourage penetration of others' networks and interference in their processes. The increase in cyberspace-related issues (see below) contributes to these dynamics. This explains the importance of the attribution process, which Rid and Buchanan (2015) have shown to be ambiguous and of a political and strategic nature.\nImputing an action to an author is made more complex and time-consuming due to technical factors allowing relative anonymity, organizational factors allowing not to acknowledge responsibility but also political factors. Therefore, a victim's probability of attributing and responding depends on his or her cost structure, that is what is at stake for the victim. However, from the point of view of the attacker, it is not possible to quantify exactly those elements which may contain material or symbolic aspects, but which also depend on the context in which the decision-makers are placed. In the case of issues considered important or even existential, the trade-off between the urgency of attributing and responding and the risks associated with incomplete communication or hasty response is less acute than in the case of less important issues. The propensity of decision-makers to take risks is therefore an important variable, both for the victim and for the current or potential aggressor.\nThe complexity of the attribution process results in a latency period with a significant impact on the credibility of deterrence. Besides, the nature of the information making it possible to conclude that an actor is liable requires compromises between preserving the capacities that made it possible to collect these elements and presenting the case with the most indisputable evidence possible. As a result, the attribution process weakens an actor's ability to demonstrate resolution and keep aggressors at bay.\nDigitization therefore increases the margin of maneuver below the threshold of the use of force. This therefore allows actors to pursue several of their objectives without incurring the penalties associated with the use of aggression, or at least by limiting these risks. Nevertheless, this freedom of action is hampered in practice because of its dependence on three factors. First, by the type of weapon or tactic used. On the one hand, offensive means are unevenly distributed between a small number of weapons or targeted actions (of which Stuxnet is an archetype) and a very large number of more indiscriminate tools (Distributed Denial of Service attacks for example). On the other hand, this situation reflects the difficulty of producing the desired effects either on the targeted social groups or organizations or on the targeted digital systems. The question of force control and its effects is therefore particularly acute when the action can produce side effects or backfires. Unless the initiator of the attack seeks to produce such indiscriminate effects, takes the risk of their probability or can exploit them in a timely manner to increase his or her reputation for resolution or capacity, this first factor produces a negative incentive to take risks.\nSecond, the margin for maneuver depends on the organizational sophistication of the attacker. This includes the available resources, the ability to mobilize and exploit them to produce the desired results and the propensity to limit errors and friction at least in planning and managing the operation. This point highlights the dilemmas and challenges characteristic of a cyber operation: It requires time, it is guided by the issue of operational security, it requires flexibility and the ability to seize opportunities that develop in interaction with the adversary and the environment.\nThird, it depends on the target's behavior, either in previous attacks or through the precedent resulting from its own offensive operations. These successive behaviors shape expectations and beliefs, but also future norms. The case of the United States is particularly enlightening. Stuxnet may have set a precedent for offensive or even disruptive actions by others, either in retaliation or to prevent further operations (the Iranians and the Shamoon virus against Saudi Aramco in August 2012 or the multiple operations carried out against the banking system, universities or certain actors in the American energy sector since 2013), or as justification (the use of the BlackEnergy malware against Ukrainian power plants in December 2015 attributed to Russia). On the contrary, the Obama administration's relative restraint in the face of the increase in attacks below the threshold for the use of armed force may have been interpreted as weakness and an incentive to take more risks.\nThis configuration is therefore a framework through which it is possible to weigh the constraints and opportunities of actions in relation to the effects to be achieved. Two contradictory trends emerge. On the one hand, cyber operations have a relative value to produce the expected effects. On the other hand, there is an incentive to act below a certain threshold. The result is the possibility of unexpected and counterproductive effects that suggest that the question should be considered in terms of strategic objectives and issues.\n## Diverging issues and conflicting practices in national and international security The representations of issues, threats, and opportunities partly explain how key actors have integrated cyber security, cyber warfare, and cyber policy issues into their strategies and in their relationships with others. This integration process is therefore not only functional but also corresponds to political and social logics. From this perspective, setting a precedent obviously matters insofar as it has an impact on the perceptions and calculations of other actors. Thus, the role of the United States, Russia, and China since the late-1990s has helped to shape debates, mechanisms, and practices in this field. But the integration of digital technologies and risks into international strategic relations has also depended on other categories of actors and their uses, as well as their role in the regulation or deregulation of cyber conflict.\n### Cyber as a national security issue The use of cyber operations in times of crisis, in negotiations or for national security reasons has become routine for states. Jensen (2017) refers to “21st Century Political Warfare” to characterize the return to “coercive diplomacy in the shadows” (p. 159) despite the limitations of cyber operations to persuade, compel or influence the behavior of other states. At the same time, there is no strong consensus or even shared understanding about the application of existing standards. The case of the United Nations Group of Governmental Experts on the Developments in the field of information and telecommunications in the context of international security (UN GGE) is instructive. Convened following a series of annual resolutions proposed by Russia to the United Nations General Assembly since 1998, this group, which included representatives of 15 and then 20 governments, reached non-binding consensus agreements in 2010. These reports respectively engaged states in defining common terms and challenges while encouraging dialogue; affirmed the applicability of international law and in particular the UN Charter in cyberspace and consolidated a core of standards of responsible behavior for states in cyberspace.\nThe 2016--2017 round of negotiations failed in June 2017 on the question of the legal options available to states to respond to hostile activities, with the United States wanting a right to self-defense to apply while Cuba feared that it would be used to justify unilateral punitive actions. At the same time, the member states of the Shanghai Cooperation Organization proposed a code of conduct in 2011 and then in 2015, but without success. In October 2018, Russia and the United States proposed competing resolutions to relaunch the UN GGE process. These behaviors can be explained not only by diverging interests but also by opposing representations about international relations, cyber security issues and the modes of governance they induce.\nTwo aspects accentuate this pluralism. On the one hand, the blurring of the categories between war and peace, but also of the criteria that make it possible to qualify an act of aggression in an indisputable way. On the other hand, the distinction between governmental and non-state actors is becoming blurred. However, the question of governance arises between the promoters of a multilateral approach and those of an approach that includes all stakeholders. At the same time, initiatives are emerging in the private sector, as illustrated by Microsoft's initiatives for a Digital Geneva Convention (2017) and a Cyber Security Tech Accord (2018).\nThe 2010s can be characterized, so far, by the progressive rise of security issues related to cyber, from computer security to national security. This is partly due to the simultaneous growth of the digital domain and of vulnerabilities that could potentially cause systemic damage. But this is also due to the diversification and diffusion of certain modes of action (DDoS, ransomwares). Finally, this is tied to the interpretation of certain precedents (Stuxnet, the DDoS attack on Estonia in 2007, the use of cyber operations by Russians against Georgia in 2008 or in Ukraine since 2014) as well as recurrent behaviors (the combination of criminal and political behavior by North Korean hackers, industrial and intellectual espionage by Chinese hackers).\nAnother more fundamental reason is the gradual construction of a threat discourse by both governments and security actors (government agencies, security companies) in a context of increasing competition among key international actors. Cybersecurity is therefore linked to existential threats to political regimes, the status of states on the international scene, social cohesion and economic prosperity. This process is intertwined with the divergence of representations between the main powers. While the United States insists on the strategic threat posed by China through its espionage campaigns in 2010--2015 and again since 2018, both China and Russia present United States' discourses, practices and military doctrines as fundamentally in conflict with their interpretation of sovereignty, both in domestic and international politics. This escalation of the stakes has profound consequences for the implementation of strategies and mechanisms designed to secure cyberspace or parts of it, to deal with threats or to modify existing power relations.\n### Practices of cyber conflict Government agencies and national security elites appear to have adopted the necessity of offensive doctrines and strategies to disrupt, coerce, and deter. In the United States, a proposed bill allowing companies to operate outside their networks (active cyber defense) illustrates the possible frustration with the failure of traditional deterrence policies, as does the shift in terminology within the Department of Defense to a “defend forward” posture defined as “confronting threats before they reach U.S. Networks” (Department of Defense, 2018; Lin & Smeets, 2018; Lyu, 2018; Sanger, 2018). More broadly, operational constraints alone are not enough to explain the practice of maintaining a presence in the digital networks of other states to hold certain targets at risk as a deterrent. Some governments have tried to influence constituencies in foreign countries through social media. Finally, other actors are carrying out disruptive actions towards the industrial and financial sectors, with much more destabilizing and insecure consequences.\nAmong these practices, those surrounding the research, development, accumulation and dissemination of zero-days, exploits and malware are worrying, as illustrated by the case of the EternalBlue exploit, developed by the United States National Security Agency (NSA), stolen and auctioned by a group of hackers suspected of being linked to Russian military intelligence and used in Wannacry and NotPetya. This case illustrates the risk of proliferation of cyber weapons, but also the risk of loss of control by their designers or owners. In this field, there is no consensual and shared policy to regulate these practices and ensure that states do not compromise all users. The segmentation of the effort to control the proliferation of the most dangerous exploits--because they are likely to cause the most damage--is even potentially counterproductive insofar as it can generate tensions and risks.\nThe intermingling between private and public, civil and military actors is also problematic. Some governments rely on state-sponsored actors to share technical and human resources but also to increase their ability to deny responsibility. However, this approach poses the classic dilemmas of the principal-agent type. Increased control by policy makers or government agencies reduces effectiveness and operational flexibility and reduces the ability to deny responsibility for an attack. The relaxation of this control by the principal increases tactical flexibility and adaptability but creates risks of escalation or misperception due to divergent or even competing agendas on the part of the agent.\nIn most European and North American countries, Internet hardware and software infrastructures are operated and maintained by the private sector. Thus, part of this sector is involved in security through software solutions or in the Threat Intelligence and Threat Analysis process. In addition, the private sector and the public sphere often appear as soft targets as part of indirect strategies seeking to modify power relations at the margins. Consequently, defense in depth would benefit from greater cooperation between the private and public sectors (information sharing, resource sharing, responsiveness), or even through integration or even control. Nevertheless, in addition to the costs of an approach of enrolling private sector forces in national security under government authority (which also depend on political cultures and institutions), there are also risks associated with identifying these actors with policy makers (increased by attribution issues). Moreover, the logic of the sovereign and those of these actors can come into confrontation and accentuate the politicization of private organizations. However, this is a means by which a multi-stakeholder approach or inclusive multilateralism can be deployed (Cattaruzza, Danet, Taillat, & Laudrain, 2016).\nIssues related to cyber security and digital technologies therefore have an undeniable strategic impact that is incommensurate with the relative utility of cyber capabilities. This phenomenon has continued to grow in a dialectic between the United States and its rivals on the one hand, and between the United States and the rest of the cyber conflict actors on the other. The result is a potentially unstable process because it is particularly sensitive to the behavior of major international security actors and, in particular, to misperceptions. The future evolution of cyber conflict is thus closely dependent on the propensity of actors to take risks or hold at risk the infrastructures and standards on which they nevertheless depend. Cyber conflict is particularly sensitive to the structuring of issues in a long-term strategic competition but also to a sudden change resulting from the risky behavior of an actor.\n## Conclusion The impact of digital and cyber-conflict technologies on international security depends both on the technical and operational characteristics of the cyber domain and on what states make of it. Interactions between states, and the rationales underlying their actions, are therefore affected by their perceptions of opportunities and vulnerabilities. In return, their strategic choices and the dilemmas that accompany them create potential for escalation and misperceptions that most want to avoid.\nThis raises the issue of collective security in a new way. Collective security depends on two factors: the establishment of a shared regime to regulate the use of digital technologies, and the ability of the main powers that guarantee the international political order to reach an agreement to fight against disruptive and revolutionary actors. The contemporary context of eroding trust between states and in the benefits of the international order would rather invite pessimism. Since the security dilemma feeds on uncertainty about the intentions of the actors, it produces even more instability if the latter are asymmetrical in terms of maintaining versus challenging the international political order. It is even more so when the legitimacy of the rules of the international game is called into question, especially when other actors contribute to the marginalization of states.",
  "citations": {
    "style": "author_year",
    "flat_text": "Check here Contemporary Security Policy R Routledge Taylor &amp; Francis Group ISSN: 1352-3260 (Print) 1743-8764 (Online) Journal homepage: www.tandfonline.com/journals/fcsp20 # Disrupt and restraint: The evolution of cyber conflict and the implications for collective security Stéphane Taillat To cite this article: Stéphane Taillat (2019) Disrupt and restraint: The evolution of cyber conflict and the implications for collective security, Contemporary Security Policy, 40:3, 368-381, DOI: 10.1080/13523260.2019.1581458 To link to this article: https://doi.org/10.1080/13523260.2019.1581458 Published online: 26 Feb 2019.\nSubmit your article to this journal Article views: 1931 View related articles View Crossmark data Citing articles: 2 View citing articles Full Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=fcsp20 CONTEMPORARY SECURITY POLICY 2019, VOL. 40, NO. 3, 368-381 https://doi.org/10.1080/13523260.2019.1581458 Routledge Taylor &amp; Francis Group Check for updates # Disrupt and restraint: The evolution of cyber conflict and the implications for collective security Stéphane Taillat International Relations and Strategic Studies, St Cyr French Army Academy, Guer, France # ABSTRACT In the last decade, cyber conflict has become a main feature of international politics and a growing concern for strategic stability and collective security. Unfortunately, cyber conflict suffers from a lack of conceptual clarity about its impact on collective security and a lack of consensus among international actors on how to interpret it. This article proposes to understand cyber conflict as an evolving process driven by two factors: the way in which digital space is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber have been included in the field of national and international security. Both tend to encourage offensive behavior but also demonstrate features pointing to restraint.\nKEYWORDS Collective security; cyber conflict; international security Cyber conflict suffers from a lack of conceptual clarity and a lack of consensus among key international actors on how to interpret it. For years, academics have struggled to account for the potentialities and effects of digital technologies on conflict dynamics. The debate has focused on the inclusion of cyber conflict in the Clausewitzian conceptualization of war. Several researchers have taken into account the specificities of cyber confrontation but have also sought to explain the gaps between expectations and behaviors, whether in terms of attribution (Rid &amp; Buchanan, 2015), deterrence (Fischerkeller &amp; Harknett, 2017; Libicki, 2009; Nye, 2016/2017), escalation dynamics, coercion (Borghard &amp; Lonergan, 2017; Gartzke &amp; Lindsay, 2016; Sharp, 2017), and the offensive-dominant character of conflict in cyberspace (Gartzke &amp; Lindsay, 2015).\nOthers have attempted to account for the empirical evolution of cyber conflict toward restraint or aggression below the threshold of armed force (Steiger, Harnisch, Zettl, &amp; Lohmann, 2018; Valeriano &amp; Maness, 2015) or to question these dynamics through the prism of covert actions and deniability (Joseph &amp; Poznansky, 2017; Poznansky &amp; Perkoski, 2018). Finally, the CONTACT Stéphane Taillat stephane.taillat@st-cyr.terre-net.defense.gouv.fr © 2019 Informa UK Limited, trading as Taylor &amp; Francis Group debates have focused on the relevance and methods of social sciences for analysing cyber conflict. Jurists have also examined the particularities of cyberspace and cyber operations to assess the possible application of legal categories, without reaching consensus or formally guiding governments.\nIn addition to these academic debates, there are divergent representations between the main powers concerning the challenges and threats related to the cyber domain in the context of a growing opposition between their interests. These divergences stem from the conceptualization of cyberspace. For China and Russia, for example, the information space includes all digital networks but also the political and social sphere. The main threat therefore stems from the ability of opponents (mainly the United States and Western countries) to destabilize these political regimes and threaten their control over society. For the United States and many European states, cyberspace mainly includes computer networks and the economic, industrial, or military activities that depend on them. The threat is therefore more about a competitor's ability to exploit the high digitization of these societies to gain an asymmetric advantage or cause catastrophic damage.\nThere is therefore a heterogeneity of values and interests, fueled by the logics of their long-term strategic competition. As a result, this heterogeneous feature of the international system results in the absence of a framework of shared meanings to limit tensions, manage conflicts, and control the risk of escalation. Moreover, the possibility of exploiting cyberspace from an asymmetrical perspective contributes to emboldening revolutionary or revisionist actors, as evidenced by the shift towards increasingly risky modes of action and strategies that contribute to disrupting the entire international normative system in peacetime.\nThe difficulty of defining cyber conflict and establishing international rules is problematic from the point of view of collective security. This difficulty is part of a more general evolution toward the blurring of conventional categories on conflicts, war and warfare. The purpose of this article is not to resolve these differences or to synthesize these conceptual approaches. In this article, I postulate that war and conflict are categories that depend on how actors interpret and integrate them into their practices and strategies. Thus, the current heterogeneity of the international system is fueled and in turn feeds these divergences of interpretation and the polarization of rivalries. Therefore, it is not possible to objectively define contemporary cyber conflict.\nCyber conflict is subject to changing evolutions and characteristics. I thus propose to understand these changing evolutions and characteristics through an analytical framework structured around two processes: the way in which digital domain is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber security have been included in the field of national and international security. This has two consequences for collective security. First, the configuration of the cyber domain produces incentives for offensive action but within a framework characterized by low operational efficiency. Second, cyber conflict is particularly dependent on interactions between actors and therefore on strategic contexts such as long-term strategic competition.\nThis article will proceed in two steps. First, it will focus on how the configuration of the cyber domain affects the incentive to act offensively while remaining below a certain threshold of aggression. Second, it will analyze how cyber capabilities have been included in national and international security issues, generating a strong sensitivity to cyber security issues.\n## Strategic opportunities and challenges in the digital domain Cyberspace is a field of confrontation, a challenge, and a means by which rivalries can be expressed. It covers an increasingly broad range of economic, political, social, cultural and security dimensions and activities, creating interdependence between them at every geopolitical level. This field is characterized by the interaction between technologies, uses, power rivalries and the increasing integration of private and public, military and civil, national, transnational, regional, and international dimensions. Cyberspace is therefore the result of a historical and socio-political process that in turn sets out a space of strategic choices, which shapes the behavior of both state and non-state actors.\n### The ubiquity of vulnerabilities The pervasiveness of vulnerabilities is the main feature of cyberspace. Thus, this space is marked by a large number of targets, entry points, and attack vectors. However, the distribution of potential targets is uneven. The traditional division into physical, logical, informational, and social layers provides a first framework for analysis. But it is possible to specify it with other frameworks.\nFirst, the type of infrastructure. As Smeets (2018) shows, vulnerabilities can be hardware, software, networks, and communication protocols between machines as well as individuals or organizations. He proposes to classify them according to the potential to exploit them on the one hand, and the potential to remedy them on the other. Software vulnerabilities are easier to exploit than hardware or network vulnerabilities, but also easier to patch once discovered (pp. 13--14). Human vulnerabilities also appear to be more related to organizational cultures and procedures than to individual cognitive biases.\nSecond, not all targeted systems are accessible in the same way. A system can be accessible through the global Internet network or from a system in a closed network that requires access to this network first. Kello (2017) proposes to map cyberspace by distinguishing between the global network (the Internet), the WorldWideWeb, and a “cyber archipelago” composed of the “air gaped” networks (p. 45). The latter are not inaccessible but require more resources and effort or even risks taking. Third, the geopolitical distribution of assets, digital infrastructures, or legal architectures determines resources and vulnerabilities. The geography of transoceanic cables invites us to think of cyberspace in terms of chokepoints or according to a logic of interdependence. The same applies to the location of data centers or the legislative requirement for Web companies to host national user data on national soil. Hence the strategic implications of a potential “Internet Balkanization”: a political fragmentation of the Internet but also the creation of a striated space limiting the capacities of access, maneuver, and the production of operational effects.\nThis mapping thus delimits a space for the strategic choices of the actors. It also helps to better explain the frequency of low-intensity attacks against soft targets and the relative difficulty of putting critical infrastructure at risk. Nevertheless, it also shows why no intrusion is insignificant in terms of these crucial issues and assets for national security and collective security.\n### Security and strategic dilemmas Technologies contribute to uncertainty about the identity and intentions of an attacker. There is therefore a security dilemma specific to cyber conflict. This is based on the difficulty in interpreting intrusions and interference either as operational preparation, as intelligence collection, or as hold at risk operation. At the same time, the specificities of cyber operations encourage penetration of others' networks and interference in their processes. The increase in cyberspace-related issues (see below) contributes to these dynamics. This explains the importance of the attribution process, which Rid and Buchanan (2015) have shown to be ambiguous and of a political and strategic nature.\nImputing an action to an author is made more complex and time-consuming due to technical factors allowing relative anonymity, organizational factors allowing not to acknowledge responsibility but also political factors. Therefore, a victim's probability of attributing and responding depends on his or her cost structure, that is what is at stake for the victim. However, from the point of view of the attacker, it is not possible to quantify exactly those elements which may contain material or symbolic aspects, but which also depend on the context in which the decision-makers are placed. In the case of issues considered important or even existential, the trade-off between the urgency of attributing and responding and the risks associated with incomplete communication or hasty response is less acute than in the case of less important issues. The propensity of decision-makers to take risks is therefore an important variable, both for the victim and for the current or potential aggressor.\nThe complexity of the attribution process results in a latency period with a significant impact on the credibility of deterrence. Besides, the nature of the information making it possible to conclude that an actor is liable requires compromises between preserving the capacities that made it possible to collect these elements and presenting the case with the most indisputable evidence possible. As a result, the attribution process weakens an actor's ability to demonstrate resolution and keep aggressors at bay.\nDigitization therefore increases the margin of maneuver below the threshold of the use of force. This therefore allows actors to pursue several of their objectives without incurring the penalties associated with the use of aggression, or at least by limiting these risks. Nevertheless, this freedom of action is hampered in practice because of its dependence on three factors. First, by the type of weapon or tactic used. On the one hand, offensive means are unevenly distributed between a small number of weapons or targeted actions (of which Stuxnet is an archetype) and a very large number of more indiscriminate tools (Distributed Denial of Service attacks for example). On the other hand, this situation reflects the difficulty of producing the desired effects either on the targeted social groups or organizations or on the targeted digital systems. The question of force control and its effects is therefore particularly acute when the action can produce side effects or backfires. Unless the initiator of the attack seeks to produce such indiscriminate effects, takes the risk of their probability or can exploit them in a timely manner to increase his or her reputation for resolution or capacity, this first factor produces a negative incentive to take risks.\nSecond, the margin for maneuver depends on the organizational sophistication of the attacker. This includes the available resources, the ability to mobilize and exploit them to produce the desired results and the propensity to limit errors and friction at least in planning and managing the operation. This point highlights the dilemmas and challenges characteristic of a cyber operation: It requires time, it is guided by the issue of operational security, it requires flexibility and the ability to seize opportunities that develop in interaction with the adversary and the environment.\nThird, it depends on the target's behavior, either in previous attacks or through the precedent resulting from its own offensive operations. These successive behaviors shape expectations and beliefs, but also future norms. The case of the United States is particularly enlightening. Stuxnet may have set a precedent for offensive or even disruptive actions by others, either in retaliation or to prevent further operations (the Iranians and the Shamoon virus against Saudi Aramco in August 2012 or the multiple operations carried out against the banking system, universities or certain actors in the American energy sector since 2013), or as justification (the use of the BlackEnergy malware against Ukrainian power plants in December 2015 attributed to Russia). On the contrary, the Obama administration's relative restraint in the face of the increase in attacks below the threshold for the use of armed force may have been interpreted as weakness and an incentive to take more risks.\nThis configuration is therefore a framework through which it is possible to weigh the constraints and opportunities of actions in relation to the effects to be achieved. Two contradictory trends emerge. On the one hand, cyber operations have a relative value to produce the expected effects. On the other hand, there is an incentive to act below a certain threshold. The result is the possibility of unexpected and counterproductive effects that suggest that the question should be considered in terms of strategic objectives and issues.\n## Diverging issues and conflicting practices in national and international security The representations of issues, threats, and opportunities partly explain how key actors have integrated cyber security, cyber warfare, and cyber policy issues into their strategies and in their relationships with others. This integration process is therefore not only functional but also corresponds to political and social logics. From this perspective, setting a precedent obviously matters insofar as it has an impact on the perceptions and calculations of other actors. Thus, the role of the United States, Russia, and China since the late-1990s has helped to shape debates, mechanisms, and practices in this field. But the integration of digital technologies and risks into international strategic relations has also depended on other categories of actors and their uses, as well as their role in the regulation or deregulation of cyber conflict.\n### Cyber as a national security issue The use of cyber operations in times of crisis, in negotiations or for national security reasons has become routine for states. Jensen (2017) refers to “21st Century Political Warfare” to characterize the return to “coercive diplomacy in the shadows” (p. 159) despite the limitations of cyber operations to persuade, compel or influence the behavior of other states. At the same time, there is no strong consensus or even shared understanding about the application of existing standards. The case of the United Nations Group of Governmental Experts on the Developments in the field of information and telecommunications in the context of international security (UN GGE) is instructive. Convened following a series of annual resolutions proposed by Russia to the United Nations General Assembly since 1998, this group, which included representatives of 15 and then 20 governments, reached non-binding consensus agreements in 2010. These reports respectively engaged states in defining common terms and challenges while encouraging dialogue; affirmed the applicability of international law and in particular the UN Charter in cyberspace and consolidated a core of standards of responsible behavior for states in cyberspace.\nThe 2016--2017 round of negotiations failed in June 2017 on the question of the legal options available to states to respond to hostile activities, with the United States wanting a right to self-defense to apply while Cuba feared that it would be used to justify unilateral punitive actions. At the same time, the member states of the Shanghai Cooperation Organization proposed a code of conduct in 2011 and then in 2015, but without success. In October 2018, Russia and the United States proposed competing resolutions to relaunch the UN GGE process. These behaviors can be explained not only by diverging interests but also by opposing representations about international relations, cyber security issues and the modes of governance they induce.\nTwo aspects accentuate this pluralism. On the one hand, the blurring of the categories between war and peace, but also of the criteria that make it possible to qualify an act of aggression in an indisputable way. On the other hand, the distinction between governmental and non-state actors is becoming blurred. However, the question of governance arises between the promoters of a multilateral approach and those of an approach that includes all stakeholders. At the same time, initiatives are emerging in the private sector, as illustrated by Microsoft's initiatives for a Digital Geneva Convention (2017) and a Cyber Security Tech Accord (2018).\nThe 2010s can be characterized, so far, by the progressive rise of security issues related to cyber, from computer security to national security. This is partly due to the simultaneous growth of the digital domain and of vulnerabilities that could potentially cause systemic damage. But this is also due to the diversification and diffusion of certain modes of action (DDoS, ransomwares). Finally, this is tied to the interpretation of certain precedents (Stuxnet, the DDoS attack on Estonia in 2007, the use of cyber operations by Russians against Georgia in 2008 or in Ukraine since 2014) as well as recurrent behaviors (the combination of criminal and political behavior by North Korean hackers, industrial and intellectual espionage by Chinese hackers).\nAnother more fundamental reason is the gradual construction of a threat discourse by both governments and security actors (government agencies, security companies) in a context of increasing competition among key international actors. Cybersecurity is therefore linked to existential threats to political regimes, the status of states on the international scene, social cohesion and economic prosperity. This process is intertwined with the divergence of representations between the main powers. While the United States insists on the strategic threat posed by China through its espionage campaigns in 2010--2015 and again since 2018, both China and Russia present United States' discourses, practices and military doctrines as fundamentally in conflict with their interpretation of sovereignty, both in domestic and international politics. This escalation of the stakes has profound consequences for the implementation of strategies and mechanisms designed to secure cyberspace or parts of it, to deal with threats or to modify existing power relations.\n### Practices of cyber conflict Government agencies and national security elites appear to have adopted the necessity of offensive doctrines and strategies to disrupt, coerce, and deter. In the United States, a proposed bill allowing companies to operate outside their networks (active cyber defense) illustrates the possible frustration with the failure of traditional deterrence policies, as does the shift in terminology within the Department of Defense to a “defend forward” posture defined as “confronting threats before they reach U.S. Networks” (Department of Defense, 2018; Lin & Smeets, 2018; Lyu, 2018; Sanger, 2018). More broadly, operational constraints alone are not enough to explain the practice of maintaining a presence in the digital networks of other states to hold certain targets at risk as a deterrent. Some governments have tried to influence constituencies in foreign countries through social media. Finally, other actors are carrying out disruptive actions towards the industrial and financial sectors, with much more destabilizing and insecure consequences.\nAmong these practices, those surrounding the research, development, accumulation and dissemination of zero-days, exploits and malware are worrying, as illustrated by the case of the EternalBlue exploit, developed by the United States National Security Agency (NSA), stolen and auctioned by a group of hackers suspected of being linked to Russian military intelligence and used in Wannacry and NotPetya. This case illustrates the risk of proliferation of cyber weapons, but also the risk of loss of control by their designers or owners. In this field, there is no consensual and shared policy to regulate these practices and ensure that states do not compromise all users. The segmentation of the effort to control the proliferation of the most dangerous exploits--because they are likely to cause the most damage--is even potentially counterproductive insofar as it can generate tensions and risks.\nThe intermingling between private and public, civil and military actors is also problematic. Some governments rely on state-sponsored actors to share technical and human resources but also to increase their ability to deny responsibility. However, this approach poses the classic dilemmas of the principal-agent type. Increased control by policy makers or government agencies reduces effectiveness and operational flexibility and reduces the ability to deny responsibility for an attack. The relaxation of this control by the principal increases tactical flexibility and adaptability but creates risks of escalation or misperception due to divergent or even competing agendas on the part of the agent.\nIn most European and North American countries, Internet hardware and software infrastructures are operated and maintained by the private sector. Thus, part of this sector is involved in security through software solutions or in the Threat Intelligence and Threat Analysis process. In addition, the private sector and the public sphere often appear as soft targets as part of indirect strategies seeking to modify power relations at the margins. Consequently, defense in depth would benefit from greater cooperation between the private and public sectors (information sharing, resource sharing, responsiveness), or even through integration or even control. Nevertheless, in addition to the costs of an approach of enrolling private sector forces in national security under government authority (which also depend on political cultures and institutions), there are also risks associated with identifying these actors with policy makers (increased by attribution issues). Moreover, the logic of the sovereign and those of these actors can come into confrontation and accentuate the politicization of private organizations. However, this is a means by which a multi-stakeholder approach or inclusive multilateralism can be deployed (Cattaruzza, Danet, Taillat, & Laudrain, 2016).\nIssues related to cyber security and digital technologies therefore have an undeniable strategic impact that is incommensurate with the relative utility of cyber capabilities. This phenomenon has continued to grow in a dialectic between the United States and its rivals on the one hand, and between the United States and the rest of the cyber conflict actors on the other. The result is a potentially unstable process because it is particularly sensitive to the behavior of major international security actors and, in particular, to misperceptions. The future evolution of cyber conflict is thus closely dependent on the propensity of actors to take risks or hold at risk the infrastructures and standards on which they nevertheless depend. Cyber conflict is particularly sensitive to the structuring of issues in a long-term strategic competition but also to a sudden change resulting from the risky behavior of an actor.\n## Conclusion The impact of digital and cyber-conflict technologies on international security depends both on the technical and operational characteristics of the cyber domain and on what states make of it. Interactions between states, and the rationales underlying their actions, are therefore affected by their perceptions of opportunities and vulnerabilities. In return, their strategic choices and the dilemmas that accompany them create potential for escalation and misperceptions that most want to avoid.\nThis raises the issue of collective security in a new way. Collective security depends on two factors: the establishment of a shared regime to regulate the use of digital technologies, and the ability of the main powers that guarantee the international political order to reach an agreement to fight against disruptive and revolutionary actors. The contemporary context of eroding trust between states and in the benefits of the international order would rather invite pessimism. Since the security dilemma feeds on uncertainty about the intentions of the actors, it produces even more instability if the latter are asymmetrical in terms of maintaining versus challenging the international political order. It is even more so when the legitimacy of the rules of the international game is called into question, especially when other actors contribute to the marginalization of states.",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "Check here\nContemporary Security Policy\nR\nRoutledge Taylor &amp; Francis Group\nISSN: 1352-3260 (Print) 1743-8764 (Online) Journal homepage: www.tandfonline.com/journals/fcsp20\n# Disrupt and restraint: The evolution of cyber conflict and the implications for collective security\nStéphane Taillat\nTo cite this article: Stéphane Taillat (2019) Disrupt and restraint: The evolution of cyber conflict and the implications for collective security, Contemporary Security Policy, 40:3, 368-381, DOI: 10.1080/13523260.2019.1581458\nTo link to this article: https://doi.org/10.1080/13523260.2019.1581458\nPublished online: 26 Feb 2019.\nSubmit your article to this journal\nArticle views: 1931\nView related articles\nView Crossmark data\nCiting articles: 2 View citing articles\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=fcsp20\nCONTEMPORARY SECURITY POLICY\n2019, VOL. 40, NO. 3, 368-381\nhttps://doi.org/10.1080/13523260.2019.1581458\nRoutledge\nTaylor &amp; Francis Group\nCheck for updates\n# Disrupt and restraint: The evolution of cyber conflict and the implications for collective security\nStéphane Taillat\nInternational Relations and Strategic Studies, St Cyr French Army Academy, Guer, France\n# ABSTRACT\nIn the last decade, cyber conflict has become a main feature of international politics and a growing concern for strategic stability and collective security. Unfortunately, cyber conflict suffers from a lack of conceptual clarity about its impact on collective security and a lack of consensus among international actors on how to interpret it. This article proposes to understand cyber conflict as an evolving process driven by two factors: the way in which digital space is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber have been included in the field of national and international security. Both tend to encourage offensive behavior but also demonstrate features pointing to restraint.\nKEYWORDS Collective security; cyber conflict; international security\nCyber conflict suffers from a lack of conceptual clarity and a lack of consensus among key international actors on how to interpret it. For years, academics have struggled to account for the potentialities and effects of digital technologies on conflict dynamics. The debate has focused on the inclusion of cyber conflict in the Clausewitzian conceptualization of war (Rid, 2012; Stone, 2013). Several researchers have taken into account the specificities of cyber confrontation but have also sought to explain the gaps between expectations and behaviors, whether in terms of attribution (Rid &amp; Buchanan, 2015), deterrence (Fischerkeller &amp; Harknett, 2017; Libicki, 2009; Nye, 2016/2017), escalation dynamics (Lin, 2012; Valeriano, Jensen, &amp; Maness, 2018), coercion (Borghard &amp; Lonergan, 2017; Gartzke &amp; Lindsay, 2016; Sharp, 2017), and the offensive-dominant character of conflict in cyberspace (Gartzke &amp; Lindsay, 2015).\nOthers have attempted to account for the empirical evolution of cyber conflict toward restraint or aggression below the threshold of armed force (Steiger, Harnisch, Zettl, &amp; Lohmann, 2018; Valeriano &amp; Maness, 2015) or to question these dynamics through the prism of covert actions and deniability (Joseph &amp; Poznansky, 2017; Poznansky &amp; Perkoski, 2018). Finally, the\nCONTACT Stéphane Taillat stephane.taillat@st-cyr.terre-net.defense.gouv.fr\n© 2019 Informa UK Limited, trading as Taylor &amp; Francis Group\ndebates have focused on the relevance and methods of social sciences for analysing cyber conflict (Kello, 2013, 2014, 2017; Valeriano & Maness, 2014). Jurists have also examined the particularities of cyberspace and cyber operations to assess the possible application of legal categories, without reaching consensus or formally guiding governments (Schmitt, 2013, 2017).\nIn addition to these academic debates, there are divergent representations between the main powers concerning the challenges and threats related to the cyber domain in the context of a growing opposition between their interests. These divergences stem from the conceptualization of cyberspace. For China and Russia, for example, the information space includes all digital networks but also the political and social sphere. The main threat therefore stems from the ability of opponents (mainly the United States and Western countries) to destabilize these political regimes and threaten their control over society. For the United States and many European states, cyberspace mainly includes computer networks and the economic, industrial, or military activities that depend on them. The threat is therefore more about a competitor's ability to exploit the high digitization of these societies to gain an asymmetric advantage or cause catastrophic damage.\nThere is therefore a heterogeneity of values and interests, fueled by the logics of their long-term strategic competition. As a result, this heterogeneous feature of the international system results in the absence of a framework of shared meanings to limit tensions, manage conflicts, and control the risk of escalation. Moreover, the possibility of exploiting cyberspace from an asymmetrical perspective contributes to emboldening revolutionary or revisionist actors, as evidenced by the shift towards increasingly risky modes of action and strategies that contribute to disrupting the entire international normative system in peacetime.\nThe difficulty of defining cyber conflict and establishing international rules is problematic from the point of view of collective security. This difficulty is part of a more general evolution toward the blurring of conventional categories on conflicts, war and warfare. The purpose of this article is not to resolve these differences or to synthesize these conceptual approaches. In this article, I postulate that war and conflict are categories that depend on how actors interpret and integrate them into their practices and strategies. Thus, the current heterogeneity of the international system is fueled and in turn feeds these divergences of interpretation and the polarization of rivalries. Therefore, it is not possible to objectively define contemporary cyber conflict.\nCyber conflict is subject to changing evolutions and characteristics. I thus propose to understand these changing evolutions and characteristics through an analytical framework structured around two processes: the way in which digital domain is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber security have been included in the field of national and international security. This has two\nconsequences for collective security. First, the configuration of the cyber domain produces incentives for offensive action but within a framework characterized by low operational efficiency. Second, cyber conflict is particularly dependent on interactions between actors and therefore on strategic contexts such as long-term strategic competition.\nThis article will proceed in two steps. First, it will focus on how the configuration of the cyber domain affects the incentive to act offensively while remaining below a certain threshold of aggression. Second, it will analyze how cyber capabilities have been included in national and international security issues, generating a strong sensitivity to cyber security issues.\n## Strategic opportunities and challenges in the digital domain\nCyberspace is a field of confrontation, a challenge, and a means by which rivalries can be expressed. It covers an increasingly broad range of economic, political, social, cultural and security dimensions and activities, creating interdependence between them at every geopolitical level. This field is characterized by the interaction between technologies, uses, power rivalries and the increasing integration of private and public, military and civil, national, transnational, regional, and international dimensions. Cyberspace is therefore the result of a historical and socio-political process that in turn sets out a space of strategic choices, which shapes the behavior of both state and non-state actors.\n### The ubiquity of vulnerabilities\nThe pervasiveness of vulnerabilities is the main feature of cyberspace (Libicki, 2009, p. xiv). Thus, this space is marked by a large number of targets, entry points, and attack vectors. However, the distribution of potential targets is uneven. The traditional division into physical, logical, informational, and social layers provides a first framework for analysis. But it is possible to specify it with other frameworks.\nFirst, the type of infrastructure. As Smeets (2018) shows, vulnerabilities can be hardware, software, networks, and communication protocols between machines as well as individuals or organizations. He proposes to classify them according to the potential to exploit them on the one hand, and the potential to remedy them on the other. Software vulnerabilities are easier to exploit than hardware or network vulnerabilities, but also easier to patch once discovered (pp. 13--14). Human vulnerabilities also appear to be more related to organizational cultures and procedures than to individual cognitive biases (PROOFPOINT, 2018; Schneier, 2008; Weber & Jean-Philippe, 2018).\nSecond, not all targeted systems are accessible in the same way. A system can be accessible through the global Internet network or from a system in a closed network that requires access to this network first. Kello (2017) proposes\nto map cyberspace by distinguishing between the global network (the Internet), the WorldWideWeb, and a “cyber archipelago” composed of the “air gaped” networks (p. 45). The latter are not inaccessible but require more resources and effort or even risks taking. Third, the geopolitical distribution of assets, digital infrastructures, or legal architectures determines resources and vulnerabilities. The geography of transoceanic cables invites us to think of cyberspace in terms of chokepoints or according to a logic of interdependence (Starosielski, 2018). The same applies to the location of data centers or the legislative requirement for Web companies to host national user data on national soil. Hence the strategic implications of a potential “Internet Balkanization”: a political fragmentation of the Internet but also the creation of a striated space limiting the capacities of access, maneuver, and the production of operational effects.\nThis mapping thus delimits a space for the strategic choices of the actors. It also helps to better explain the frequency of low-intensity attacks against soft targets and the relative difficulty of putting critical infrastructure at risk. Nevertheless, it also shows why no intrusion is insignificant in terms of these crucial issues and assets for national security and collective security.\n### Security and strategic dilemmas\nTechnologies contribute to uncertainty about the identity and intentions of an attacker. There is therefore a security dilemma specific to cyber conflict. This is based on the difficulty in interpreting intrusions and interference either as operational preparation, as intelligence collection, or as hold at risk operation. At the same time, the specificities of cyber operations encourage penetration of others' networks and interference in their processes (Buchanan, 2017a). The increase in cyberspace-related issues (see below) contributes to these dynamics. This explains the importance of the attribution process, which Rid and Buchanan (2015) have shown to be ambiguous and of a political and strategic nature.\nImputing an action to an author is made more complex and time-consuming due to technical factors allowing relative anonymity, organizational factors allowing not to acknowledge responsibility but also political factors. Therefore, a victim's probability of attributing and responding depends on his or her cost structure, that is what is at stake for the victim. However, from the point of view of the attacker, it is not possible to quantify exactly those elements which may contain material or symbolic aspects, but which also depend on the context in which the decision-makers are placed. In the case of issues considered important or even existential, the trade-off between the urgency of attributing and responding and the risks associated with incomplete communication or hasty response is less acute than in the case of less important issues. The propensity of decision-makers to take\nrisks is therefore an important variable, both for the victim and for the current or potential aggressor.\nThe complexity of the attribution process results in a latency period with a significant impact on the credibility of deterrence. Besides, the nature of the information making it possible to conclude that an actor is liable requires compromises between preserving the capacities that made it possible to collect these elements and presenting the case with the most indisputable evidence possible. As a result, the attribution process weakens an actor's ability to demonstrate resolution and keep aggressors at bay.\nDigitization therefore increases the margin of maneuver below the threshold of the use of force. This therefore allows actors to pursue several of their objectives without incurring the penalties associated with the use of aggression, or at least by limiting these risks. Nevertheless, this freedom of action is hampered in practice because of its dependence on three factors. First, by the type of weapon or tactic used. On the one hand, offensive means are unevenly distributed between a small number of weapons or targeted actions (of which Stuxnet is an archetype) (Zetter, 2015) and a very large number of more indiscriminate tools (Distributed Denial of Service attacks for example) (Rid & McBurney, 2012; Smeets, 2018). On the other hand, this situation reflects the difficulty of producing the desired effects either on the targeted social groups or organizations or on the targeted digital systems. The question of force control and its effects is therefore particularly acute when the action can produce side effects or backfires. Unless the initiator of the attack seeks to produce such indiscriminate effects, takes the risk of their probability or can exploit them in a timely manner to increase his or her reputation for resolution or capacity, this first factor produces a negative incentive to take risks.\nSecond, the margin for maneuver depends on the organizational sophistication of the attacker. This includes the available resources, the ability to mobilize and exploit them to produce the desired results and the propensity to limit errors and friction at least in planning and managing the operation (Buchanan, 2017b). This point highlights the dilemmas and challenges characteristic of a cyber operation: It requires time, it is guided by the issue of operational security, it requires flexibility and the ability to seize opportunities that develop in interaction with the adversary and the environment.\nThird, it depends on the target's behavior, either in previous attacks or through the precedent resulting from its own offensive operations. These successive behaviors shape expectations and beliefs, but also future norms. The case of the United States is particularly enlightening. Stuxnet may have set a precedent for offensive or even disruptive actions by others, either in retaliation or to prevent further operations (the Iranians and the Shamoon virus against Saudi Aramco in August 2012 or the multiple operations carried out against the banking system, universities or certain actors in the American\nenergy sector since 2013), or as justification (the use of the BlackEnergy malware against Ukrainian power plants in December 2015 attributed to Russia). On the contrary, the Obama administration's relative restraint in the face of the increase in attacks below the threshold for the use of armed force may have been interpreted as weakness and an incentive to take more risks.\nThis configuration is therefore a framework through which it is possible to weigh the constraints and opportunities of actions in relation to the effects to be achieved. Two contradictory trends emerge. On the one hand, cyber operations have a relative value to produce the expected effects. On the other hand, there is an incentive to act below a certain threshold. The result is the possibility of unexpected and counterproductive effects that suggest that the question should be considered in terms of strategic objectives and issues.\n## Diverging issues and conflicting practices in national and international security\nThe representations of issues, threats, and opportunities partly explain how key actors have integrated cyber security, cyber warfare, and cyber policy issues into their strategies and in their relationships with others. This integration process is therefore not only functional but also corresponds to political and social logics. From this perspective, setting a precedent obviously matters insofar as it has an impact on the perceptions and calculations of other actors. Thus, the role of the United States, Russia, and China since the late-1990s has helped to shape debates, mechanisms, and practices in this field. But the integration of digital technologies and risks into international strategic relations has also depended on other categories of actors and their uses, as well as their role in the regulation or deregulation of cyber conflict.\n### Cyber as a national security issue\nThe use of cyber operations in times of crisis, in negotiations or for national security reasons has become routine for states. Jensen (2017) refers to “21st Century Political Warfare” to characterize the return to “coercive diplomacy in the shadows” (p. 159) despite the limitations of cyber operations to persuade, compel or influence the behavior of other states (Jensen & Work, 2018; Valeriano et al. 2018, p. 226). At the same time, there is no strong consensus or even shared understanding about the application of existing standards. The case of the United Nations Group of Governmental Experts on the Developments in the field of information and telecommunications in the context of international security (UN GGE) is instructive. Convened following a series of annual resolutions proposed by Russia to the United\nNations General Assembly since 1998, this group, which included representatives of 15 and then 20 governments, reached non-binding consensus agreements in 2010. These reports respectively engaged states in defining common terms and challenges while encouraging dialogue; affirmed the applicability of international law and in particular the UN Charter in cyberspace and consolidated a core of standards of responsible behavior for states in cyberspace.\nThe 2016--2017 round of negotiations failed in June 2017 on the question of the legal options available to states to respond to hostile activities, with the United States wanting a right to self-defense to apply while Cuba feared that it would be used to justify unilateral punitive actions (Grisby, 2017). At the same time, the member states of the Shanghai Cooperation Organization proposed a code of conduct in 2011 and then in 2015, but without success. In October 2018, Russia and the United States proposed competing resolutions to relaunch the UN GGE process (Grisby, 2018). These behaviors can be explained not only by diverging interests but also by opposing representations about international relations, cyber security issues and the modes of governance they induce.\nTwo aspects accentuate this pluralism. On the one hand, the blurring of the categories between war and peace, but also of the criteria that make it possible to qualify an act of aggression in an indisputable way. On the other hand, the distinction between governmental and non-state actors is becoming blurred. However, the question of governance arises between the promoters of a multilateral approach and those of an approach that includes all stakeholders (DeNardis, 2014; Mueller, 2017). At the same time, initiatives are emerging in the private sector, as illustrated by Microsoft's initiatives for a Digital Geneva Convention (2017) and a Cyber Security Tech Accord (2018).\nThe 2010s can be characterized, so far, by the progressive rise of security issues related to cyber, from computer security to national security (Balzacq & Dunn-Cavelty, 2016; Dunn-Cavelty, 2007; Nissenbaum, 2005). This is partly due to the simultaneous growth of the digital domain and of vulnerabilities that could potentially cause systemic damage. But this is also due to the diversification and diffusion of certain modes of action (DDoS, ransomwares) (Buchanan, 2016). Finally, this is tied to the interpretation of certain precedents (Stuxnet, the DDoS attack on Estonia in 2007, the use of cyber operations by Russians against Georgia in 2008 or in Ukraine since 2014) as well as recurrent behaviors (the combination of criminal and political behavior by North Korean hackers, industrial and intellectual espionage by Chinese hackers).\nAnother more fundamental reason is the gradual construction of a threat discourse by both governments and security actors (government agencies, security companies) in a context of increasing competition among key international actors. Cybersecurity is therefore linked to existential threats to political regimes, the status of states on the international scene, social cohesion\nand economic prosperity. This process is intertwined with the divergence of representations between the main powers. While the United States insists on the strategic threat posed by China through its espionage campaigns in 2010--2015 and again since 2018, both China and Russia present United States' discourses, practices and military doctrines as fundamentally in conflict with their interpretation of sovereignty, both in domestic and international politics. This escalation of the stakes has profound consequences for the implementation of strategies and mechanisms designed to secure cyberspace or parts of it, to deal with threats or to modify existing power relations.\n### Practices of cyber conflict\nGovernment agencies and national security elites appear to have adopted the necessity of offensive doctrines and strategies to disrupt, coerce, and deter. In the United States, a proposed bill allowing companies to operate outside their networks (active cyber defense) illustrates the possible frustration with the failure of traditional deterrence policies, as does the shift in terminology within the Department of Defense to a “defend forward” posture defined as “confronting threats before they reach U.S. Networks” (Department of Defense, 2018; Lin & Smeets, 2018; Lyu, 2018; Sanger, 2018). More broadly, operational constraints alone are not enough to explain the practice of maintaining a presence in the digital networks of other states to hold certain targets at risk as a deterrent. Some governments have tried to influence constituencies in foreign countries through social media (Lapowski, 2018; Solon, 2018). Finally, other actors are carrying out disruptive actions towards the industrial and financial sectors, with much more destabilizing and insecure consequences.\nAmong these practices, those surrounding the research, development, accumulation and dissemination of zero-days, exploits and malware are worrying, as illustrated by the case of the EternalBlue exploit, developed by the United States National Security Agency (NSA), stolen and auctioned by a group of hackers suspected of being linked to Russian military intelligence and used in Wannacry and NotPetya. This case illustrates the risk of proliferation of cyber weapons, but also the risk of loss of control by their designers or owners. In this field, there is no consensual and shared policy to regulate these practices and ensure that states do not compromise all users. The segmentation of the effort to control the proliferation of the most dangerous exploits--because they are likely to cause the most damage--is even potentially counterproductive insofar as it can generate tensions and risks.\nThe intermingling between private and public, civil and military actors is also problematic. Some governments rely on state-sponsored actors to share technical and human resources but also to increase their ability to deny\nresponsibility (Healey, 2012; Maurer, 2017). However, this approach poses the classic dilemmas of the principal-agent type. Increased control by policy makers or government agencies reduces effectiveness and operational flexibility and reduces the ability to deny responsibility for an attack. The relaxation of this control by the principal increases tactical flexibility and adaptability but creates risks of escalation or misperception due to divergent or even competing agendas on the part of the agent.\nIn most European and North American countries, Internet hardware and software infrastructures are operated and maintained by the private sector. Thus, part of this sector is involved in security through software solutions or in the Threat Intelligence and Threat Analysis process. In addition, the private sector and the public sphere often appear as soft targets as part of indirect strategies seeking to modify power relations at the margins. Consequently, defense in depth would benefit from greater cooperation between the private and public sectors (information sharing, resource sharing, responsiveness), or even through integration or even control. Nevertheless, in addition to the costs of an approach of enrolling private sector forces in national security under government authority (which also depend on political cultures and institutions), there are also risks associated with identifying these actors with policy makers (increased by attribution issues). Moreover, the logic of the sovereign and those of these actors can come into confrontation and accentuate the politicization of private organizations. However, this is a means by which a multi-stakeholder approach or inclusive multilateralism can be deployed (Cattaruzza, Danet, Taillat, & Laudrain, 2016).\nIssues related to cyber security and digital technologies therefore have an undeniable strategic impact that is incommensurate with the relative utility of cyber capabilities. This phenomenon has continued to grow in a dialectic between the United States and its rivals on the one hand, and between the United States and the rest of the cyber conflict actors on the other. The result is a potentially unstable process because it is particularly sensitive to the behavior of major international security actors and, in particular, to misperceptions. The future evolution of cyber conflict is thus closely dependent on the propensity of actors to take risks or hold at risk the infrastructures and standards on which they nevertheless depend. Cyber conflict is particularly sensitive to the structuring of issues in a long-term strategic competition but also to a sudden change resulting from the risky behavior of an actor.\n## Conclusion\nThe impact of digital and cyber-conflict technologies on international security depends both on the technical and operational characteristics of the cyber domain and on what states make of it. Interactions between states, and the rationales underlying their actions, are therefore affected by their perceptions\nof opportunities and vulnerabilities. In return, their strategic choices and the dilemmas that accompany them create potential for escalation and misperceptions that most want to avoid.\nThis raises the issue of collective security in a new way. Collective security depends on two factors: the establishment of a shared regime to regulate the use of digital technologies, and the ability of the main powers that guarantee the international political order to reach an agreement to fight against disruptive and revolutionary actors. The contemporary context of eroding trust between states and in the benefits of the international order would rather invite pessimism. Since the security dilemma feeds on uncertainty about the intentions of the actors, it produces even more instability if the latter are asymmetrical in terms of maintaining versus challenging the international political order. It is even more so when the legitimacy of the rules of the international game is called into question, especially when other actors contribute to the marginalization of states."
    },
    "numeric": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "Check here\nContemporary Security Policy\nR\nRoutledge Taylor &amp; Francis Group\nISSN: 1352-3260 (Print) 1743-8764 (Online) Journal homepage: www.tandfonline.com/journals/fcsp20\n# Disrupt and restraint: The evolution of cyber conflict and the implications for collective security\nStéphane Taillat\nTo cite this article: Stéphane Taillat (2019) Disrupt and restraint: The evolution of cyber conflict and the implications for collective security, Contemporary Security Policy, 40:3, 368-381, DOI: 10.1080/13523260.2019.1581458\nTo link to this article: https://doi.org/10.1080/13523260.2019.1581458\nPublished online: 26 Feb 2019.\nSubmit your article to this journal\nArticle views: 1931\nView related articles\nView Crossmark data\nCiting articles: 2 View citing articles\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=fcsp20\nCONTEMPORARY SECURITY POLICY\n2019, VOL. 40, NO. 3, 368-381\nhttps://doi.org/10.1080/13523260.2019.1581458\nRoutledge\nTaylor &amp; Francis Group\nCheck for updates\n# Disrupt and restraint: The evolution of cyber conflict and the implications for collective security\nStéphane Taillat\nInternational Relations and Strategic Studies, St Cyr French Army Academy, Guer, France\n# ABSTRACT\nIn the last decade, cyber conflict has become a main feature of international politics and a growing concern for strategic stability and collective security. Unfortunately, cyber conflict suffers from a lack of conceptual clarity about its impact on collective security and a lack of consensus among international actors on how to interpret it. This article proposes to understand cyber conflict as an evolving process driven by two factors: the way in which digital space is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber have been included in the field of national and international security. Both tend to encourage offensive behavior but also demonstrate features pointing to restraint.\nKEYWORDS Collective security; cyber conflict; international security\nCyber conflict suffers from a lack of conceptual clarity and a lack of consensus among key international actors on how to interpret it. For years, academics have struggled to account for the potentialities and effects of digital technologies on conflict dynamics. The debate has focused on the inclusion of cyber conflict in the Clausewitzian conceptualization of war (Rid, 2012; Stone, 2013). Several researchers have taken into account the specificities of cyber confrontation but have also sought to explain the gaps between expectations and behaviors, whether in terms of attribution (Rid &amp; Buchanan, 2015), deterrence (Fischerkeller &amp; Harknett, 2017; Libicki, 2009; Nye, 2016/2017), escalation dynamics (Lin, 2012; Valeriano, Jensen, &amp; Maness, 2018), coercion (Borghard &amp; Lonergan, 2017; Gartzke &amp; Lindsay, 2016; Sharp, 2017), and the offensive-dominant character of conflict in cyberspace (Gartzke &amp; Lindsay, 2015).\nOthers have attempted to account for the empirical evolution of cyber conflict toward restraint or aggression below the threshold of armed force (Steiger, Harnisch, Zettl, &amp; Lohmann, 2018; Valeriano &amp; Maness, 2015) or to question these dynamics through the prism of covert actions and deniability (Joseph &amp; Poznansky, 2017; Poznansky &amp; Perkoski, 2018). Finally, the\nCONTACT Stéphane Taillat stephane.taillat@st-cyr.terre-net.defense.gouv.fr\n© 2019 Informa UK Limited, trading as Taylor &amp; Francis Group\ndebates have focused on the relevance and methods of social sciences for analysing cyber conflict (Kello, 2013, 2014, 2017; Valeriano & Maness, 2014). Jurists have also examined the particularities of cyberspace and cyber operations to assess the possible application of legal categories, without reaching consensus or formally guiding governments (Schmitt, 2013, 2017).\nIn addition to these academic debates, there are divergent representations between the main powers concerning the challenges and threats related to the cyber domain in the context of a growing opposition between their interests. These divergences stem from the conceptualization of cyberspace. For China and Russia, for example, the information space includes all digital networks but also the political and social sphere. The main threat therefore stems from the ability of opponents (mainly the United States and Western countries) to destabilize these political regimes and threaten their control over society. For the United States and many European states, cyberspace mainly includes computer networks and the economic, industrial, or military activities that depend on them. The threat is therefore more about a competitor's ability to exploit the high digitization of these societies to gain an asymmetric advantage or cause catastrophic damage.\nThere is therefore a heterogeneity of values and interests, fueled by the logics of their long-term strategic competition. As a result, this heterogeneous feature of the international system results in the absence of a framework of shared meanings to limit tensions, manage conflicts, and control the risk of escalation. Moreover, the possibility of exploiting cyberspace from an asymmetrical perspective contributes to emboldening revolutionary or revisionist actors, as evidenced by the shift towards increasingly risky modes of action and strategies that contribute to disrupting the entire international normative system in peacetime.\nThe difficulty of defining cyber conflict and establishing international rules is problematic from the point of view of collective security. This difficulty is part of a more general evolution toward the blurring of conventional categories on conflicts, war and warfare. The purpose of this article is not to resolve these differences or to synthesize these conceptual approaches. In this article, I postulate that war and conflict are categories that depend on how actors interpret and integrate them into their practices and strategies. Thus, the current heterogeneity of the international system is fueled and in turn feeds these divergences of interpretation and the polarization of rivalries. Therefore, it is not possible to objectively define contemporary cyber conflict.\nCyber conflict is subject to changing evolutions and characteristics. I thus propose to understand these changing evolutions and characteristics through an analytical framework structured around two processes: the way in which digital domain is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber security have been included in the field of national and international security. This has two\nconsequences for collective security. First, the configuration of the cyber domain produces incentives for offensive action but within a framework characterized by low operational efficiency. Second, cyber conflict is particularly dependent on interactions between actors and therefore on strategic contexts such as long-term strategic competition.\nThis article will proceed in two steps. First, it will focus on how the configuration of the cyber domain affects the incentive to act offensively while remaining below a certain threshold of aggression. Second, it will analyze how cyber capabilities have been included in national and international security issues, generating a strong sensitivity to cyber security issues.\n## Strategic opportunities and challenges in the digital domain\nCyberspace is a field of confrontation, a challenge, and a means by which rivalries can be expressed. It covers an increasingly broad range of economic, political, social, cultural and security dimensions and activities, creating interdependence between them at every geopolitical level. This field is characterized by the interaction between technologies, uses, power rivalries and the increasing integration of private and public, military and civil, national, transnational, regional, and international dimensions. Cyberspace is therefore the result of a historical and socio-political process that in turn sets out a space of strategic choices, which shapes the behavior of both state and non-state actors.\n### The ubiquity of vulnerabilities\nThe pervasiveness of vulnerabilities is the main feature of cyberspace (Libicki, 2009, p. xiv). Thus, this space is marked by a large number of targets, entry points, and attack vectors. However, the distribution of potential targets is uneven. The traditional division into physical, logical, informational, and social layers provides a first framework for analysis. But it is possible to specify it with other frameworks.\nFirst, the type of infrastructure. As Smeets (2018) shows, vulnerabilities can be hardware, software, networks, and communication protocols between machines as well as individuals or organizations. He proposes to classify them according to the potential to exploit them on the one hand, and the potential to remedy them on the other. Software vulnerabilities are easier to exploit than hardware or network vulnerabilities, but also easier to patch once discovered (pp. 13--14). Human vulnerabilities also appear to be more related to organizational cultures and procedures than to individual cognitive biases (PROOFPOINT, 2018; Schneier, 2008; Weber & Jean-Philippe, 2018).\nSecond, not all targeted systems are accessible in the same way. A system can be accessible through the global Internet network or from a system in a closed network that requires access to this network first. Kello (2017) proposes\nto map cyberspace by distinguishing between the global network (the Internet), the WorldWideWeb, and a “cyber archipelago” composed of the “air gaped” networks (p. 45). The latter are not inaccessible but require more resources and effort or even risks taking. Third, the geopolitical distribution of assets, digital infrastructures, or legal architectures determines resources and vulnerabilities. The geography of transoceanic cables invites us to think of cyberspace in terms of chokepoints or according to a logic of interdependence (Starosielski, 2018). The same applies to the location of data centers or the legislative requirement for Web companies to host national user data on national soil. Hence the strategic implications of a potential “Internet Balkanization”: a political fragmentation of the Internet but also the creation of a striated space limiting the capacities of access, maneuver, and the production of operational effects.\nThis mapping thus delimits a space for the strategic choices of the actors. It also helps to better explain the frequency of low-intensity attacks against soft targets and the relative difficulty of putting critical infrastructure at risk. Nevertheless, it also shows why no intrusion is insignificant in terms of these crucial issues and assets for national security and collective security.\n### Security and strategic dilemmas\nTechnologies contribute to uncertainty about the identity and intentions of an attacker. There is therefore a security dilemma specific to cyber conflict. This is based on the difficulty in interpreting intrusions and interference either as operational preparation, as intelligence collection, or as hold at risk operation. At the same time, the specificities of cyber operations encourage penetration of others' networks and interference in their processes (Buchanan, 2017a). The increase in cyberspace-related issues (see below) contributes to these dynamics. This explains the importance of the attribution process, which Rid and Buchanan (2015) have shown to be ambiguous and of a political and strategic nature.\nImputing an action to an author is made more complex and time-consuming due to technical factors allowing relative anonymity, organizational factors allowing not to acknowledge responsibility but also political factors. Therefore, a victim's probability of attributing and responding depends on his or her cost structure, that is what is at stake for the victim. However, from the point of view of the attacker, it is not possible to quantify exactly those elements which may contain material or symbolic aspects, but which also depend on the context in which the decision-makers are placed. In the case of issues considered important or even existential, the trade-off between the urgency of attributing and responding and the risks associated with incomplete communication or hasty response is less acute than in the case of less important issues. The propensity of decision-makers to take\nrisks is therefore an important variable, both for the victim and for the current or potential aggressor.\nThe complexity of the attribution process results in a latency period with a significant impact on the credibility of deterrence. Besides, the nature of the information making it possible to conclude that an actor is liable requires compromises between preserving the capacities that made it possible to collect these elements and presenting the case with the most indisputable evidence possible. As a result, the attribution process weakens an actor's ability to demonstrate resolution and keep aggressors at bay.\nDigitization therefore increases the margin of maneuver below the threshold of the use of force. This therefore allows actors to pursue several of their objectives without incurring the penalties associated with the use of aggression, or at least by limiting these risks. Nevertheless, this freedom of action is hampered in practice because of its dependence on three factors. First, by the type of weapon or tactic used. On the one hand, offensive means are unevenly distributed between a small number of weapons or targeted actions (of which Stuxnet is an archetype) (Zetter, 2015) and a very large number of more indiscriminate tools (Distributed Denial of Service attacks for example) (Rid & McBurney, 2012; Smeets, 2018). On the other hand, this situation reflects the difficulty of producing the desired effects either on the targeted social groups or organizations or on the targeted digital systems. The question of force control and its effects is therefore particularly acute when the action can produce side effects or backfires. Unless the initiator of the attack seeks to produce such indiscriminate effects, takes the risk of their probability or can exploit them in a timely manner to increase his or her reputation for resolution or capacity, this first factor produces a negative incentive to take risks.\nSecond, the margin for maneuver depends on the organizational sophistication of the attacker. This includes the available resources, the ability to mobilize and exploit them to produce the desired results and the propensity to limit errors and friction at least in planning and managing the operation (Buchanan, 2017b). This point highlights the dilemmas and challenges characteristic of a cyber operation: It requires time, it is guided by the issue of operational security, it requires flexibility and the ability to seize opportunities that develop in interaction with the adversary and the environment.\nThird, it depends on the target's behavior, either in previous attacks or through the precedent resulting from its own offensive operations. These successive behaviors shape expectations and beliefs, but also future norms. The case of the United States is particularly enlightening. Stuxnet may have set a precedent for offensive or even disruptive actions by others, either in retaliation or to prevent further operations (the Iranians and the Shamoon virus against Saudi Aramco in August 2012 or the multiple operations carried out against the banking system, universities or certain actors in the American\nenergy sector since 2013), or as justification (the use of the BlackEnergy malware against Ukrainian power plants in December 2015 attributed to Russia). On the contrary, the Obama administration's relative restraint in the face of the increase in attacks below the threshold for the use of armed force may have been interpreted as weakness and an incentive to take more risks.\nThis configuration is therefore a framework through which it is possible to weigh the constraints and opportunities of actions in relation to the effects to be achieved. Two contradictory trends emerge. On the one hand, cyber operations have a relative value to produce the expected effects. On the other hand, there is an incentive to act below a certain threshold. The result is the possibility of unexpected and counterproductive effects that suggest that the question should be considered in terms of strategic objectives and issues.\n## Diverging issues and conflicting practices in national and international security\nThe representations of issues, threats, and opportunities partly explain how key actors have integrated cyber security, cyber warfare, and cyber policy issues into their strategies and in their relationships with others. This integration process is therefore not only functional but also corresponds to political and social logics. From this perspective, setting a precedent obviously matters insofar as it has an impact on the perceptions and calculations of other actors. Thus, the role of the United States, Russia, and China since the late-1990s has helped to shape debates, mechanisms, and practices in this field. But the integration of digital technologies and risks into international strategic relations has also depended on other categories of actors and their uses, as well as their role in the regulation or deregulation of cyber conflict.\n### Cyber as a national security issue\nThe use of cyber operations in times of crisis, in negotiations or for national security reasons has become routine for states. Jensen (2017) refers to “21st Century Political Warfare” to characterize the return to “coercive diplomacy in the shadows” (p. 159) despite the limitations of cyber operations to persuade, compel or influence the behavior of other states (Jensen & Work, 2018; Valeriano et al. 2018, p. 226). At the same time, there is no strong consensus or even shared understanding about the application of existing standards. The case of the United Nations Group of Governmental Experts on the Developments in the field of information and telecommunications in the context of international security (UN GGE) is instructive. Convened following a series of annual resolutions proposed by Russia to the United\nNations General Assembly since 1998, this group, which included representatives of 15 and then 20 governments, reached non-binding consensus agreements in 2010. These reports respectively engaged states in defining common terms and challenges while encouraging dialogue; affirmed the applicability of international law and in particular the UN Charter in cyberspace and consolidated a core of standards of responsible behavior for states in cyberspace.\nThe 2016--2017 round of negotiations failed in June 2017 on the question of the legal options available to states to respond to hostile activities, with the United States wanting a right to self-defense to apply while Cuba feared that it would be used to justify unilateral punitive actions (Grisby, 2017). At the same time, the member states of the Shanghai Cooperation Organization proposed a code of conduct in 2011 and then in 2015, but without success. In October 2018, Russia and the United States proposed competing resolutions to relaunch the UN GGE process (Grisby, 2018). These behaviors can be explained not only by diverging interests but also by opposing representations about international relations, cyber security issues and the modes of governance they induce.\nTwo aspects accentuate this pluralism. On the one hand, the blurring of the categories between war and peace, but also of the criteria that make it possible to qualify an act of aggression in an indisputable way. On the other hand, the distinction between governmental and non-state actors is becoming blurred. However, the question of governance arises between the promoters of a multilateral approach and those of an approach that includes all stakeholders (DeNardis, 2014; Mueller, 2017). At the same time, initiatives are emerging in the private sector, as illustrated by Microsoft's initiatives for a Digital Geneva Convention (2017) and a Cyber Security Tech Accord (2018).\nThe 2010s can be characterized, so far, by the progressive rise of security issues related to cyber, from computer security to national security (Balzacq & Dunn-Cavelty, 2016; Dunn-Cavelty, 2007; Nissenbaum, 2005). This is partly due to the simultaneous growth of the digital domain and of vulnerabilities that could potentially cause systemic damage. But this is also due to the diversification and diffusion of certain modes of action (DDoS, ransomwares) (Buchanan, 2016). Finally, this is tied to the interpretation of certain precedents (Stuxnet, the DDoS attack on Estonia in 2007, the use of cyber operations by Russians against Georgia in 2008 or in Ukraine since 2014) as well as recurrent behaviors (the combination of criminal and political behavior by North Korean hackers, industrial and intellectual espionage by Chinese hackers).\nAnother more fundamental reason is the gradual construction of a threat discourse by both governments and security actors (government agencies, security companies) in a context of increasing competition among key international actors. Cybersecurity is therefore linked to existential threats to political regimes, the status of states on the international scene, social cohesion\nand economic prosperity. This process is intertwined with the divergence of representations between the main powers. While the United States insists on the strategic threat posed by China through its espionage campaigns in 2010--2015 and again since 2018, both China and Russia present United States' discourses, practices and military doctrines as fundamentally in conflict with their interpretation of sovereignty, both in domestic and international politics. This escalation of the stakes has profound consequences for the implementation of strategies and mechanisms designed to secure cyberspace or parts of it, to deal with threats or to modify existing power relations.\n### Practices of cyber conflict\nGovernment agencies and national security elites appear to have adopted the necessity of offensive doctrines and strategies to disrupt, coerce, and deter. In the United States, a proposed bill allowing companies to operate outside their networks (active cyber defense) illustrates the possible frustration with the failure of traditional deterrence policies, as does the shift in terminology within the Department of Defense to a “defend forward” posture defined as “confronting threats before they reach U.S. Networks” (Department of Defense, 2018; Lin & Smeets, 2018; Lyu, 2018; Sanger, 2018). More broadly, operational constraints alone are not enough to explain the practice of maintaining a presence in the digital networks of other states to hold certain targets at risk as a deterrent. Some governments have tried to influence constituencies in foreign countries through social media (Lapowski, 2018; Solon, 2018). Finally, other actors are carrying out disruptive actions towards the industrial and financial sectors, with much more destabilizing and insecure consequences.\nAmong these practices, those surrounding the research, development, accumulation and dissemination of zero-days, exploits and malware are worrying, as illustrated by the case of the EternalBlue exploit, developed by the United States National Security Agency (NSA), stolen and auctioned by a group of hackers suspected of being linked to Russian military intelligence and used in Wannacry and NotPetya. This case illustrates the risk of proliferation of cyber weapons, but also the risk of loss of control by their designers or owners. In this field, there is no consensual and shared policy to regulate these practices and ensure that states do not compromise all users. The segmentation of the effort to control the proliferation of the most dangerous exploits--because they are likely to cause the most damage--is even potentially counterproductive insofar as it can generate tensions and risks.\nThe intermingling between private and public, civil and military actors is also problematic. Some governments rely on state-sponsored actors to share technical and human resources but also to increase their ability to deny\nresponsibility (Healey, 2012; Maurer, 2017). However, this approach poses the classic dilemmas of the principal-agent type. Increased control by policy makers or government agencies reduces effectiveness and operational flexibility and reduces the ability to deny responsibility for an attack. The relaxation of this control by the principal increases tactical flexibility and adaptability but creates risks of escalation or misperception due to divergent or even competing agendas on the part of the agent.\nIn most European and North American countries, Internet hardware and software infrastructures are operated and maintained by the private sector. Thus, part of this sector is involved in security through software solutions or in the Threat Intelligence and Threat Analysis process. In addition, the private sector and the public sphere often appear as soft targets as part of indirect strategies seeking to modify power relations at the margins. Consequently, defense in depth would benefit from greater cooperation between the private and public sectors (information sharing, resource sharing, responsiveness), or even through integration or even control. Nevertheless, in addition to the costs of an approach of enrolling private sector forces in national security under government authority (which also depend on political cultures and institutions), there are also risks associated with identifying these actors with policy makers (increased by attribution issues). Moreover, the logic of the sovereign and those of these actors can come into confrontation and accentuate the politicization of private organizations. However, this is a means by which a multi-stakeholder approach or inclusive multilateralism can be deployed (Cattaruzza, Danet, Taillat, & Laudrain, 2016).\nIssues related to cyber security and digital technologies therefore have an undeniable strategic impact that is incommensurate with the relative utility of cyber capabilities. This phenomenon has continued to grow in a dialectic between the United States and its rivals on the one hand, and between the United States and the rest of the cyber conflict actors on the other. The result is a potentially unstable process because it is particularly sensitive to the behavior of major international security actors and, in particular, to misperceptions. The future evolution of cyber conflict is thus closely dependent on the propensity of actors to take risks or hold at risk the infrastructures and standards on which they nevertheless depend. Cyber conflict is particularly sensitive to the structuring of issues in a long-term strategic competition but also to a sudden change resulting from the risky behavior of an actor.\n## Conclusion\nThe impact of digital and cyber-conflict technologies on international security depends both on the technical and operational characteristics of the cyber domain and on what states make of it. Interactions between states, and the rationales underlying their actions, are therefore affected by their perceptions\nof opportunities and vulnerabilities. In return, their strategic choices and the dilemmas that accompany them create potential for escalation and misperceptions that most want to avoid.\nThis raises the issue of collective security in a new way. Collective security depends on two factors: the establishment of a shared regime to regulate the use of digital technologies, and the ability of the main powers that guarantee the international political order to reach an agreement to fight against disruptive and revolutionary actors. The contemporary context of eroding trust between states and in the benefits of the international order would rather invite pessimism. Since the security dilemma feeds on uncertainty about the intentions of the actors, it produces even more instability if the latter are asymmetrical in terms of maintaining versus challenging the international political order. It is even more so when the legitimacy of the rules of the international game is called into question, especially when other actors contribute to the marginalization of states."
    },
    "author_year": {
      "total": {
        "intext_total": 17,
        "success_occurrences": 17,
        "success_unique": 16,
        "bib_unique_total": 84,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.19047619047619047,
        "success_percentage": 100.0,
        "style": "author_year"
      },
      "results": [
        {
          "index": "rid|2012",
          "intext_citation": "(Rid, 2012; Stone, 2013)",
          "preceding_text": "The debate has focused on the inclusion of cyber conflict in the Clausewitzian conceptualization of war",
          "footnote": "Rid, T. (2012). Cyber war will not take place. Journal of Strategic Studies, 35(1), 5–32. doi:10.1080/01402390.2011.608939"
        },
        {
          "index": "lin|2012",
          "intext_citation": "(Lin, 2012; Valeriano, Jensen, &amp; Maness, 2018)",
          "preceding_text": "of cyber confrontation but have also sought to explain the gaps between expectations and behaviors, whether in terms of attribution (Rid &amp; Buchanan, 2015), deterrence (Fischerkeller &amp; Harknett, 2017; Libicki, 2009; Nye, 2016/2017), escalation dynamics",
          "footnote": "Lin, H. (2012). Escalation dynamics and conflict termination in cyberspace. *Strategic Studies Quarterly*, 6(3), 46–70."
        },
        {
          "index": "kello|2013",
          "intext_citation": "(Kello, 2013, 2014, 2017; Valeriano & Maness, 2014)",
          "preceding_text": "debates have focused on the relevance and methods of social sciences for analysing cyber conflict",
          "footnote": "Kello, L. (2013). The meaning of the cyber revolution: Perils to theory and statecraft. *International Security*, 38(2), 7–40. doi:10.1162/ISEC_a_00138"
        },
        {
          "index": "schmitt|2013",
          "intext_citation": "(Schmitt, 2013, 2017)",
          "preceding_text": "Jurists have also examined the particularities of cyberspace and cyber operations to assess the possible application of legal categories, without reaching consensus or formally guiding governments",
          "footnote": "Schmitt, M. (Ed.). (2013). Tallinn manual on the international law applicable to cyber warfare. Cambridge: Cambridge University Press."
        },
        {
          "index": "proofpoint|2018",
          "intext_citation": "(PROOFPOINT, 2018; Schneier, 2008; Weber & Jean-Philippe, 2018)",
          "preceding_text": "13--14). Human vulnerabilities also appear to be more related to organizational cultures and procedures than to individual cognitive biases",
          "footnote": "PROOFPOINT. (2018). The Human Factor 2018 Report. Retrieved from https://www.proofpoint.com/sites/default/files/pfpt-uk-tr-the-human-factor-2018.pdf"
        },
        {
          "index": "starosielski|2018",
          "intext_citation": "(Starosielski, 2018)",
          "preceding_text": "The geography of transoceanic cables invites us to think of cyberspace in terms of chokepoints or according to a logic of interdependence",
          "footnote": "Starosielski, N. (2018). Strangling the internet. Limn, 10. Retrieved from https://limn.it/articles/strangling-the-internet/"
        },
        {
          "index": "buchanan|2017a",
          "intext_citation": "(Buchanan, 2017a)",
          "preceding_text": "At the same time, the specificities of cyber operations encourage penetration of others' networks and interference in their processes",
          "footnote": "Buchanan, B. (2017a). The cybersecurity dilemma. Hacking, trust and fear between nations. Oxford: Oxford University Press."
        },
        {
          "index": "zetter|2015",
          "intext_citation": "(Zetter, 2015)",
          "preceding_text": "First, by the type of weapon or tactic used. On the one hand, offensive means are unevenly distributed between a small number of weapons or targeted actions (of which Stuxnet is an archetype)",
          "footnote": "Zetter, K. (2015). Countdown to zero day: Stuxnet and the launch of the world's first digital weapon. New-York, NY: Crown Publishing."
        },
        {
          "index": "rid|2012",
          "intext_citation": "(Rid & McBurney, 2012; Smeets, 2018)",
          "preceding_text": "one hand, offensive means are unevenly distributed between a small number of weapons or targeted actions (of which Stuxnet is an archetype) (Zetter, 2015) and a very large number of more indiscriminate tools (Distributed Denial of Service attacks for example)",
          "footnote": "Rid, T. (2012). Cyber war will not take place. Journal of Strategic Studies, 35(1), 5–32. doi:10.1080/01402390.2011.608939"
        },
        {
          "index": "buchanan|2017b",
          "intext_citation": "(Buchanan, 2017b)",
          "preceding_text": "n the organizational sophistication of the attacker. This includes the available resources, the ability to mobilize and exploit them to produce the desired results and the propensity to limit errors and friction at least in planning and managing the operation",
          "footnote": "Buchanan, B. (2017b). The legend of sophistication in cyber operations. Cambridge, MA: Harvard Belfer Center for Science and International Affairs."
        },
        {
          "index": "grisby|2017",
          "intext_citation": "(Grisby, 2017)",
          "preceding_text": "tions failed in June 2017 on the question of the legal options available to states to respond to hostile activities, with the United States wanting a right to self-defense to apply while Cuba feared that it would be used to justify unilateral punitive actions",
          "footnote": "Grisby, A. (2017). The end of cyber norms. *Survival*, 59(6), 109–122. doi:10.1080/00396338.2017.1399730"
        },
        {
          "index": "grisby|2018",
          "intext_citation": "(Grisby, 2018)",
          "preceding_text": "In October 2018, Russia and the United States proposed competing resolutions to relaunch the UN GGE process",
          "footnote": "Grisby, A. (2018, October 29). Unpacking the competing Russian and U.S. cyberspace resolutions at the United Nations. *Council on Foreign Relations* blog. Retrieved from https://www.cfr.org/blog/unpacking-competing-russian-and-us-cyberspace-resolutions-united-nations"
        },
        {
          "index": "denardis|2014",
          "intext_citation": "(DeNardis, 2014; Mueller, 2017)",
          "preceding_text": "However, the question of governance arises between the promoters of a multilateral approach and those of an approach that includes all stakeholders",
          "footnote": "DeNardis, L. (2014). The global war for internet governance. Cambridge, MA: Yale University Press."
        },
        {
          "index": "balzacq|2016",
          "intext_citation": "(Balzacq & Dunn-Cavelty, 2016; Dunn-Cavelty, 2007; Nissenbaum, 2005)",
          "preceding_text": "The 2010s can be characterized, so far, by the progressive rise of security issues related to cyber, from computer security to national security",
          "footnote": "Balzacq, T. & Dunn-Cavelty, M. (2016). A theory of actor-network for cyber-security. European Journal of International Security, 1(2), 176--198. doi:10.1017/eis.2016.8"
        },
        {
          "index": "buchanan|2016",
          "intext_citation": "(Buchanan, 2016)",
          "preceding_text": "But this is also due to the diversification and diffusion of certain modes of action (DDoS, ransomwares)",
          "footnote": "Buchanan, B. (2016). The life cycle of cyber threats. Survival, 58(1), 39--58. doi:10.1080/00396338.2016.1142093"
        },
        {
          "index": "lapowski|2018",
          "intext_citation": "(Lapowski, 2018; Solon, 2018)",
          "preceding_text": "Some governments have tried to influence constituencies in foreign countries through social media",
          "footnote": "Lapowski, I. (2018, October 26). Iran’s new Facebook trolls are using Russia’s playbook. *Wired*. Retrieved from https://www.wired.com/story/iran-facebook-trolls-using-russia-playbook/"
        },
        {
          "index": "healey|2012",
          "intext_citation": "(Healey, 2012; Maurer, 2017)",
          "preceding_text": "responsibility",
          "footnote": "Healey, J. (2012, February 22). Beyond attribution: Seeking national responsibility for cyber attacks. The Atlantic Council Issue Brief. Retrieved from http://www.atlanticcouncil.org/images/files/publication_pdfs/403/022212_ACUS_NatlResponsibilityCyber.PDF"
        }
      ],
      "flat_text": "Check here Contemporary Security Policy R Routledge Taylor &amp; Francis Group ISSN: 1352-3260 (Print) 1743-8764 (Online) Journal homepage: www.tandfonline.com/journals/fcsp20 # Disrupt and restraint: The evolution of cyber conflict and the implications for collective security Stéphane Taillat To cite this article: Stéphane Taillat (2019) Disrupt and restraint: The evolution of cyber conflict and the implications for collective security, Contemporary Security Policy, 40:3, 368-381, DOI: 10.1080/13523260.2019.1581458 To link to this article: https://doi.org/10.1080/13523260.2019.1581458 Published online: 26 Feb 2019.\nSubmit your article to this journal Article views: 1931 View related articles View Crossmark data Citing articles: 2 View citing articles Full Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=fcsp20 CONTEMPORARY SECURITY POLICY 2019, VOL. 40, NO. 3, 368-381 https://doi.org/10.1080/13523260.2019.1581458 Routledge Taylor &amp; Francis Group Check for updates # Disrupt and restraint: The evolution of cyber conflict and the implications for collective security Stéphane Taillat International Relations and Strategic Studies, St Cyr French Army Academy, Guer, France # ABSTRACT In the last decade, cyber conflict has become a main feature of international politics and a growing concern for strategic stability and collective security. Unfortunately, cyber conflict suffers from a lack of conceptual clarity about its impact on collective security and a lack of consensus among international actors on how to interpret it. This article proposes to understand cyber conflict as an evolving process driven by two factors: the way in which digital space is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber have been included in the field of national and international security. Both tend to encourage offensive behavior but also demonstrate features pointing to restraint.\nKEYWORDS Collective security; cyber conflict; international security Cyber conflict suffers from a lack of conceptual clarity and a lack of consensus among key international actors on how to interpret it. For years, academics have struggled to account for the potentialities and effects of digital technologies on conflict dynamics. The debate has focused on the inclusion of cyber conflict in the Clausewitzian conceptualization of war. Several researchers have taken into account the specificities of cyber confrontation but have also sought to explain the gaps between expectations and behaviors, whether in terms of attribution (Rid &amp; Buchanan, 2015), deterrence (Fischerkeller &amp; Harknett, 2017; Libicki, 2009; Nye, 2016/2017), escalation dynamics, coercion (Borghard &amp; Lonergan, 2017; Gartzke &amp; Lindsay, 2016; Sharp, 2017), and the offensive-dominant character of conflict in cyberspace (Gartzke &amp; Lindsay, 2015).\nOthers have attempted to account for the empirical evolution of cyber conflict toward restraint or aggression below the threshold of armed force (Steiger, Harnisch, Zettl, &amp; Lohmann, 2018; Valeriano &amp; Maness, 2015) or to question these dynamics through the prism of covert actions and deniability (Joseph &amp; Poznansky, 2017; Poznansky &amp; Perkoski, 2018). Finally, the CONTACT Stéphane Taillat stephane.taillat@st-cyr.terre-net.defense.gouv.fr © 2019 Informa UK Limited, trading as Taylor &amp; Francis Group debates have focused on the relevance and methods of social sciences for analysing cyber conflict. Jurists have also examined the particularities of cyberspace and cyber operations to assess the possible application of legal categories, without reaching consensus or formally guiding governments.\nIn addition to these academic debates, there are divergent representations between the main powers concerning the challenges and threats related to the cyber domain in the context of a growing opposition between their interests. These divergences stem from the conceptualization of cyberspace. For China and Russia, for example, the information space includes all digital networks but also the political and social sphere. The main threat therefore stems from the ability of opponents (mainly the United States and Western countries) to destabilize these political regimes and threaten their control over society. For the United States and many European states, cyberspace mainly includes computer networks and the economic, industrial, or military activities that depend on them. The threat is therefore more about a competitor's ability to exploit the high digitization of these societies to gain an asymmetric advantage or cause catastrophic damage.\nThere is therefore a heterogeneity of values and interests, fueled by the logics of their long-term strategic competition. As a result, this heterogeneous feature of the international system results in the absence of a framework of shared meanings to limit tensions, manage conflicts, and control the risk of escalation. Moreover, the possibility of exploiting cyberspace from an asymmetrical perspective contributes to emboldening revolutionary or revisionist actors, as evidenced by the shift towards increasingly risky modes of action and strategies that contribute to disrupting the entire international normative system in peacetime.\nThe difficulty of defining cyber conflict and establishing international rules is problematic from the point of view of collective security. This difficulty is part of a more general evolution toward the blurring of conventional categories on conflicts, war and warfare. The purpose of this article is not to resolve these differences or to synthesize these conceptual approaches. In this article, I postulate that war and conflict are categories that depend on how actors interpret and integrate them into their practices and strategies. Thus, the current heterogeneity of the international system is fueled and in turn feeds these divergences of interpretation and the polarization of rivalries. Therefore, it is not possible to objectively define contemporary cyber conflict.\nCyber conflict is subject to changing evolutions and characteristics. I thus propose to understand these changing evolutions and characteristics through an analytical framework structured around two processes: the way in which digital domain is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber security have been included in the field of national and international security. This has two consequences for collective security. First, the configuration of the cyber domain produces incentives for offensive action but within a framework characterized by low operational efficiency. Second, cyber conflict is particularly dependent on interactions between actors and therefore on strategic contexts such as long-term strategic competition.\nThis article will proceed in two steps. First, it will focus on how the configuration of the cyber domain affects the incentive to act offensively while remaining below a certain threshold of aggression. Second, it will analyze how cyber capabilities have been included in national and international security issues, generating a strong sensitivity to cyber security issues.\n## Strategic opportunities and challenges in the digital domain Cyberspace is a field of confrontation, a challenge, and a means by which rivalries can be expressed. It covers an increasingly broad range of economic, political, social, cultural and security dimensions and activities, creating interdependence between them at every geopolitical level. This field is characterized by the interaction between technologies, uses, power rivalries and the increasing integration of private and public, military and civil, national, transnational, regional, and international dimensions. Cyberspace is therefore the result of a historical and socio-political process that in turn sets out a space of strategic choices, which shapes the behavior of both state and non-state actors.\n### The ubiquity of vulnerabilities The pervasiveness of vulnerabilities is the main feature of cyberspace. Thus, this space is marked by a large number of targets, entry points, and attack vectors. However, the distribution of potential targets is uneven. The traditional division into physical, logical, informational, and social layers provides a first framework for analysis. But it is possible to specify it with other frameworks.\nFirst, the type of infrastructure. As Smeets (2018) shows, vulnerabilities can be hardware, software, networks, and communication protocols between machines as well as individuals or organizations. He proposes to classify them according to the potential to exploit them on the one hand, and the potential to remedy them on the other. Software vulnerabilities are easier to exploit than hardware or network vulnerabilities, but also easier to patch once discovered (pp. 13--14). Human vulnerabilities also appear to be more related to organizational cultures and procedures than to individual cognitive biases.\nSecond, not all targeted systems are accessible in the same way. A system can be accessible through the global Internet network or from a system in a closed network that requires access to this network first. Kello (2017) proposes to map cyberspace by distinguishing between the global network (the Internet), the WorldWideWeb, and a “cyber archipelago” composed of the “air gaped” networks (p. 45). The latter are not inaccessible but require more resources and effort or even risks taking. Third, the geopolitical distribution of assets, digital infrastructures, or legal architectures determines resources and vulnerabilities. The geography of transoceanic cables invites us to think of cyberspace in terms of chokepoints or according to a logic of interdependence. The same applies to the location of data centers or the legislative requirement for Web companies to host national user data on national soil. Hence the strategic implications of a potential “Internet Balkanization”: a political fragmentation of the Internet but also the creation of a striated space limiting the capacities of access, maneuver, and the production of operational effects.\nThis mapping thus delimits a space for the strategic choices of the actors. It also helps to better explain the frequency of low-intensity attacks against soft targets and the relative difficulty of putting critical infrastructure at risk. Nevertheless, it also shows why no intrusion is insignificant in terms of these crucial issues and assets for national security and collective security.\n### Security and strategic dilemmas Technologies contribute to uncertainty about the identity and intentions of an attacker. There is therefore a security dilemma specific to cyber conflict. This is based on the difficulty in interpreting intrusions and interference either as operational preparation, as intelligence collection, or as hold at risk operation. At the same time, the specificities of cyber operations encourage penetration of others' networks and interference in their processes. The increase in cyberspace-related issues (see below) contributes to these dynamics. This explains the importance of the attribution process, which Rid and Buchanan (2015) have shown to be ambiguous and of a political and strategic nature.\nImputing an action to an author is made more complex and time-consuming due to technical factors allowing relative anonymity, organizational factors allowing not to acknowledge responsibility but also political factors. Therefore, a victim's probability of attributing and responding depends on his or her cost structure, that is what is at stake for the victim. However, from the point of view of the attacker, it is not possible to quantify exactly those elements which may contain material or symbolic aspects, but which also depend on the context in which the decision-makers are placed. In the case of issues considered important or even existential, the trade-off between the urgency of attributing and responding and the risks associated with incomplete communication or hasty response is less acute than in the case of less important issues. The propensity of decision-makers to take risks is therefore an important variable, both for the victim and for the current or potential aggressor.\nThe complexity of the attribution process results in a latency period with a significant impact on the credibility of deterrence. Besides, the nature of the information making it possible to conclude that an actor is liable requires compromises between preserving the capacities that made it possible to collect these elements and presenting the case with the most indisputable evidence possible. As a result, the attribution process weakens an actor's ability to demonstrate resolution and keep aggressors at bay.\nDigitization therefore increases the margin of maneuver below the threshold of the use of force. This therefore allows actors to pursue several of their objectives without incurring the penalties associated with the use of aggression, or at least by limiting these risks. Nevertheless, this freedom of action is hampered in practice because of its dependence on three factors. First, by the type of weapon or tactic used. On the one hand, offensive means are unevenly distributed between a small number of weapons or targeted actions (of which Stuxnet is an archetype) and a very large number of more indiscriminate tools (Distributed Denial of Service attacks for example). On the other hand, this situation reflects the difficulty of producing the desired effects either on the targeted social groups or organizations or on the targeted digital systems. The question of force control and its effects is therefore particularly acute when the action can produce side effects or backfires. Unless the initiator of the attack seeks to produce such indiscriminate effects, takes the risk of their probability or can exploit them in a timely manner to increase his or her reputation for resolution or capacity, this first factor produces a negative incentive to take risks.\nSecond, the margin for maneuver depends on the organizational sophistication of the attacker. This includes the available resources, the ability to mobilize and exploit them to produce the desired results and the propensity to limit errors and friction at least in planning and managing the operation. This point highlights the dilemmas and challenges characteristic of a cyber operation: It requires time, it is guided by the issue of operational security, it requires flexibility and the ability to seize opportunities that develop in interaction with the adversary and the environment.\nThird, it depends on the target's behavior, either in previous attacks or through the precedent resulting from its own offensive operations. These successive behaviors shape expectations and beliefs, but also future norms. The case of the United States is particularly enlightening. Stuxnet may have set a precedent for offensive or even disruptive actions by others, either in retaliation or to prevent further operations (the Iranians and the Shamoon virus against Saudi Aramco in August 2012 or the multiple operations carried out against the banking system, universities or certain actors in the American energy sector since 2013), or as justification (the use of the BlackEnergy malware against Ukrainian power plants in December 2015 attributed to Russia). On the contrary, the Obama administration's relative restraint in the face of the increase in attacks below the threshold for the use of armed force may have been interpreted as weakness and an incentive to take more risks.\nThis configuration is therefore a framework through which it is possible to weigh the constraints and opportunities of actions in relation to the effects to be achieved. Two contradictory trends emerge. On the one hand, cyber operations have a relative value to produce the expected effects. On the other hand, there is an incentive to act below a certain threshold. The result is the possibility of unexpected and counterproductive effects that suggest that the question should be considered in terms of strategic objectives and issues.\n## Diverging issues and conflicting practices in national and international security The representations of issues, threats, and opportunities partly explain how key actors have integrated cyber security, cyber warfare, and cyber policy issues into their strategies and in their relationships with others. This integration process is therefore not only functional but also corresponds to political and social logics. From this perspective, setting a precedent obviously matters insofar as it has an impact on the perceptions and calculations of other actors. Thus, the role of the United States, Russia, and China since the late-1990s has helped to shape debates, mechanisms, and practices in this field. But the integration of digital technologies and risks into international strategic relations has also depended on other categories of actors and their uses, as well as their role in the regulation or deregulation of cyber conflict.\n### Cyber as a national security issue The use of cyber operations in times of crisis, in negotiations or for national security reasons has become routine for states. Jensen (2017) refers to “21st Century Political Warfare” to characterize the return to “coercive diplomacy in the shadows” (p. 159) despite the limitations of cyber operations to persuade, compel or influence the behavior of other states. At the same time, there is no strong consensus or even shared understanding about the application of existing standards. The case of the United Nations Group of Governmental Experts on the Developments in the field of information and telecommunications in the context of international security (UN GGE) is instructive. Convened following a series of annual resolutions proposed by Russia to the United Nations General Assembly since 1998, this group, which included representatives of 15 and then 20 governments, reached non-binding consensus agreements in 2010. These reports respectively engaged states in defining common terms and challenges while encouraging dialogue; affirmed the applicability of international law and in particular the UN Charter in cyberspace and consolidated a core of standards of responsible behavior for states in cyberspace.\nThe 2016--2017 round of negotiations failed in June 2017 on the question of the legal options available to states to respond to hostile activities, with the United States wanting a right to self-defense to apply while Cuba feared that it would be used to justify unilateral punitive actions. At the same time, the member states of the Shanghai Cooperation Organization proposed a code of conduct in 2011 and then in 2015, but without success. In October 2018, Russia and the United States proposed competing resolutions to relaunch the UN GGE process. These behaviors can be explained not only by diverging interests but also by opposing representations about international relations, cyber security issues and the modes of governance they induce.\nTwo aspects accentuate this pluralism. On the one hand, the blurring of the categories between war and peace, but also of the criteria that make it possible to qualify an act of aggression in an indisputable way. On the other hand, the distinction between governmental and non-state actors is becoming blurred. However, the question of governance arises between the promoters of a multilateral approach and those of an approach that includes all stakeholders. At the same time, initiatives are emerging in the private sector, as illustrated by Microsoft's initiatives for a Digital Geneva Convention (2017) and a Cyber Security Tech Accord (2018).\nThe 2010s can be characterized, so far, by the progressive rise of security issues related to cyber, from computer security to national security. This is partly due to the simultaneous growth of the digital domain and of vulnerabilities that could potentially cause systemic damage. But this is also due to the diversification and diffusion of certain modes of action (DDoS, ransomwares). Finally, this is tied to the interpretation of certain precedents (Stuxnet, the DDoS attack on Estonia in 2007, the use of cyber operations by Russians against Georgia in 2008 or in Ukraine since 2014) as well as recurrent behaviors (the combination of criminal and political behavior by North Korean hackers, industrial and intellectual espionage by Chinese hackers).\nAnother more fundamental reason is the gradual construction of a threat discourse by both governments and security actors (government agencies, security companies) in a context of increasing competition among key international actors. Cybersecurity is therefore linked to existential threats to political regimes, the status of states on the international scene, social cohesion and economic prosperity. This process is intertwined with the divergence of representations between the main powers. While the United States insists on the strategic threat posed by China through its espionage campaigns in 2010--2015 and again since 2018, both China and Russia present United States' discourses, practices and military doctrines as fundamentally in conflict with their interpretation of sovereignty, both in domestic and international politics. This escalation of the stakes has profound consequences for the implementation of strategies and mechanisms designed to secure cyberspace or parts of it, to deal with threats or to modify existing power relations.\n### Practices of cyber conflict Government agencies and national security elites appear to have adopted the necessity of offensive doctrines and strategies to disrupt, coerce, and deter. In the United States, a proposed bill allowing companies to operate outside their networks (active cyber defense) illustrates the possible frustration with the failure of traditional deterrence policies, as does the shift in terminology within the Department of Defense to a “defend forward” posture defined as “confronting threats before they reach U.S. Networks” (Department of Defense, 2018; Lin & Smeets, 2018; Lyu, 2018; Sanger, 2018). More broadly, operational constraints alone are not enough to explain the practice of maintaining a presence in the digital networks of other states to hold certain targets at risk as a deterrent. Some governments have tried to influence constituencies in foreign countries through social media. Finally, other actors are carrying out disruptive actions towards the industrial and financial sectors, with much more destabilizing and insecure consequences.\nAmong these practices, those surrounding the research, development, accumulation and dissemination of zero-days, exploits and malware are worrying, as illustrated by the case of the EternalBlue exploit, developed by the United States National Security Agency (NSA), stolen and auctioned by a group of hackers suspected of being linked to Russian military intelligence and used in Wannacry and NotPetya. This case illustrates the risk of proliferation of cyber weapons, but also the risk of loss of control by their designers or owners. In this field, there is no consensual and shared policy to regulate these practices and ensure that states do not compromise all users. The segmentation of the effort to control the proliferation of the most dangerous exploits--because they are likely to cause the most damage--is even potentially counterproductive insofar as it can generate tensions and risks.\nThe intermingling between private and public, civil and military actors is also problematic. Some governments rely on state-sponsored actors to share technical and human resources but also to increase their ability to deny responsibility. However, this approach poses the classic dilemmas of the principal-agent type. Increased control by policy makers or government agencies reduces effectiveness and operational flexibility and reduces the ability to deny responsibility for an attack. The relaxation of this control by the principal increases tactical flexibility and adaptability but creates risks of escalation or misperception due to divergent or even competing agendas on the part of the agent.\nIn most European and North American countries, Internet hardware and software infrastructures are operated and maintained by the private sector. Thus, part of this sector is involved in security through software solutions or in the Threat Intelligence and Threat Analysis process. In addition, the private sector and the public sphere often appear as soft targets as part of indirect strategies seeking to modify power relations at the margins. Consequently, defense in depth would benefit from greater cooperation between the private and public sectors (information sharing, resource sharing, responsiveness), or even through integration or even control. Nevertheless, in addition to the costs of an approach of enrolling private sector forces in national security under government authority (which also depend on political cultures and institutions), there are also risks associated with identifying these actors with policy makers (increased by attribution issues). Moreover, the logic of the sovereign and those of these actors can come into confrontation and accentuate the politicization of private organizations. However, this is a means by which a multi-stakeholder approach or inclusive multilateralism can be deployed (Cattaruzza, Danet, Taillat, & Laudrain, 2016).\nIssues related to cyber security and digital technologies therefore have an undeniable strategic impact that is incommensurate with the relative utility of cyber capabilities. This phenomenon has continued to grow in a dialectic between the United States and its rivals on the one hand, and between the United States and the rest of the cyber conflict actors on the other. The result is a potentially unstable process because it is particularly sensitive to the behavior of major international security actors and, in particular, to misperceptions. The future evolution of cyber conflict is thus closely dependent on the propensity of actors to take risks or hold at risk the infrastructures and standards on which they nevertheless depend. Cyber conflict is particularly sensitive to the structuring of issues in a long-term strategic competition but also to a sudden change resulting from the risky behavior of an actor.\n## Conclusion The impact of digital and cyber-conflict technologies on international security depends both on the technical and operational characteristics of the cyber domain and on what states make of it. Interactions between states, and the rationales underlying their actions, are therefore affected by their perceptions of opportunities and vulnerabilities. In return, their strategic choices and the dilemmas that accompany them create potential for escalation and misperceptions that most want to avoid.\nThis raises the issue of collective security in a new way. Collective security depends on two factors: the establishment of a shared regime to regulate the use of digital technologies, and the ability of the main powers that guarantee the international political order to reach an agreement to fight against disruptive and revolutionary actors. The contemporary context of eroding trust between states and in the benefits of the international order would rather invite pessimism. Since the security dilemma feeds on uncertainty about the intentions of the actors, it produces even more instability if the latter are asymmetrical in terms of maintaining versus challenging the international political order. It is even more so when the legitimacy of the rules of the international game is called into question, especially when other actors contribute to the marginalization of states."
    }
  },
  "citation_summary": {
    "style": "author_year",
    "dominant_bucket": "author_year",
    "dominant": {
      "intext_total": 17.0,
      "success_occurrences": 17.0,
      "success_unique": 16.0,
      "bib_unique_total": 84.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 0.19047619047619047,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "author_year"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "numeric": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 17.0,
        "success_occurrences": 17.0,
        "success_unique": 16.0,
        "bib_unique_total": 84.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.19047619047619047,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "Disrupt and restraint: The evolution of cyber conflict and the implications for collective security",
    "subtitle": "To link to this article: https://doi.org/10.1080/13523260.2019.1581458",
    "document_type": "journal_article",
    "venue": "ISSN: 1352-3260 (Print) 1743-8764 (Online) Journal homepage: www.tandfonline.com/journals/fcsp20",
    "publication_year": 1931,
    "authors": [
      "Contemporary Security Policy",
      "Routledge Taylor",
      "Francis Group",
      "Stéphane Taillat",
      "View Crossmark data"
    ],
    "affiliations": [
      "International Relations and Strategic Studies, St Cyr French Army Academy, Guer, France"
    ],
    "emails": [
      "stephane.taillat@st-cyr.terre-net.defense.gouv.fr"
    ],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "In the last decade, cyber conflict has become a main feature of international politics and a growing concern for strategic stability and collective security. Unfortunately, cyber conflict suffers from a lack of conceptual clarity about its impact on collective security and a lack of consensus among international actors on how to interpret it. This article proposes to understand cyber conflict as an evolving process driven by two factors: the way in which digital space is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber have been included in the field of national and international security. Both tend to encourage offensive behavior but also demonstrate features pointing to restraint. KEYWORDS Collective security; cyber conflict; international security Cyber conflict suffers from a lack of conceptual clarity and a lack of consensus among key international actors on how to interpret it. For years, academics have struggled to account for the potentialities and effects of digital technologies on conflict dynamics. The debate has focused on the inclusion of cyber conflict in the Clausewitzian conceptualization of war (Rid, 2012; Stone, 2013). Several researchers have taken into account the specificities of cyber confrontation but have also sought to explain the gaps between expectations and behaviors, whether in terms of attribution (Rid & Buchanan, 2015), deterrence (Fischerkeller & Harknett, 2017; Libicki, 2009; Nye, 2016/2017), escalation dynamics (Lin, 2012; Valeriano, Jensen, & Maness, 2018), coercion (Borghard & Lonergan, 2017; Gartzke & Lindsay, 2016; Sharp, 2017), and the offensive-dominant character of conflict in cyberspace (Gartzke & Lindsay, 2015). Others have attempted to account for the empirical evolution of cyber conflict toward restraint or aggression below the threshold of armed force (Steiger, Harnisch, Zettl, & Lohmann, 2018; Valeriano & Maness, 2015) or to question these dynamics through the prism of covert actions and deniability (Joseph & Poznansky, 2017; Poznansky & Perkoski, 2018). Finally, the CONTACT Stéphane Taillat stephane.taillat@st-cyr.terre-net.defense.gouv.fr © 2019 Informa UK Limited, trading as Taylor & Francis Group debates have focused on the relevance and methods of social sciences for analysing cyber conflict (Kello, 2013, 2014, 2017; Valeriano & Maness, 2014). Jurists have also examined the particularities of cyberspace and cyber operations to assess the possible application of legal categories, without reaching consensus or formally guiding governments (Schmitt, 2013, 2017). In addition to these academic debates, there are divergent representations between the main powers concerning the challenges and threats related to the cyber domain in the context of a growing opposition between their interests. These divergences stem from the conceptualization of cyberspace. For China and Russia, for example, the information space includes all digital networks but also the political and social sphere. The main threat therefore stems from the ability of opponents (mainly the United States and Western countries) to destabilize these political regimes and threaten their control over society. For the United States and many European states, cyberspace mainly includes computer networks and the economic, industrial, or military activities that depend on them. The threat is therefore more about a competitor's ability to exploit the high digitization of these societies to gain an asymmetric advantage or cause catastrophic damage. There is therefore a heterogeneity of values and interests, fueled by the logics of their long-term strategic competition. As a result, this heterogeneous feature of the international system results in the absence of a framework of shared meanings to limit tensions, manage conflicts, and control the risk of escalation. Moreover, the possibility of exploiting cyberspace from an asymmetrical perspective contributes to emboldening revolutionary or revisionist actors, as evidenced by the shift towards increasingly risky modes of action and strategies that contribute to disrupting the entire international normative system in peacetime. The difficulty of defining cyber conflict and establishing international rules is problematic from the point of view of collective security. This difficulty is part of a more general evolution toward the blurring of conventional categories on conflicts, war and warfare. The purpose of this article is not to resolve these differences or to synthesize these conceptual approaches. In this article, I postulate that war and conflict are categories that depend on how actors interpret and integrate them into their practices and strategies. Thus, the current heterogeneity of the international system is fueled and in turn feeds these divergences of interpretation and the polarization of rivalries. Therefore, it is not possible to objectively define contemporary cyber conflict. Cyber conflict is subject to changing evolutions and characteristics. I thus propose to understand these changing evolutions and characteristics through an analytical framework structured around two processes: the way in which digital domain is configured and the way in which tactical, organizational, strategic, and doctrinal characteristics related to cyber security have been included in the field of national and international security. This has two consequences for collective security. First, the configuration of the cyber domain produces incentives for offensive action but within a framework characterized by low operational efficiency. Second, cyber conflict is particularly dependent on interactions between actors and therefore on strategic contexts such as long-term strategic competition. This article will proceed in two steps. First, it will focus on how the configuration of the cyber domain affects the incentive to act offensively while remaining below a certain threshold of aggression. Second, it will analyze how cyber capabilities have been included in national and international security issues, generating a strong sensitivity to cyber security issues.",
    "keywords": [],
    "publication_dates": {
      "published": "26 Feb 2019",
      "online": "26 Feb 2019"
    },
    "identifiers": {
      "doi": [
        "10.1080/13523260.2019.1581458",
        "10.1017/eis.2016.8",
        "10.1080/09636412.2017.1306396",
        "10.1080/00396338.2016.1142093",
        "10.1109/CYCONUS.2016.7836628",
        "10.1080/09636412.2015.1038188",
        "10.1080/00396338.2017.1399730",
        "10.1177/0022343317731508",
        "10.1162/ISEC_a_00138",
        "10.3917/pe.144.0139",
        "10.1017/eis.2017.17",
        "10.1007/s10676-005-4582-3",
        "10.1162/ISEC_a_00266",
        "10.1093/jogss/ogy022",
        "10.1080/01402390.2011.608939",
        "10.1080/01402390.2014.977382",
        "10.1080/03071847.2012.664354",
        "10.1080/01402390.2017.1307741",
        "10.1080/01402390.2017.1288107",
        "10.1080/23738871.2018.1453526",
        "10.1080/01402390.2012.730485",
        "10.1177/0022343313518940"
      ],
      "issn": [
        "ISSN: 1352-3260"
      ],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "www.tandfonline.com/journals/fcsp20",
        "https://doi.org/10.1080/13523260.2019.1581458",
        "https://www.tandfonline.com/action/journalInformation?journalCode=fcsp20"
      ]
    },
    "references_block_count": 1,
    "references_entries_estimated": 50,
    "heading_count": 15,
    "max_heading_level": 3,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "title_looks_like_mid_paragraph_sentence"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 17,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 1.0,
      "footnote_coverage": 1.0,
      "unique_index_count": 16
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "author_year",
      "recommended_style": "unknown",
      "aligned": true,
      "signals": {
        "superscript_hits": 0,
        "superscript_definition_lines": 0,
        "numeric_bracket_hits": 0,
        "numeric_endnote_lines": 0,
        "author_year_hits": 7
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 84.0,
      "dominant_bib_coverage_rate": 0.19047619047619047,
      "dominant_link_target": "bibliography",
      "dominant_unresolved_flag": "unresolved_reference_links"
    },
    "heading_validation": {
      "heading_count": 15,
      "max_heading_level": 3,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": true,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": true,
        "emails": true,
        "orcids": false,
        "abstract": true,
        "keywords": false,
        "venue": true,
        "persistent_identifier": true,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 5,
        "affiliations": 1,
        "emails": 1,
        "orcids": 0,
        "keywords": 0,
        "doi": 22,
        "issn": 1,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 3
      },
      "coverage": {
        "core_coverage": 1.0,
        "email_author_link_rate": 1.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "title_looks_like_mid_paragraph_sentence"
        ],
        "toc_dot_lines": 0
      },
      "flags": []
    },
    "flags": [
      "low_bib_coverage"
    ]
  },
  "updated_at_utc": "2026-02-14T08:28:06.195912+00:00"
}