{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\2H8H9DLZ\\Libicki - 2020 - Cyberwar is What States Make of It.pdf",
  "custom_id": "8",
  "response": {
    "id": "batch-b6235e9e-9-5c8ce547-59c4-4d7b-bcfa-07fef7e1eb04",
    "custom_id": "8",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "# THE CYBER DEFENSE REVIEW\n\nCyberwar is What States Make of ItAuthor(s): Martin Libicki\n\nSource: The Cyber Defense Review, Vol. 5, No. 2, Special Edition: Information Operations/Information Warfare (SUMMER 2020), pp. 77-88\n\nPublished by: Army Cyber Institute\n\nStable URL: https://www.jstor.org/stable/10.2307/26923524\n\n## REFERENCES\n\nLinked references are available on JSTOR for this article: https://www.jstor.org/stable/10.2307/26923524?seq=1&amp;cid=pdf-reference#references_tab_contents\n\nYou may need to log in to JSTOR to access the linked references.\n\nJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\n\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms\n\nArmy Cyber Institute is collaborating with JSTOR to digitize, preserve and extend access to The Cyber Defense Review\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2450,
              "width": 1653
            }
          },
          {
            "index": 1,
            "markdown": "This content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n\n# THE CYBER DEFENSE REVIEW\n\n* RESEARCH ARTICLES *\n\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          },
          {
            "index": 2,
            "markdown": "This content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          },
          {
            "index": 3,
            "markdown": "# Cyberwar is What States Make of It\n\nDr. Martin Libicki\n\nNo one there at the time could forget the vicious cyberattack on Venezuela's power systems in March 2019. Four days of chaos ensued. Stores and restaurants closed. Card payments systems were down, with customers asked to pay in dollars. Disrupted public transportation left many unable to get to work. Looting ensued. Seventeen people died in hospitals for lack of electricity.[2]\n\nWait, some of you may be thinking: what cyberattack? There is no question that Venezuela's grid had serious problems, but the only evidence that a cyberattack caused these problems was the word of President Maduro. He certainly had political reasons to mobilize his supporters against yet another delivered insult by the US, which has made no secret of its desire to see Maduro go.[3] More likely, the power outage reflected the same dysfunctional energy facilities that reduced the average daily oil production rate from nearly 2.5 million barrels in 2015, to a third of that in 2019.\n\nBrazil can tell a similar tale of woe. In 2007, hackers attacked the grid of the state of Rio Grande do Sul, causing severe power outages. The CIA picked up and circulated this story within the intelligence community for two years before it was broadcast by Sixty Minutes in 2009.[4] Or was it a cyberattack? Once it was reported in the press, Brazil's government denied any such cyberattack, claiming the cause to be sooty insulators, resulting in a fine assessed against the relevant utility.[5] So, end of the story? Not necessarily, argue two of the savvier observers on the cyberwar scene (one American and one Israeli); there were known groups that had both an interest in, and a talent for cyberspace mischief, and the government of Brazil would have been embarrassed to admit their success.\n\nThis is a work of the U.S. Government and is not subject to copyright protection in the United States. Foreign copyrights may apply.\n\nSUMMER 2020\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          },
          {
            "index": 4,
            "markdown": "CYBERWAR IS WHAT STATES MAKE OF IT\n\n![img-0.jpeg](img-0.jpeg)\n\nDr. Martin C. Libicki (Ph.D., U.C. Berkeley 1978) is the MaryEllen and Richard Keyser Chair of Cybersecurity at the U.S. Naval Academy where he teaches cyberwar strategy and cyberspace economics. Prior employment includes having been a senior management scientist at RAND since 1998, focusing on the impacts of information technology on domestic and national security. He wrote three commercially published books: Cyberspace in Peace and War (2016, second edition forthcoming), Conquest in Cyberspace: National Security and Information Warfare (2007), and Information Technology Standards (1994). He is also the author of numerous RAND monographs, notably Defender's Dilemma, Brandishing Cyberattack Capabilities, Crisis and Escalation in Cyberspace, Global Demographic Change and its Implications for Military Power, Cyberdeterrence and Cyberwar, How Insurgencies End (with Ben Connable), and How Terrorist Groups End (with Seth Jones). Prior employment includes 12 years at the National Defense University, three years on the Navy Staff as program sponsor for industrial preparedness, and three years for the GAO.\n\nIf attacks on the power grid can be faked or hidden, imagine what can be done with other mischief in cyberspace. Cyber-espionage can go undetected for years. Withdrawals from bank accounts can be covered by funds transfers from the embarrassed bank (albeit not legally in many countries). Induced failures in police or intelligence systems may not make the news if such systems are themselves unknown to the public. By contrast, there is no hiding when it is the lights that go out. Nevertheless, the fact of a power outage does not prove that a cyberattack caused it—and, while the power company might know, they may not say or be encouraged or even allowed to speak. And, even if a cyberattack is established, attribution can still be an issue.\n\nSo far, the only verified cases of electric power loss caused by hacking occurred in Ukraine: two separate incidents in late 2015 and late 2016. But just as the existence of nuclear weapons—even though none have been detonated in war since 1945—has dramatically influenced the security choices of the US, Russia, and China, an imminent threat to knockout electric power could shape future crises. Targeted countries could be coerced or alternatively, they could try to pre-empt attackers by doing likewise. The most frequently discussed way to convert the threat to the electric grid from a notional to a real possibility is to implant malware into the other side's industrial control systems (as distinct from their office and billing systems). Such implants have been likened to Soviet moves to put intermediate-range nuclear-tipped missiles in Cuba, thereby tripling their capacity to strike the US.\n\nSo, have countries implanted malware in other countries' electric grids? In 2009, The Wall Street Journal, with no evidence beyond \"intelligence\" sources, reported that Russia and China had done precisely that to the US grid.[6]\n\nIn late 2014, Admiral Michael Rogers, Commander, U.S. Cyber Command (USCYBERCOM), testified[7] that,\n\nTHE CYBER DEFENSE REVIEW\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [
              {
                "id": "img-0.jpeg",
                "top_left_x": 123,
                "top_left_y": 200,
                "bottom_right_x": 526,
                "bottom_right_y": 703,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          },
          {
            "index": 5,
            "markdown": "“there are nation-states and groups out there that have the capability ... to shut down, forestall our ability to operate our basic infrastructure, whether it's generating power across this nation, whether it's moving water and fuel.” Later that year evidence surfaced that Russian hackers had used tools to penetrate power stations (using Black Energy malware) and corrupted software updates of machinery that sat on electronically isolated (aka “air-gapped”) networks (using Havex malware). In mid-2018, DHS officials reported penetration by Russian hackers of the US electrical system by leveraging the phishing-acquired credentials of suppliers to electrical control systems; “They got to the point where they could have thrown switches” and disrupted power flows.[8] Iran has been credited with similar capabilities.[9] Some believe that “so many attackers have stowed away in the systems that run the US electric grid that experts say they likely have the capability to strike at will.”[10]\n\nIt is difficult to know what to make of these claims. The intelligence community keeps secrets for a living. Law enforcement rarely releases sensitive information before trials. Corporations seldom concede that they are victims of hackers, especially of hacks that produced no visible effects. Finding malware is not necessarily an indication of cyberattack, either. The malware could have drifted in from elsewhere. Stuxnet, for instance, appeared in over 100,000 systems outside the Natanz centrifuge plant. A compiler corrupted to produce malware-laden software for a specific supply-chain attack can compromise other software that is unknown to the hackers. While possible, it is quite difficult for hackers who cannot communicate with the malware to time an attack.\n\nAt least, claims of extant or impending cyberattacks can be refuted if given time. Anomalous indicators on an employee's laptop at the Burlington Electric Department were initially mistaken for a deliberate Russian hacking attempt on its electrical power grid.[11] That is reassuring to onlookers who remember the accusation, and then the retraction, but what if someone had acted irreversibly on the accusation, before it was retracted?\n\nMatters are foggier if attackers, rather than defenders, claim that implants were installed. In mid-2019, USCYBERCOM gave notice that it was installing implants into the Russian electric grid,[12] which the Russians denied,[13] claiming that such attacks were thwarted.[14] So, is the US capable of taking down the Russian electric grid (e.g. in retaliation for their doing likewise)?\n\nFinally, even if the fact of the disruption and attribution both are indisputable, the message intended by the disruption is subject to multiple interpretations. Consider the hacks of Ukraine's power grid.[15] The hack, according to Robert M. Lee and Mike Assante (both teach cybersecurity for SANS) was meant, “to stoke the ire of Ukrainian customers and weaken their trust in the Ukrainian power companies and government.” The article's author, citing Ukrainian sources, then adds that “[s]peculation has been rampant that the subsequent blackouts in Ukraine were retaliation for the attack on the Crimean substations.” Robert Lee was quoted later in the article considering the possibility that, “the attack on the Ukrainian power",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          },
          {
            "index": 6,
            "markdown": "CYBERWAR IS WHAT STATES MAKE OF IT\n\ncompanies was a message to Ukrainian authorities not to pursue privatization,\" ultimately concluding the message to be: \"We want to be seen, and we want to send you a message ... oh, you think you can take away the power [in Crimea]? Well I can take away the power from you.\" Finally, an attack on the electric grid that caused modest effects could easily be portrayed as one that could have caused major effects but for self-restraint or error: the late 2016 cyberattack on Ukraine's electric grid opened circuit breakers that were closed an hour later, but analysis of the code suggested that the hackers sought to cause physical damage before power was restored but made several coding errors.[16] Oleksii Yasinksy, a Ukrainian cybersecurity researcher, believed the hackers \"could have knocked out Ukrenergo's transmission station for longer or caused permanent, physical harm to the grid, he says—a restraint that American analysts like Assante and Lee have also noted.\"[17]\n\nWhat can we draw from these examples? Based on the Venezuelan incident, one observer concluded, \"the inability to definitively discount US or other foreign intervention, whether deliberate or accidental, demonstrates the incredible power of using cyberattacks to target utilities.\"[18] But there is an alternative perspective: it demonstrates the profound impact such cyberattacks have on the public's imagination—which, when coupled with the difficulty of proving who did what and why—illustrates the power that mere claims of cyberattack have, either by the attacker or the attacked. There is a reason cyberspace events are mysterious. To paraphrase Ross Anderson[19]: airline safety has improved faster than cybersecurity because airplanes crash outside and, by so doing, create facts that cannot be waved away. But computers crash inside, which allows others to understate or overstate what actually took place.\n\n## Manipulating Information about Information War Itself is Information Warfare\n\nThe ease with which facts can be manipulated, given the ambiguities and obscurities of cyberspace, means that leaders will be tempted to do just that. Having examined the means of distorting the truth, it is important to understand some of the motives that would prompt such distortions. The degree of manipulation will depend on several variables, including the moral quality of a country's leaders, their ability to maintain a narrative at variance with facts, and the political context within which they operate.\n\nIn fairness, the ability to create misperceptions that vary with reality is often unequal. Transparency brings reality and perceptions closer together. So, the leeway of governments to fudge events will vary—directly or via proxies (e.g., power grid operators). Competition among private cybersecurity firms makes it more difficult to advance defensible claims. Conversely, exposure to public opinion creates a gap between perceptions and reality that may be unsupportable. Claims to expert authority are not taken as seriously as (we suppose) before. At least in the West, epistemic closure appears to be growing worse. Despite a clear consensus among the cybersecurity community that imaging servers suffices to understand a network intrusion, for instance, many who take their cues from the leaders they like believe\n\nTHE CYBER DEFENSE REVIEW\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          },
          {
            "index": 7,
            "markdown": "MARTIN LIBICKI\n\nthat shipping servers to a foreign country is a way to hide false flag attacks (e.g., Ukrainians doing what Russians are blamed for).\n\nAdding to the discrepancy has been the tendency of some countries to separate their communications from the rest of the world. North Korea remains isolated. China's Great Firewall is a prime example of selective filtering. Iran is similar in this regard and is contemplating even more isolation.[20] Russia recently experimented with closing its Internet off from the rest of the world.[21] Early hopes that the Internet would bring the world together and that, in John Gilmore's words, \"The Net interprets censorship as damage and routes around it,\" look nostalgic. As Evgeny Morozov observed in *The Net Delusion: The Dark Side of Internet Freedom*,[22] authoritarian governments originally caught flat-footed by the Internet have learned how to control it and turn it to their purposes.\n\nBetween the facts that, for laypeople, cyberspace is opaque, and yet, the Internet can actually facilitate misperception over reality, the stage is set for states to make of events in cyberspace as they will.\n\nTo simplify the question, consider two players: the target and the attacker. The target has two basic choices: to play up the incident (even, perhaps especially, if no cyberattack were actually involved or no implant dropped), or to downplay it. The attacker has two basic choices as well, but is in a poor position vis-à-vis the target to argue about the effects of the cyberattack. Figuratively and literally, the target is there, and the attacker is not. But the attacker can either dispute or embrace attribution because the requisite evidence is something the attacker will have special knowledge of.[23]\n\nThe target can play up the cyberattack in many ways. Assuming there is something to work with (e.g., a blackout), it can be mischaracterized as an accident, human error, design flaw, as well as a cyberattack. As a variant, an accidental or inadvertent cyberattack can be characterized as deliberate and malicious.[24] A cyberattack with a weak effect could be touted as a bullet dodged, either because the hacker erred, or because the hacker was brandishing its capabilities and could have done worse if it wanted to. And, as noted, even if no cyberattack took place, some entity the target wants to malign could be accused of having planted malware \"discovered\" in the system. Attribution can also be played, largely because some cyberattacks are more embarrassing than others. An inside job can imply that an organization's employees are untrustworthy, or that the organization poorly vetted, and/or that its systems afforded others too many privileges. The victim of a state-backed hacker group can summon the misleading argument that a private company can no more defend its network against an army than it can defend its factory against one; falling to a criminal group is more blameworthy. Finally, if the adverse impact of the cyberattack is insufficient to meet the target's needed political narrative, the cyberattack can be cast as the beginning of a systematic campaign. With a little nerve, it can argue that it was the first shot in a kinetic war, thereby justifying the target's decision to\n\nSUMMER 2020 | 81\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          },
          {
            "index": 8,
            "markdown": "CYBERWAR IS WHAT STATES MAKE OF IT\n\nmobilize its society to fight. While an actual kinetic war may not happen, an action-reaction cycle could actually escalate into war. And if the war does not come, there's always the narrative that war would have come were it not for the target's raising the alarm and mobilizing (e.g., its own forces, the righteous anger of its citizenry, enraged world opinion) accordingly.\n\nThis litany of options illustrates why the target may play up a cyberattack. They help unify a country in the face of an adversary while distracting the polity from the government's mistakes. The mobilization of opinion helps governments institute repressive measures or raise taxes. Threats of cyberattacks may persuade the public to allow its government access to personal or organizational systems. Once governments are granted authority to surveil systems for malware or other evidence of intrusion, they can use such access to monitor unwanted activity by citizens. Accusations may create cover for the target's own aggressive acts, forcing concessions from the attacker, even if the incident is phony or exaggerated. It can warn third countries that war may be coming, thereby forcing alliances or other commitments. (Ironically, hyping a cyberattack could lower tensions by substituting conflict in cyberspace, which is unlikely to kill anyone, for more risky posturing in the physical world).\n\nThe most innocent explanation is that exaggerating the cyberspace threat will persuade many to take cybersecurity more seriously as they should have from the start (like Senator Arthur Vandenberg, who told President Truman public support for aid to Greece and Turkey against Communists required him to \"scare the hell out of the American people\"). But this rationale holds some paradox. If the point is to inspire confidence in the integrity of government processes – for instance, that voters can trust election results because they are protected – advertising their vulnerability to hacking may ultimately lead to trustworthy voting systems but, until then, will not produce trusted voting systems.\n\nThat logic is one of several reasons' leaders may be reluctant to play up cyberattacks. As a device for mobilizing popular opinion, cyberspace events may be too esoteric, incomprehensible, and removed from daily concerns to allow for galvanizing emotions. Unlike terrorism, cyberattacks more likely will engender anxiety and annoyance, on par with the prospect of a morning traffic jam. But if someone's literal viscera are not threatened, can cyberattacks induce the kind of visceral fear with the requisite political clout?\n\nReasons to downplay cyberattacks are not hard to find. Falling victim to cyberattacks is, as noted, embarrassing. Such catastrophes can be prevented either by diligent cybersecurity investments or through various forms of self-denial (e.g., closing systems to easy access by others, retaining less information, or prioritizing security over usability and flexibility). Because the point of government is providing security and reliability, admitting that it failed at that can be difficult.\n\nOther reasons for reticence may arise in strategy. Just as playing up cyberattacks may help mobilize citizens for confrontation, playing them down may allow governments to avoid\n\nTHE CYBER DEFENSE REVIEW\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          },
          {
            "index": 9,
            "markdown": "MARTIN LIBICKI\n\nconfrontations they cannot win or at least can win only at great cost. Analogously, many in Europe were eager to accept Putin's assertion that Russia had no forces in Ukraine's east: \"[The West] connived in Mr. Putin's pretense that he had not invaded eastern Ukraine—even though in a furtive tricky way he plainly had—because to say otherwise would have required a drastic response.\"[25] Playing down attacks also signals insouciance. Thus, if its purpose is to goad the target into doing something rash (e.g., as the September 11th attacks may have been used by al-Qaeda to goad the US into Afghanistan) then downplaying that would translate as an insufficient pain threshold to merit response. Similarly, by refusing to admit to being hurt, a state conveys that it is not coerced and thus will not accede to whatever demands, be they explicit or implicit, are imposed by the attacker, and will itself be undeterred in pursuing its own ends.\n\nDenying attribution also obviates pressures on the target to respond, and also conveys, albeit weakly, that the cyberattack fell below some pain threshold. This allows the target state the option to determine later that they have enough confidence to respond. Conversely, an argument that the pain of cyberattack is limited can be undermined by the discovery of wider and deeper effects and rarely can be assigned by the reverse (much as death tolls can only go up as catastrophes are investigated). The same holds for characterization of near-attacks or failed-attacks. Earlier interpretations that they were not deliberate or carried out by incompetents can be credibly revisited.\n\nA last option is to cast doubt on any early facts, whether helpful or harmful. One reason may be to avoid prejudicing the investigation in the hopes of learning the real lessons for the incident. Another is to prevent the attacker (and would-be copycats) from receiving battle damage assessment so to speak, the better to perfect subsequent attacks.\n\nAs to attackers, they, like defenders, can play up or play down the consequences of the attack, its characterization, or its attribution. In practice, however, it is difficult for attackers to more credibly characterize the attack than the target, which has far greater access to information than the attacker. Indeed, the attacker often will have very little if any firsthand information. Reports, for instance, that the US successfully interfered with performance of North Korea's Musudan missile had to be left dangling because of the lack of any sure way to know whether the hack actually worked, or, even if it did work, was a decisive factor in subsequent launch failures.[26] The best the attacker can do is to argue that while the target may know better, its leaders often lie about what they know to be otherwise. It took two months after the public learned about Stuxnet for Iran to concede it had been hurt. Yet neither the US nor Israel officially claimed that the attacks succeeded.\n\nIn theory, matters are less clear. Attackers usually know better what they tried to do than do defenders; if the damage is subtle or only appears under certain circumstances, the attacker may know to look to telltale signs that its attacks worked, often leaving the defender oblivious to the attack. Subtle attacks also do not make the news, at least not until their impacts become visible.\n\nSUMMER 2020 | 83\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          },
          {
            "index": 10,
            "markdown": "CYBERWAR IS WHAT STATES MAKE OF IT\n\nThis leaves attribution as the attacker's primary lever. Countries generally do not acknowledge their cyberspace operations, even when so accused. This stands in contrast to acts of terrorism (at least pre-9/11), which were followed by multiple claimed terrorist group perpetrators. Many cyberattacks such as the 2012 attack on Saudi Aramco or the 2014 attack on Sony are claimed by groups: The Cutting Sword of Justice and the Guardians of the Peace, respectively. But these groups do not really exist as separate entities. The reasons to deny attribution are straightforward. Most accusations involve cyber espionage whose operators avoid—because the point is to work undetected—revealing their own capabilities and modus operandi.\n\nAs for the rarer instances of cyberattack, often the target knows the attacker's identity, while admitting as much opens the attacker to criticism and makes it hard for the attacker to, in turn, criticize incoming cyberattacks. For example, going back at least to the 1973 War, Israel's neighbors believed that Israel had nuclear weapons, thereby giving Israel the benefit of deterrence. Yet Israel strenuously denied having such weapons, to the point of even luring and then jailing Mordechai Vanunu, an Israeli who revealed as much to the British press in the 1980's.[27] Israel may well have calculated that open admission would have led third parties to push Israel to de-nuclearize, or to pressure neighboring countries to pursue their own nuclear weapons.\n\nStuxnet provides an interesting case in contrast. Neither the US nor Israel denied this cyberattack,[28] yet neither admitted it officially, at least at first. But at least some in each country wanted to take credit for it. In the US, former Vice Chairman of the JCS, General Cartwright, was accused to have been the source for David Sanger's articles on the hack. And a 2011 YouTube video captured Israel's Chief of Staff at his retirement party counting Stuxnet among his prominent achievements.[29] In 2016, an official Israeli document baldly stated, \"an example of an offensive cyber operation conducted by Israel is Stuxnet, which was jointly developed with the United States and targeted Iranian nuclear facilities.\"[30] Other governments have tried to have it both ways. Russia denied hacking the DNC in 2016, but its President called the hackers \"artists.\"[31] North Korea denied hacking Sony in 2014 but called it a \"righteous deed.\"[32]\n\nGenerally, hypocrisy—a tribute vice pays to virtue—rules. Given a choice between appearing great and appearing good, countries choose good. That is, they would rather talk up their fealty to international norms than overawe others with their cyberspace prowess. But for how long? As noted, the US did not seem to mind news stories that it had penetrated Russia's grid. In the summer of 2019, the US also indicated it was penetrating systems of those intruding against the US[33] (a.k.a. \"defending forward,\" or \"persistent engagement\"), and had countered Iran's shoot-down of a US drone with a cyberattack.[34] Might other countries follow? No country had (publicly, at least) established a cyberspace operations entity until the US formed USCYBERCOM. Many blushed at the thought of militarizing cyberspace until they—first allies, and then adversaries—followed suit. Whether other countries copy the trend\n\nTHE CYBER DEFENSE REVIEW\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          },
          {
            "index": 11,
            "markdown": "MARTIN LIBICKI\n\nof taking credit not only for successes but also for operations more difficult to assess as successful depends on whether the aforementioned events of 2019 recur. This, in turn, depends on how much they reflected the character of the U.S. Administration at the time. But if such behavior becomes a trend, as opposed to a blip, other countries likely will follow suit in the years to come.\n\n# CONCLUSION\n\nIt has been said that the first casualty in war is truth. Today advances in technology and transparency as well as the professionalization of inquiry make it easier to determine the truth sooner rather than later. In this regard, cyberspace lags. Perhaps this should not be so—a fully imaged computer hard drive after a cyberattack leaves nowhere for anything to hide. But, in practice, there is often no third-party confirmation of a successful cyberattack, much less a failed cyberattack, or one partially completed (e.g., an implant). There is no easy equivalent in overhead imagery. And besides, matters once considered settled because of elite scientific consensus are increasingly open to question for a variety of causes (e.g., populism, the Internet's ability to support echo chambers, less influence of traditional media, epistemic closure).\n\nTrue facts of cyberwar are becoming secondary to misperceptions that governments either shape or influence. Increasingly, cyberwar is becoming what states make of it, and how they package it. That leaves, as open questions, what states will make of it. As argued, their options range in efficacy and persistence (in the face of subsequent revelations). The strategies states will employ will, of course, adapt to the circumstances. No hard projections can be made about what the games will look like, but games there will be.[35]\n\nSUMMER 2020 | 85\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          },
          {
            "index": 12,
            "markdown": "CYBERWAR IS WHAT STATES MAKE OF IT\n\n# NOTES\n\n1. Titled in homage to an otherwise unrelated article: Alexander Wendt, \"Anarchy is What States Make of It: The Social Construction of Power Politics,\" *International Organization* 46(02):391-425, March 1992.\n2. Description from Tom McKay, \"Maduro Says 'Multiple Cyberattacks' Backed by U.S. to Blame for Four Days of Widespread Blackouts,\" March 10, 2019; https://gizmodo.com/maduro-says-multiple-cyberattacks-backed-by-u-s-to-b-1833190542.\n3. When China's offer to help bolster the security of Venezuela's grid was rejected, even the Chinese were convinced that no such cyberattack had taken place.\n4. This claim (without details) was made by the CIA's Tom Donahue (Thomas Claburn, \"CIA Admits Cyberattacks Blacked Out Cities,\" January 18, 2008; http://www.informationweek.com/cia-admits-cyberattacks-blacked-out-citi/205901631) and broadcast (with more details) by the CBS news show, \"Sixty Minutes\" on June 11, 2009 (http://www.cbsnews.com/news/cyber-war-sabotaging-the-system-06-11-2009/).\n5. Marcelo Soares, \"Brazilian Blackout Traced to Sooty Insulators, Not Hackers\" November 9, 2009; http://www.wired.com/threatlevel/2009/11/brazil_blackout/.\n6. Siobhan Gorman, \"Electricity Grid in U.S. Penetrated by Spies,\" *Wall Street Journal*, April 8, 2009, 1, http://www.wsj.com/articles/SB123914805204099085.\n7. Ellen Nakashima, \"Foreign powers steal data on critical U.S. infrastructure, NSA chief says,\" November 20, 2014; http://www.washingtonpost.com/world/national-security/nsa-chief-foreign-powers-steal-data-on-critical-us-infrastructure/2014/11/20/ddd4392e-70cb-11e4-893f-86bd390a3340_story.html.\n8. Rebecca Smith, \"Russian Hackers Reach U.S. Utility Control Rooms, Homeland Security Officials Say,\" July 23, 2018; https://www.wsj.com/articles/russian-hackers-reach-u-s-utility-control-rooms-homeland-security-officials-say-1532388110 and Colleen Long, \"Russian hackers used phishing tools in 2017 attack on grid, July 26, 2018; https://www.apnews.com/2c17bda4ac704df6be66018197f29912.\n9. Courtney Kube, Carol E. Lee, Dan De Luce and Ken Dilanian, \"Iran has laid groundwork for extensive cyberattacks on U.S., say officials,\" July 20, 2018; https://www.nbcnews.com/news/us-news/iran-has-laid-groundwork-extensive-cyberattacks-u-s-say-officials-n893081. See also Andy Greenberg, \"The Highly Dangerous 'Triton' Hackers have Probed the US Grid,\" June 14, 2019; https://www.wired.com/story/triton-hackers-scan-us-power-grid/.\n10. Garance Burke and Jonathan Fahey, \"Iranian hackers breached US power grid to engineer blackouts,\" December 22, 2015; https://https://apnews.com/79f0c976364b4c9dad12c44bba4ccc88. See also Sue Halpern, \"Should the U.S. Expect an Iranian Cyberattack,\" January 6, 2010; https://www.newyorker.com/tech/annals-of-technology/should-the-us-expect-an-iranian-cyberattack.\n11. Ellen Nakashima and Juliet Eilperin, \"Russian government hackers do not appear to have targeted Vermont utility, say people close to investigation,\" January 2, 2017; https://www.washingtonpost.com/world/national-security/russian-government-hackers-do-not-appear-to-have-targeted-vermont-utility-say-people-close-to-investigation/2017/01/02/70c25956-d12c-11e6-945a-76f69a399dd5_story.html.\n12. David Sanger and Nicole Perlroth, \"U.S. Escalates Online Attacks on Russia's Power Grid,\" June 15, 2019; https://www.nytimes.com/2019/06/15/us/politics/trump-cyber-russia-grid.html.\n13. Ivan Nechepurenko, \"Kremlin Warns of Cyberwar After Report of U.S. Hacking Into Russian Power Grid,\" June 17, 2019; https://www.nytimes.com/2019/06/17/world/europe/russia-us-cyberwar-grid.html.\n14. Reuters, \"Russia thwarts U.S. cyber attacks on its infrastructure: news agencies,\" June 17, 2019; https://www.reuters.com/article/us-usa-russia-cyber-russia/russia-thwarts-u-s-cyber-attacks-on-its-infrastructure-news-agencies-idUSKCNITI1U0.\n15. Kim Zetter, \"Inside the Cunning, Unprecedented Hack of Ukraine's Power Grid,\" March 3, 2016; http://www.wired.com/2016/03/inside-cunning-unprecedented-hack-ukraines-power-grid/.\n16. Joe Slowik, \"CRASHOVERRIDE: Reassessing the 2016 Ukraine Electric Power Event as a Protection-Focused Attack,\" August 15, 2019; https://dragos.com/wp-content/uploads/CRASHOVERRIDE.pdf.\n17. Andy Greenberg, \"How an Entire Nation Became Russia's Test Lab for Cyberwar,\" June 20, 2017; https://www.wired.com/story/russian-hackers-attack-ukraine/.\n18. From Kalev Leetaru, \"Could Venezuela's Power Outage Really Be A Cyber Attack?,\" March 9, 2019; https://www.forbes.com/sites/kalevleetaru/2019/03/09/could-venezuelas-power-outage-really-be-a-cyber-attack/#34e80b4e607c.\n\nTHE CYBER DEFENSE REVIEW\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          },
          {
            "index": 13,
            "markdown": "MARTIN LIBICKI\n\n# NOTES\n\n19. My interpretation of an argument on the first page of Ross Anderson, \"Why Cryptosystems Fail,\" 1993, https://www.cl.cam.ac.uk/~rja14/Papers/wcf.pdf.\n\n20. See, for example, Behrang Tajdin, \"Iran letter raises prospect of 'white list' internet clampdown,\" November 26, 2019; https://www.bbc.com/news/technology-50563917.\n\n21. Catalin Cimpanu, \"Russia successfully disconnected from the internet,\" December 23, 2019; https://www.zdnet.com/article/russia-successfully-disconnected-from-the-internet/.\n\n22. New York, USA: Public Affairs, 2011.\n\n23. Notionally, if the attacker supports multiple, albeit uncooperative, threat actor groups, or when multiple states attack, the target's knowledge may be incomplete. Practically, this is rare to nonexistent.\n\n24. Some consider this plausible. In 2008, a National Journal story quoted unnamed intelligence sources to argue that a hacker trying to map Florida Power &amp; light, \"got carried away and had a 'what happens if I pull on this' moment ... [and] triggered a cascade effect, shutting down large portions of the Florida power grid\". The outage was later ascribed to human error. See Shane Harris, \"China's Cyber Militia,\" National Journal Magazine, May 31, 2008, http://www.nationaljournal.com/magazine/china-s-cyber-militia-20080531.\n\n25. From Economist, \"The Siege,\" July 12, 2014, http://www.economist.com/news/leaders/21606831-believing-vladimir-putin-has-surrendered-ukraine-would-be-naive-west-must-keep-up.\n\n26. David Sanger and William Broad, \"Trump Inherits a Secret Cyberwar Against North Korean Missiles,\" March 4, 2017; https://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html.\n\n27. But see Conrad Duncan, \"Netanyahu calls Israel a 'nuclear power' before correcting himself in apparent slip of the tongue,\" January 6, 2020; https://www.independent.co.uk/news/world/middle-east/netanyahu-israel-nuclear-power-weapons-iran-crisis-trump-a9272086.html.\n\n28. See, for instance, Deputy Secretary of Defense Lynn's non-answer in Kim Zetter, \"Senior Defense Official Caught Hedging on U.S. Involvement in Stuxnet,\" Wired, May 26, 2011, http://www.wired.com/threatlevel/2011/05/defense-department-stuxnet/.\n\n29. Christopher Williams, \"Israeli security chief celebrates Stuxnet cyber attack\" February 16, 2011; http://www.telegraph.co.uk/technology/news/8326274/Israeli-security-chief-celebrates-Stuxnet-cyberattack.html and William Jacobson, \"Did Israel Just Admit to Creating Stuxnet?\", February 15, 2011; http://legalinsurrection.com/2011/02/did-israeli-just-admit-to-creating-stuxnet/.\n\n30. \"Deterring Terror: English Translation of the Official Strategy of the Israel Defense Forces,\" Belfer Center Special Report of August 2016; http://www.belfercenter.org/publication/israeli-defense-forces-defense-doctrine-english-translation, 48.\n\n31. See Andrew Higgins, \"Maybe Private Russian Hackers Meddled in Election, Putin Says,\" June 1, 2017; https://www.nytimes.com/2017/06/01/world/europe/vladimir-putin-donald-trump-hacking.html.\n\n32. Choe Sang-Hundec, \"North Korea Denies Role in Sony Pictures Hacking,\" New York Times, December 7, 2014, http://www.nytimes.com/2014/12/08/business/north-korea-denies-hacking-sony-but-calls-attack-a-righteous-deed.html.\n\n33. Ellen Nakashima, \"U.S. Cyber Command operation disrupted Internet access of Russian troll factory on day of 2018 midterms,\" February 27, 2019; https://www.whitehouse.gov/presidential-actions/presidentexecutive-order-strengthening-cybersecurity-federal-networks-critical-infrastructure/.\n\n34. AFP, \"US launched cyber attacks on Iran after drone shootdown: reports,\" June 22, 2019; https://news.yahoo.com/us-launched-cyber-attacks-iran-drone-shootdown-reports-232123877.html.\n\nSUMMER 2020 | 87\n\nThis content downloaded from\n\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\n\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          },
          {
            "index": 14,
            "markdown": "This content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2112,
              "width": 1400
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 15,
          "doc_size_bytes": 440700
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "# THE CYBER DEFENSE REVIEW\nCyberwar is What States Make of ItAuthor(s): Martin Libicki\nSource: The Cyber Defense Review, Vol. 5, No. 2, Special Edition: Information Operations/Information Warfare (SUMMER 2020), pp. 77-88\nPublished by: Army Cyber Institute\nStable URL: https://www.jstor.org/stable/10.2307/26923524\n## REFERENCES\nLinked references are available on JSTOR for this article: https://www.jstor.org/stable/10.2307/26923524?seq=1&amp;cid=pdf-reference#references_tab_contents\nYou may need to log in to JSTOR to access the linked references.\nJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms\nArmy Cyber Institute is collaborating with JSTOR to digitize, preserve and extend access to The Cyber Defense Review\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n# THE CYBER DEFENSE REVIEW\n* RESEARCH ARTICLES *\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n# Cyberwar is What States Make of It\nDr. Martin Libicki\nNo one there at the time could forget the vicious cyberattack on Venezuela's power systems in March 2019. Four days of chaos ensued. Stores and restaurants closed. Card payments systems were down, with customers asked to pay in dollars. Disrupted public transportation left many unable to get to work. Looting ensued. Seventeen people died in hospitals for lack of electricity.[2]\nWait, some of you may be thinking: what cyberattack? There is no question that Venezuela's grid had serious problems, but the only evidence that a cyberattack caused these problems was the word of President Maduro. He certainly had political reasons to mobilize his supporters against yet another delivered insult by the US, which has made no secret of its desire to see Maduro go.[3] More likely, the power outage reflected the same dysfunctional energy facilities that reduced the average daily oil production rate from nearly 2.5 million barrels in 2015, to a third of that in 2019.\nBrazil can tell a similar tale of woe. In 2007, hackers attacked the grid of the state of Rio Grande do Sul, causing severe power outages. The CIA picked up and circulated this story within the intelligence community for two years before it was broadcast by Sixty Minutes in 2009.[4] Or was it a cyberattack? Once it was reported in the press, Brazil's government denied any such cyberattack, claiming the cause to be sooty insulators, resulting in a fine assessed against the relevant utility.[5] So, end of the story? Not necessarily, argue two of the savvier observers on the cyberwar scene (one American and one Israeli); there were known groups that had both an interest in, and a talent for cyberspace mischief, and the government of Brazil would have been embarrassed to admit their success.\nThis is a work of the U.S. Government and is not subject to copyright protection in the United States. Foreign copyrights may apply.\nSUMMER 2020\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nDr. Martin C. Libicki (Ph.D., U.C. Berkeley 1978) is the MaryEllen and Richard Keyser Chair of Cybersecurity at the U.S. Naval Academy where he teaches cyberwar strategy and cyberspace economics. Prior employment includes having been a senior management scientist at RAND since 1998, focusing on the impacts of information technology on domestic and national security. He wrote three commercially published books: Cyberspace in Peace and War (2016, second edition forthcoming), Conquest in Cyberspace: National Security and Information Warfare (2007), and Information Technology Standards (1994). He is also the author of numerous RAND monographs, notably Defender's Dilemma, Brandishing Cyberattack Capabilities, Crisis and Escalation in Cyberspace, Global Demographic Change and its Implications for Military Power, Cyberdeterrence and Cyberwar, How Insurgencies End (with Ben Connable), and How Terrorist Groups End (with Seth Jones). Prior employment includes 12 years at the National Defense University, three years on the Navy Staff as program sponsor for industrial preparedness, and three years for the GAO.\nIf attacks on the power grid can be faked or hidden, imagine what can be done with other mischief in cyberspace. Cyber-espionage can go undetected for years. Withdrawals from bank accounts can be covered by funds transfers from the embarrassed bank (albeit not legally in many countries). Induced failures in police or intelligence systems may not make the news if such systems are themselves unknown to the public. By contrast, there is no hiding when it is the lights that go out. Nevertheless, the fact of a power outage does not prove that a cyberattack caused it—and, while the power company might know, they may not say or be encouraged or even allowed to speak. And, even if a cyberattack is established, attribution can still be an issue.\nSo far, the only verified cases of electric power loss caused by hacking occurred in Ukraine: two separate incidents in late 2015 and late 2016. But just as the existence of nuclear weapons—even though none have been detonated in war since 1945—has dramatically influenced the security choices of the US, Russia, and China, an imminent threat to knockout electric power could shape future crises. Targeted countries could be coerced or alternatively, they could try to pre-empt attackers by doing likewise. The most frequently discussed way to convert the threat to the electric grid from a notional to a real possibility is to implant malware into the other side's industrial control systems (as distinct from their office and billing systems). Such implants have been likened to Soviet moves to put intermediate-range nuclear-tipped missiles in Cuba, thereby tripling their capacity to strike the US.\nSo, have countries implanted malware in other countries' electric grids? In 2009, The Wall Street Journal, with no evidence beyond \"intelligence\" sources, reported that Russia and China had done precisely that to the US grid.[6]\nIn late 2014, Admiral Michael Rogers, Commander, U.S. Cyber Command (USCYBERCOM), testified[7] that,\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n“there are nation-states and groups out there that have the capability ... to shut down, forestall our ability to operate our basic infrastructure, whether it's generating power across this nation, whether it's moving water and fuel.” Later that year evidence surfaced that Russian hackers had used tools to penetrate power stations (using Black Energy malware) and corrupted software updates of machinery that sat on electronically isolated (aka “air-gapped”) networks (using Havex malware). In mid-2018, DHS officials reported penetration by Russian hackers of the US electrical system by leveraging the phishing-acquired credentials of suppliers to electrical control systems; “They got to the point where they could have thrown switches” and disrupted power flows.[8] Iran has been credited with similar capabilities.[9] Some believe that “so many attackers have stowed away in the systems that run the US electric grid that experts say they likely have the capability to strike at will.”[10]\nIt is difficult to know what to make of these claims. The intelligence community keeps secrets for a living. Law enforcement rarely releases sensitive information before trials. Corporations seldom concede that they are victims of hackers, especially of hacks that produced no visible effects. Finding malware is not necessarily an indication of cyberattack, either. The malware could have drifted in from elsewhere. Stuxnet, for instance, appeared in over 100,000 systems outside the Natanz centrifuge plant. A compiler corrupted to produce malware-laden software for a specific supply-chain attack can compromise other software that is unknown to the hackers. While possible, it is quite difficult for hackers who cannot communicate with the malware to time an attack.\nAt least, claims of extant or impending cyberattacks can be refuted if given time. Anomalous indicators on an employee's laptop at the Burlington Electric Department were initially mistaken for a deliberate Russian hacking attempt on its electrical power grid.[11] That is reassuring to onlookers who remember the accusation, and then the retraction, but what if someone had acted irreversibly on the accusation, before it was retracted?\nMatters are foggier if attackers, rather than defenders, claim that implants were installed. In mid-2019, USCYBERCOM gave notice that it was installing implants into the Russian electric grid,[12] which the Russians denied,[13] claiming that such attacks were thwarted.[14] So, is the US capable of taking down the Russian electric grid (e.g. in retaliation for their doing likewise)?\nFinally, even if the fact of the disruption and attribution both are indisputable, the message intended by the disruption is subject to multiple interpretations. Consider the hacks of Ukraine's power grid.[15] The hack, according to Robert M. Lee and Mike Assante (both teach cybersecurity for SANS) was meant, “to stoke the ire of Ukrainian customers and weaken their trust in the Ukrainian power companies and government.” The article's author, citing Ukrainian sources, then adds that “[s]peculation has been rampant that the subsequent blackouts in Ukraine were retaliation for the attack on the Crimean substations.” Robert Lee was quoted later in the article considering the possibility that, “the attack on the Ukrainian power\nCYBERWAR IS WHAT STATES MAKE OF IT\ncompanies was a message to Ukrainian authorities not to pursue privatization,\" ultimately concluding the message to be: \"We want to be seen, and we want to send you a message ... oh, you think you can take away the power [in Crimea]? Well I can take away the power from you.\" Finally, an attack on the electric grid that caused modest effects could easily be portrayed as one that could have caused major effects but for self-restraint or error: the late 2016 cyberattack on Ukraine's electric grid opened circuit breakers that were closed an hour later, but analysis of the code suggested that the hackers sought to cause physical damage before power was restored but made several coding errors.[16] Oleksii Yasinksy, a Ukrainian cybersecurity researcher, believed the hackers \"could have knocked out Ukrenergo's transmission station for longer or caused permanent, physical harm to the grid, he says—a restraint that American analysts like Assante and Lee have also noted.\"[17]\nWhat can we draw from these examples? Based on the Venezuelan incident, one observer concluded, \"the inability to definitively discount US or other foreign intervention, whether deliberate or accidental, demonstrates the incredible power of using cyberattacks to target utilities.\"[18] But there is an alternative perspective: it demonstrates the profound impact such cyberattacks have on the public's imagination—which, when coupled with the difficulty of proving who did what and why—illustrates the power that mere claims of cyberattack have, either by the attacker or the attacked. There is a reason cyberspace events are mysterious. To paraphrase Ross Anderson[19]: airline safety has improved faster than cybersecurity because airplanes crash outside and, by so doing, create facts that cannot be waved away. But computers crash inside, which allows others to understate or overstate what actually took place.\n## Manipulating Information about Information War Itself is Information Warfare\nThe ease with which facts can be manipulated, given the ambiguities and obscurities of cyberspace, means that leaders will be tempted to do just that. Having examined the means of distorting the truth, it is important to understand some of the motives that would prompt such distortions. The degree of manipulation will depend on several variables, including the moral quality of a country's leaders, their ability to maintain a narrative at variance with facts, and the political context within which they operate.\nIn fairness, the ability to create misperceptions that vary with reality is often unequal. Transparency brings reality and perceptions closer together. So, the leeway of governments to fudge events will vary—directly or via proxies (e.g., power grid operators). Competition among private cybersecurity firms makes it more difficult to advance defensible claims. Conversely, exposure to public opinion creates a gap between perceptions and reality that may be unsupportable. Claims to expert authority are not taken as seriously as (we suppose) before. At least in the West, epistemic closure appears to be growing worse. Despite a clear consensus among the cybersecurity community that imaging servers suffices to understand a network intrusion, for instance, many who take their cues from the leaders they like believe\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nthat shipping servers to a foreign country is a way to hide false flag attacks (e.g., Ukrainians doing what Russians are blamed for).\nAdding to the discrepancy has been the tendency of some countries to separate their communications from the rest of the world. North Korea remains isolated. China's Great Firewall is a prime example of selective filtering. Iran is similar in this regard and is contemplating even more isolation.[20] Russia recently experimented with closing its Internet off from the rest of the world.[21] Early hopes that the Internet would bring the world together and that, in John Gilmore's words, \"The Net interprets censorship as damage and routes around it,\" look nostalgic. As Evgeny Morozov observed in *The Net Delusion: The Dark Side of Internet Freedom*,[22] authoritarian governments originally caught flat-footed by the Internet have learned how to control it and turn it to their purposes.\nBetween the facts that, for laypeople, cyberspace is opaque, and yet, the Internet can actually facilitate misperception over reality, the stage is set for states to make of events in cyberspace as they will.\nTo simplify the question, consider two players: the target and the attacker. The target has two basic choices: to play up the incident (even, perhaps especially, if no cyberattack were actually involved or no implant dropped), or to downplay it. The attacker has two basic choices as well, but is in a poor position vis-à-vis the target to argue about the effects of the cyberattack. Figuratively and literally, the target is there, and the attacker is not. But the attacker can either dispute or embrace attribution because the requisite evidence is something the attacker will have special knowledge of.[23]\nThe target can play up the cyberattack in many ways. Assuming there is something to work with (e.g., a blackout), it can be mischaracterized as an accident, human error, design flaw, as well as a cyberattack. As a variant, an accidental or inadvertent cyberattack can be characterized as deliberate and malicious.[24] A cyberattack with a weak effect could be touted as a bullet dodged, either because the hacker erred, or because the hacker was brandishing its capabilities and could have done worse if it wanted to. And, as noted, even if no cyberattack took place, some entity the target wants to malign could be accused of having planted malware \"discovered\" in the system. Attribution can also be played, largely because some cyberattacks are more embarrassing than others. An inside job can imply that an organization's employees are untrustworthy, or that the organization poorly vetted, and/or that its systems afforded others too many privileges. The victim of a state-backed hacker group can summon the misleading argument that a private company can no more defend its network against an army than it can defend its factory against one; falling to a criminal group is more blameworthy. Finally, if the adverse impact of the cyberattack is insufficient to meet the target's needed political narrative, the cyberattack can be cast as the beginning of a systematic campaign. With a little nerve, it can argue that it was the first shot in a kinetic war, thereby justifying the target's decision to\nSUMMER 2020 | 81\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nmobilize its society to fight. While an actual kinetic war may not happen, an action-reaction cycle could actually escalate into war. And if the war does not come, there's always the narrative that war would have come were it not for the target's raising the alarm and mobilizing (e.g., its own forces, the righteous anger of its citizenry, enraged world opinion) accordingly.\nThis litany of options illustrates why the target may play up a cyberattack. They help unify a country in the face of an adversary while distracting the polity from the government's mistakes. The mobilization of opinion helps governments institute repressive measures or raise taxes. Threats of cyberattacks may persuade the public to allow its government access to personal or organizational systems. Once governments are granted authority to surveil systems for malware or other evidence of intrusion, they can use such access to monitor unwanted activity by citizens. Accusations may create cover for the target's own aggressive acts, forcing concessions from the attacker, even if the incident is phony or exaggerated. It can warn third countries that war may be coming, thereby forcing alliances or other commitments. (Ironically, hyping a cyberattack could lower tensions by substituting conflict in cyberspace, which is unlikely to kill anyone, for more risky posturing in the physical world).\nThe most innocent explanation is that exaggerating the cyberspace threat will persuade many to take cybersecurity more seriously as they should have from the start (like Senator Arthur Vandenberg, who told President Truman public support for aid to Greece and Turkey against Communists required him to \"scare the hell out of the American people\"). But this rationale holds some paradox. If the point is to inspire confidence in the integrity of government processes – for instance, that voters can trust election results because they are protected – advertising their vulnerability to hacking may ultimately lead to trustworthy voting systems but, until then, will not produce trusted voting systems.\nThat logic is one of several reasons' leaders may be reluctant to play up cyberattacks. As a device for mobilizing popular opinion, cyberspace events may be too esoteric, incomprehensible, and removed from daily concerns to allow for galvanizing emotions. Unlike terrorism, cyberattacks more likely will engender anxiety and annoyance, on par with the prospect of a morning traffic jam. But if someone's literal viscera are not threatened, can cyberattacks induce the kind of visceral fear with the requisite political clout?\nReasons to downplay cyberattacks are not hard to find. Falling victim to cyberattacks is, as noted, embarrassing. Such catastrophes can be prevented either by diligent cybersecurity investments or through various forms of self-denial (e.g., closing systems to easy access by others, retaining less information, or prioritizing security over usability and flexibility). Because the point of government is providing security and reliability, admitting that it failed at that can be difficult.\nOther reasons for reticence may arise in strategy. Just as playing up cyberattacks may help mobilize citizens for confrontation, playing them down may allow governments to avoid\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nconfrontations they cannot win or at least can win only at great cost. Analogously, many in Europe were eager to accept Putin's assertion that Russia had no forces in Ukraine's east: \"[The West] connived in Mr. Putin's pretense that he had not invaded eastern Ukraine—even though in a furtive tricky way he plainly had—because to say otherwise would have required a drastic response.\"[25] Playing down attacks also signals insouciance. Thus, if its purpose is to goad the target into doing something rash (e.g., as the September 11th attacks may have been used by al-Qaeda to goad the US into Afghanistan) then downplaying that would translate as an insufficient pain threshold to merit response. Similarly, by refusing to admit to being hurt, a state conveys that it is not coerced and thus will not accede to whatever demands, be they explicit or implicit, are imposed by the attacker, and will itself be undeterred in pursuing its own ends.\nDenying attribution also obviates pressures on the target to respond, and also conveys, albeit weakly, that the cyberattack fell below some pain threshold. This allows the target state the option to determine later that they have enough confidence to respond. Conversely, an argument that the pain of cyberattack is limited can be undermined by the discovery of wider and deeper effects and rarely can be assigned by the reverse (much as death tolls can only go up as catastrophes are investigated). The same holds for characterization of near-attacks or failed-attacks. Earlier interpretations that they were not deliberate or carried out by incompetents can be credibly revisited.\nA last option is to cast doubt on any early facts, whether helpful or harmful. One reason may be to avoid prejudicing the investigation in the hopes of learning the real lessons for the incident. Another is to prevent the attacker (and would-be copycats) from receiving battle damage assessment so to speak, the better to perfect subsequent attacks.\nAs to attackers, they, like defenders, can play up or play down the consequences of the attack, its characterization, or its attribution. In practice, however, it is difficult for attackers to more credibly characterize the attack than the target, which has far greater access to information than the attacker. Indeed, the attacker often will have very little if any firsthand information. Reports, for instance, that the US successfully interfered with performance of North Korea's Musudan missile had to be left dangling because of the lack of any sure way to know whether the hack actually worked, or, even if it did work, was a decisive factor in subsequent launch failures.[26] The best the attacker can do is to argue that while the target may know better, its leaders often lie about what they know to be otherwise. It took two months after the public learned about Stuxnet for Iran to concede it had been hurt. Yet neither the US nor Israel officially claimed that the attacks succeeded.\nIn theory, matters are less clear. Attackers usually know better what they tried to do than do defenders; if the damage is subtle or only appears under certain circumstances, the attacker may know to look to telltale signs that its attacks worked, often leaving the defender oblivious to the attack. Subtle attacks also do not make the news, at least not until their impacts become visible.\nSUMMER 2020 | 83\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nThis leaves attribution as the attacker's primary lever. Countries generally do not acknowledge their cyberspace operations, even when so accused. This stands in contrast to acts of terrorism (at least pre-9/11), which were followed by multiple claimed terrorist group perpetrators. Many cyberattacks such as the 2012 attack on Saudi Aramco or the 2014 attack on Sony are claimed by groups: The Cutting Sword of Justice and the Guardians of the Peace, respectively. But these groups do not really exist as separate entities. The reasons to deny attribution are straightforward. Most accusations involve cyber espionage whose operators avoid—because the point is to work undetected—revealing their own capabilities and modus operandi.\nAs for the rarer instances of cyberattack, often the target knows the attacker's identity, while admitting as much opens the attacker to criticism and makes it hard for the attacker to, in turn, criticize incoming cyberattacks. For example, going back at least to the 1973 War, Israel's neighbors believed that Israel had nuclear weapons, thereby giving Israel the benefit of deterrence. Yet Israel strenuously denied having such weapons, to the point of even luring and then jailing Mordechai Vanunu, an Israeli who revealed as much to the British press in the 1980's.[27] Israel may well have calculated that open admission would have led third parties to push Israel to de-nuclearize, or to pressure neighboring countries to pursue their own nuclear weapons.\nStuxnet provides an interesting case in contrast. Neither the US nor Israel denied this cyberattack,[28] yet neither admitted it officially, at least at first. But at least some in each country wanted to take credit for it. In the US, former Vice Chairman of the JCS, General Cartwright, was accused to have been the source for David Sanger's articles on the hack. And a 2011 YouTube video captured Israel's Chief of Staff at his retirement party counting Stuxnet among his prominent achievements.[29] In 2016, an official Israeli document baldly stated, \"an example of an offensive cyber operation conducted by Israel is Stuxnet, which was jointly developed with the United States and targeted Iranian nuclear facilities.\"[30] Other governments have tried to have it both ways. Russia denied hacking the DNC in 2016, but its President called the hackers \"artists.\"[31] North Korea denied hacking Sony in 2014 but called it a \"righteous deed.\"[32]\nGenerally, hypocrisy—a tribute vice pays to virtue—rules. Given a choice between appearing great and appearing good, countries choose good. That is, they would rather talk up their fealty to international norms than overawe others with their cyberspace prowess. But for how long? As noted, the US did not seem to mind news stories that it had penetrated Russia's grid. In the summer of 2019, the US also indicated it was penetrating systems of those intruding against the US[33] (a.k.a. \"defending forward,\" or \"persistent engagement\"), and had countered Iran's shoot-down of a US drone with a cyberattack.[34] Might other countries follow? No country had (publicly, at least) established a cyberspace operations entity until the US formed USCYBERCOM. Many blushed at the thought of militarizing cyberspace until they—first allies, and then adversaries—followed suit. Whether other countries copy the trend\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nof taking credit not only for successes but also for operations more difficult to assess as successful depends on whether the aforementioned events of 2019 recur. This, in turn, depends on how much they reflected the character of the U.S. Administration at the time. But if such behavior becomes a trend, as opposed to a blip, other countries likely will follow suit in the years to come.\n# CONCLUSION\nIt has been said that the first casualty in war is truth. Today advances in technology and transparency as well as the professionalization of inquiry make it easier to determine the truth sooner rather than later. In this regard, cyberspace lags. Perhaps this should not be so—a fully imaged computer hard drive after a cyberattack leaves nowhere for anything to hide. But, in practice, there is often no third-party confirmation of a successful cyberattack, much less a failed cyberattack, or one partially completed (e.g., an implant). There is no easy equivalent in overhead imagery. And besides, matters once considered settled because of elite scientific consensus are increasingly open to question for a variety of causes (e.g., populism, the Internet's ability to support echo chambers, less influence of traditional media, epistemic closure).\nTrue facts of cyberwar are becoming secondary to misperceptions that governments either shape or influence. Increasingly, cyberwar is becoming what states make of it, and how they package it. That leaves, as open questions, what states will make of it. As argued, their options range in efficacy and persistence (in the face of subsequent revelations). The strategies states will employ will, of course, adapt to the circumstances. No hard projections can be made about what the games will look like, but games there will be.[35]\nSUMMER 2020 | 85\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT",
  "references": [
    "# NOTES\n1. Titled in homage to an otherwise unrelated article: Alexander Wendt, \"Anarchy is What States Make of It: The Social Construction of Power Politics,\" *International Organization* 46(02):391-425, March 1992.\n2. Description from Tom McKay, \"Maduro Says 'Multiple Cyberattacks' Backed by U.S. to Blame for Four Days of Widespread Blackouts,\" March 10, 2019; https://gizmodo.com/maduro-says-multiple-cyberattacks-backed-by-u-s-to-b-1833190542.\n3. When China's offer to help bolster the security of Venezuela's grid was rejected, even the Chinese were convinced that no such cyberattack had taken place.\n4. This claim (without details) was made by the CIA's Tom Donahue (Thomas Claburn, \"CIA Admits Cyberattacks Blacked Out Cities,\" January 18, 2008; http://www.informationweek.com/cia-admits-cyberattacks-blacked-out-citi/205901631) and broadcast (with more details) by the CBS news show, \"Sixty Minutes\" on June 11, 2009 (http://www.cbsnews.com/news/cyber-war-sabotaging-the-system-06-11-2009/).\n5. Marcelo Soares, \"Brazilian Blackout Traced to Sooty Insulators, Not Hackers\" November 9, 2009; http://www.wired.com/threatlevel/2009/11/brazil_blackout/.\n6. Siobhan Gorman, \"Electricity Grid in U.S. Penetrated by Spies,\" *Wall Street Journal*, April 8, 2009, 1, http://www.wsj.com/articles/SB123914805204099085.\n7. Ellen Nakashima, \"Foreign powers steal data on critical U.S. infrastructure, NSA chief says,\" November 20, 2014; http://www.washingtonpost.com/world/national-security/nsa-chief-foreign-powers-steal-data-on-critical-us-infrastructure/2014/11/20/ddd4392e-70cb-11e4-893f-86bd390a3340_story.html.\n8. Rebecca Smith, \"Russian Hackers Reach U.S. Utility Control Rooms, Homeland Security Officials Say,\" July 23, 2018; https://www.wsj.com/articles/russian-hackers-reach-u-s-utility-control-rooms-homeland-security-officials-say-1532388110 and Colleen Long, \"Russian hackers used phishing tools in 2017 attack on grid, July 26, 2018; https://www.apnews.com/2c17bda4ac704df6be66018197f29912.\n9. Courtney Kube, Carol E. Lee, Dan De Luce and Ken Dilanian, \"Iran has laid groundwork for extensive cyberattacks on U.S., say officials,\" July 20, 2018; https://www.nbcnews.com/news/us-news/iran-has-laid-groundwork-extensive-cyberattacks-u-s-say-officials-n893081. See also Andy Greenberg, \"The Highly Dangerous 'Triton' Hackers have Probed the US Grid,\" June 14, 2019; https://www.wired.com/story/triton-hackers-scan-us-power-grid/.\n10. Garance Burke and Jonathan Fahey, \"Iranian hackers breached US power grid to engineer blackouts,\" December 22, 2015; https://https://apnews.com/79f0c976364b4c9dad12c44bba4ccc88. See also Sue Halpern, \"Should the U.S. Expect an Iranian Cyberattack,\" January 6, 2010; https://www.newyorker.com/tech/annals-of-technology/should-the-us-expect-an-iranian-cyberattack.\n11. Ellen Nakashima and Juliet Eilperin, \"Russian government hackers do not appear to have targeted Vermont utility, say people close to investigation,\" January 2, 2017; https://www.washingtonpost.com/world/national-security/russian-government-hackers-do-not-appear-to-have-targeted-vermont-utility-say-people-close-to-investigation/2017/01/02/70c25956-d12c-11e6-945a-76f69a399dd5_story.html.\n12. David Sanger and Nicole Perlroth, \"U.S. Escalates Online Attacks on Russia's Power Grid,\" June 15, 2019; https://www.nytimes.com/2019/06/15/us/politics/trump-cyber-russia-grid.html.\n13. Ivan Nechepurenko, \"Kremlin Warns of Cyberwar After Report of U.S. Hacking Into Russian Power Grid,\" June 17, 2019; https://www.nytimes.com/2019/06/17/world/europe/russia-us-cyberwar-grid.html.\n14. Reuters, \"Russia thwarts U.S. cyber attacks on its infrastructure: news agencies,\" June 17, 2019; https://www.reuters.com/article/us-usa-russia-cyber-russia/russia-thwarts-u-s-cyber-attacks-on-its-infrastructure-news-agencies-idUSKCNITI1U0.\n15. Kim Zetter, \"Inside the Cunning, Unprecedented Hack of Ukraine's Power Grid,\" March 3, 2016; http://www.wired.com/2016/03/inside-cunning-unprecedented-hack-ukraines-power-grid/.\n16. Joe Slowik, \"CRASHOVERRIDE: Reassessing the 2016 Ukraine Electric Power Event as a Protection-Focused Attack,\" August 15, 2019; https://dragos.com/wp-content/uploads/CRASHOVERRIDE.pdf.\n17. Andy Greenberg, \"How an Entire Nation Became Russia's Test Lab for Cyberwar,\" June 20, 2017; https://www.wired.com/story/russian-hackers-attack-ukraine/.\n18. From Kalev Leetaru, \"Could Venezuela's Power Outage Really Be A Cyber Attack?,\" March 9, 2019; https://www.forbes.com/sites/kalevleetaru/2019/03/09/could-venezuelas-power-outage-really-be-a-cyber-attack/#34e80b4e607c.\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\n# NOTES\n19. My interpretation of an argument on the first page of Ross Anderson, \"Why Cryptosystems Fail,\" 1993, https://www.cl.cam.ac.uk/~rja14/Papers/wcf.pdf.\n20. See, for example, Behrang Tajdin, \"Iran letter raises prospect of 'white list' internet clampdown,\" November 26, 2019; https://www.bbc.com/news/technology-50563917.\n21. Catalin Cimpanu, \"Russia successfully disconnected from the internet,\" December 23, 2019; https://www.zdnet.com/article/russia-successfully-disconnected-from-the-internet/.\n22. New York, USA: Public Affairs, 2011.\n23. Notionally, if the attacker supports multiple, albeit uncooperative, threat actor groups, or when multiple states attack, the target's knowledge may be incomplete. Practically, this is rare to nonexistent.\n24. Some consider this plausible. In 2008, a National Journal story quoted unnamed intelligence sources to argue that a hacker trying to map Florida Power &amp; light, \"got carried away and had a 'what happens if I pull on this' moment ... [and] triggered a cascade effect, shutting down large portions of the Florida power grid\". The outage was later ascribed to human error. See Shane Harris, \"China's Cyber Militia,\" National Journal Magazine, May 31, 2008, http://www.nationaljournal.com/magazine/china-s-cyber-militia-20080531.\n25. From Economist, \"The Siege,\" July 12, 2014, http://www.economist.com/news/leaders/21606831-believing-vladimir-putin-has-surrendered-ukraine-would-be-naive-west-must-keep-up.\n26. David Sanger and William Broad, \"Trump Inherits a Secret Cyberwar Against North Korean Missiles,\" March 4, 2017; https://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html.\n27. But see Conrad Duncan, \"Netanyahu calls Israel a 'nuclear power' before correcting himself in apparent slip of the tongue,\" January 6, 2020; https://www.independent.co.uk/news/world/middle-east/netanyahu-israel-nuclear-power-weapons-iran-crisis-trump-a9272086.html.\n28. See, for instance, Deputy Secretary of Defense Lynn's non-answer in Kim Zetter, \"Senior Defense Official Caught Hedging on U.S. Involvement in Stuxnet,\" Wired, May 26, 2011, http://www.wired.com/threatlevel/2011/05/defense-department-stuxnet/.\n29. Christopher Williams, \"Israeli security chief celebrates Stuxnet cyber attack\" February 16, 2011; http://www.telegraph.co.uk/technology/news/8326274/Israeli-security-chief-celebrates-Stuxnet-cyberattack.html and William Jacobson, \"Did Israel Just Admit to Creating Stuxnet?\", February 15, 2011; http://legalinsurrection.com/2011/02/did-israeli-just-admit-to-creating-stuxnet/.\n30. \"Deterring Terror: English Translation of the Official Strategy of the Israel Defense Forces,\" Belfer Center Special Report of August 2016; http://www.belfercenter.org/publication/israeli-defense-forces-defense-doctrine-english-translation, 48.\n31. See Andrew Higgins, \"Maybe Private Russian Hackers Meddled in Election, Putin Says,\" June 1, 2017; https://www.nytimes.com/2017/06/01/world/europe/vladimir-putin-donald-trump-hacking.html.\n32. Choe Sang-Hundec, \"North Korea Denies Role in Sony Pictures Hacking,\" New York Times, December 7, 2014, http://www.nytimes.com/2014/12/08/business/north-korea-denies-hacking-sony-but-calls-attack-a-righteous-deed.html.\n33. Ellen Nakashima, \"U.S. Cyber Command operation disrupted Internet access of Russian troll factory on day of 2018 midterms,\" February 27, 2019; https://www.whitehouse.gov/presidential-actions/presidentexecutive-order-strengthening-cybersecurity-federal-networks-critical-infrastructure/.\n34. AFP, \"US launched cyber attacks on Iran after drone shootdown: reports,\" June 22, 2019; https://news.yahoo.com/us-launched-cyber-attacks-iran-drone-shootdown-reports-232123877.html.\nSUMMER 2020 | 87\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms"
  ],
  "flat_text": "# THE CYBER DEFENSE REVIEW\nCyberwar is What States Make of ItAuthor(s): Martin Libicki\nSource: The Cyber Defense Review, Vol. 5, No. 2, Special Edition: Information Operations/Information Warfare , pp. 77-88\nPublished by: Army Cyber Institute\nStable URL: https://www.jstor.org/stable/10.2307/26923524\n## REFERENCES\nLinked references are available on JSTOR for this article: https://www.jstor.org/stable/10.2307/26923524?seq=1&amp;cid=pdf-reference#references_tab_contents\nYou may need to log in to JSTOR to access the linked references.\nJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms\nArmy Cyber Institute is collaborating with JSTOR to digitize, preserve and extend access to The Cyber Defense Review\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n# THE CYBER DEFENSE REVIEW\n* RESEARCH ARTICLES *\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n# Cyberwar is What States Make of It\nDr. Martin Libicki\nNo one there at the time could forget the vicious cyberattack on Venezuela's power systems in March 2019. Four days of chaos ensued. Stores and restaurants closed. Card payments systems were down, with customers asked to pay in dollars. Disrupted public transportation left many unable to get to work. Looting ensued. Seventeen people died in hospitals for lack of electricity.[2]\nWait, some of you may be thinking: what cyberattack? There is no question that Venezuela's grid had serious problems, but the only evidence that a cyberattack caused these problems was the word of President Maduro. He certainly had political reasons to mobilize his supporters against yet another delivered insult by the US, which has made no secret of its desire to see Maduro go.[3] More likely, the power outage reflected the same dysfunctional energy facilities that reduced the average daily oil production rate from nearly 2.5 million barrels in 2015, to a third of that in 2019.\nBrazil can tell a similar tale of woe. In 2007, hackers attacked the grid of the state of Rio Grande do Sul, causing severe power outages. The CIA picked up and circulated this story within the intelligence community for two years before it was broadcast by Sixty Minutes in 2009.[4] Or was it a cyberattack? Once it was reported in the press, Brazil's government denied any such cyberattack, claiming the cause to be sooty insulators, resulting in a fine assessed against the relevant utility.[5] So, end of the story? Not necessarily, argue two of the savvier observers on the cyberwar scene (one American and one Israeli); there were known groups that had both an interest in, and a talent for cyberspace mischief, and the government of Brazil would have been embarrassed to admit their success.\nThis is a work of the U.S. Government and is not subject to copyright protection in the United States. Foreign copyrights may apply.\nSUMMER 2020\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nDr. Martin C. Libicki (Ph.D., U.C. Berkeley 1978) is the MaryEllen and Richard Keyser Chair of Cybersecurity at the U.S. Naval Academy where he teaches cyberwar strategy and cyberspace economics. Prior employment includes having been a senior management scientist at RAND since 1998, focusing on the impacts of information technology on domestic and national security. He wrote three commercially published books: Cyberspace in Peace and War (2016, second edition forthcoming), Conquest in Cyberspace: National Security and Information Warfare (2007), and Information Technology Standards (1994). He is also the author of numerous RAND monographs, notably Defender's Dilemma, Brandishing Cyberattack Capabilities, Crisis and Escalation in Cyberspace, Global Demographic Change and its Implications for Military Power, Cyberdeterrence and Cyberwar, How Insurgencies End (with Ben Connable), and How Terrorist Groups End (with Seth Jones). Prior employment includes 12 years at the National Defense University, three years on the Navy Staff as program sponsor for industrial preparedness, and three years for the GAO.\nIf attacks on the power grid can be faked or hidden, imagine what can be done with other mischief in cyberspace. Cyber-espionage can go undetected for years. Withdrawals from bank accounts can be covered by funds transfers from the embarrassed bank (albeit not legally in many countries). Induced failures in police or intelligence systems may not make the news if such systems are themselves unknown to the public. By contrast, there is no hiding when it is the lights that go out. Nevertheless, the fact of a power outage does not prove that a cyberattack caused it—and, while the power company might know, they may not say or be encouraged or even allowed to speak. And, even if a cyberattack is established, attribution can still be an issue.\nSo far, the only verified cases of electric power loss caused by hacking occurred in Ukraine: two separate incidents in late 2015 and late 2016. But just as the existence of nuclear weapons—even though none have been detonated in war since 1945—has dramatically influenced the security choices of the US, Russia, and China, an imminent threat to knockout electric power could shape future crises. Targeted countries could be coerced or alternatively, they could try to pre-empt attackers by doing likewise. The most frequently discussed way to convert the threat to the electric grid from a notional to a real possibility is to implant malware into the other side's industrial control systems (as distinct from their office and billing systems). Such implants have been likened to Soviet moves to put intermediate-range nuclear-tipped missiles in Cuba, thereby tripling their capacity to strike the US.\nSo, have countries implanted malware in other countries' electric grids? In 2009, The Wall Street Journal, with no evidence beyond \"intelligence\" sources, reported that Russia and China had done precisely that to the US grid.[6]\nIn late 2014, Admiral Michael Rogers, Commander, U.S. Cyber Command (USCYBERCOM), testified[7] that,\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n“there are nation-states and groups out there that have the capability ... to shut down, forestall our ability to operate our basic infrastructure, whether it's generating power across this nation, whether it's moving water and fuel.” Later that year evidence surfaced that Russian hackers had used tools to penetrate power stations (using Black Energy malware) and corrupted software updates of machinery that sat on electronically isolated (aka “air-gapped”) networks (using Havex malware). In mid-2018, DHS officials reported penetration by Russian hackers of the US electrical system by leveraging the phishing-acquired credentials of suppliers to electrical control systems; “They got to the point where they could have thrown switches” and disrupted power flows.[8] Iran has been credited with similar capabilities.[9] Some believe that “so many attackers have stowed away in the systems that run the US electric grid that experts say they likely have the capability to strike at will.”[10]\nIt is difficult to know what to make of these claims. The intelligence community keeps secrets for a living. Law enforcement rarely releases sensitive information before trials. Corporations seldom concede that they are victims of hackers, especially of hacks that produced no visible effects. Finding malware is not necessarily an indication of cyberattack, either. The malware could have drifted in from elsewhere. Stuxnet, for instance, appeared in over 100,000 systems outside the Natanz centrifuge plant. A compiler corrupted to produce malware-laden software for a specific supply-chain attack can compromise other software that is unknown to the hackers. While possible, it is quite difficult for hackers who cannot communicate with the malware to time an attack.\nAt least, claims of extant or impending cyberattacks can be refuted if given time. Anomalous indicators on an employee's laptop at the Burlington Electric Department were initially mistaken for a deliberate Russian hacking attempt on its electrical power grid.[11] That is reassuring to onlookers who remember the accusation, and then the retraction, but what if someone had acted irreversibly on the accusation, before it was retracted?\nMatters are foggier if attackers, rather than defenders, claim that implants were installed. In mid-2019, USCYBERCOM gave notice that it was installing implants into the Russian electric grid,[12] which the Russians denied,[13] claiming that such attacks were thwarted.[14] So, is the US capable of taking down the Russian electric grid (e.g. in retaliation for their doing likewise)?\nFinally, even if the fact of the disruption and attribution both are indisputable, the message intended by the disruption is subject to multiple interpretations. Consider the hacks of Ukraine's power grid.[15] The hack, according to Robert M. Lee and Mike Assante (both teach cybersecurity for SANS) was meant, “to stoke the ire of Ukrainian customers and weaken their trust in the Ukrainian power companies and government.” The article's author, citing Ukrainian sources, then adds that “[s]peculation has been rampant that the subsequent blackouts in Ukraine were retaliation for the attack on the Crimean substations.” Robert Lee was quoted later in the article considering the possibility that, “the attack on the Ukrainian power\nCYBERWAR IS WHAT STATES MAKE OF IT\ncompanies was a message to Ukrainian authorities not to pursue privatization,\" ultimately concluding the message to be: \"We want to be seen, and we want to send you a message ... oh, you think you can take away the power [in Crimea]? Well I can take away the power from you.\" Finally, an attack on the electric grid that caused modest effects could easily be portrayed as one that could have caused major effects but for self-restraint or error: the late 2016 cyberattack on Ukraine's electric grid opened circuit breakers that were closed an hour later, but analysis of the code suggested that the hackers sought to cause physical damage before power was restored but made several coding errors.[16] Oleksii Yasinksy, a Ukrainian cybersecurity researcher, believed the hackers \"could have knocked out Ukrenergo's transmission station for longer or caused permanent, physical harm to the grid, he says—a restraint that American analysts like Assante and Lee have also noted.\"[17]\nWhat can we draw from these examples? Based on the Venezuelan incident, one observer concluded, \"the inability to definitively discount US or other foreign intervention, whether deliberate or accidental, demonstrates the incredible power of using cyberattacks to target utilities.\"[18] But there is an alternative perspective: it demonstrates the profound impact such cyberattacks have on the public's imagination—which, when coupled with the difficulty of proving who did what and why—illustrates the power that mere claims of cyberattack have, either by the attacker or the attacked. There is a reason cyberspace events are mysterious. To paraphrase Ross Anderson[19]: airline safety has improved faster than cybersecurity because airplanes crash outside and, by so doing, create facts that cannot be waved away. But computers crash inside, which allows others to understate or overstate what actually took place.\n## Manipulating Information about Information War Itself is Information Warfare\nThe ease with which facts can be manipulated, given the ambiguities and obscurities of cyberspace, means that leaders will be tempted to do just that. Having examined the means of distorting the truth, it is important to understand some of the motives that would prompt such distortions. The degree of manipulation will depend on several variables, including the moral quality of a country's leaders, their ability to maintain a narrative at variance with facts, and the political context within which they operate.\nIn fairness, the ability to create misperceptions that vary with reality is often unequal. Transparency brings reality and perceptions closer together. So, the leeway of governments to fudge events will vary—directly or via proxies (e.g., power grid operators). Competition among private cybersecurity firms makes it more difficult to advance defensible claims. Conversely, exposure to public opinion creates a gap between perceptions and reality that may be unsupportable. Claims to expert authority are not taken as seriously as (we suppose) before. At least in the West, epistemic closure appears to be growing worse. Despite a clear consensus among the cybersecurity community that imaging servers suffices to understand a network intrusion, for instance, many who take their cues from the leaders they like believe\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nthat shipping servers to a foreign country is a way to hide false flag attacks (e.g., Ukrainians doing what Russians are blamed for).\nAdding to the discrepancy has been the tendency of some countries to separate their communications from the rest of the world. North Korea remains isolated. China's Great Firewall is a prime example of selective filtering. Iran is similar in this regard and is contemplating even more isolation.[20] Russia recently experimented with closing its Internet off from the rest of the world.[21] Early hopes that the Internet would bring the world together and that, in John Gilmore's words, \"The Net interprets censorship as damage and routes around it,\" look nostalgic. As Evgeny Morozov observed in *The Net Delusion: The Dark Side of Internet Freedom*,[22] authoritarian governments originally caught flat-footed by the Internet have learned how to control it and turn it to their purposes.\nBetween the facts that, for laypeople, cyberspace is opaque, and yet, the Internet can actually facilitate misperception over reality, the stage is set for states to make of events in cyberspace as they will.\nTo simplify the question, consider two players: the target and the attacker. The target has two basic choices: to play up the incident (even, perhaps especially, if no cyberattack were actually involved or no implant dropped), or to downplay it. The attacker has two basic choices as well, but is in a poor position vis-à-vis the target to argue about the effects of the cyberattack. Figuratively and literally, the target is there, and the attacker is not. But the attacker can either dispute or embrace attribution because the requisite evidence is something the attacker will have special knowledge of.[23]\nThe target can play up the cyberattack in many ways. Assuming there is something to work with (e.g., a blackout), it can be mischaracterized as an accident, human error, design flaw, as well as a cyberattack. As a variant, an accidental or inadvertent cyberattack can be characterized as deliberate and malicious.[24] A cyberattack with a weak effect could be touted as a bullet dodged, either because the hacker erred, or because the hacker was brandishing its capabilities and could have done worse if it wanted to. And, as noted, even if no cyberattack took place, some entity the target wants to malign could be accused of having planted malware \"discovered\" in the system. Attribution can also be played, largely because some cyberattacks are more embarrassing than others. An inside job can imply that an organization's employees are untrustworthy, or that the organization poorly vetted, and/or that its systems afforded others too many privileges. The victim of a state-backed hacker group can summon the misleading argument that a private company can no more defend its network against an army than it can defend its factory against one; falling to a criminal group is more blameworthy. Finally, if the adverse impact of the cyberattack is insufficient to meet the target's needed political narrative, the cyberattack can be cast as the beginning of a systematic campaign. With a little nerve, it can argue that it was the first shot in a kinetic war, thereby justifying the target's decision to\nSUMMER 2020 | 81\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nmobilize its society to fight. While an actual kinetic war may not happen, an action-reaction cycle could actually escalate into war. And if the war does not come, there's always the narrative that war would have come were it not for the target's raising the alarm and mobilizing (e.g., its own forces, the righteous anger of its citizenry, enraged world opinion) accordingly.\nThis litany of options illustrates why the target may play up a cyberattack. They help unify a country in the face of an adversary while distracting the polity from the government's mistakes. The mobilization of opinion helps governments institute repressive measures or raise taxes. Threats of cyberattacks may persuade the public to allow its government access to personal or organizational systems. Once governments are granted authority to surveil systems for malware or other evidence of intrusion, they can use such access to monitor unwanted activity by citizens. Accusations may create cover for the target's own aggressive acts, forcing concessions from the attacker, even if the incident is phony or exaggerated. It can warn third countries that war may be coming, thereby forcing alliances or other commitments. (Ironically, hyping a cyberattack could lower tensions by substituting conflict in cyberspace, which is unlikely to kill anyone, for more risky posturing in the physical world).\nThe most innocent explanation is that exaggerating the cyberspace threat will persuade many to take cybersecurity more seriously as they should have from the start (like Senator Arthur Vandenberg, who told President Truman public support for aid to Greece and Turkey against Communists required him to \"scare the hell out of the American people\"). But this rationale holds some paradox. If the point is to inspire confidence in the integrity of government processes – for instance, that voters can trust election results because they are protected – advertising their vulnerability to hacking may ultimately lead to trustworthy voting systems but, until then, will not produce trusted voting systems.\nThat logic is one of several reasons' leaders may be reluctant to play up cyberattacks. As a device for mobilizing popular opinion, cyberspace events may be too esoteric, incomprehensible, and removed from daily concerns to allow for galvanizing emotions. Unlike terrorism, cyberattacks more likely will engender anxiety and annoyance, on par with the prospect of a morning traffic jam. But if someone's literal viscera are not threatened, can cyberattacks induce the kind of visceral fear with the requisite political clout?\nReasons to downplay cyberattacks are not hard to find. Falling victim to cyberattacks is, as noted, embarrassing. Such catastrophes can be prevented either by diligent cybersecurity investments or through various forms of self-denial (e.g., closing systems to easy access by others, retaining less information, or prioritizing security over usability and flexibility). Because the point of government is providing security and reliability, admitting that it failed at that can be difficult.\nOther reasons for reticence may arise in strategy. Just as playing up cyberattacks may help mobilize citizens for confrontation, playing them down may allow governments to avoid\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nconfrontations they cannot win or at least can win only at great cost. Analogously, many in Europe were eager to accept Putin's assertion that Russia had no forces in Ukraine's east: \"[The West] connived in Mr. Putin's pretense that he had not invaded eastern Ukraine—even though in a furtive tricky way he plainly had—because to say otherwise would have required a drastic response.\"[25] Playing down attacks also signals insouciance. Thus, if its purpose is to goad the target into doing something rash (e.g., as the September 11th attacks may have been used by al-Qaeda to goad the US into Afghanistan) then downplaying that would translate as an insufficient pain threshold to merit response. Similarly, by refusing to admit to being hurt, a state conveys that it is not coerced and thus will not accede to whatever demands, be they explicit or implicit, are imposed by the attacker, and will itself be undeterred in pursuing its own ends.\nDenying attribution also obviates pressures on the target to respond, and also conveys, albeit weakly, that the cyberattack fell below some pain threshold. This allows the target state the option to determine later that they have enough confidence to respond. Conversely, an argument that the pain of cyberattack is limited can be undermined by the discovery of wider and deeper effects and rarely can be assigned by the reverse (much as death tolls can only go up as catastrophes are investigated). The same holds for characterization of near-attacks or failed-attacks. Earlier interpretations that they were not deliberate or carried out by incompetents can be credibly revisited.\nA last option is to cast doubt on any early facts, whether helpful or harmful. One reason may be to avoid prejudicing the investigation in the hopes of learning the real lessons for the incident. Another is to prevent the attacker (and would-be copycats) from receiving battle damage assessment so to speak, the better to perfect subsequent attacks.\nAs to attackers, they, like defenders, can play up or play down the consequences of the attack, its characterization, or its attribution. In practice, however, it is difficult for attackers to more credibly characterize the attack than the target, which has far greater access to information than the attacker. Indeed, the attacker often will have very little if any firsthand information. Reports, for instance, that the US successfully interfered with performance of North Korea's Musudan missile had to be left dangling because of the lack of any sure way to know whether the hack actually worked, or, even if it did work, was a decisive factor in subsequent launch failures.[26] The best the attacker can do is to argue that while the target may know better, its leaders often lie about what they know to be otherwise. It took two months after the public learned about Stuxnet for Iran to concede it had been hurt. Yet neither the US nor Israel officially claimed that the attacks succeeded.\nIn theory, matters are less clear. Attackers usually know better what they tried to do than do defenders; if the damage is subtle or only appears under certain circumstances, the attacker may know to look to telltale signs that its attacks worked, often leaving the defender oblivious to the attack. Subtle attacks also do not make the news, at least not until their impacts become visible.\nSUMMER 2020 | 83\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nThis leaves attribution as the attacker's primary lever. Countries generally do not acknowledge their cyberspace operations, even when so accused. This stands in contrast to acts of terrorism (at least pre-9/11), which were followed by multiple claimed terrorist group perpetrators. Many cyberattacks such as the 2012 attack on Saudi Aramco or the 2014 attack on Sony are claimed by groups: The Cutting Sword of Justice and the Guardians of the Peace, respectively. But these groups do not really exist as separate entities. The reasons to deny attribution are straightforward. Most accusations involve cyber espionage whose operators avoid—because the point is to work undetected—revealing their own capabilities and modus operandi.\nAs for the rarer instances of cyberattack, often the target knows the attacker's identity, while admitting as much opens the attacker to criticism and makes it hard for the attacker to, in turn, criticize incoming cyberattacks. For example, going back at least to the 1973 War, Israel's neighbors believed that Israel had nuclear weapons, thereby giving Israel the benefit of deterrence. Yet Israel strenuously denied having such weapons, to the point of even luring and then jailing Mordechai Vanunu, an Israeli who revealed as much to the British press in the 1980's.[27] Israel may well have calculated that open admission would have led third parties to push Israel to de-nuclearize, or to pressure neighboring countries to pursue their own nuclear weapons.\nStuxnet provides an interesting case in contrast. Neither the US nor Israel denied this cyberattack,[28] yet neither admitted it officially, at least at first. But at least some in each country wanted to take credit for it. In the US, former Vice Chairman of the JCS, General Cartwright, was accused to have been the source for David Sanger's articles on the hack. And a 2011 YouTube video captured Israel's Chief of Staff at his retirement party counting Stuxnet among his prominent achievements.[29] In 2016, an official Israeli document baldly stated, \"an example of an offensive cyber operation conducted by Israel is Stuxnet, which was jointly developed with the United States and targeted Iranian nuclear facilities.\"[30] Other governments have tried to have it both ways. Russia denied hacking the DNC in 2016, but its President called the hackers \"artists.\"[31] North Korea denied hacking Sony in 2014 but called it a \"righteous deed.\"[32]\nGenerally, hypocrisy—a tribute vice pays to virtue—rules. Given a choice between appearing great and appearing good, countries choose good. That is, they would rather talk up their fealty to international norms than overawe others with their cyberspace prowess. But for how long? As noted, the US did not seem to mind news stories that it had penetrated Russia's grid. In the summer of 2019, the US also indicated it was penetrating systems of those intruding against the US[33] (a.k.a. \"defending forward,\" or \"persistent engagement\"), and had countered Iran's shoot-down of a US drone with a cyberattack.[34] Might other countries follow? No country had (publicly, at least) established a cyberspace operations entity until the US formed USCYBERCOM. Many blushed at the thought of militarizing cyberspace until they—first allies, and then adversaries—followed suit. Whether other countries copy the trend\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nof taking credit not only for successes but also for operations more difficult to assess as successful depends on whether the aforementioned events of 2019 recur. This, in turn, depends on how much they reflected the character of the U.S. Administration at the time. But if such behavior becomes a trend, as opposed to a blip, other countries likely will follow suit in the years to come.\n# CONCLUSION\nIt has been said that the first casualty in war is truth. Today advances in technology and transparency as well as the professionalization of inquiry make it easier to determine the truth sooner rather than later. In this regard, cyberspace lags. Perhaps this should not be so—a fully imaged computer hard drive after a cyberattack leaves nowhere for anything to hide. But, in practice, there is often no third-party confirmation of a successful cyberattack, much less a failed cyberattack, or one partially completed (e.g., an implant). There is no easy equivalent in overhead imagery. And besides, matters once considered settled because of elite scientific consensus are increasingly open to question for a variety of causes (e.g., populism, the Internet's ability to support echo chambers, less influence of traditional media, epistemic closure).\nTrue facts of cyberwar are becoming secondary to misperceptions that governments either shape or influence. Increasingly, cyberwar is becoming what states make of it, and how they package it. That leaves, as open questions, what states will make of it. As argued, their options range in efficacy and persistence (in the face of subsequent revelations). The strategies states will employ will, of course, adapt to the circumstances. No hard projections can be made about what the games will look like, but games there will be.[35]\nSUMMER 2020 | 85\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT",
  "citations": {
    "style": "hybrid",
    "flat_text": "# THE CYBER DEFENSE REVIEW\nCyberwar is What States Make of ItAuthor(s): Martin Libicki\nSource: The Cyber Defense Review, Vol. 5, No. 2, Special Edition: Information Operations/Information Warfare , pp. 77-88\nPublished by: Army Cyber Institute\nStable URL: https://www.jstor.org/stable/10.2307/26923524\n## REFERENCES\nLinked references are available on JSTOR for this article: https://www.jstor.org/stable/10.2307/26923524?seq=1&amp;cid=pdf-reference#references_tab_contents\nYou may need to log in to JSTOR to access the linked references.\nJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms\nArmy Cyber Institute is collaborating with JSTOR to digitize, preserve and extend access to The Cyber Defense Review\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n# THE CYBER DEFENSE REVIEW\n* RESEARCH ARTICLES *\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n# Cyberwar is What States Make of It\nDr. Martin Libicki\nNo one there at the time could forget the vicious cyberattack on Venezuela's power systems in March 2019. Four days of chaos ensued. Stores and restaurants closed. Card payments systems were down, with customers asked to pay in dollars. Disrupted public transportation left many unable to get to work. Looting ensued. Seventeen people died in hospitals for lack of electricity.[2]\nWait, some of you may be thinking: what cyberattack? There is no question that Venezuela's grid had serious problems, but the only evidence that a cyberattack caused these problems was the word of President Maduro. He certainly had political reasons to mobilize his supporters against yet another delivered insult by the US, which has made no secret of its desire to see Maduro go.[3] More likely, the power outage reflected the same dysfunctional energy facilities that reduced the average daily oil production rate from nearly 2.5 million barrels in 2015, to a third of that in 2019.\nBrazil can tell a similar tale of woe. In 2007, hackers attacked the grid of the state of Rio Grande do Sul, causing severe power outages. The CIA picked up and circulated this story within the intelligence community for two years before it was broadcast by Sixty Minutes in 2009.[4] Or was it a cyberattack? Once it was reported in the press, Brazil's government denied any such cyberattack, claiming the cause to be sooty insulators, resulting in a fine assessed against the relevant utility.[5] So, end of the story? Not necessarily, argue two of the savvier observers on the cyberwar scene (one American and one Israeli); there were known groups that had both an interest in, and a talent for cyberspace mischief, and the government of Brazil would have been embarrassed to admit their success.\nThis is a work of the U.S. Government and is not subject to copyright protection in the United States. Foreign copyrights may apply.\nSUMMER 2020\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nDr. Martin C. Libicki (Ph.D., U.C. Berkeley 1978) is the MaryEllen and Richard Keyser Chair of Cybersecurity at the U.S. Naval Academy where he teaches cyberwar strategy and cyberspace economics. Prior employment includes having been a senior management scientist at RAND since 1998, focusing on the impacts of information technology on domestic and national security. He wrote three commercially published books: Cyberspace in Peace and War (2016, second edition forthcoming), Conquest in Cyberspace: National Security and Information Warfare (2007), and Information Technology Standards (1994). He is also the author of numerous RAND monographs, notably Defender's Dilemma, Brandishing Cyberattack Capabilities, Crisis and Escalation in Cyberspace, Global Demographic Change and its Implications for Military Power, Cyberdeterrence and Cyberwar, How Insurgencies End (with Ben Connable), and How Terrorist Groups End (with Seth Jones). Prior employment includes 12 years at the National Defense University, three years on the Navy Staff as program sponsor for industrial preparedness, and three years for the GAO.\nIf attacks on the power grid can be faked or hidden, imagine what can be done with other mischief in cyberspace. Cyber-espionage can go undetected for years. Withdrawals from bank accounts can be covered by funds transfers from the embarrassed bank (albeit not legally in many countries). Induced failures in police or intelligence systems may not make the news if such systems are themselves unknown to the public. By contrast, there is no hiding when it is the lights that go out. Nevertheless, the fact of a power outage does not prove that a cyberattack caused it—and, while the power company might know, they may not say or be encouraged or even allowed to speak. And, even if a cyberattack is established, attribution can still be an issue.\nSo far, the only verified cases of electric power loss caused by hacking occurred in Ukraine: two separate incidents in late 2015 and late 2016. But just as the existence of nuclear weapons—even though none have been detonated in war since 1945—has dramatically influenced the security choices of the US, Russia, and China, an imminent threat to knockout electric power could shape future crises. Targeted countries could be coerced or alternatively, they could try to pre-empt attackers by doing likewise. The most frequently discussed way to convert the threat to the electric grid from a notional to a real possibility is to implant malware into the other side's industrial control systems (as distinct from their office and billing systems). Such implants have been likened to Soviet moves to put intermediate-range nuclear-tipped missiles in Cuba, thereby tripling their capacity to strike the US.\nSo, have countries implanted malware in other countries' electric grids? In 2009, The Wall Street Journal, with no evidence beyond \"intelligence\" sources, reported that Russia and China had done precisely that to the US grid.[6]\nIn late 2014, Admiral Michael Rogers, Commander, U.S. Cyber Command (USCYBERCOM), testified[7] that,\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n“there are nation-states and groups out there that have the capability ... to shut down, forestall our ability to operate our basic infrastructure, whether it's generating power across this nation, whether it's moving water and fuel.” Later that year evidence surfaced that Russian hackers had used tools to penetrate power stations (using Black Energy malware) and corrupted software updates of machinery that sat on electronically isolated (aka “air-gapped”) networks (using Havex malware). In mid-2018, DHS officials reported penetration by Russian hackers of the US electrical system by leveraging the phishing-acquired credentials of suppliers to electrical control systems; “They got to the point where they could have thrown switches” and disrupted power flows.[8] Iran has been credited with similar capabilities.[9] Some believe that “so many attackers have stowed away in the systems that run the US electric grid that experts say they likely have the capability to strike at will.”[10]\nIt is difficult to know what to make of these claims. The intelligence community keeps secrets for a living. Law enforcement rarely releases sensitive information before trials. Corporations seldom concede that they are victims of hackers, especially of hacks that produced no visible effects. Finding malware is not necessarily an indication of cyberattack, either. The malware could have drifted in from elsewhere. Stuxnet, for instance, appeared in over 100,000 systems outside the Natanz centrifuge plant. A compiler corrupted to produce malware-laden software for a specific supply-chain attack can compromise other software that is unknown to the hackers. While possible, it is quite difficult for hackers who cannot communicate with the malware to time an attack.\nAt least, claims of extant or impending cyberattacks can be refuted if given time. Anomalous indicators on an employee's laptop at the Burlington Electric Department were initially mistaken for a deliberate Russian hacking attempt on its electrical power grid.[11] That is reassuring to onlookers who remember the accusation, and then the retraction, but what if someone had acted irreversibly on the accusation, before it was retracted?\nMatters are foggier if attackers, rather than defenders, claim that implants were installed. In mid-2019, USCYBERCOM gave notice that it was installing implants into the Russian electric grid,[12] which the Russians denied,[13] claiming that such attacks were thwarted.[14] So, is the US capable of taking down the Russian electric grid (e.g. in retaliation for their doing likewise)?\nFinally, even if the fact of the disruption and attribution both are indisputable, the message intended by the disruption is subject to multiple interpretations. Consider the hacks of Ukraine's power grid.[15] The hack, according to Robert M. Lee and Mike Assante (both teach cybersecurity for SANS) was meant, “to stoke the ire of Ukrainian customers and weaken their trust in the Ukrainian power companies and government.” The article's author, citing Ukrainian sources, then adds that “[s]peculation has been rampant that the subsequent blackouts in Ukraine were retaliation for the attack on the Crimean substations.” Robert Lee was quoted later in the article considering the possibility that, “the attack on the Ukrainian power\nCYBERWAR IS WHAT STATES MAKE OF IT\ncompanies was a message to Ukrainian authorities not to pursue privatization,\" ultimately concluding the message to be: \"We want to be seen, and we want to send you a message ... oh, you think you can take away the power [in Crimea]? Well I can take away the power from you.\" Finally, an attack on the electric grid that caused modest effects could easily be portrayed as one that could have caused major effects but for self-restraint or error: the late 2016 cyberattack on Ukraine's electric grid opened circuit breakers that were closed an hour later, but analysis of the code suggested that the hackers sought to cause physical damage before power was restored but made several coding errors.[16] Oleksii Yasinksy, a Ukrainian cybersecurity researcher, believed the hackers \"could have knocked out Ukrenergo's transmission station for longer or caused permanent, physical harm to the grid, he says—a restraint that American analysts like Assante and Lee have also noted.\"[17]\nWhat can we draw from these examples? Based on the Venezuelan incident, one observer concluded, \"the inability to definitively discount US or other foreign intervention, whether deliberate or accidental, demonstrates the incredible power of using cyberattacks to target utilities.\"[18] But there is an alternative perspective: it demonstrates the profound impact such cyberattacks have on the public's imagination—which, when coupled with the difficulty of proving who did what and why—illustrates the power that mere claims of cyberattack have, either by the attacker or the attacked. There is a reason cyberspace events are mysterious. To paraphrase Ross Anderson[19]: airline safety has improved faster than cybersecurity because airplanes crash outside and, by so doing, create facts that cannot be waved away. But computers crash inside, which allows others to understate or overstate what actually took place.\n## Manipulating Information about Information War Itself is Information Warfare\nThe ease with which facts can be manipulated, given the ambiguities and obscurities of cyberspace, means that leaders will be tempted to do just that. Having examined the means of distorting the truth, it is important to understand some of the motives that would prompt such distortions. The degree of manipulation will depend on several variables, including the moral quality of a country's leaders, their ability to maintain a narrative at variance with facts, and the political context within which they operate.\nIn fairness, the ability to create misperceptions that vary with reality is often unequal. Transparency brings reality and perceptions closer together. So, the leeway of governments to fudge events will vary—directly or via proxies (e.g., power grid operators). Competition among private cybersecurity firms makes it more difficult to advance defensible claims. Conversely, exposure to public opinion creates a gap between perceptions and reality that may be unsupportable. Claims to expert authority are not taken as seriously as (we suppose) before. At least in the West, epistemic closure appears to be growing worse. Despite a clear consensus among the cybersecurity community that imaging servers suffices to understand a network intrusion, for instance, many who take their cues from the leaders they like believe\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nthat shipping servers to a foreign country is a way to hide false flag attacks (e.g., Ukrainians doing what Russians are blamed for).\nAdding to the discrepancy has been the tendency of some countries to separate their communications from the rest of the world. North Korea remains isolated. China's Great Firewall is a prime example of selective filtering. Iran is similar in this regard and is contemplating even more isolation.[20] Russia recently experimented with closing its Internet off from the rest of the world.[21] Early hopes that the Internet would bring the world together and that, in John Gilmore's words, \"The Net interprets censorship as damage and routes around it,\" look nostalgic. As Evgeny Morozov observed in *The Net Delusion: The Dark Side of Internet Freedom*,[22] authoritarian governments originally caught flat-footed by the Internet have learned how to control it and turn it to their purposes.\nBetween the facts that, for laypeople, cyberspace is opaque, and yet, the Internet can actually facilitate misperception over reality, the stage is set for states to make of events in cyberspace as they will.\nTo simplify the question, consider two players: the target and the attacker. The target has two basic choices: to play up the incident (even, perhaps especially, if no cyberattack were actually involved or no implant dropped), or to downplay it. The attacker has two basic choices as well, but is in a poor position vis-à-vis the target to argue about the effects of the cyberattack. Figuratively and literally, the target is there, and the attacker is not. But the attacker can either dispute or embrace attribution because the requisite evidence is something the attacker will have special knowledge of.[23]\nThe target can play up the cyberattack in many ways. Assuming there is something to work with (e.g., a blackout), it can be mischaracterized as an accident, human error, design flaw, as well as a cyberattack. As a variant, an accidental or inadvertent cyberattack can be characterized as deliberate and malicious.[24] A cyberattack with a weak effect could be touted as a bullet dodged, either because the hacker erred, or because the hacker was brandishing its capabilities and could have done worse if it wanted to. And, as noted, even if no cyberattack took place, some entity the target wants to malign could be accused of having planted malware \"discovered\" in the system. Attribution can also be played, largely because some cyberattacks are more embarrassing than others. An inside job can imply that an organization's employees are untrustworthy, or that the organization poorly vetted, and/or that its systems afforded others too many privileges. The victim of a state-backed hacker group can summon the misleading argument that a private company can no more defend its network against an army than it can defend its factory against one; falling to a criminal group is more blameworthy. Finally, if the adverse impact of the cyberattack is insufficient to meet the target's needed political narrative, the cyberattack can be cast as the beginning of a systematic campaign. With a little nerve, it can argue that it was the first shot in a kinetic war, thereby justifying the target's decision to\nSUMMER 2020 | 81\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nmobilize its society to fight. While an actual kinetic war may not happen, an action-reaction cycle could actually escalate into war. And if the war does not come, there's always the narrative that war would have come were it not for the target's raising the alarm and mobilizing (e.g., its own forces, the righteous anger of its citizenry, enraged world opinion) accordingly.\nThis litany of options illustrates why the target may play up a cyberattack. They help unify a country in the face of an adversary while distracting the polity from the government's mistakes. The mobilization of opinion helps governments institute repressive measures or raise taxes. Threats of cyberattacks may persuade the public to allow its government access to personal or organizational systems. Once governments are granted authority to surveil systems for malware or other evidence of intrusion, they can use such access to monitor unwanted activity by citizens. Accusations may create cover for the target's own aggressive acts, forcing concessions from the attacker, even if the incident is phony or exaggerated. It can warn third countries that war may be coming, thereby forcing alliances or other commitments. (Ironically, hyping a cyberattack could lower tensions by substituting conflict in cyberspace, which is unlikely to kill anyone, for more risky posturing in the physical world).\nThe most innocent explanation is that exaggerating the cyberspace threat will persuade many to take cybersecurity more seriously as they should have from the start (like Senator Arthur Vandenberg, who told President Truman public support for aid to Greece and Turkey against Communists required him to \"scare the hell out of the American people\"). But this rationale holds some paradox. If the point is to inspire confidence in the integrity of government processes – for instance, that voters can trust election results because they are protected – advertising their vulnerability to hacking may ultimately lead to trustworthy voting systems but, until then, will not produce trusted voting systems.\nThat logic is one of several reasons' leaders may be reluctant to play up cyberattacks. As a device for mobilizing popular opinion, cyberspace events may be too esoteric, incomprehensible, and removed from daily concerns to allow for galvanizing emotions. Unlike terrorism, cyberattacks more likely will engender anxiety and annoyance, on par with the prospect of a morning traffic jam. But if someone's literal viscera are not threatened, can cyberattacks induce the kind of visceral fear with the requisite political clout?\nReasons to downplay cyberattacks are not hard to find. Falling victim to cyberattacks is, as noted, embarrassing. Such catastrophes can be prevented either by diligent cybersecurity investments or through various forms of self-denial (e.g., closing systems to easy access by others, retaining less information, or prioritizing security over usability and flexibility). Because the point of government is providing security and reliability, admitting that it failed at that can be difficult.\nOther reasons for reticence may arise in strategy. Just as playing up cyberattacks may help mobilize citizens for confrontation, playing them down may allow governments to avoid\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nconfrontations they cannot win or at least can win only at great cost. Analogously, many in Europe were eager to accept Putin's assertion that Russia had no forces in Ukraine's east: \"[The West] connived in Mr. Putin's pretense that he had not invaded eastern Ukraine—even though in a furtive tricky way he plainly had—because to say otherwise would have required a drastic response.\"[25] Playing down attacks also signals insouciance. Thus, if its purpose is to goad the target into doing something rash (e.g., as the September 11th attacks may have been used by al-Qaeda to goad the US into Afghanistan) then downplaying that would translate as an insufficient pain threshold to merit response. Similarly, by refusing to admit to being hurt, a state conveys that it is not coerced and thus will not accede to whatever demands, be they explicit or implicit, are imposed by the attacker, and will itself be undeterred in pursuing its own ends.\nDenying attribution also obviates pressures on the target to respond, and also conveys, albeit weakly, that the cyberattack fell below some pain threshold. This allows the target state the option to determine later that they have enough confidence to respond. Conversely, an argument that the pain of cyberattack is limited can be undermined by the discovery of wider and deeper effects and rarely can be assigned by the reverse (much as death tolls can only go up as catastrophes are investigated). The same holds for characterization of near-attacks or failed-attacks. Earlier interpretations that they were not deliberate or carried out by incompetents can be credibly revisited.\nA last option is to cast doubt on any early facts, whether helpful or harmful. One reason may be to avoid prejudicing the investigation in the hopes of learning the real lessons for the incident. Another is to prevent the attacker (and would-be copycats) from receiving battle damage assessment so to speak, the better to perfect subsequent attacks.\nAs to attackers, they, like defenders, can play up or play down the consequences of the attack, its characterization, or its attribution. In practice, however, it is difficult for attackers to more credibly characterize the attack than the target, which has far greater access to information than the attacker. Indeed, the attacker often will have very little if any firsthand information. Reports, for instance, that the US successfully interfered with performance of North Korea's Musudan missile had to be left dangling because of the lack of any sure way to know whether the hack actually worked, or, even if it did work, was a decisive factor in subsequent launch failures.[26] The best the attacker can do is to argue that while the target may know better, its leaders often lie about what they know to be otherwise. It took two months after the public learned about Stuxnet for Iran to concede it had been hurt. Yet neither the US nor Israel officially claimed that the attacks succeeded.\nIn theory, matters are less clear. Attackers usually know better what they tried to do than do defenders; if the damage is subtle or only appears under certain circumstances, the attacker may know to look to telltale signs that its attacks worked, often leaving the defender oblivious to the attack. Subtle attacks also do not make the news, at least not until their impacts become visible.\nSUMMER 2020 | 83\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nThis leaves attribution as the attacker's primary lever. Countries generally do not acknowledge their cyberspace operations, even when so accused. This stands in contrast to acts of terrorism (at least pre-9/11), which were followed by multiple claimed terrorist group perpetrators. Many cyberattacks such as the 2012 attack on Saudi Aramco or the 2014 attack on Sony are claimed by groups: The Cutting Sword of Justice and the Guardians of the Peace, respectively. But these groups do not really exist as separate entities. The reasons to deny attribution are straightforward. Most accusations involve cyber espionage whose operators avoid—because the point is to work undetected—revealing their own capabilities and modus operandi.\nAs for the rarer instances of cyberattack, often the target knows the attacker's identity, while admitting as much opens the attacker to criticism and makes it hard for the attacker to, in turn, criticize incoming cyberattacks. For example, going back at least to the 1973 War, Israel's neighbors believed that Israel had nuclear weapons, thereby giving Israel the benefit of deterrence. Yet Israel strenuously denied having such weapons, to the point of even luring and then jailing Mordechai Vanunu, an Israeli who revealed as much to the British press in the 1980's.[27] Israel may well have calculated that open admission would have led third parties to push Israel to de-nuclearize, or to pressure neighboring countries to pursue their own nuclear weapons.\nStuxnet provides an interesting case in contrast. Neither the US nor Israel denied this cyberattack,[28] yet neither admitted it officially, at least at first. But at least some in each country wanted to take credit for it. In the US, former Vice Chairman of the JCS, General Cartwright, was accused to have been the source for David Sanger's articles on the hack. And a 2011 YouTube video captured Israel's Chief of Staff at his retirement party counting Stuxnet among his prominent achievements.[29] In 2016, an official Israeli document baldly stated, \"an example of an offensive cyber operation conducted by Israel is Stuxnet, which was jointly developed with the United States and targeted Iranian nuclear facilities.\"[30] Other governments have tried to have it both ways. Russia denied hacking the DNC in 2016, but its President called the hackers \"artists.\"[31] North Korea denied hacking Sony in 2014 but called it a \"righteous deed.\"[32]\nGenerally, hypocrisy—a tribute vice pays to virtue—rules. Given a choice between appearing great and appearing good, countries choose good. That is, they would rather talk up their fealty to international norms than overawe others with their cyberspace prowess. But for how long? As noted, the US did not seem to mind news stories that it had penetrated Russia's grid. In the summer of 2019, the US also indicated it was penetrating systems of those intruding against the US[33] (a.k.a. \"defending forward,\" or \"persistent engagement\"), and had countered Iran's shoot-down of a US drone with a cyberattack.[34] Might other countries follow? No country had (publicly, at least) established a cyberspace operations entity until the US formed USCYBERCOM. Many blushed at the thought of militarizing cyberspace until they—first allies, and then adversaries—followed suit. Whether other countries copy the trend\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nof taking credit not only for successes but also for operations more difficult to assess as successful depends on whether the aforementioned events of 2019 recur. This, in turn, depends on how much they reflected the character of the U.S. Administration at the time. But if such behavior becomes a trend, as opposed to a blip, other countries likely will follow suit in the years to come.\n# CONCLUSION\nIt has been said that the first casualty in war is truth. Today advances in technology and transparency as well as the professionalization of inquiry make it easier to determine the truth sooner rather than later. In this regard, cyberspace lags. Perhaps this should not be so—a fully imaged computer hard drive after a cyberattack leaves nowhere for anything to hide. But, in practice, there is often no third-party confirmation of a successful cyberattack, much less a failed cyberattack, or one partially completed (e.g., an implant). There is no easy equivalent in overhead imagery. And besides, matters once considered settled because of elite scientific consensus are increasingly open to question for a variety of causes (e.g., populism, the Internet's ability to support echo chambers, less influence of traditional media, epistemic closure).\nTrue facts of cyberwar are becoming secondary to misperceptions that governments either shape or influence. Increasingly, cyberwar is becoming what states make of it, and how they package it. That leaves, as open questions, what states will make of it. As argued, their options range in efficacy and persistence (in the face of subsequent revelations). The strategies states will employ will, of course, adapt to the circumstances. No hard projections can be made about what the games will look like, but games there will be.[35]\nSUMMER 2020 | 85\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 30,
        "success_occurrences": 30,
        "success_unique": 30,
        "bib_unique_total": 70,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.42857142857142855,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 4,
        "missing_intext_indices": [
          1,
          4,
          10,
          22
        ],
        "highest_intext_index": 34,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 5,
        "uncited_footnote_indices": [
          1,
          4,
          10,
          22,
          144
        ],
        "style": "hybrid"
      },
      "results": [
        {
          "index": "2",
          "intext_citation": "electricity.[2]",
          "preceding_text": "Seventeen people died in hospitals for lack of",
          "footnote": ". Description from Tom McKay, \"Maduro Says 'Multiple Cyberattacks' Backed by U.S. to Blame for Four Days of Widespread Blackouts,\" March 10, 2019; https://gizmodo.com/maduro-says-multiple-cyberattacks-backed-by-u-s-to-b-1833190542."
        },
        {
          "index": "3",
          "intext_citation": "go.[3]",
          "preceding_text": "He certainly had political reasons to mobilize his supporters against yet another delivered insult by the US, which has made no secret of its desire to see Maduro",
          "footnote": ". When China's offer to help bolster the security of Venezuela's grid was rejected, even the Chinese were convinced that no such cyberattack had taken place."
        },
        {
          "index": "5",
          "intext_citation": "utility.[5]",
          "preceding_text": "Once it was reported in the press, Brazil's government denied any such cyberattack, claiming the cause to be sooty insulators, resulting in a fine assessed against the relevant",
          "footnote": ". Marcelo Soares, \"Brazilian Blackout Traced to Sooty Insulators, Not Hackers\" November 9, 2009; http://www.wired.com/threatlevel/2009/11/brazil_blackout/."
        },
        {
          "index": "6",
          "intext_citation": "grid.[6]",
          "preceding_text": "In 2009, The Wall Street Journal, with no evidence beyond \"intelligence\" sources, reported that Russia and China had done precisely that to the US",
          "footnote": ". Siobhan Gorman, \"Electricity Grid in U.S. Penetrated by Spies,\" *Wall Street Journal*, April 8, 2009, 1, http://www.wsj.com/articles/SB123914805204099085."
        },
        {
          "index": "7",
          "intext_citation": "testified[7]",
          "preceding_text": "Cyber Command (USCYBERCOM),",
          "footnote": ". Ellen Nakashima, \"Foreign powers steal data on critical U.S. infrastructure, NSA chief says,\" November 20, 2014; http://www.washingtonpost.com/world/national-security/nsa-chief-foreign-powers-steal-data-on-critical-us-infrastructure/2014/11/20/ddd4392e-70cb-11e4-893f-86bd390a3340_story.html."
        },
        {
          "index": "8",
          "intext_citation": "flows.[8]",
          "preceding_text": "In mid-2018, DHS officials reported penetration by Russian hackers of the US electrical system by leveraging the phishing-acquired credentials of suppliers to electrical control systems; “They got to the point where they could have thrown switches” and disrupted power",
          "footnote": ". Rebecca Smith, \"Russian Hackers Reach U.S. Utility Control Rooms, Homeland Security Officials Say,\" July 23, 2018; https://www.wsj.com/articles/russian-hackers-reach-u-s-utility-control-rooms-homeland-security-officials-say-1532388110 and Colleen Long, \"Russian hackers used phishing tools in 2017 attack on grid, July 26, 2018; https://www.apnews.com/2c17bda4ac704df6be66018197f29912."
        },
        {
          "index": "9",
          "intext_citation": "capabilities.[9]",
          "preceding_text": "d penetration by Russian hackers of the US electrical system by leveraging the phishing-acquired credentials of suppliers to electrical control systems; “They got to the point where they could have thrown switches” and disrupted power flows.[8] Iran has been credited with similar",
          "footnote": ". Courtney Kube, Carol E. Lee, Dan De Luce and Ken Dilanian, \"Iran has laid groundwork for extensive cyberattacks on U.S., say officials,\" July 20, 2018; https://www.nbcnews.com/news/us-news/iran-has-laid-groundwork-extensive-cyberattacks-u-s-say-officials-n893081. See also Andy Greenberg, \"The Highly Dangerous 'Triton' Hackers have Probed the US Grid,\" June 14, 2019; https://www.wired.com/story/triton-hackers-scan-us-power-grid/."
        },
        {
          "index": "11",
          "intext_citation": "grid.[11]",
          "preceding_text": "Anomalous indicators on an employee's laptop at the Burlington Electric Department were initially mistaken for a deliberate Russian hacking attempt on its electrical power",
          "footnote": ". Ellen Nakashima and Juliet Eilperin, \"Russian government hackers do not appear to have targeted Vermont utility, say people close to investigation,\" January 2, 2017; https://www.washingtonpost.com/world/national-security/russian-government-hackers-do-not-appear-to-have-targeted-vermont-utility-say-people-close-to-investigation/2017/01/02/70c25956-d12c-11e6-945a-76f69a399dd5_story.html."
        },
        {
          "index": "12",
          "intext_citation": "grid,[12]",
          "preceding_text": "In mid-2019, USCYBERCOM gave notice that it was installing implants into the Russian electric",
          "footnote": ". David Sanger and Nicole Perlroth, \"U.S. Escalates Online Attacks on Russia's Power Grid,\" June 15, 2019; https://www.nytimes.com/2019/06/15/us/politics/trump-cyber-russia-grid.html."
        },
        {
          "index": "13",
          "intext_citation": "denied,[13]",
          "preceding_text": "In mid-2019, USCYBERCOM gave notice that it was installing implants into the Russian electric grid,[12] which the Russians",
          "footnote": ". Ivan Nechepurenko, \"Kremlin Warns of Cyberwar After Report of U.S. Hacking Into Russian Power Grid,\" June 17, 2019; https://www.nytimes.com/2019/06/17/world/europe/russia-us-cyberwar-grid.html."
        },
        {
          "index": "14",
          "intext_citation": "thwarted.[14]",
          "preceding_text": "In mid-2019, USCYBERCOM gave notice that it was installing implants into the Russian electric grid,[12] which the Russians denied,[13] claiming that such attacks were",
          "footnote": ". Reuters, \"Russia thwarts U.S. cyber attacks on its infrastructure: news agencies,\" June 17, 2019; https://www.reuters.com/article/us-usa-russia-cyber-russia/russia-thwarts-u-s-cyber-attacks-on-its-infrastructure-news-agencies-idUSKCNITI1U0."
        },
        {
          "index": "15",
          "intext_citation": "grid.[15]",
          "preceding_text": "Consider the hacks of Ukraine's power",
          "footnote": ". Kim Zetter, \"Inside the Cunning, Unprecedented Hack of Ukraine's Power Grid,\" March 3, 2016; http://www.wired.com/2016/03/inside-cunning-unprecedented-hack-ukraines-power-grid/."
        },
        {
          "index": "16",
          "intext_citation": "errors.[16]",
          "preceding_text": "ects but for self-restraint or error: the late 2016 cyberattack on Ukraine's electric grid opened circuit breakers that were closed an hour later, but analysis of the code suggested that the hackers sought to cause physical damage before power was restored but made several coding",
          "footnote": ". Joe Slowik, \"CRASHOVERRIDE: Reassessing the 2016 Ukraine Electric Power Event as a Protection-Focused Attack,\" August 15, 2019; https://dragos.com/wp-content/uploads/CRASHOVERRIDE.pdf."
        },
        {
          "index": "17",
          "intext_citation": "noted.\"[17]",
          "preceding_text": "g errors.[16] Oleksii Yasinksy, a Ukrainian cybersecurity researcher, believed the hackers \"could have knocked out Ukrenergo's transmission station for longer or caused permanent, physical harm to the grid, he says—a restraint that American analysts like Assante and Lee have also",
          "footnote": ". Andy Greenberg, \"How an Entire Nation Became Russia's Test Lab for Cyberwar,\" June 20, 2017; https://www.wired.com/story/russian-hackers-attack-ukraine/."
        },
        {
          "index": "18",
          "intext_citation": "utilities.\"[18]",
          "preceding_text": "Based on the Venezuelan incident, one observer concluded, \"the inability to definitively discount US or other foreign intervention, whether deliberate or accidental, demonstrates the incredible power of using cyberattacks to target",
          "footnote": ". From Kalev Leetaru, \"Could Venezuela's Power Outage Really Be A Cyber Attack?,\" March 9, 2019; https://www.forbes.com/sites/kalevleetaru/2019/03/09/could-venezuelas-power-outage-really-be-a-cyber-attack/#34e80b4e607c."
        },
        {
          "index": "19",
          "intext_citation": "Anderson[19]",
          "preceding_text": "To paraphrase Ross",
          "footnote": ". My interpretation of an argument on the first page of Ross Anderson, \"Why Cryptosystems Fail,\" 1993, https://www.cl.cam.ac.uk/~rja14/Papers/wcf.pdf."
        },
        {
          "index": "20",
          "intext_citation": "isolation.[20]",
          "preceding_text": "Iran is similar in this regard and is contemplating even more",
          "footnote": ". See, for example, Behrang Tajdin, \"Iran letter raises prospect of 'white list' internet clampdown,\" November 26, 2019; https://www.bbc.com/news/technology-50563917."
        },
        {
          "index": "21",
          "intext_citation": "world.[21]",
          "preceding_text": "Iran is similar in this regard and is contemplating even more isolation.[20] Russia recently experimented with closing its Internet off from the rest of the",
          "footnote": ". Catalin Cimpanu, \"Russia successfully disconnected from the internet,\" December 23, 2019; https://www.zdnet.com/article/russia-successfully-disconnected-from-the-internet/."
        },
        {
          "index": "23",
          "intext_citation": "of.[23]",
          "preceding_text": "But the attacker can either dispute or embrace attribution because the requisite evidence is something the attacker will have special knowledge",
          "footnote": ". Notionally, if the attacker supports multiple, albeit uncooperative, threat actor groups, or when multiple states attack, the target's knowledge may be incomplete. Practically, this is rare to nonexistent."
        },
        {
          "index": "24",
          "intext_citation": "malicious.[24]",
          "preceding_text": "As a variant, an accidental or inadvertent cyberattack can be characterized as deliberate and",
          "footnote": ". Some consider this plausible. In 2008, a National Journal story quoted unnamed intelligence sources to argue that a hacker trying to map Florida Power &amp; light, \"got carried away and had a 'what happens if I pull on this' moment ... [and] triggered a cascade effect, shutting down large portions of the Florida power grid\". The outage was later ascribed to human error. See Shane Harris, \"China's Cyber Militia,\" National Journal Magazine, May 31, 2008, http://www.nationaljournal.com/magazine/china-s-cyber-militia-20080531."
        },
        {
          "index": "25",
          "intext_citation": "response.\"[25]",
          "preceding_text": "Putin's pretense that he had not invaded eastern Ukraine—even though in a furtive tricky way he plainly had—because to say otherwise would have required a drastic",
          "footnote": ". From Economist, \"The Siege,\" July 12, 2014, http://www.economist.com/news/leaders/21606831-believing-vladimir-putin-has-surrendered-ukraine-would-be-naive-west-must-keep-up."
        },
        {
          "index": "26",
          "intext_citation": "failures.[26]",
          "preceding_text": "Reports, for instance, that the US successfully interfered with performance of North Korea's Musudan missile had to be left dangling because of the lack of any sure way to know whether the hack actually worked, or, even if it did work, was a decisive factor in subsequent launch",
          "footnote": ". David Sanger and William Broad, \"Trump Inherits a Secret Cyberwar Against North Korean Missiles,\" March 4, 2017; https://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html."
        },
        {
          "index": "27",
          "intext_citation": "s.[27]",
          "preceding_text": "Yet Israel strenuously denied having such weapons, to the point of even luring and then jailing Mordechai Vanunu, an Israeli who revealed as much to the British press in the 1980'",
          "footnote": ". But see Conrad Duncan, \"Netanyahu calls Israel a 'nuclear power' before correcting himself in apparent slip of the tongue,\" January 6, 2020; https://www.independent.co.uk/news/world/middle-east/netanyahu-israel-nuclear-power-weapons-iran-crisis-trump-a9272086.html."
        },
        {
          "index": "28",
          "intext_citation": "cyberattack,[28]",
          "preceding_text": "Neither the US nor Israel denied this",
          "footnote": ". See, for instance, Deputy Secretary of Defense Lynn's non-answer in Kim Zetter, \"Senior Defense Official Caught Hedging on U.S. Involvement in Stuxnet,\" Wired, May 26, 2011, http://www.wired.com/threatlevel/2011/05/defense-department-stuxnet/."
        },
        {
          "index": "29",
          "intext_citation": "achievements.[29]",
          "preceding_text": "And a 2011 YouTube video captured Israel's Chief of Staff at his retirement party counting Stuxnet among his prominent",
          "footnote": ". Christopher Williams, \"Israeli security chief celebrates Stuxnet cyber attack\" February 16, 2011; http://www.telegraph.co.uk/technology/news/8326274/Israeli-security-chief-celebrates-Stuxnet-cyberattack.html and William Jacobson, \"Did Israel Just Admit to Creating Stuxnet?\", February 15, 2011; http://legalinsurrection.com/2011/02/did-israeli-just-admit-to-creating-stuxnet/."
        },
        {
          "index": "30",
          "intext_citation": "facilities.\"[30]",
          "preceding_text": "retirement party counting Stuxnet among his prominent achievements.[29] In 2016, an official Israeli document baldly stated, \"an example of an offensive cyber operation conducted by Israel is Stuxnet, which was jointly developed with the United States and targeted Iranian nuclear",
          "footnote": ". \"Deterring Terror: English Translation of the Official Strategy of the Israel Defense Forces,\" Belfer Center Special Report of August 2016; http://www.belfercenter.org/publication/israeli-defense-forces-defense-doctrine-english-translation, 48."
        },
        {
          "index": "31",
          "intext_citation": "artists.\"[31]",
          "preceding_text": "Russia denied hacking the DNC in 2016, but its President called the hackers \"",
          "footnote": ". See Andrew Higgins, \"Maybe Private Russian Hackers Meddled in Election, Putin Says,\" June 1, 2017; https://www.nytimes.com/2017/06/01/world/europe/vladimir-putin-donald-trump-hacking.html."
        },
        {
          "index": "32",
          "intext_citation": "deed.\"[32]",
          "preceding_text": "Russia denied hacking the DNC in 2016, but its President called the hackers \"artists.\"[31] North Korea denied hacking Sony in 2014 but called it a \"righteous",
          "footnote": ". Choe Sang-Hundec, \"North Korea Denies Role in Sony Pictures Hacking,\" New York Times, December 7, 2014, http://www.nytimes.com/2014/12/08/business/north-korea-denies-hacking-sony-but-calls-attack-a-righteous-deed.html."
        },
        {
          "index": "33",
          "intext_citation": "US[33]",
          "preceding_text": "In the summer of 2019, the US also indicated it was penetrating systems of those intruding against the",
          "footnote": ". Ellen Nakashima, \"U.S. Cyber Command operation disrupted Internet access of Russian troll factory on day of 2018 midterms,\" February 27, 2019; https://www.whitehouse.gov/presidential-actions/presidentexecutive-order-strengthening-cybersecurity-federal-networks-critical-infrastructure/."
        },
        {
          "index": "34",
          "intext_citation": "cyberattack.[34]",
          "preceding_text": "\"defending forward,\" or \"persistent engagement\"), and had countered Iran's shoot-down of a US drone with a",
          "footnote": ". AFP, \"US launched cyber attacks on Iran after drone shootdown: reports,\" June 22, 2019; https://news.yahoo.com/us-launched-cyber-attacks-iran-drone-shootdown-reports-232123877.html."
        }
      ],
      "flat_text": "# THE CYBER DEFENSE REVIEW\nCyberwar is What States Make of ItAuthor(s): Martin Libicki\nSource: The Cyber Defense Review, Vol. 5, No. 2, Special Edition: Information Operations/Information Warfare , pp. 77-88\nPublished by: Army Cyber Institute\nStable URL: https://www.jstor.org/stable/10.2307/26923524\n## REFERENCES\nLinked references are available on JSTOR for this article: https://www.jstor.org/stable/10.2307/26923524?seq=1&amp;cid=pdf-reference#references_tab_contents\nYou may need to log in to JSTOR to access the linked references.\nJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms\nArmy Cyber Institute is collaborating with JSTOR to digitize, preserve and extend access to The Cyber Defense Review\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n# THE CYBER DEFENSE REVIEW\n* RESEARCH ARTICLES *\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n# Cyberwar is What States Make of It\nDr. Martin Libicki\nNo one there at the time could forget the vicious cyberattack on Venezuela's power systems in March 2019. Four days of chaos ensued. Stores and restaurants closed. Card payments systems were down, with customers asked to pay in dollars. Disrupted public transportation left many unable to get to work. Looting ensued. Seventeen people died in hospitals for lack of electricity.[2]\nWait, some of you may be thinking: what cyberattack? There is no question that Venezuela's grid had serious problems, but the only evidence that a cyberattack caused these problems was the word of President Maduro. He certainly had political reasons to mobilize his supporters against yet another delivered insult by the US, which has made no secret of its desire to see Maduro go.[3] More likely, the power outage reflected the same dysfunctional energy facilities that reduced the average daily oil production rate from nearly 2.5 million barrels in 2015, to a third of that in 2019.\nBrazil can tell a similar tale of woe. In 2007, hackers attacked the grid of the state of Rio Grande do Sul, causing severe power outages. The CIA picked up and circulated this story within the intelligence community for two years before it was broadcast by Sixty Minutes in 2009.[4] Or was it a cyberattack? Once it was reported in the press, Brazil's government denied any such cyberattack, claiming the cause to be sooty insulators, resulting in a fine assessed against the relevant utility.[5] So, end of the story? Not necessarily, argue two of the savvier observers on the cyberwar scene (one American and one Israeli); there were known groups that had both an interest in, and a talent for cyberspace mischief, and the government of Brazil would have been embarrassed to admit their success.\nThis is a work of the U.S. Government and is not subject to copyright protection in the United States. Foreign copyrights may apply.\nSUMMER 2020\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nDr. Martin C. Libicki (Ph.D., U.C. Berkeley 1978) is the MaryEllen and Richard Keyser Chair of Cybersecurity at the U.S. Naval Academy where he teaches cyberwar strategy and cyberspace economics. Prior employment includes having been a senior management scientist at RAND since 1998, focusing on the impacts of information technology on domestic and national security. He wrote three commercially published books: Cyberspace in Peace and War (2016, second edition forthcoming), Conquest in Cyberspace: National Security and Information Warfare (2007), and Information Technology Standards (1994). He is also the author of numerous RAND monographs, notably Defender's Dilemma, Brandishing Cyberattack Capabilities, Crisis and Escalation in Cyberspace, Global Demographic Change and its Implications for Military Power, Cyberdeterrence and Cyberwar, How Insurgencies End (with Ben Connable), and How Terrorist Groups End (with Seth Jones). Prior employment includes 12 years at the National Defense University, three years on the Navy Staff as program sponsor for industrial preparedness, and three years for the GAO.\nIf attacks on the power grid can be faked or hidden, imagine what can be done with other mischief in cyberspace. Cyber-espionage can go undetected for years. Withdrawals from bank accounts can be covered by funds transfers from the embarrassed bank (albeit not legally in many countries). Induced failures in police or intelligence systems may not make the news if such systems are themselves unknown to the public. By contrast, there is no hiding when it is the lights that go out. Nevertheless, the fact of a power outage does not prove that a cyberattack caused it—and, while the power company might know, they may not say or be encouraged or even allowed to speak. And, even if a cyberattack is established, attribution can still be an issue.\nSo far, the only verified cases of electric power loss caused by hacking occurred in Ukraine: two separate incidents in late 2015 and late 2016. But just as the existence of nuclear weapons—even though none have been detonated in war since 1945—has dramatically influenced the security choices of the US, Russia, and China, an imminent threat to knockout electric power could shape future crises. Targeted countries could be coerced or alternatively, they could try to pre-empt attackers by doing likewise. The most frequently discussed way to convert the threat to the electric grid from a notional to a real possibility is to implant malware into the other side's industrial control systems (as distinct from their office and billing systems). Such implants have been likened to Soviet moves to put intermediate-range nuclear-tipped missiles in Cuba, thereby tripling their capacity to strike the US.\nSo, have countries implanted malware in other countries' electric grids? In 2009, The Wall Street Journal, with no evidence beyond \"intelligence\" sources, reported that Russia and China had done precisely that to the US grid.[6]\nIn late 2014, Admiral Michael Rogers, Commander, U.S. Cyber Command (USCYBERCOM), testified[7] that,\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n“there are nation-states and groups out there that have the capability ... to shut down, forestall our ability to operate our basic infrastructure, whether it's generating power across this nation, whether it's moving water and fuel.” Later that year evidence surfaced that Russian hackers had used tools to penetrate power stations (using Black Energy malware) and corrupted software updates of machinery that sat on electronically isolated (aka “air-gapped”) networks (using Havex malware). In mid-2018, DHS officials reported penetration by Russian hackers of the US electrical system by leveraging the phishing-acquired credentials of suppliers to electrical control systems; “They got to the point where they could have thrown switches” and disrupted power flows.[8] Iran has been credited with similar capabilities.[9] Some believe that “so many attackers have stowed away in the systems that run the US electric grid that experts say they likely have the capability to strike at will.”[10]\nIt is difficult to know what to make of these claims. The intelligence community keeps secrets for a living. Law enforcement rarely releases sensitive information before trials. Corporations seldom concede that they are victims of hackers, especially of hacks that produced no visible effects. Finding malware is not necessarily an indication of cyberattack, either. The malware could have drifted in from elsewhere. Stuxnet, for instance, appeared in over 100,000 systems outside the Natanz centrifuge plant. A compiler corrupted to produce malware-laden software for a specific supply-chain attack can compromise other software that is unknown to the hackers. While possible, it is quite difficult for hackers who cannot communicate with the malware to time an attack.\nAt least, claims of extant or impending cyberattacks can be refuted if given time. Anomalous indicators on an employee's laptop at the Burlington Electric Department were initially mistaken for a deliberate Russian hacking attempt on its electrical power grid.[11] That is reassuring to onlookers who remember the accusation, and then the retraction, but what if someone had acted irreversibly on the accusation, before it was retracted?\nMatters are foggier if attackers, rather than defenders, claim that implants were installed. In mid-2019, USCYBERCOM gave notice that it was installing implants into the Russian electric grid,[12] which the Russians denied,[13] claiming that such attacks were thwarted.[14] So, is the US capable of taking down the Russian electric grid (e.g. in retaliation for their doing likewise)?\nFinally, even if the fact of the disruption and attribution both are indisputable, the message intended by the disruption is subject to multiple interpretations. Consider the hacks of Ukraine's power grid.[15] The hack, according to Robert M. Lee and Mike Assante (both teach cybersecurity for SANS) was meant, “to stoke the ire of Ukrainian customers and weaken their trust in the Ukrainian power companies and government.” The article's author, citing Ukrainian sources, then adds that “[s]peculation has been rampant that the subsequent blackouts in Ukraine were retaliation for the attack on the Crimean substations.” Robert Lee was quoted later in the article considering the possibility that, “the attack on the Ukrainian power\nCYBERWAR IS WHAT STATES MAKE OF IT\ncompanies was a message to Ukrainian authorities not to pursue privatization,\" ultimately concluding the message to be: \"We want to be seen, and we want to send you a message ... oh, you think you can take away the power [in Crimea]? Well I can take away the power from you.\" Finally, an attack on the electric grid that caused modest effects could easily be portrayed as one that could have caused major effects but for self-restraint or error: the late 2016 cyberattack on Ukraine's electric grid opened circuit breakers that were closed an hour later, but analysis of the code suggested that the hackers sought to cause physical damage before power was restored but made several coding errors.[16] Oleksii Yasinksy, a Ukrainian cybersecurity researcher, believed the hackers \"could have knocked out Ukrenergo's transmission station for longer or caused permanent, physical harm to the grid, he says—a restraint that American analysts like Assante and Lee have also noted.\"[17]\nWhat can we draw from these examples? Based on the Venezuelan incident, one observer concluded, \"the inability to definitively discount US or other foreign intervention, whether deliberate or accidental, demonstrates the incredible power of using cyberattacks to target utilities.\"[18] But there is an alternative perspective: it demonstrates the profound impact such cyberattacks have on the public's imagination—which, when coupled with the difficulty of proving who did what and why—illustrates the power that mere claims of cyberattack have, either by the attacker or the attacked. There is a reason cyberspace events are mysterious. To paraphrase Ross Anderson[19]: airline safety has improved faster than cybersecurity because airplanes crash outside and, by so doing, create facts that cannot be waved away. But computers crash inside, which allows others to understate or overstate what actually took place.\n## Manipulating Information about Information War Itself is Information Warfare\nThe ease with which facts can be manipulated, given the ambiguities and obscurities of cyberspace, means that leaders will be tempted to do just that. Having examined the means of distorting the truth, it is important to understand some of the motives that would prompt such distortions. The degree of manipulation will depend on several variables, including the moral quality of a country's leaders, their ability to maintain a narrative at variance with facts, and the political context within which they operate.\nIn fairness, the ability to create misperceptions that vary with reality is often unequal. Transparency brings reality and perceptions closer together. So, the leeway of governments to fudge events will vary—directly or via proxies (e.g., power grid operators). Competition among private cybersecurity firms makes it more difficult to advance defensible claims. Conversely, exposure to public opinion creates a gap between perceptions and reality that may be unsupportable. Claims to expert authority are not taken as seriously as (we suppose) before. At least in the West, epistemic closure appears to be growing worse. Despite a clear consensus among the cybersecurity community that imaging servers suffices to understand a network intrusion, for instance, many who take their cues from the leaders they like believe\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nthat shipping servers to a foreign country is a way to hide false flag attacks (e.g., Ukrainians doing what Russians are blamed for).\nAdding to the discrepancy has been the tendency of some countries to separate their communications from the rest of the world. North Korea remains isolated. China's Great Firewall is a prime example of selective filtering. Iran is similar in this regard and is contemplating even more isolation.[20] Russia recently experimented with closing its Internet off from the rest of the world.[21] Early hopes that the Internet would bring the world together and that, in John Gilmore's words, \"The Net interprets censorship as damage and routes around it,\" look nostalgic. As Evgeny Morozov observed in *The Net Delusion: The Dark Side of Internet Freedom*,[22] authoritarian governments originally caught flat-footed by the Internet have learned how to control it and turn it to their purposes.\nBetween the facts that, for laypeople, cyberspace is opaque, and yet, the Internet can actually facilitate misperception over reality, the stage is set for states to make of events in cyberspace as they will.\nTo simplify the question, consider two players: the target and the attacker. The target has two basic choices: to play up the incident (even, perhaps especially, if no cyberattack were actually involved or no implant dropped), or to downplay it. The attacker has two basic choices as well, but is in a poor position vis-à-vis the target to argue about the effects of the cyberattack. Figuratively and literally, the target is there, and the attacker is not. But the attacker can either dispute or embrace attribution because the requisite evidence is something the attacker will have special knowledge of.[23]\nThe target can play up the cyberattack in many ways. Assuming there is something to work with (e.g., a blackout), it can be mischaracterized as an accident, human error, design flaw, as well as a cyberattack. As a variant, an accidental or inadvertent cyberattack can be characterized as deliberate and malicious.[24] A cyberattack with a weak effect could be touted as a bullet dodged, either because the hacker erred, or because the hacker was brandishing its capabilities and could have done worse if it wanted to. And, as noted, even if no cyberattack took place, some entity the target wants to malign could be accused of having planted malware \"discovered\" in the system. Attribution can also be played, largely because some cyberattacks are more embarrassing than others. An inside job can imply that an organization's employees are untrustworthy, or that the organization poorly vetted, and/or that its systems afforded others too many privileges. The victim of a state-backed hacker group can summon the misleading argument that a private company can no more defend its network against an army than it can defend its factory against one; falling to a criminal group is more blameworthy. Finally, if the adverse impact of the cyberattack is insufficient to meet the target's needed political narrative, the cyberattack can be cast as the beginning of a systematic campaign. With a little nerve, it can argue that it was the first shot in a kinetic war, thereby justifying the target's decision to\nSUMMER 2020 | 81\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nmobilize its society to fight. While an actual kinetic war may not happen, an action-reaction cycle could actually escalate into war. And if the war does not come, there's always the narrative that war would have come were it not for the target's raising the alarm and mobilizing (e.g., its own forces, the righteous anger of its citizenry, enraged world opinion) accordingly.\nThis litany of options illustrates why the target may play up a cyberattack. They help unify a country in the face of an adversary while distracting the polity from the government's mistakes. The mobilization of opinion helps governments institute repressive measures or raise taxes. Threats of cyberattacks may persuade the public to allow its government access to personal or organizational systems. Once governments are granted authority to surveil systems for malware or other evidence of intrusion, they can use such access to monitor unwanted activity by citizens. Accusations may create cover for the target's own aggressive acts, forcing concessions from the attacker, even if the incident is phony or exaggerated. It can warn third countries that war may be coming, thereby forcing alliances or other commitments. (Ironically, hyping a cyberattack could lower tensions by substituting conflict in cyberspace, which is unlikely to kill anyone, for more risky posturing in the physical world).\nThe most innocent explanation is that exaggerating the cyberspace threat will persuade many to take cybersecurity more seriously as they should have from the start (like Senator Arthur Vandenberg, who told President Truman public support for aid to Greece and Turkey against Communists required him to \"scare the hell out of the American people\"). But this rationale holds some paradox. If the point is to inspire confidence in the integrity of government processes – for instance, that voters can trust election results because they are protected – advertising their vulnerability to hacking may ultimately lead to trustworthy voting systems but, until then, will not produce trusted voting systems.\nThat logic is one of several reasons' leaders may be reluctant to play up cyberattacks. As a device for mobilizing popular opinion, cyberspace events may be too esoteric, incomprehensible, and removed from daily concerns to allow for galvanizing emotions. Unlike terrorism, cyberattacks more likely will engender anxiety and annoyance, on par with the prospect of a morning traffic jam. But if someone's literal viscera are not threatened, can cyberattacks induce the kind of visceral fear with the requisite political clout?\nReasons to downplay cyberattacks are not hard to find. Falling victim to cyberattacks is, as noted, embarrassing. Such catastrophes can be prevented either by diligent cybersecurity investments or through various forms of self-denial (e.g., closing systems to easy access by others, retaining less information, or prioritizing security over usability and flexibility). Because the point of government is providing security and reliability, admitting that it failed at that can be difficult.\nOther reasons for reticence may arise in strategy. Just as playing up cyberattacks may help mobilize citizens for confrontation, playing them down may allow governments to avoid\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nconfrontations they cannot win or at least can win only at great cost. Analogously, many in Europe were eager to accept Putin's assertion that Russia had no forces in Ukraine's east: \"[The West] connived in Mr. Putin's pretense that he had not invaded eastern Ukraine—even though in a furtive tricky way he plainly had—because to say otherwise would have required a drastic response.\"[25] Playing down attacks also signals insouciance. Thus, if its purpose is to goad the target into doing something rash (e.g., as the September 11th attacks may have been used by al-Qaeda to goad the US into Afghanistan) then downplaying that would translate as an insufficient pain threshold to merit response. Similarly, by refusing to admit to being hurt, a state conveys that it is not coerced and thus will not accede to whatever demands, be they explicit or implicit, are imposed by the attacker, and will itself be undeterred in pursuing its own ends.\nDenying attribution also obviates pressures on the target to respond, and also conveys, albeit weakly, that the cyberattack fell below some pain threshold. This allows the target state the option to determine later that they have enough confidence to respond. Conversely, an argument that the pain of cyberattack is limited can be undermined by the discovery of wider and deeper effects and rarely can be assigned by the reverse (much as death tolls can only go up as catastrophes are investigated). The same holds for characterization of near-attacks or failed-attacks. Earlier interpretations that they were not deliberate or carried out by incompetents can be credibly revisited.\nA last option is to cast doubt on any early facts, whether helpful or harmful. One reason may be to avoid prejudicing the investigation in the hopes of learning the real lessons for the incident. Another is to prevent the attacker (and would-be copycats) from receiving battle damage assessment so to speak, the better to perfect subsequent attacks.\nAs to attackers, they, like defenders, can play up or play down the consequences of the attack, its characterization, or its attribution. In practice, however, it is difficult for attackers to more credibly characterize the attack than the target, which has far greater access to information than the attacker. Indeed, the attacker often will have very little if any firsthand information. Reports, for instance, that the US successfully interfered with performance of North Korea's Musudan missile had to be left dangling because of the lack of any sure way to know whether the hack actually worked, or, even if it did work, was a decisive factor in subsequent launch failures.[26] The best the attacker can do is to argue that while the target may know better, its leaders often lie about what they know to be otherwise. It took two months after the public learned about Stuxnet for Iran to concede it had been hurt. Yet neither the US nor Israel officially claimed that the attacks succeeded.\nIn theory, matters are less clear. Attackers usually know better what they tried to do than do defenders; if the damage is subtle or only appears under certain circumstances, the attacker may know to look to telltale signs that its attacks worked, often leaving the defender oblivious to the attack. Subtle attacks also do not make the news, at least not until their impacts become visible.\nSUMMER 2020 | 83\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nThis leaves attribution as the attacker's primary lever. Countries generally do not acknowledge their cyberspace operations, even when so accused. This stands in contrast to acts of terrorism (at least pre-9/11), which were followed by multiple claimed terrorist group perpetrators. Many cyberattacks such as the 2012 attack on Saudi Aramco or the 2014 attack on Sony are claimed by groups: The Cutting Sword of Justice and the Guardians of the Peace, respectively. But these groups do not really exist as separate entities. The reasons to deny attribution are straightforward. Most accusations involve cyber espionage whose operators avoid—because the point is to work undetected—revealing their own capabilities and modus operandi.\nAs for the rarer instances of cyberattack, often the target knows the attacker's identity, while admitting as much opens the attacker to criticism and makes it hard for the attacker to, in turn, criticize incoming cyberattacks. For example, going back at least to the 1973 War, Israel's neighbors believed that Israel had nuclear weapons, thereby giving Israel the benefit of deterrence. Yet Israel strenuously denied having such weapons, to the point of even luring and then jailing Mordechai Vanunu, an Israeli who revealed as much to the British press in the 1980's.[27] Israel may well have calculated that open admission would have led third parties to push Israel to de-nuclearize, or to pressure neighboring countries to pursue their own nuclear weapons.\nStuxnet provides an interesting case in contrast. Neither the US nor Israel denied this cyberattack,[28] yet neither admitted it officially, at least at first. But at least some in each country wanted to take credit for it. In the US, former Vice Chairman of the JCS, General Cartwright, was accused to have been the source for David Sanger's articles on the hack. And a 2011 YouTube video captured Israel's Chief of Staff at his retirement party counting Stuxnet among his prominent achievements.[29] In 2016, an official Israeli document baldly stated, \"an example of an offensive cyber operation conducted by Israel is Stuxnet, which was jointly developed with the United States and targeted Iranian nuclear facilities.\"[30] Other governments have tried to have it both ways. Russia denied hacking the DNC in 2016, but its President called the hackers \"artists.\"[31] North Korea denied hacking Sony in 2014 but called it a \"righteous deed.\"[32]\nGenerally, hypocrisy—a tribute vice pays to virtue—rules. Given a choice between appearing great and appearing good, countries choose good. That is, they would rather talk up their fealty to international norms than overawe others with their cyberspace prowess. But for how long? As noted, the US did not seem to mind news stories that it had penetrated Russia's grid. In the summer of 2019, the US also indicated it was penetrating systems of those intruding against the US[33] (a.k.a. \"defending forward,\" or \"persistent engagement\"), and had countered Iran's shoot-down of a US drone with a cyberattack.[34] Might other countries follow? No country had (publicly, at least) established a cyberspace operations entity until the US formed USCYBERCOM. Many blushed at the thought of militarizing cyberspace until they—first allies, and then adversaries—followed suit. Whether other countries copy the trend\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nof taking credit not only for successes but also for operations more difficult to assess as successful depends on whether the aforementioned events of 2019 recur. This, in turn, depends on how much they reflected the character of the U.S. Administration at the time. But if such behavior becomes a trend, as opposed to a blip, other countries likely will follow suit in the years to come.\n# CONCLUSION\nIt has been said that the first casualty in war is truth. Today advances in technology and transparency as well as the professionalization of inquiry make it easier to determine the truth sooner rather than later. In this regard, cyberspace lags. Perhaps this should not be so—a fully imaged computer hard drive after a cyberattack leaves nowhere for anything to hide. But, in practice, there is often no third-party confirmation of a successful cyberattack, much less a failed cyberattack, or one partially completed (e.g., an implant). There is no easy equivalent in overhead imagery. And besides, matters once considered settled because of elite scientific consensus are increasingly open to question for a variety of causes (e.g., populism, the Internet's ability to support echo chambers, less influence of traditional media, epistemic closure).\nTrue facts of cyberwar are becoming secondary to misperceptions that governments either shape or influence. Increasingly, cyberwar is becoming what states make of it, and how they package it. That leaves, as open questions, what states will make of it. As argued, their options range in efficacy and persistence (in the face of subsequent revelations). The strategies states will employ will, of course, adapt to the circumstances. No hard projections can be made about what the games will look like, but games there will be.[35]\nSUMMER 2020 | 85\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT"
    },
    "numeric": {
      "total": {
        "intext_total": 33,
        "success_occurrences": 33,
        "success_unique": 33,
        "bib_unique_total": 35,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.9428571428571428,
        "success_percentage": 100.0,
        "style": "numeric"
      },
      "results": [
        {
          "index": "2",
          "intext_citation": "[2]",
          "preceding_text": "Disrupted public transportation left many unable to get to work. Looting ensued. Seventeen people died in hospitals for lack of electricity.",
          "footnote": "Description from Tom McKay, \"Maduro Says 'Multiple Cyberattacks' Backed by U.S. to Blame for Four Days of Widespread Blackouts,\" March 10, 2019; https://gizmodo.com/maduro-says-multiple-cyberattacks-backed-by-u-s-to-b-1833190542."
        },
        {
          "index": "3",
          "intext_citation": "[3]",
          "preceding_text": "He certainly had political reasons to mobilize his supporters against yet another delivered insult by the US, which has made no secret of its desire to see Maduro go.",
          "footnote": "When China's offer to help bolster the security of Venezuela's grid was rejected, even the Chinese were convinced that no such cyberattack had taken place."
        },
        {
          "index": "4",
          "intext_citation": "[4]",
          "preceding_text": "The CIA picked up and circulated this story within the intelligence community for two years before it was broadcast by Sixty Minutes in 2009.",
          "footnote": "This claim (without details) was made by the CIA's Tom Donahue (Thomas Claburn, \"CIA Admits Cyberattacks Blacked Out Cities,\" January 18, 2008; http://www.informationweek.com/cia-admits-cyberattacks-blacked-out-citi/205901631) and broadcast (with more details) by the CBS news show, \"Sixty Minutes\" on June 11, 2009 (http://www.cbsnews.com/news/cyber-war-sabotaging-the-system-06-11-2009/)."
        },
        {
          "index": "5",
          "intext_citation": "[5]",
          "preceding_text": "Once it was reported in the press, Brazil's government denied any such cyberattack, claiming the cause to be sooty insulators, resulting in a fine assessed against the relevant utility.",
          "footnote": "Marcelo Soares, \"Brazilian Blackout Traced to Sooty Insulators, Not Hackers\" November 9, 2009; http://www.wired.com/threatlevel/2009/11/brazil_blackout/."
        },
        {
          "index": "6",
          "intext_citation": "[6]",
          "preceding_text": "In 2009, The Wall Street Journal, with no evidence beyond \"intelligence\" sources, reported that Russia and China had done precisely that to the US grid.",
          "footnote": "Siobhan Gorman, \"Electricity Grid in U.S. Penetrated by Spies,\" *Wall Street Journal*, April 8, 2009, 1, http://www.wsj.com/articles/SB123914805204099085."
        },
        {
          "index": "7",
          "intext_citation": "[7]",
          "preceding_text": "Cyber Command (USCYBERCOM), testified",
          "footnote": "Ellen Nakashima, \"Foreign powers steal data on critical U.S. infrastructure, NSA chief says,\" November 20, 2014; http://www.washingtonpost.com/world/national-security/nsa-chief-foreign-powers-steal-data-on-critical-us-infrastructure/2014/11/20/ddd4392e-70cb-11e4-893f-86bd390a3340_story.html."
        },
        {
          "index": "8",
          "intext_citation": "[8]",
          "preceding_text": "ian hackers of the US electrical system by leveraging the phishing-acquired credentials of suppliers to electrical control systems; “They got to the point where they could have thrown switches” and disrupted power flows.",
          "footnote": "Rebecca Smith, \"Russian Hackers Reach U.S. Utility Control Rooms, Homeland Security Officials Say,\" July 23, 2018; https://www.wsj.com/articles/russian-hackers-reach-u-s-utility-control-rooms-homeland-security-officials-say-1532388110 and Colleen Long, \"Russian hackers used phishing tools in 2017 attack on grid, July 26, 2018; https://www.apnews.com/2c17bda4ac704df6be66018197f29912."
        },
        {
          "index": "9",
          "intext_citation": "[9]",
          "preceding_text": "the phishing-acquired credentials of suppliers to electrical control systems; “They got to the point where they could have thrown switches” and disrupted power flows.[8] Iran has been credited with similar capabilities.",
          "footnote": "Courtney Kube, Carol E. Lee, Dan De Luce and Ken Dilanian, \"Iran has laid groundwork for extensive cyberattacks on U.S., say officials,\" July 20, 2018; https://www.nbcnews.com/news/us-news/iran-has-laid-groundwork-extensive-cyberattacks-u-s-say-officials-n893081. See also Andy Greenberg, \"The Highly Dangerous 'Triton' Hackers have Probed the US Grid,\" June 14, 2019; https://www.wired.com/story/triton-hackers-scan-us-power-grid/."
        },
        {
          "index": "10",
          "intext_citation": "[10]",
          "preceding_text": "Iran has been credited with similar capabilities.[9] Some believe that “so many attackers have stowed away in the systems that run the US electric grid that experts say they likely have the capability to strike at will.”",
          "footnote": "Garance Burke and Jonathan Fahey, \"Iranian hackers breached US power grid to engineer blackouts,\" December 22, 2015; https://https://apnews.com/79f0c976364b4c9dad12c44bba4ccc88. See also Sue Halpern, \"Should the U.S. Expect an Iranian Cyberattack,\" January 6, 2010; https://www.newyorker.com/tech/annals-of-technology/should-the-us-expect-an-iranian-cyberattack."
        },
        {
          "index": "11",
          "intext_citation": "[11]",
          "preceding_text": "Anomalous indicators on an employee's laptop at the Burlington Electric Department were initially mistaken for a deliberate Russian hacking attempt on its electrical power grid.",
          "footnote": "Ellen Nakashima and Juliet Eilperin, \"Russian government hackers do not appear to have targeted Vermont utility, say people close to investigation,\" January 2, 2017; https://www.washingtonpost.com/world/national-security/russian-government-hackers-do-not-appear-to-have-targeted-vermont-utility-say-people-close-to-investigation/2017/01/02/70c25956-d12c-11e6-945a-76f69a399dd5_story.html."
        },
        {
          "index": "12",
          "intext_citation": "[12]",
          "preceding_text": "Matters are foggier if attackers, rather than defenders, claim that implants were installed. In mid-2019, USCYBERCOM gave notice that it was installing implants into the Russian electric grid,",
          "footnote": "David Sanger and Nicole Perlroth, \"U.S. Escalates Online Attacks on Russia's Power Grid,\" June 15, 2019; https://www.nytimes.com/2019/06/15/us/politics/trump-cyber-russia-grid.html."
        },
        {
          "index": "13",
          "intext_citation": "[13]",
          "preceding_text": "In mid-2019, USCYBERCOM gave notice that it was installing implants into the Russian electric grid,[12] which the Russians denied,",
          "footnote": "Ivan Nechepurenko, \"Kremlin Warns of Cyberwar After Report of U.S. Hacking Into Russian Power Grid,\" June 17, 2019; https://www.nytimes.com/2019/06/17/world/europe/russia-us-cyberwar-grid.html."
        },
        {
          "index": "14",
          "intext_citation": "[14]",
          "preceding_text": "In mid-2019, USCYBERCOM gave notice that it was installing implants into the Russian electric grid,[12] which the Russians denied,[13] claiming that such attacks were thwarted.",
          "footnote": "Reuters, \"Russia thwarts U.S. cyber attacks on its infrastructure: news agencies,\" June 17, 2019; https://www.reuters.com/article/us-usa-russia-cyber-russia/russia-thwarts-u-s-cyber-attacks-on-its-infrastructure-news-agencies-idUSKCNITI1U0."
        },
        {
          "index": "15",
          "intext_citation": "[15]",
          "preceding_text": "Consider the hacks of Ukraine's power grid.",
          "footnote": "Kim Zetter, \"Inside the Cunning, Unprecedented Hack of Ukraine's Power Grid,\" March 3, 2016; http://www.wired.com/2016/03/inside-cunning-unprecedented-hack-ukraines-power-grid/."
        },
        {
          "index": "16",
          "intext_citation": "[16]",
          "preceding_text": "kraine's electric grid opened circuit breakers that were closed an hour later, but analysis of the code suggested that the hackers sought to cause physical damage before power was restored but made several coding errors.",
          "footnote": "Joe Slowik, \"CRASHOVERRIDE: Reassessing the 2016 Ukraine Electric Power Event as a Protection-Focused Attack,\" August 15, 2019; https://dragos.com/wp-content/uploads/CRASHOVERRIDE.pdf."
        },
        {
          "index": "17",
          "intext_citation": "[17]",
          "preceding_text": ", believed the hackers \"could have knocked out Ukrenergo's transmission station for longer or caused permanent, physical harm to the grid, he says—a restraint that American analysts like Assante and Lee have also noted.\"",
          "footnote": "Andy Greenberg, \"How an Entire Nation Became Russia's Test Lab for Cyberwar,\" June 20, 2017; https://www.wired.com/story/russian-hackers-attack-ukraine/."
        },
        {
          "index": "18",
          "intext_citation": "[18]",
          "preceding_text": "incident, one observer concluded, \"the inability to definitively discount US or other foreign intervention, whether deliberate or accidental, demonstrates the incredible power of using cyberattacks to target utilities.\"",
          "footnote": "From Kalev Leetaru, \"Could Venezuela's Power Outage Really Be A Cyber Attack?,\" March 9, 2019; https://www.forbes.com/sites/kalevleetaru/2019/03/09/could-venezuelas-power-outage-really-be-a-cyber-attack/#34e80b4e607c. THE CYBER DEFENSE REVIEW This content downloaded from"
        },
        {
          "index": "19",
          "intext_citation": "[19]",
          "preceding_text": "There is a reason cyberspace events are mysterious. To paraphrase Ross Anderson",
          "footnote": "My interpretation of an argument on the first page of Ross Anderson, \"Why Cryptosystems Fail,\" 1993, https://www.cl.cam.ac.uk/~rja14/Papers/wcf.pdf."
        },
        {
          "index": "20",
          "intext_citation": "[20]",
          "preceding_text": "North Korea remains isolated. China's Great Firewall is a prime example of selective filtering. Iran is similar in this regard and is contemplating even more isolation.",
          "footnote": "See, for example, Behrang Tajdin, \"Iran letter raises prospect of 'white list' internet clampdown,\" November 26, 2019; https://www.bbc.com/news/technology-50563917."
        },
        {
          "index": "21",
          "intext_citation": "[21]",
          "preceding_text": "Iran is similar in this regard and is contemplating even more isolation.[20] Russia recently experimented with closing its Internet off from the rest of the world.",
          "footnote": "Catalin Cimpanu, \"Russia successfully disconnected from the internet,\" December 23, 2019; https://www.zdnet.com/article/russia-successfully-disconnected-from-the-internet/."
        },
        {
          "index": "22",
          "intext_citation": "[22]",
          "preceding_text": "As Evgeny Morozov observed in *The Net Delusion: The Dark Side of Internet Freedom*,",
          "footnote": "New York, USA: Public Affairs, 2011."
        },
        {
          "index": "23",
          "intext_citation": "[23]",
          "preceding_text": "But the attacker can either dispute or embrace attribution because the requisite evidence is something the attacker will have special knowledge of.",
          "footnote": "Notionally, if the attacker supports multiple, albeit uncooperative, threat actor groups, or when multiple states attack, the target's knowledge may be incomplete. Practically, this is rare to nonexistent."
        },
        {
          "index": "24",
          "intext_citation": "[24]",
          "preceding_text": "As a variant, an accidental or inadvertent cyberattack can be characterized as deliberate and malicious.",
          "footnote": "Some consider this plausible. In 2008, a National Journal story quoted unnamed intelligence sources to argue that a hacker trying to map Florida Power &amp; light, \"got carried away and had a 'what happens if I pull on this' moment ... [and] triggered a cascade effect, shutting down large portions of the Florida power grid\". The outage was later ascribed to human error. See Shane Harris, \"China's Cyber Militia,\" National Journal Magazine, May 31, 2008, http://www.nationaljournal.com/magazine/china-s-cyber-militia-20080531."
        },
        {
          "index": "25",
          "intext_citation": "[25]",
          "preceding_text": "Putin's pretense that he had not invaded eastern Ukraine—even though in a furtive tricky way he plainly had—because to say otherwise would have required a drastic response.\"",
          "footnote": "From Economist, \"The Siege,\" July 12, 2014, http://www.economist.com/news/leaders/21606831-believing-vladimir-putin-has-surrendered-ukraine-would-be-naive-west-must-keep-up."
        },
        {
          "index": "26",
          "intext_citation": "[26]",
          "preceding_text": "ormance of North Korea's Musudan missile had to be left dangling because of the lack of any sure way to know whether the hack actually worked, or, even if it did work, was a decisive factor in subsequent launch failures.",
          "footnote": "David Sanger and William Broad, \"Trump Inherits a Secret Cyberwar Against North Korean Missiles,\" March 4, 2017; https://www.nytimes.com/2017/03/04/world/asia/north-korea-missile-program-sabotage.html."
        },
        {
          "index": "27",
          "intext_citation": "[27]",
          "preceding_text": "Yet Israel strenuously denied having such weapons, to the point of even luring and then jailing Mordechai Vanunu, an Israeli who revealed as much to the British press in the 1980's.",
          "footnote": "But see Conrad Duncan, \"Netanyahu calls Israel a 'nuclear power' before correcting himself in apparent slip of the tongue,\" January 6, 2020; https://www.independent.co.uk/news/world/middle-east/netanyahu-israel-nuclear-power-weapons-iran-crisis-trump-a9272086.html."
        },
        {
          "index": "28",
          "intext_citation": "[28]",
          "preceding_text": "Stuxnet provides an interesting case in contrast. Neither the US nor Israel denied this cyberattack,",
          "footnote": "See, for instance, Deputy Secretary of Defense Lynn's non-answer in Kim Zetter, \"Senior Defense Official Caught Hedging on U.S. Involvement in Stuxnet,\" Wired, May 26, 2011, http://www.wired.com/threatlevel/2011/05/defense-department-stuxnet/."
        },
        {
          "index": "29",
          "intext_citation": "[29]",
          "preceding_text": "And a 2011 YouTube video captured Israel's Chief of Staff at his retirement party counting Stuxnet among his prominent achievements.",
          "footnote": "Christopher Williams, \"Israeli security chief celebrates Stuxnet cyber attack\" February 16, 2011; http://www.telegraph.co.uk/technology/news/8326274/Israeli-security-chief-celebrates-Stuxnet-cyberattack.html and William Jacobson, \"Did Israel Just Admit to Creating Stuxnet?\", February 15, 2011; http://legalinsurrection.com/2011/02/did-israeli-just-admit-to-creating-stuxnet/."
        },
        {
          "index": "30",
          "intext_citation": "[30]",
          "preceding_text": "n 2016, an official Israeli document baldly stated, \"an example of an offensive cyber operation conducted by Israel is Stuxnet, which was jointly developed with the United States and targeted Iranian nuclear facilities.\"",
          "footnote": "\"Deterring Terror: English Translation of the Official Strategy of the Israel Defense Forces,\" Belfer Center Special Report of August 2016; http://www.belfercenter.org/publication/israeli-defense-forces-defense-doctrine-english-translation, 48."
        },
        {
          "index": "31",
          "intext_citation": "[31]",
          "preceding_text": "Russia denied hacking the DNC in 2016, but its President called the hackers \"artists.\"",
          "footnote": "See Andrew Higgins, \"Maybe Private Russian Hackers Meddled in Election, Putin Says,\" June 1, 2017; https://www.nytimes.com/2017/06/01/world/europe/vladimir-putin-donald-trump-hacking.html."
        },
        {
          "index": "32",
          "intext_citation": "[32]",
          "preceding_text": "Russia denied hacking the DNC in 2016, but its President called the hackers \"artists.\"[31] North Korea denied hacking Sony in 2014 but called it a \"righteous deed.\"",
          "footnote": "Choe Sang-Hundec, \"North Korea Denies Role in Sony Pictures Hacking,\" New York Times, December 7, 2014, http://www.nytimes.com/2014/12/08/business/north-korea-denies-hacking-sony-but-calls-attack-a-righteous-deed.html."
        },
        {
          "index": "33",
          "intext_citation": "[33]",
          "preceding_text": "As noted, the US did not seem to mind news stories that it had penetrated Russia's grid. In the summer of 2019, the US also indicated it was penetrating systems of those intruding against the US",
          "footnote": "Ellen Nakashima, \"U.S. Cyber Command operation disrupted Internet access of Russian troll factory on day of 2018 midterms,\" February 27, 2019; https://www.whitehouse.gov/presidential-actions/presidentexecutive-order-strengthening-cybersecurity-federal-networks-critical-infrastructure/."
        },
        {
          "index": "34",
          "intext_citation": "[34]",
          "preceding_text": "\"defending forward,\" or \"persistent engagement\"), and had countered Iran's shoot-down of a US drone with a cyberattack.",
          "footnote": "AFP, \"US launched cyber attacks on Iran after drone shootdown: reports,\" June 22, 2019; https://news.yahoo.com/us-launched-cyber-attacks-iran-drone-shootdown-reports-232123877.html. SUMMER 2020 | 87 This content downloaded from"
        }
      ],
      "flat_text": "# THE CYBER DEFENSE REVIEW\nCyberwar is What States Make of ItAuthor(s): Martin Libicki\nSource: The Cyber Defense Review, Vol. 5, No. 2, Special Edition: Information Operations/Information Warfare (SUMMER 2020), pp. 77-88\nPublished by: Army Cyber Institute\nStable URL: https://www.jstor.org/stable/10.2307/26923524\n## REFERENCES\nLinked references are available on JSTOR for this article: https://www.jstor.org/stable/10.2307/26923524?seq=1&amp;cid=pdf-reference#references_tab_contents\nYou may need to log in to JSTOR to access the linked references.\nJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms\nArmy Cyber Institute is collaborating with JSTOR to digitize, preserve and extend access to The Cyber Defense Review\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n# THE CYBER DEFENSE REVIEW\n* RESEARCH ARTICLES *\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n# Cyberwar is What States Make of It\nDr. Martin Libicki\nNo one there at the time could forget the vicious cyberattack on Venezuela's power systems in March 2019. Four days of chaos ensued. Stores and restaurants closed. Card payments systems were down, with customers asked to pay in dollars. Disrupted public transportation left many unable to get to work. Looting ensued. Seventeen people died in hospitals for lack of electricity.\nWait, some of you may be thinking: what cyberattack? There is no question that Venezuela's grid had serious problems, but the only evidence that a cyberattack caused these problems was the word of President Maduro. He certainly had political reasons to mobilize his supporters against yet another delivered insult by the US, which has made no secret of its desire to see Maduro go. More likely, the power outage reflected the same dysfunctional energy facilities that reduced the average daily oil production rate from nearly 2.5 million barrels in 2015, to a third of that in 2019.\nBrazil can tell a similar tale of woe. In 2007, hackers attacked the grid of the state of Rio Grande do Sul, causing severe power outages. The CIA picked up and circulated this story within the intelligence community for two years before it was broadcast by Sixty Minutes in 2009. Or was it a cyberattack? Once it was reported in the press, Brazil's government denied any such cyberattack, claiming the cause to be sooty insulators, resulting in a fine assessed against the relevant utility. So, end of the story? Not necessarily, argue two of the savvier observers on the cyberwar scene (one American and one Israeli); there were known groups that had both an interest in, and a talent for cyberspace mischief, and the government of Brazil would have been embarrassed to admit their success.\nThis is a work of the U.S. Government and is not subject to copyright protection in the United States. Foreign copyrights may apply.\nSUMMER 2020\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nDr. Martin C. Libicki (Ph.D., U.C. Berkeley 1978) is the MaryEllen and Richard Keyser Chair of Cybersecurity at the U.S. Naval Academy where he teaches cyberwar strategy and cyberspace economics. Prior employment includes having been a senior management scientist at RAND since 1998, focusing on the impacts of information technology on domestic and national security. He wrote three commercially published books: Cyberspace in Peace and War (2016, second edition forthcoming), Conquest in Cyberspace: National Security and Information Warfare (2007), and Information Technology Standards (1994). He is also the author of numerous RAND monographs, notably Defender's Dilemma, Brandishing Cyberattack Capabilities, Crisis and Escalation in Cyberspace, Global Demographic Change and its Implications for Military Power, Cyberdeterrence and Cyberwar, How Insurgencies End (with Ben Connable), and How Terrorist Groups End (with Seth Jones). Prior employment includes 12 years at the National Defense University, three years on the Navy Staff as program sponsor for industrial preparedness, and three years for the GAO.\nIf attacks on the power grid can be faked or hidden, imagine what can be done with other mischief in cyberspace. Cyber-espionage can go undetected for years. Withdrawals from bank accounts can be covered by funds transfers from the embarrassed bank (albeit not legally in many countries). Induced failures in police or intelligence systems may not make the news if such systems are themselves unknown to the public. By contrast, there is no hiding when it is the lights that go out. Nevertheless, the fact of a power outage does not prove that a cyberattack caused it—and, while the power company might know, they may not say or be encouraged or even allowed to speak. And, even if a cyberattack is established, attribution can still be an issue.\nSo far, the only verified cases of electric power loss caused by hacking occurred in Ukraine: two separate incidents in late 2015 and late 2016. But just as the existence of nuclear weapons—even though none have been detonated in war since 1945—has dramatically influenced the security choices of the US, Russia, and China, an imminent threat to knockout electric power could shape future crises. Targeted countries could be coerced or alternatively, they could try to pre-empt attackers by doing likewise. The most frequently discussed way to convert the threat to the electric grid from a notional to a real possibility is to implant malware into the other side's industrial control systems (as distinct from their office and billing systems). Such implants have been likened to Soviet moves to put intermediate-range nuclear-tipped missiles in Cuba, thereby tripling their capacity to strike the US.\nSo, have countries implanted malware in other countries' electric grids? In 2009, The Wall Street Journal, with no evidence beyond \"intelligence\" sources, reported that Russia and China had done precisely that to the US grid.\nIn late 2014, Admiral Michael Rogers, Commander, U.S. Cyber Command (USCYBERCOM), testified that,\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n“there are nation-states and groups out there that have the capability ... to shut down, forestall our ability to operate our basic infrastructure, whether it's generating power across this nation, whether it's moving water and fuel.” Later that year evidence surfaced that Russian hackers had used tools to penetrate power stations (using Black Energy malware) and corrupted software updates of machinery that sat on electronically isolated (aka “air-gapped”) networks (using Havex malware). In mid-2018, DHS officials reported penetration by Russian hackers of the US electrical system by leveraging the phishing-acquired credentials of suppliers to electrical control systems; “They got to the point where they could have thrown switches” and disrupted power flows. Iran has been credited with similar capabilities. Some believe that “so many attackers have stowed away in the systems that run the US electric grid that experts say they likely have the capability to strike at will.”\nIt is difficult to know what to make of these claims. The intelligence community keeps secrets for a living. Law enforcement rarely releases sensitive information before trials. Corporations seldom concede that they are victims of hackers, especially of hacks that produced no visible effects. Finding malware is not necessarily an indication of cyberattack, either. The malware could have drifted in from elsewhere. Stuxnet, for instance, appeared in over 100,000 systems outside the Natanz centrifuge plant. A compiler corrupted to produce malware-laden software for a specific supply-chain attack can compromise other software that is unknown to the hackers. While possible, it is quite difficult for hackers who cannot communicate with the malware to time an attack.\nAt least, claims of extant or impending cyberattacks can be refuted if given time. Anomalous indicators on an employee's laptop at the Burlington Electric Department were initially mistaken for a deliberate Russian hacking attempt on its electrical power grid. That is reassuring to onlookers who remember the accusation, and then the retraction, but what if someone had acted irreversibly on the accusation, before it was retracted?\nMatters are foggier if attackers, rather than defenders, claim that implants were installed. In mid-2019, USCYBERCOM gave notice that it was installing implants into the Russian electric grid, which the Russians denied, claiming that such attacks were thwarted. So, is the US capable of taking down the Russian electric grid (e.g. in retaliation for their doing likewise)?\nFinally, even if the fact of the disruption and attribution both are indisputable, the message intended by the disruption is subject to multiple interpretations. Consider the hacks of Ukraine's power grid. The hack, according to Robert M. Lee and Mike Assante (both teach cybersecurity for SANS) was meant, “to stoke the ire of Ukrainian customers and weaken their trust in the Ukrainian power companies and government.” The article's author, citing Ukrainian sources, then adds that “[s]peculation has been rampant that the subsequent blackouts in Ukraine were retaliation for the attack on the Crimean substations.” Robert Lee was quoted later in the article considering the possibility that, “the attack on the Ukrainian power\nCYBERWAR IS WHAT STATES MAKE OF IT\ncompanies was a message to Ukrainian authorities not to pursue privatization,\" ultimately concluding the message to be: \"We want to be seen, and we want to send you a message ... oh, you think you can take away the power [in Crimea]? Well I can take away the power from you.\" Finally, an attack on the electric grid that caused modest effects could easily be portrayed as one that could have caused major effects but for self-restraint or error: the late 2016 cyberattack on Ukraine's electric grid opened circuit breakers that were closed an hour later, but analysis of the code suggested that the hackers sought to cause physical damage before power was restored but made several coding errors. Oleksii Yasinksy, a Ukrainian cybersecurity researcher, believed the hackers \"could have knocked out Ukrenergo's transmission station for longer or caused permanent, physical harm to the grid, he says—a restraint that American analysts like Assante and Lee have also noted.\"\nWhat can we draw from these examples? Based on the Venezuelan incident, one observer concluded, \"the inability to definitively discount US or other foreign intervention, whether deliberate or accidental, demonstrates the incredible power of using cyberattacks to target utilities.\" But there is an alternative perspective: it demonstrates the profound impact such cyberattacks have on the public's imagination—which, when coupled with the difficulty of proving who did what and why—illustrates the power that mere claims of cyberattack have, either by the attacker or the attacked. There is a reason cyberspace events are mysterious. To paraphrase Ross Anderson: airline safety has improved faster than cybersecurity because airplanes crash outside and, by so doing, create facts that cannot be waved away. But computers crash inside, which allows others to understate or overstate what actually took place.\n## Manipulating Information about Information War Itself is Information Warfare\nThe ease with which facts can be manipulated, given the ambiguities and obscurities of cyberspace, means that leaders will be tempted to do just that. Having examined the means of distorting the truth, it is important to understand some of the motives that would prompt such distortions. The degree of manipulation will depend on several variables, including the moral quality of a country's leaders, their ability to maintain a narrative at variance with facts, and the political context within which they operate.\nIn fairness, the ability to create misperceptions that vary with reality is often unequal. Transparency brings reality and perceptions closer together. So, the leeway of governments to fudge events will vary—directly or via proxies (e.g., power grid operators). Competition among private cybersecurity firms makes it more difficult to advance defensible claims. Conversely, exposure to public opinion creates a gap between perceptions and reality that may be unsupportable. Claims to expert authority are not taken as seriously as (we suppose) before. At least in the West, epistemic closure appears to be growing worse. Despite a clear consensus among the cybersecurity community that imaging servers suffices to understand a network intrusion, for instance, many who take their cues from the leaders they like believe\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nthat shipping servers to a foreign country is a way to hide false flag attacks (e.g., Ukrainians doing what Russians are blamed for).\nAdding to the discrepancy has been the tendency of some countries to separate their communications from the rest of the world. North Korea remains isolated. China's Great Firewall is a prime example of selective filtering. Iran is similar in this regard and is contemplating even more isolation. Russia recently experimented with closing its Internet off from the rest of the world. Early hopes that the Internet would bring the world together and that, in John Gilmore's words, \"The Net interprets censorship as damage and routes around it,\" look nostalgic. As Evgeny Morozov observed in *The Net Delusion: The Dark Side of Internet Freedom*, authoritarian governments originally caught flat-footed by the Internet have learned how to control it and turn it to their purposes.\nBetween the facts that, for laypeople, cyberspace is opaque, and yet, the Internet can actually facilitate misperception over reality, the stage is set for states to make of events in cyberspace as they will.\nTo simplify the question, consider two players: the target and the attacker. The target has two basic choices: to play up the incident (even, perhaps especially, if no cyberattack were actually involved or no implant dropped), or to downplay it. The attacker has two basic choices as well, but is in a poor position vis-à-vis the target to argue about the effects of the cyberattack. Figuratively and literally, the target is there, and the attacker is not. But the attacker can either dispute or embrace attribution because the requisite evidence is something the attacker will have special knowledge of.\nThe target can play up the cyberattack in many ways. Assuming there is something to work with (e.g., a blackout), it can be mischaracterized as an accident, human error, design flaw, as well as a cyberattack. As a variant, an accidental or inadvertent cyberattack can be characterized as deliberate and malicious. A cyberattack with a weak effect could be touted as a bullet dodged, either because the hacker erred, or because the hacker was brandishing its capabilities and could have done worse if it wanted to. And, as noted, even if no cyberattack took place, some entity the target wants to malign could be accused of having planted malware \"discovered\" in the system. Attribution can also be played, largely because some cyberattacks are more embarrassing than others. An inside job can imply that an organization's employees are untrustworthy, or that the organization poorly vetted, and/or that its systems afforded others too many privileges. The victim of a state-backed hacker group can summon the misleading argument that a private company can no more defend its network against an army than it can defend its factory against one; falling to a criminal group is more blameworthy. Finally, if the adverse impact of the cyberattack is insufficient to meet the target's needed political narrative, the cyberattack can be cast as the beginning of a systematic campaign. With a little nerve, it can argue that it was the first shot in a kinetic war, thereby justifying the target's decision to\nSUMMER 2020 | 81\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nmobilize its society to fight. While an actual kinetic war may not happen, an action-reaction cycle could actually escalate into war. And if the war does not come, there's always the narrative that war would have come were it not for the target's raising the alarm and mobilizing (e.g., its own forces, the righteous anger of its citizenry, enraged world opinion) accordingly.\nThis litany of options illustrates why the target may play up a cyberattack. They help unify a country in the face of an adversary while distracting the polity from the government's mistakes. The mobilization of opinion helps governments institute repressive measures or raise taxes. Threats of cyberattacks may persuade the public to allow its government access to personal or organizational systems. Once governments are granted authority to surveil systems for malware or other evidence of intrusion, they can use such access to monitor unwanted activity by citizens. Accusations may create cover for the target's own aggressive acts, forcing concessions from the attacker, even if the incident is phony or exaggerated. It can warn third countries that war may be coming, thereby forcing alliances or other commitments. (Ironically, hyping a cyberattack could lower tensions by substituting conflict in cyberspace, which is unlikely to kill anyone, for more risky posturing in the physical world).\nThe most innocent explanation is that exaggerating the cyberspace threat will persuade many to take cybersecurity more seriously as they should have from the start (like Senator Arthur Vandenberg, who told President Truman public support for aid to Greece and Turkey against Communists required him to \"scare the hell out of the American people\"). But this rationale holds some paradox. If the point is to inspire confidence in the integrity of government processes – for instance, that voters can trust election results because they are protected – advertising their vulnerability to hacking may ultimately lead to trustworthy voting systems but, until then, will not produce trusted voting systems.\nThat logic is one of several reasons' leaders may be reluctant to play up cyberattacks. As a device for mobilizing popular opinion, cyberspace events may be too esoteric, incomprehensible, and removed from daily concerns to allow for galvanizing emotions. Unlike terrorism, cyberattacks more likely will engender anxiety and annoyance, on par with the prospect of a morning traffic jam. But if someone's literal viscera are not threatened, can cyberattacks induce the kind of visceral fear with the requisite political clout?\nReasons to downplay cyberattacks are not hard to find. Falling victim to cyberattacks is, as noted, embarrassing. Such catastrophes can be prevented either by diligent cybersecurity investments or through various forms of self-denial (e.g., closing systems to easy access by others, retaining less information, or prioritizing security over usability and flexibility). Because the point of government is providing security and reliability, admitting that it failed at that can be difficult.\nOther reasons for reticence may arise in strategy. Just as playing up cyberattacks may help mobilize citizens for confrontation, playing them down may allow governments to avoid\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nconfrontations they cannot win or at least can win only at great cost. Analogously, many in Europe were eager to accept Putin's assertion that Russia had no forces in Ukraine's east: \"[The West] connived in Mr. Putin's pretense that he had not invaded eastern Ukraine—even though in a furtive tricky way he plainly had—because to say otherwise would have required a drastic response.\" Playing down attacks also signals insouciance. Thus, if its purpose is to goad the target into doing something rash (e.g., as the September 11th attacks may have been used by al-Qaeda to goad the US into Afghanistan) then downplaying that would translate as an insufficient pain threshold to merit response. Similarly, by refusing to admit to being hurt, a state conveys that it is not coerced and thus will not accede to whatever demands, be they explicit or implicit, are imposed by the attacker, and will itself be undeterred in pursuing its own ends.\nDenying attribution also obviates pressures on the target to respond, and also conveys, albeit weakly, that the cyberattack fell below some pain threshold. This allows the target state the option to determine later that they have enough confidence to respond. Conversely, an argument that the pain of cyberattack is limited can be undermined by the discovery of wider and deeper effects and rarely can be assigned by the reverse (much as death tolls can only go up as catastrophes are investigated). The same holds for characterization of near-attacks or failed-attacks. Earlier interpretations that they were not deliberate or carried out by incompetents can be credibly revisited.\nA last option is to cast doubt on any early facts, whether helpful or harmful. One reason may be to avoid prejudicing the investigation in the hopes of learning the real lessons for the incident. Another is to prevent the attacker (and would-be copycats) from receiving battle damage assessment so to speak, the better to perfect subsequent attacks.\nAs to attackers, they, like defenders, can play up or play down the consequences of the attack, its characterization, or its attribution. In practice, however, it is difficult for attackers to more credibly characterize the attack than the target, which has far greater access to information than the attacker. Indeed, the attacker often will have very little if any firsthand information. Reports, for instance, that the US successfully interfered with performance of North Korea's Musudan missile had to be left dangling because of the lack of any sure way to know whether the hack actually worked, or, even if it did work, was a decisive factor in subsequent launch failures. The best the attacker can do is to argue that while the target may know better, its leaders often lie about what they know to be otherwise. It took two months after the public learned about Stuxnet for Iran to concede it had been hurt. Yet neither the US nor Israel officially claimed that the attacks succeeded.\nIn theory, matters are less clear. Attackers usually know better what they tried to do than do defenders; if the damage is subtle or only appears under certain circumstances, the attacker may know to look to telltale signs that its attacks worked, often leaving the defender oblivious to the attack. Subtle attacks also do not make the news, at least not until their impacts become visible.\nSUMMER 2020 | 83\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nThis leaves attribution as the attacker's primary lever. Countries generally do not acknowledge their cyberspace operations, even when so accused. This stands in contrast to acts of terrorism (at least pre-9/11), which were followed by multiple claimed terrorist group perpetrators. Many cyberattacks such as the 2012 attack on Saudi Aramco or the 2014 attack on Sony are claimed by groups: The Cutting Sword of Justice and the Guardians of the Peace, respectively. But these groups do not really exist as separate entities. The reasons to deny attribution are straightforward. Most accusations involve cyber espionage whose operators avoid—because the point is to work undetected—revealing their own capabilities and modus operandi.\nAs for the rarer instances of cyberattack, often the target knows the attacker's identity, while admitting as much opens the attacker to criticism and makes it hard for the attacker to, in turn, criticize incoming cyberattacks. For example, going back at least to the 1973 War, Israel's neighbors believed that Israel had nuclear weapons, thereby giving Israel the benefit of deterrence. Yet Israel strenuously denied having such weapons, to the point of even luring and then jailing Mordechai Vanunu, an Israeli who revealed as much to the British press in the 1980's. Israel may well have calculated that open admission would have led third parties to push Israel to de-nuclearize, or to pressure neighboring countries to pursue their own nuclear weapons.\nStuxnet provides an interesting case in contrast. Neither the US nor Israel denied this cyberattack, yet neither admitted it officially, at least at first. But at least some in each country wanted to take credit for it. In the US, former Vice Chairman of the JCS, General Cartwright, was accused to have been the source for David Sanger's articles on the hack. And a 2011 YouTube video captured Israel's Chief of Staff at his retirement party counting Stuxnet among his prominent achievements. In 2016, an official Israeli document baldly stated, \"an example of an offensive cyber operation conducted by Israel is Stuxnet, which was jointly developed with the United States and targeted Iranian nuclear facilities.\" Other governments have tried to have it both ways. Russia denied hacking the DNC in 2016, but its President called the hackers \"artists.\" North Korea denied hacking Sony in 2014 but called it a \"righteous deed.\"\nGenerally, hypocrisy—a tribute vice pays to virtue—rules. Given a choice between appearing great and appearing good, countries choose good. That is, they would rather talk up their fealty to international norms than overawe others with their cyberspace prowess. But for how long? As noted, the US did not seem to mind news stories that it had penetrated Russia's grid. In the summer of 2019, the US also indicated it was penetrating systems of those intruding against the US (a.k.a. \"defending forward,\" or \"persistent engagement\"), and had countered Iran's shoot-down of a US drone with a cyberattack. Might other countries follow? No country had (publicly, at least) established a cyberspace operations entity until the US formed USCYBERCOM. Many blushed at the thought of militarizing cyberspace until they—first allies, and then adversaries—followed suit. Whether other countries copy the trend\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nof taking credit not only for successes but also for operations more difficult to assess as successful depends on whether the aforementioned events of 2019 recur. This, in turn, depends on how much they reflected the character of the U.S. Administration at the time. But if such behavior becomes a trend, as opposed to a blip, other countries likely will follow suit in the years to come.\n# CONCLUSION\nIt has been said that the first casualty in war is truth. Today advances in technology and transparency as well as the professionalization of inquiry make it easier to determine the truth sooner rather than later. In this regard, cyberspace lags. Perhaps this should not be so—a fully imaged computer hard drive after a cyberattack leaves nowhere for anything to hide. But, in practice, there is often no third-party confirmation of a successful cyberattack, much less a failed cyberattack, or one partially completed (e.g., an implant). There is no easy equivalent in overhead imagery. And besides, matters once considered settled because of elite scientific consensus are increasingly open to question for a variety of causes (e.g., populism, the Internet's ability to support echo chambers, less influence of traditional media, epistemic closure).\nTrue facts of cyberwar are becoming secondary to misperceptions that governments either shape or influence. Increasingly, cyberwar is becoming what states make of it, and how they package it. That leaves, as open questions, what states will make of it. As argued, their options range in efficacy and persistence (in the face of subsequent revelations). The strategies states will employ will, of course, adapt to the circumstances. No hard projections can be made about what the games will look like, but games there will be.\nSUMMER 2020 | 85\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT"
    },
    "author_year": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 97,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "author_year"
      },
      "results": [],
      "flat_text": "# THE CYBER DEFENSE REVIEW\nCyberwar is What States Make of ItAuthor(s): Martin Libicki\nSource: The Cyber Defense Review, Vol. 5, No. 2, Special Edition: Information Operations/Information Warfare , pp. 77-88\nPublished by: Army Cyber Institute\nStable URL: https://www.jstor.org/stable/10.2307/26923524\n## REFERENCES\nLinked references are available on JSTOR for this article: https://www.jstor.org/stable/10.2307/26923524?seq=1&amp;cid=pdf-reference#references_tab_contents\nYou may need to log in to JSTOR to access the linked references.\nJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org.\nYour use of the JSTOR archive indicates your acceptance of the Terms &amp; Conditions of Use, available at https://about.jstor.org/terms\nArmy Cyber Institute is collaborating with JSTOR to digitize, preserve and extend access to The Cyber Defense Review\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n# THE CYBER DEFENSE REVIEW\n* RESEARCH ARTICLES *\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n# Cyberwar is What States Make of It\nDr. Martin Libicki\nNo one there at the time could forget the vicious cyberattack on Venezuela's power systems in March 2019. Four days of chaos ensued. Stores and restaurants closed. Card payments systems were down, with customers asked to pay in dollars. Disrupted public transportation left many unable to get to work. Looting ensued. Seventeen people died in hospitals for lack of electricity.[2]\nWait, some of you may be thinking: what cyberattack? There is no question that Venezuela's grid had serious problems, but the only evidence that a cyberattack caused these problems was the word of President Maduro. He certainly had political reasons to mobilize his supporters against yet another delivered insult by the US, which has made no secret of its desire to see Maduro go.[3] More likely, the power outage reflected the same dysfunctional energy facilities that reduced the average daily oil production rate from nearly 2.5 million barrels in 2015, to a third of that in 2019.\nBrazil can tell a similar tale of woe. In 2007, hackers attacked the grid of the state of Rio Grande do Sul, causing severe power outages. The CIA picked up and circulated this story within the intelligence community for two years before it was broadcast by Sixty Minutes in 2009.[4] Or was it a cyberattack? Once it was reported in the press, Brazil's government denied any such cyberattack, claiming the cause to be sooty insulators, resulting in a fine assessed against the relevant utility.[5] So, end of the story? Not necessarily, argue two of the savvier observers on the cyberwar scene (one American and one Israeli); there were known groups that had both an interest in, and a talent for cyberspace mischief, and the government of Brazil would have been embarrassed to admit their success.\nThis is a work of the U.S. Government and is not subject to copyright protection in the United States. Foreign copyrights may apply.\nSUMMER 2020\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nDr. Martin C. Libicki (Ph.D., U.C. Berkeley 1978) is the MaryEllen and Richard Keyser Chair of Cybersecurity at the U.S. Naval Academy where he teaches cyberwar strategy and cyberspace economics. Prior employment includes having been a senior management scientist at RAND since 1998, focusing on the impacts of information technology on domestic and national security. He wrote three commercially published books: Cyberspace in Peace and War (2016, second edition forthcoming), Conquest in Cyberspace: National Security and Information Warfare (2007), and Information Technology Standards (1994). He is also the author of numerous RAND monographs, notably Defender's Dilemma, Brandishing Cyberattack Capabilities, Crisis and Escalation in Cyberspace, Global Demographic Change and its Implications for Military Power, Cyberdeterrence and Cyberwar, How Insurgencies End (with Ben Connable), and How Terrorist Groups End (with Seth Jones). Prior employment includes 12 years at the National Defense University, three years on the Navy Staff as program sponsor for industrial preparedness, and three years for the GAO.\nIf attacks on the power grid can be faked or hidden, imagine what can be done with other mischief in cyberspace. Cyber-espionage can go undetected for years. Withdrawals from bank accounts can be covered by funds transfers from the embarrassed bank (albeit not legally in many countries). Induced failures in police or intelligence systems may not make the news if such systems are themselves unknown to the public. By contrast, there is no hiding when it is the lights that go out. Nevertheless, the fact of a power outage does not prove that a cyberattack caused it—and, while the power company might know, they may not say or be encouraged or even allowed to speak. And, even if a cyberattack is established, attribution can still be an issue.\nSo far, the only verified cases of electric power loss caused by hacking occurred in Ukraine: two separate incidents in late 2015 and late 2016. But just as the existence of nuclear weapons—even though none have been detonated in war since 1945—has dramatically influenced the security choices of the US, Russia, and China, an imminent threat to knockout electric power could shape future crises. Targeted countries could be coerced or alternatively, they could try to pre-empt attackers by doing likewise. The most frequently discussed way to convert the threat to the electric grid from a notional to a real possibility is to implant malware into the other side's industrial control systems (as distinct from their office and billing systems). Such implants have been likened to Soviet moves to put intermediate-range nuclear-tipped missiles in Cuba, thereby tripling their capacity to strike the US.\nSo, have countries implanted malware in other countries' electric grids? In 2009, The Wall Street Journal, with no evidence beyond \"intelligence\" sources, reported that Russia and China had done precisely that to the US grid.[6]\nIn late 2014, Admiral Michael Rogers, Commander, U.S. Cyber Command (USCYBERCOM), testified[7] that,\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\n“there are nation-states and groups out there that have the capability ... to shut down, forestall our ability to operate our basic infrastructure, whether it's generating power across this nation, whether it's moving water and fuel.” Later that year evidence surfaced that Russian hackers had used tools to penetrate power stations (using Black Energy malware) and corrupted software updates of machinery that sat on electronically isolated (aka “air-gapped”) networks (using Havex malware). In mid-2018, DHS officials reported penetration by Russian hackers of the US electrical system by leveraging the phishing-acquired credentials of suppliers to electrical control systems; “They got to the point where they could have thrown switches” and disrupted power flows.[8] Iran has been credited with similar capabilities.[9] Some believe that “so many attackers have stowed away in the systems that run the US electric grid that experts say they likely have the capability to strike at will.”[10]\nIt is difficult to know what to make of these claims. The intelligence community keeps secrets for a living. Law enforcement rarely releases sensitive information before trials. Corporations seldom concede that they are victims of hackers, especially of hacks that produced no visible effects. Finding malware is not necessarily an indication of cyberattack, either. The malware could have drifted in from elsewhere. Stuxnet, for instance, appeared in over 100,000 systems outside the Natanz centrifuge plant. A compiler corrupted to produce malware-laden software for a specific supply-chain attack can compromise other software that is unknown to the hackers. While possible, it is quite difficult for hackers who cannot communicate with the malware to time an attack.\nAt least, claims of extant or impending cyberattacks can be refuted if given time. Anomalous indicators on an employee's laptop at the Burlington Electric Department were initially mistaken for a deliberate Russian hacking attempt on its electrical power grid.[11] That is reassuring to onlookers who remember the accusation, and then the retraction, but what if someone had acted irreversibly on the accusation, before it was retracted?\nMatters are foggier if attackers, rather than defenders, claim that implants were installed. In mid-2019, USCYBERCOM gave notice that it was installing implants into the Russian electric grid,[12] which the Russians denied,[13] claiming that such attacks were thwarted.[14] So, is the US capable of taking down the Russian electric grid (e.g. in retaliation for their doing likewise)?\nFinally, even if the fact of the disruption and attribution both are indisputable, the message intended by the disruption is subject to multiple interpretations. Consider the hacks of Ukraine's power grid.[15] The hack, according to Robert M. Lee and Mike Assante (both teach cybersecurity for SANS) was meant, “to stoke the ire of Ukrainian customers and weaken their trust in the Ukrainian power companies and government.” The article's author, citing Ukrainian sources, then adds that “[s]peculation has been rampant that the subsequent blackouts in Ukraine were retaliation for the attack on the Crimean substations.” Robert Lee was quoted later in the article considering the possibility that, “the attack on the Ukrainian power\nCYBERWAR IS WHAT STATES MAKE OF IT\ncompanies was a message to Ukrainian authorities not to pursue privatization,\" ultimately concluding the message to be: \"We want to be seen, and we want to send you a message ... oh, you think you can take away the power [in Crimea]? Well I can take away the power from you.\" Finally, an attack on the electric grid that caused modest effects could easily be portrayed as one that could have caused major effects but for self-restraint or error: the late 2016 cyberattack on Ukraine's electric grid opened circuit breakers that were closed an hour later, but analysis of the code suggested that the hackers sought to cause physical damage before power was restored but made several coding errors.[16] Oleksii Yasinksy, a Ukrainian cybersecurity researcher, believed the hackers \"could have knocked out Ukrenergo's transmission station for longer or caused permanent, physical harm to the grid, he says—a restraint that American analysts like Assante and Lee have also noted.\"[17]\nWhat can we draw from these examples? Based on the Venezuelan incident, one observer concluded, \"the inability to definitively discount US or other foreign intervention, whether deliberate or accidental, demonstrates the incredible power of using cyberattacks to target utilities.\"[18] But there is an alternative perspective: it demonstrates the profound impact such cyberattacks have on the public's imagination—which, when coupled with the difficulty of proving who did what and why—illustrates the power that mere claims of cyberattack have, either by the attacker or the attacked. There is a reason cyberspace events are mysterious. To paraphrase Ross Anderson[19]: airline safety has improved faster than cybersecurity because airplanes crash outside and, by so doing, create facts that cannot be waved away. But computers crash inside, which allows others to understate or overstate what actually took place.\n## Manipulating Information about Information War Itself is Information Warfare\nThe ease with which facts can be manipulated, given the ambiguities and obscurities of cyberspace, means that leaders will be tempted to do just that. Having examined the means of distorting the truth, it is important to understand some of the motives that would prompt such distortions. The degree of manipulation will depend on several variables, including the moral quality of a country's leaders, their ability to maintain a narrative at variance with facts, and the political context within which they operate.\nIn fairness, the ability to create misperceptions that vary with reality is often unequal. Transparency brings reality and perceptions closer together. So, the leeway of governments to fudge events will vary—directly or via proxies (e.g., power grid operators). Competition among private cybersecurity firms makes it more difficult to advance defensible claims. Conversely, exposure to public opinion creates a gap between perceptions and reality that may be unsupportable. Claims to expert authority are not taken as seriously as (we suppose) before. At least in the West, epistemic closure appears to be growing worse. Despite a clear consensus among the cybersecurity community that imaging servers suffices to understand a network intrusion, for instance, many who take their cues from the leaders they like believe\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nthat shipping servers to a foreign country is a way to hide false flag attacks (e.g., Ukrainians doing what Russians are blamed for).\nAdding to the discrepancy has been the tendency of some countries to separate their communications from the rest of the world. North Korea remains isolated. China's Great Firewall is a prime example of selective filtering. Iran is similar in this regard and is contemplating even more isolation.[20] Russia recently experimented with closing its Internet off from the rest of the world.[21] Early hopes that the Internet would bring the world together and that, in John Gilmore's words, \"The Net interprets censorship as damage and routes around it,\" look nostalgic. As Evgeny Morozov observed in *The Net Delusion: The Dark Side of Internet Freedom*,[22] authoritarian governments originally caught flat-footed by the Internet have learned how to control it and turn it to their purposes.\nBetween the facts that, for laypeople, cyberspace is opaque, and yet, the Internet can actually facilitate misperception over reality, the stage is set for states to make of events in cyberspace as they will.\nTo simplify the question, consider two players: the target and the attacker. The target has two basic choices: to play up the incident (even, perhaps especially, if no cyberattack were actually involved or no implant dropped), or to downplay it. The attacker has two basic choices as well, but is in a poor position vis-à-vis the target to argue about the effects of the cyberattack. Figuratively and literally, the target is there, and the attacker is not. But the attacker can either dispute or embrace attribution because the requisite evidence is something the attacker will have special knowledge of.[23]\nThe target can play up the cyberattack in many ways. Assuming there is something to work with (e.g., a blackout), it can be mischaracterized as an accident, human error, design flaw, as well as a cyberattack. As a variant, an accidental or inadvertent cyberattack can be characterized as deliberate and malicious.[24] A cyberattack with a weak effect could be touted as a bullet dodged, either because the hacker erred, or because the hacker was brandishing its capabilities and could have done worse if it wanted to. And, as noted, even if no cyberattack took place, some entity the target wants to malign could be accused of having planted malware \"discovered\" in the system. Attribution can also be played, largely because some cyberattacks are more embarrassing than others. An inside job can imply that an organization's employees are untrustworthy, or that the organization poorly vetted, and/or that its systems afforded others too many privileges. The victim of a state-backed hacker group can summon the misleading argument that a private company can no more defend its network against an army than it can defend its factory against one; falling to a criminal group is more blameworthy. Finally, if the adverse impact of the cyberattack is insufficient to meet the target's needed political narrative, the cyberattack can be cast as the beginning of a systematic campaign. With a little nerve, it can argue that it was the first shot in a kinetic war, thereby justifying the target's decision to\nSUMMER 2020 | 81\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nmobilize its society to fight. While an actual kinetic war may not happen, an action-reaction cycle could actually escalate into war. And if the war does not come, there's always the narrative that war would have come were it not for the target's raising the alarm and mobilizing (e.g., its own forces, the righteous anger of its citizenry, enraged world opinion) accordingly.\nThis litany of options illustrates why the target may play up a cyberattack. They help unify a country in the face of an adversary while distracting the polity from the government's mistakes. The mobilization of opinion helps governments institute repressive measures or raise taxes. Threats of cyberattacks may persuade the public to allow its government access to personal or organizational systems. Once governments are granted authority to surveil systems for malware or other evidence of intrusion, they can use such access to monitor unwanted activity by citizens. Accusations may create cover for the target's own aggressive acts, forcing concessions from the attacker, even if the incident is phony or exaggerated. It can warn third countries that war may be coming, thereby forcing alliances or other commitments. (Ironically, hyping a cyberattack could lower tensions by substituting conflict in cyberspace, which is unlikely to kill anyone, for more risky posturing in the physical world).\nThe most innocent explanation is that exaggerating the cyberspace threat will persuade many to take cybersecurity more seriously as they should have from the start (like Senator Arthur Vandenberg, who told President Truman public support for aid to Greece and Turkey against Communists required him to \"scare the hell out of the American people\"). But this rationale holds some paradox. If the point is to inspire confidence in the integrity of government processes – for instance, that voters can trust election results because they are protected – advertising their vulnerability to hacking may ultimately lead to trustworthy voting systems but, until then, will not produce trusted voting systems.\nThat logic is one of several reasons' leaders may be reluctant to play up cyberattacks. As a device for mobilizing popular opinion, cyberspace events may be too esoteric, incomprehensible, and removed from daily concerns to allow for galvanizing emotions. Unlike terrorism, cyberattacks more likely will engender anxiety and annoyance, on par with the prospect of a morning traffic jam. But if someone's literal viscera are not threatened, can cyberattacks induce the kind of visceral fear with the requisite political clout?\nReasons to downplay cyberattacks are not hard to find. Falling victim to cyberattacks is, as noted, embarrassing. Such catastrophes can be prevented either by diligent cybersecurity investments or through various forms of self-denial (e.g., closing systems to easy access by others, retaining less information, or prioritizing security over usability and flexibility). Because the point of government is providing security and reliability, admitting that it failed at that can be difficult.\nOther reasons for reticence may arise in strategy. Just as playing up cyberattacks may help mobilize citizens for confrontation, playing them down may allow governments to avoid\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nconfrontations they cannot win or at least can win only at great cost. Analogously, many in Europe were eager to accept Putin's assertion that Russia had no forces in Ukraine's east: \"[The West] connived in Mr. Putin's pretense that he had not invaded eastern Ukraine—even though in a furtive tricky way he plainly had—because to say otherwise would have required a drastic response.\"[25] Playing down attacks also signals insouciance. Thus, if its purpose is to goad the target into doing something rash (e.g., as the September 11th attacks may have been used by al-Qaeda to goad the US into Afghanistan) then downplaying that would translate as an insufficient pain threshold to merit response. Similarly, by refusing to admit to being hurt, a state conveys that it is not coerced and thus will not accede to whatever demands, be they explicit or implicit, are imposed by the attacker, and will itself be undeterred in pursuing its own ends.\nDenying attribution also obviates pressures on the target to respond, and also conveys, albeit weakly, that the cyberattack fell below some pain threshold. This allows the target state the option to determine later that they have enough confidence to respond. Conversely, an argument that the pain of cyberattack is limited can be undermined by the discovery of wider and deeper effects and rarely can be assigned by the reverse (much as death tolls can only go up as catastrophes are investigated). The same holds for characterization of near-attacks or failed-attacks. Earlier interpretations that they were not deliberate or carried out by incompetents can be credibly revisited.\nA last option is to cast doubt on any early facts, whether helpful or harmful. One reason may be to avoid prejudicing the investigation in the hopes of learning the real lessons for the incident. Another is to prevent the attacker (and would-be copycats) from receiving battle damage assessment so to speak, the better to perfect subsequent attacks.\nAs to attackers, they, like defenders, can play up or play down the consequences of the attack, its characterization, or its attribution. In practice, however, it is difficult for attackers to more credibly characterize the attack than the target, which has far greater access to information than the attacker. Indeed, the attacker often will have very little if any firsthand information. Reports, for instance, that the US successfully interfered with performance of North Korea's Musudan missile had to be left dangling because of the lack of any sure way to know whether the hack actually worked, or, even if it did work, was a decisive factor in subsequent launch failures.[26] The best the attacker can do is to argue that while the target may know better, its leaders often lie about what they know to be otherwise. It took two months after the public learned about Stuxnet for Iran to concede it had been hurt. Yet neither the US nor Israel officially claimed that the attacks succeeded.\nIn theory, matters are less clear. Attackers usually know better what they tried to do than do defenders; if the damage is subtle or only appears under certain circumstances, the attacker may know to look to telltale signs that its attacks worked, often leaving the defender oblivious to the attack. Subtle attacks also do not make the news, at least not until their impacts become visible.\nSUMMER 2020 | 83\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT\nThis leaves attribution as the attacker's primary lever. Countries generally do not acknowledge their cyberspace operations, even when so accused. This stands in contrast to acts of terrorism (at least pre-9/11), which were followed by multiple claimed terrorist group perpetrators. Many cyberattacks such as the 2012 attack on Saudi Aramco or the 2014 attack on Sony are claimed by groups: The Cutting Sword of Justice and the Guardians of the Peace, respectively. But these groups do not really exist as separate entities. The reasons to deny attribution are straightforward. Most accusations involve cyber espionage whose operators avoid—because the point is to work undetected—revealing their own capabilities and modus operandi.\nAs for the rarer instances of cyberattack, often the target knows the attacker's identity, while admitting as much opens the attacker to criticism and makes it hard for the attacker to, in turn, criticize incoming cyberattacks. For example, going back at least to the 1973 War, Israel's neighbors believed that Israel had nuclear weapons, thereby giving Israel the benefit of deterrence. Yet Israel strenuously denied having such weapons, to the point of even luring and then jailing Mordechai Vanunu, an Israeli who revealed as much to the British press in the 1980's.[27] Israel may well have calculated that open admission would have led third parties to push Israel to de-nuclearize, or to pressure neighboring countries to pursue their own nuclear weapons.\nStuxnet provides an interesting case in contrast. Neither the US nor Israel denied this cyberattack,[28] yet neither admitted it officially, at least at first. But at least some in each country wanted to take credit for it. In the US, former Vice Chairman of the JCS, General Cartwright, was accused to have been the source for David Sanger's articles on the hack. And a 2011 YouTube video captured Israel's Chief of Staff at his retirement party counting Stuxnet among his prominent achievements.[29] In 2016, an official Israeli document baldly stated, \"an example of an offensive cyber operation conducted by Israel is Stuxnet, which was jointly developed with the United States and targeted Iranian nuclear facilities.\"[30] Other governments have tried to have it both ways. Russia denied hacking the DNC in 2016, but its President called the hackers \"artists.\"[31] North Korea denied hacking Sony in 2014 but called it a \"righteous deed.\"[32]\nGenerally, hypocrisy—a tribute vice pays to virtue—rules. Given a choice between appearing great and appearing good, countries choose good. That is, they would rather talk up their fealty to international norms than overawe others with their cyberspace prowess. But for how long? As noted, the US did not seem to mind news stories that it had penetrated Russia's grid. In the summer of 2019, the US also indicated it was penetrating systems of those intruding against the US[33] (a.k.a. \"defending forward,\" or \"persistent engagement\"), and had countered Iran's shoot-down of a US drone with a cyberattack.[34] Might other countries follow? No country had (publicly, at least) established a cyberspace operations entity until the US formed USCYBERCOM. Many blushed at the thought of militarizing cyberspace until they—first allies, and then adversaries—followed suit. Whether other countries copy the trend\nTHE CYBER DEFENSE REVIEW\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nMARTIN LIBICKI\nof taking credit not only for successes but also for operations more difficult to assess as successful depends on whether the aforementioned events of 2019 recur. This, in turn, depends on how much they reflected the character of the U.S. Administration at the time. But if such behavior becomes a trend, as opposed to a blip, other countries likely will follow suit in the years to come.\n# CONCLUSION\nIt has been said that the first casualty in war is truth. Today advances in technology and transparency as well as the professionalization of inquiry make it easier to determine the truth sooner rather than later. In this regard, cyberspace lags. Perhaps this should not be so—a fully imaged computer hard drive after a cyberattack leaves nowhere for anything to hide. But, in practice, there is often no third-party confirmation of a successful cyberattack, much less a failed cyberattack, or one partially completed (e.g., an implant). There is no easy equivalent in overhead imagery. And besides, matters once considered settled because of elite scientific consensus are increasingly open to question for a variety of causes (e.g., populism, the Internet's ability to support echo chambers, less influence of traditional media, epistemic closure).\nTrue facts of cyberwar are becoming secondary to misperceptions that governments either shape or influence. Increasingly, cyberwar is becoming what states make of it, and how they package it. That leaves, as open questions, what states will make of it. As argued, their options range in efficacy and persistence (in the face of subsequent revelations). The strategies states will employ will, of course, adapt to the circumstances. No hard projections can be made about what the games will look like, but games there will be.[35]\nSUMMER 2020 | 85\nThis content downloaded from\n144.82.114.237 on Wed, 23 Apr 2025 12:46:31 UTC\nAll use subject to https://about.jstor.org/terms\nCYBERWAR IS WHAT STATES MAKE OF IT"
    }
  },
  "citation_summary": {
    "style": "hybrid",
    "dominant_bucket": "tex",
    "dominant": {
      "intext_total": 30.0,
      "success_occurrences": 30.0,
      "success_unique": 30.0,
      "bib_unique_total": 70.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 0.42857142857142855,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 4.0,
      "highest_intext_index": 34.0,
      "missing_footnotes_for_seen_total": 0.0,
      "uncited_footnote_total": 5.0,
      "style": "hybrid"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 30.0,
        "success_occurrences": 30.0,
        "success_unique": 30.0,
        "bib_unique_total": 70.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.42857142857142855,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 4.0,
        "highest_intext_index": 34.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 5.0,
        "style": "hybrid"
      },
      "numeric": {
        "intext_total": 33.0,
        "success_occurrences": 33.0,
        "success_unique": 33.0,
        "bib_unique_total": 35.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.9428571428571428,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 97.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "THE CYBER DEFENSE REVIEW",
    "subtitle": "Cyberwar is What States Make of ItAuthor(s): Martin Libicki",
    "document_type": "journal_article",
    "venue": "# THE CYBER DEFENSE REVIEW",
    "publication_year": 1978,
    "authors": [],
    "affiliations": [
      "Published by: Army Cyber Institute",
      "Army Cyber Institute is collaborating with JSTOR to digitize, preserve and extend access to The Cyber Defense Review",
      "Dr. Martin C. Libicki (Ph.D., U.C. Berkeley 1978) is the MaryEllen and Richard Keyser Chair of Cybersecurity at the U.S. Naval Academy where he teaches cyberwar strategy and cy"
    ],
    "emails": [
      "support@jstor.org"
    ],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "",
    "keywords": [],
    "publication_dates": {},
    "identifiers": {
      "doi": [
        "10.2307/26923524"
      ],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "https://www.jstor.org/stable/10.2307/26923524",
        "https://www.jstor.org/stable/10.2307/26923524?seq=1&amp;cid=pdf-reference#references_tab_contents",
        "https://about.jstor.org/terms"
      ]
    },
    "references_block_count": 1,
    "references_entries_estimated": 34,
    "heading_count": 8,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "no_authors",
        "no_abstract"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 30,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 1.0,
      "footnote_coverage": 1.0,
      "unique_index_count": 30
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "hybrid",
      "recommended_style": "numeric",
      "aligned": true,
      "signals": {
        "superscript_hits": 0,
        "superscript_definition_lines": 0,
        "numeric_bracket_hits": 34,
        "numeric_endnote_lines": 0,
        "author_year_hits": 0
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 70.0,
      "dominant_bib_coverage_rate": 0.42857142857142855,
      "dominant_link_target": "footnotes",
      "dominant_unresolved_flag": "unresolved_footnote_links"
    },
    "heading_validation": {
      "heading_count": 8,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": true,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": false,
        "affiliations": true,
        "emails": true,
        "orcids": false,
        "abstract": false,
        "keywords": false,
        "venue": true,
        "persistent_identifier": true,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 0,
        "affiliations": 3,
        "emails": 1,
        "orcids": 0,
        "keywords": 0,
        "doi": 1,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 3
      },
      "coverage": {
        "core_coverage": 0.6666666666666666,
        "email_author_link_rate": 0.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "no_authors",
          "no_abstract"
        ],
        "toc_dot_lines": 0
      },
      "flags": [
        "meta_missing_authors",
        "meta_missing_abstract_and_keywords"
      ]
    },
    "flags": [
      "low_bib_coverage",
      "meta_missing_authors",
      "meta_missing_abstract_and_keywords"
    ]
  },
  "updated_at_utc": "2026-02-14T08:28:22.803737+00:00"
}