{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\DZJWKF4X\\(Metodi Hadji-Janev, 2023).pdf",
  "custom_id": "222",
  "response": {
    "id": "batch-b6235e9e-223-828318d3-e5d3-454b-9ad9-1f2cceb1bb02",
    "custom_id": "222",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "# Use of force against cyber attacks\n\nAuthor: Metodi Hadji-Janev\nMilitary Academy “General Mihailo Apostolski”-Skopje,\nUniversity “Goce Delcev”-Stip”, Republic of Macedonia\n\nAbstract. The rapid development of the technology in an age of intensified globalization has seriously affected international security. Today state and non-state actors can use telecommunication and information technologies in a disruptive way and through cyberspace remotely cause damages to the critical infrastructures that run our everyday live and on which we depend upon. Urged by this complexity some countries have considered military response including the use of force in self-defense. However international legal standards, principles and norms that regulate use of force under international law do not mention use of force against cyber attacks. Therefore it is not quite clear whether or not states can lawfully use force in self-defense against cyber attacks.\n\nKeywords. *Ius ad bellum*, armed attack, self-defense, cyber-attack, proportionality, necessity, anticipatory self-defense\n\n# Introduction\n\nThe development of modern technology and interconnectivity has brought both positive and negative effects. Today, thanks to a modern technology we leave in a world of global interconnectedness which through linked digital information networks brings vast benefits. Nevertheless, although designed and created for good electronic and informational interconnectivity creates tremendous vulnerabilities.\n\nBoth state and non-state actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Therefore, the more developed the states are the more vulnerable they are. Faced by this complexity some countries have declared to take radical measures to confront upcoming threats from cyber-attacks.\n\nHence cyber threats and readiness to respond to such threats by some states with the use of force in self-defense have raised some legal questions. Giving the nature of cyber attacks and the fact that current regulations for use of force in self-defense are designed for use of physical force, but not in cyberspace, it is not clear whether: (1) cyber attack could meet the standards of an armed attack; (2) cyber-attack is attributable to the state and (3) the use of force carried in self-defense could meet the standards for \"necessity\" and \"proportionality\". Therefore, the article will first explain how cyberspace affects states security. Then will examine when and under which circumstances can state (victim of a cyber attack lawfully use force in self defense).",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 1,
            "markdown": "1. Security threats from cyberspace\n\nThreats from cyberspace are real and affect our everyday life. Unlike conventional threats these threats are hybrid coming both from state and non state actors. These actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Using different techniques and methods in the cyberspace both state and non-state actors generally (but not limited to) conduct cyber attacks\n\n- to spread misinformation,\n- for electronic espionage purposes that weakens state's competitive advantage,\n- to commit clandestine modification of sensitive data on the battlefield or\n- to affect countries' critical infrastructures\n\nMotives for such attacks through cyberspace differ. In general, they are usually conducted for social and criminal gain or for political and strategic military advantage. Thus, hybrid threats from cyberspace that underpins our security come from criminals, state actors, or groups and individuals with ideological and religiously violent motivation that could act independently or as a proxy to a violent state actor. Depending on the actor(s) and his/her/their motivation under current international regulations cyber attacks generally can be classified as cyber crime, cyber terror, or cyber warfare.¹\n\nCyber-attacks in Estonia (2007), Georgia (2008), Iran (2010), Burma (2010), USA (2011), Middle East (2012), confirm the above mentioned concerns and the effects that these attacks can cause.² Severity and the influence of these actions were also experienced during German Chancellor visit to China,³ by UK's financial, legal and retail firms, the Belgian federal government, or Pentagon in the US.⁴\n\nUrged by this complexity some countries and organizations such as U.S. and NATO have considered radical measures to confront upcoming threats from cyber-attacks. In its first formal cyber strategy U.S. concluded that computer sabotage coming from another country can constitute an act of war.⁵ Seeing itself as the world's premier collective defense entity, NATO believes that has a responsibility to take adequate measures to protect itself and its members from cyber threats.⁶\n\nHence cyber threats and readiness to respond to such threats by some states have raised some legal questions. Precisely, it is not clear whether or not such response would be legal under international norms, principles and standards. These concerns lead one to take a closer look into the international legislation with regards to use of force.\n\n¹ NATO Parliamentary Assembly, “NATO and Cyber defense”, 173 DSCFC 09 E BIS - NATO AND CYBER DEFENCE\n² Report of the New England Faculty Summit on Cyber Security held at Boston University on June 28, (2011), http://www.bu.edu/hic/files/2011/07/CyberSecuritySummitReport.pdf\n³ “Merkel’s China Visit Marred by Hacking Allegations”, Der Spiegel, August 27, 2007, accessed August 25, 2013 at: http://chinadigitaltimes.net/2007/08/merkels-china-visit-marred-by-hacking-allegations-spiegel/\n⁴ Rex B. Hughes, “NATO and Global Cyber Defense”, The Bucharest Conference Paper, Romanian Ministry of Foreign Affairs, March 2008, p44\n⁵ Siobhan Gorman and Julian E. Barnes: Cyber Combat : Act of War, The Wall Street Journal, (May 30, 2011), http://online.wsj.com/article/SB10001424052702304563104576355623135782718.html\n⁶ Sverre Myrli: NATO and Cyber Defense, NATO Parliamentary Assembly available at: http://www.nato-pa.int/default.Asp?SHORTCUT=1782.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 2,
            "markdown": "2. Use of force in international law as a response to cyber attack\n\nStates or international organizations could lawfully use force against cyber-attacks in two situations. First, if this is authorized by the United Nations Security Council (UNSC). Second, state(s), or international organization could use force in individual or collective self-defense. It is well known that UNSC resolutions are legally binding. This means that any decision made by the UNSC and translated into resolution to use force as a result of a cyber attack will be lawful.\n\nSince the UNSC mandates binding resolutions the decision to use force against an entity that had conducted cyber-attack under the Charter will be legal. However, having in mind that threat perceptions in the context of cyber attacks among member state will differ from state to state and that according to recent Security Council’s practice in such situations Council will fail to respond in a timely manner, it seems valid to assume that a state(s) will choose to respond with cyber attacks by exercising it/their right(s) to self-defense (individually or collectively).\n\n3. Self-defense against cyber-attack(s)?\n\nThe use of force by a victim state of a cyber attack(s) lawfully in self-defense would be possible only if: (1) cyber attack(s) meets the standards of an armed attack, (2) cyber-attack is attributable to the state where the self-defense is being carried out and (3) the use of force carried in self-defense is “necessary” and “proportional”. Legal analogy based debates among the scholars in the context of applicability of international legal standards and principles to cyber-attacks have stimulated numerous debates in the light of these conditions too. Precisely disagreements stem from the absence of the definition of what constitutes an armed attack under international law; challenges to attribute cyber-attack(s) to a state; and applicability of customary rules of self-defense along with the provisions under the UN Charter and interpretation.\n\n3.1. Cyber-attack as an armed attack?\n\nRelevant international organizations guidance, certain international instruments and legal scholar expressing their opinions, had tried to fill the absence of authoritative definition of armed conflict. Today it is well accepted that Jean Pictet’s guidance to determine the existence of an international armed conflict under Common Article 2 of the 1949 Geneva Conventions serve as a useful guide for assessing whether a particular use of force could be considered as an act equal to armed attack. According to Pictet’s guidance a use of force is considered an armed attack when the force is of “sufficient scope, duration, and intensity.”7 Another useful tool that helps to fill the absence of a legal definition of what constitutes armed attack is the U.N. General Assembly’s Resolution for “Definition of Aggression”. Although the Resolution does not contain a definition of armed attack this instrument provides examples of state actions that could be considered as an armed attack. Even more many argue that guidance of this instrument has gained extensive international acceptance.8\n\n7 Walter G. Sharp: Cyberspace and the use of force, Aegis Research Corporation, (1999) 60-61\n8 The U.N. Documents: Definition of Aggression, G.A. Res. 3314, U.N. GAOR, 29th Sess. (Dec. 14, 1974)",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 3,
            "markdown": "Some scholars have tried to define armed conflict by explaining the distinction between terms “war” and “armed conflict”. Based on the threshold in ICRC Commentary of the Common Article 2 according to Sharp, de facto hostilities exist, and consequently the Jews in Bello apply when any use of force, regardless of its scope, duration, or intensity, occurs between the members of the armed forces of two states.\n\nBoth states and the International Court of Justice have frequently applied these guidance and explanations in the context of the conventional understanding of the use of force. Nevertheless, the authors disagree whether these guidance and explanations can be applied to cyber-attacks. While some legal scholars believe that it is intuitive that cyber-attacks can constitute armed attacks, especially in light of their ability to injure or kill, part of the legal community has been reluctant to classify them this way because they do not resemble \"classic attack(s) with traditional military force.\"¹⁰\n\nAuthors that negate the applicability of guidance and explanations of what constitutes an armed attack to cyber attacks are not united. There are authors who in fact disagree over the whole idea of applicability of *Ius ad bellum* to the cyberspace activities. Jeffrey Addicott, for example, asserts that “international laws associated with the use of force are woefully inadequate in terms of addressing the threat of cyber warfare”¹¹. On the other hand, there are authors who disagree only to the applicability limited to guidance and explanations of the conventional use of force. For the purpose and space of the given debate, we will focus on general arguments that these authors pose on their behalf in the context of the debate.\n\nDiscussing the conditions to meet criteria for using force as a response to unlawful armed attack Mary Oconel points that attempt to apply these conditions to cyber force actions is difficult, if not impossible. The sort of damage, according to this author’s views does not meet the condition that an armed attack must be significant to trigger Article 51. To prove her point she offers ICJ case law practice. Using *Nicaragua* case Oconel emphases Court’s views about the importance of “scale and effects” in determining whether or not specific action could be classified as an armed attack.¹²\n\nPeter Singer and Noah Shachtman share similar positions as *O’connel*. In their argumentation, they provide insights from recent state practice. Analyzing the effects of Russian cyber-attacks to Estonia and comparing cyber attacks against Georgian government with the actual Russian missiles and bombs in the accompanying war, they tried to point that effects from cyber attacks were incomparable with the effects from the actual armed attack.¹³ Therefore, they believe that it is even inappropriate to apply *is ad bellum* rules of the cyber domain. Similar explanations come from Duncan Hollis,\n\n⁹ Sharp suggests that war refers to a state of de jure hostilities invoked by a formal declaration of one party that creates an international armed conflict as a matter of law. In contrast, any other armed conflict refers to a state of de facto hostilities invoked by the use of force by one party without any declaration of war. He then concludes that determination when any other conflict exists is a factual subjective determination that centers on the use of force between states. Walter G. Sharp, (1999) 74\n\n¹⁰ Thomas Wingfield: *When is a Cyberattack an \"Armed Attack\"?: Legal Thresholds for Distinguishing military activities in cyberspace*, Cyber Conflict Studies Association, (2006) 6\n\n¹¹ Jeffrey F. Addicott, “Cyberterrorism: Legal Policy Issues,” in *Legal Issues in the Struggle against Terrorism*, eds. John N. Moore and Robert F. Turner, Durham, NC: Carolina Academic Press, (2010), 550\n\n¹² “...The prohibition of armed attacks may apply to the sending by a state of armed bands to the territory of another state, if such an operation, because of its scale and effects would have been classified as an armed attack rather than a mere frontier incident...” Marry E. O’connell: *Cyber Security and International Law*, International Law Meeting Summary, Chatham House (2012), 5-7\n\n¹³ Peter Singer and Noah Shachtman: *The Wrong War*, Foreign Policy 21st Century Defense Initiative, Brookings, (2011), http://www.brookings.edu/research/articles/2011/08/15-cybersecurity-singer-shachtman",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 4,
            "markdown": "who asserts that a cyber - attack alone will almost never constitute an armed attack for the purposes of Article 51. Hollis' argumentation for this position is that a cyber - attack lacks the physical characteristics traditionally associated with military coercion\".14 Although there are others who share these views many authors believe that guidance and explanations of what constitutes an armed attack in conventional terms could be also applicable to unconventional use of force including cyber-attacks.\n\nYoarm Dinstein is among the authors who share the view that cyber attack can constitute armed attack. Accordingly, in his analyses based on the \"instrument-based approach\" Dinstein uses the guidance and explanations of what constitutes an armed attack in conventional terms to prove that cyber-attacks can constitute armed attacks. The logic of this approach holds that if cyber-attacks could cause the destruction of a power grid than cyber-attack constitutes an armed attack. This is due to the fact that before the development of cyber capabilities such destruction could have been possible only by using kinetic force. Beside that article 3 of the \"Definition of Aggression\" provides implicit support to Dinsteins' approach.15\n\nUnlike Dinstein, Walter Sharp also believes that a cyber attack could constitute an armed attack. However, Sharp uses guidance and explanations of what constitutes an armed attack in conventional terms and merge them to the target of potential cyber attack. Eric Talbot along with Sharp advocates that cyber attack classifies as an armed attack if it targets a sufficiently important computer system.16 Baring in mind our previous discussion about the importance of SCADA systems and the complexity of the risks that these systems' failure could cause sound reasonable to agree with these authors' logics. Purposeful cyber-attack to SCADA systems could cause failure of these systems and therefore cascade severe consequences. We could not agree less that in situations like this, cyber-attacks would meet not just the ICRC threshold regarding the \"intensity\", but also ICJ well established test \"scale and effects\" for determining whether or not specific action could be classified as an armed attack. Nonetheless the issue with this approach in determining when a cyber - attack could constitute an armed attack is that its proponents advocate aggressive response based on the \"strict liability\". Sean Condron, for example, argues that a cyber-attack constitutes an armed attack, and would grant the target the right to use force in self-defense, whenever it penetrates any critical national infrastructure system, regardless of whether it has yet caused any physical destruction or casualties.17\n\nMichael Schmitt, former colonel turned professor, uses his own developed model to measure the consequences of cyber-attack under the guidance and explanations of what constitutes an armed attack in conventional terms. Schmitt propagates that one needs to consider seven factors before deciding if a cyber-attack's effects could be deemed to armed attack. These factors are severity (the type and scale of the harm); immediacy (how quickly the harm materializes after the attack); directness (the length of the causal chain between the attack and the harm); invasiveness (the degree to which the attack penetrates the victim state's territory);\n\n14 In other words, because it generally does not use traditional military weapons, Duncan B. Hollis: Why States Need an International Law for Information Operations, 11 Lewis &amp; Clark L. Rev. (2007), 1023-1042\n15 This view has some support in the article 41 of the U.N. Charter as well Yoram Dinstein: Computer Network Attacks and Self-Defense, in: Michael N. Schmitt &amp; Brian T. O'Donnell eds. Computer Network Attack And International Law, (2002), 99\n16 Walter Sharp, (1999), 129-130\n17 Sean M. Condron: Getting it Right: Protecting American Critical Infrastructure in Cyberspace, 20 Harvard J.L. &amp; Tech., (2007), 403, 415-16",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 5,
            "markdown": "measurability (the degree to which the harm can be quantified); presumptive legitimacy, (the weight given to the fact that) and responsibility (to be able to attribute the attack).¹⁸ If the cyber-attack, in the field of cyber-activities as a whole, meets these criteria, cyber-attacks constituting an armed attack are the exception rather than the rule. These factors are illuminating, but they call for such a wide-ranging inquiry that they may not provide sufficient guidance to decision makers.¹⁹ Although widely accepted some argue that Schmitt model suffers from some inconsistencies. It could be argued that only a small number of cyber-attacks could rise to the level of armed attack.²⁰ Another issue arises from the ability to foresee the severity of the attack which could be abused since it is highly subjective.\n\nThe analyses of two opposing groups of authors further confirm the complexity that cyberspace poses to the society and security in a broader and law in a narrow context. In the light of our previous discussion regarding the complexity (growing asymmetry in a cyberspace and the “paradox of modernity”) it seems that second group of authors’ arguments for now, are more convincing. Just because we have not experienced a severe cyber-attack that could cause death and significant material property damage this does not mean that a cyber-attack or series of such attacks could not rise to a level of what is considered to be an armed attack under International law. Precisely, certain cyber-attacks could rise to amount of armed attack that under *Ius ad bellum* principles, standards and norms could justify the use of military force. Nevertheless, in order for victim state to be able to use force in self-defense lawfully beside the condition that state needs to be a victim of illegal action that constitutes armed attack the victim state must attribute such illegal attack(s) directly and conclusively to another state or agents under that state’s direct control.²¹\n\n## 3.2. The challenge of attribution\n\nMost of the arguments that build “pro” and “contra” views to use military force against cyber-attacks in the context of requirement to attribute responsibility steam from the premises that we discussed regarding the so-call “paradox of modernity”. Legal scholars who disagree to apply the analogy of *Ius ad bellum* standards, principles and norms to cyberspace threats generally focus on the difficulties to attribute cyber-attacks directly and conclusively to another state.\n\nBret Michael and Thomas Wingfiled propose that the issue of attribution in cyberspace derives from technical challenges... since the Internet was conceived without a requirement for users’ accountability. The problem according to them is even more complicated since they argue that the attribution in cyberspace is “asymmetric”.²²\n\nDiscussing the challenge of attribution in cyberspace Eric Jensen concludes similarly to Michael and Wingfield, that tracing cyber-attacks can be exceptionally long process. The problem with accuracy, however never ends since as he asserts even\n\n¹⁸ Michel Schmitt: Computer Network Attack and the Use of force in International law: The Columbia Journal of Transnational Law, Volume 37, (1999), 885-937\n\n¹⁹ This analytical approach is important for our debate since it seems that it would appear to be the analytical model adopted by the United States. Office Of General Counsel, Department Of Defense: An Assessment Of International Legal Issues In Information Operations, (May 1999)\n\n²⁰ Daniel B. Silver, Computer Network Attack as a Use of Force Under Article 2(4), 76 Int’l Law Studies 73, (2002) 92–93\n\n²¹ Sean M. Condron, (2007), 414\n\n²² Bret Michael and Thomas Wingfiled: International Legal Reform Could Make States Liable for Cyber Abuse, Per Concordiam, Journal of European Security and Defense Issues, Vol.2 Issue 2, (2011), 40-41",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 6,
            "markdown": "if the server is located to “...identify the entity or individual directing the attack is extremely hard. Nevertheless, he advocates for changing the approach.²³ The issue with cyber terrorists’ and cyber criminal modus operandi discussed by Davis Brown seems to echo Jensens’ analyses. Cyber-terrorists and cyber criminals often hijack innocent systems and use them as “zombies” to initiate their cyber-attacks. While victim-states must try to penetrate such guises, current technology may not always allow them to do so in a timely manner.²⁴ O’connel offers state practice to point that as a source of International law, it also requires for attribution to be made with clear and convincing evidence. Nevertheless, much similarly as previously cited authors she concludes that in the case of cyber-attack such convincing evidence is hard to find.\n\nSince legal requirements for conclusive attribution is hard to apply in case of cyber-attacks, some have suggested that states could legally employ cross-border cyber attacks and therefore not use military force. Using the transnational criminal approach Michael and Wingfiled see this approach promising. They do believe in potentials to establish international jurisdiction where individuals and groups may be investigated and prosecuted under other countries’ domestic law.²⁵\n\nAuthors who advocate that cyber-attacks could trigger the use of force in self-defense lawfully under the International law in response to “attribution challenge” offer different proposals. Mainly they build their argumentation based on the same issues proposed by the authors who disagree with their positions, i.e. the complexity to directly and conclusively attribute the cyber-attack(s).\n\nSome recognize that attribution stubbornly permeates every aspect of cyber operations, however they consider this as a technical issue, not a legal one. Therefore they advocate that the identity of the attacker may well determine if a state of war exists.²⁶ Others have tried to materialize their argumentation emphasizing the risks that cyber-attacks pose to the states. Sean Cordon explains that if states are about to follow traditional procedures to attribute responsibility regarding the nature of cyber-attacks than they need to be ready to experience risks that a cyber attack could pose. This, according to him could create a dilemma for the states.²⁷ Similar views have echoed that such situations could put states in the limbo position between its safety traditional legislation and imperfect reality.²⁸\n\nFrom all of the above it is clear that direct and concessive attribution to cyber attack is not easy to achieve. Difficulty to locate the entity responsible for cyber-attack(s) is stubborn impediment that questions lawful response in self-defense. On the other hand, neither cyber-attacks are traditional nor the traditional test for state responsibility aloud victim state to exercise the inherent right of self-defense appropriately. Legal scholars’ disagreements over applicability of self-defense under international law to cyber-attacks culminate in the context of necessity, proportionality and anticipatory self-defense.\n\n²³ Eric Jensen: Computer Attacks on Critical National Infrastructure: A Use of Force Invoking the Right of Self-Defense, 38 Stanford Journal of International Law, (2002) 207\n²⁴ Davis Brown: A Proposal for an International Convention to Regulate the Use of Information Systems in Armed Conflict, 47 Harvard International Law Journal (2006) 181-183\n²⁵ Bret Michael and Thomas Wingfiled, (2011), 41\n²⁶ Charles Dunlap: Perspectives for Cyber Strategists on Law for Cyberwar, Strategic Study Quarterly, Spring, (2011), 88\n²⁷ Sean Condron, (2007), 414-415\n²⁸ Duncan B. Hollis, (2007), 1026",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 7,
            "markdown": "## 3.3. Necessity and proportionality against cyber-attacks\n\nNecessity and proportionality are founding principles of appropriate self-defense.²⁹ As well as other elements that build the threshold of lawful self-defense against cyber-attacks these principles considered in the context of cyber-attacks are highly disputed among the legal scholars. If under the given evidences state cannot achieve a reasonable settlement of a dispute through peaceful means self-defense against cyber-attack will meet the requirement of necessity. Self-defense against cyber-attack is proportional if victim state limits its actions to the amount of force required to defeat an ongoing cyber-attack or to deter a future cyber-attacks.³⁰ Compliance with the principles of necessity and proportionality is difficult and fact-intensive even for conventional attacks, and therefore cyber-attacks present new hard challenges.\n\nAuthors who disagree with the overall applicability of *Ius ad bellum* to cyber-attacks believe that necessity and proportionality are difficult conditions to meet. Building on the previous discussions this part of the legal community considers that difficulties come from the complexity of cyber-attacks and as a consequence the amount of the time needed to attribute the attack. Evidences from recent cases like Estonia or Iran confirm these considerations. In both situations, attacks came from different locations. Therefore the biggest concern regarding the international legal requirements for lawful self-defense against cyber-attack is the defensive response. Technical challenge also raises considerations toward these directions. In fact the defending state would need time to consider the effects that counter measures could cause. Nevertheless, putted into the light of analytical models previously described in determining whether cyber-attacks could constitute a lawful armed attack, such evidences are not convincing. If for example one considers effect based-approach to determine if cyber-attacks qualify as an armed attack necessity is highly dependable of the effects caused by the cyber-attack(s). If victim state suffers severely and there are reasonable doubts that aggressor is preparing further cyber-attacks than the threshold of necessity change. In fact the imminence of danger aloud for victim state to respond before it is too late. At the same time proportional-limited military response to disrupt or destroy the base or the system that has caused or is about to cause further cyber-attacks sounds logically and acceptable under the recent *Ius ad bellum practice*.\n\nSince both analytical models “effect based” and “strict liability” model advocated for elements that consider *ex-ante* use of force in the context of our debate it is worth mentioning the issue of anticipatory self-defense.\n\n## 3.4. Anticipatory self-defense and cyber-attacks\n\nThe issue of anticipatory self-defense has been long debated among the legal scholars even in conventional terms. Measures undertaken in anticipatory self-defense are lawful when the “necessity of that self-defense is instant, overwhelming, and leaving no choice of means, and no moment for deliberation.”³¹ Since the vocabulary that explains what constitutes anticipatory self-defense differs from the course of article 51 of the Charter it is well accepted that anticipatory self-defense is considered as customary self-defense. Contrary to these views significant part of the legal community\n\n---\n\n²⁹ Thomas Wingfield: The Law of Information conflict: National Security Law in Cyberspace (2000) 42\n³⁰ Yoram Dinstein: War, Aggression and Self-defense (4th ed. 2005) 237\n³¹ Lori Fisler Damrosch et al.: International Law: Cases and Materials 59 5th ed. (2009) 1135",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 8,
            "markdown": "believes that self- defense should be practiced not outside the Charter.³² Under these circumstances lawful ex-ante use of force (as “strict liability” or to a certain degree “effect based” analytical models suggest) would require victim state to sufficiently demonstrate the imminence of an anticipated attack. In the case of cyber attacks, such a requirement would invariably be difficult to meet, if not impossible.\n\n## Conclusion\n\nTelecommunication and information technologies have changed our way of leaving. Cyberspace is both necessity but also vulnerability. Abusing cyberspace state and non state actors commit cyber attacks designed to spread misinformation, weaken state’s competitive advantage through electronic espionage, commit clandestine modification of sensitive data on the battlefield or affect countries’ critical infrastructures. In order to protect themselves against violent destructive and illegal activities some states are prepared to use force in self-defense. These commitments however have raised serious legal questions.\n\nThe overall debate over the applicability of *Ius ad bellum* principles, standards and norms to cyber-attacks unequivocally showed that it is not quite clear whether or not, states could lawfully use force in self-defense against cyber attack. Although under specific conditions cyber-attacks could amount to armed attack(s), it is very hard to attribute such attacks to a state or non-state actors. Additionally necessity and proportionality along with the ex-ante attitude (i.e. anticipatory self – defense) are highly disputed among the legal scholars. All of these challenges require for one to reconsider legal alternatives that could provide more appropriate solutions to cyber-attacks and cyber-security.\n\n## References\n\n1. Bret Michael and Thomas Wingfiled: International Legal Reform Could Make States Liable for Cyber Abuse, Per Concordiam, Journal of European Security and Defense Issues, Vol.2 Issue 2, (2011),\n2. Charles Dunlap: Perspectives for Cyber Strategists on Law for Cyberwar, Strategic Study Quarterly, Spring, (2011),\n3. Daniel B. Silver, Computer Network Attack as a Use of Force Under Article 2(4), 76 Int’l Law Studies 73, (2002),\n4. Davis Brown: A Proposal for an International Convention to Regulate the Use of Information Systems in Armed Conflict, 47 Harvard International Law Journal (2006),\n5. Duncan B. Hollis: Why States Need an International Law for Information Operations, 11 Lewis &amp; Clark L. Rev. (2007),\n6. Eric Jensen: Computer Attacks on Critical National Infrastructure: A Use of Force Invoking the Right of Self-Defense, 38 Stanford Journal of International Law, (2002),\n\n³² In fact, The UN World Summit Outcome Document of 2005 restates the international community’s support for strict compliance with the “Charter rules on use of force”",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 9,
            "markdown": "7. Jeffrey F. Addicott, \"Cyberterrorism: Legal Policy Issues,\" in *Legal Issues in the Struggle against Terrorism*, eds. John N. Moore and Robert F. Turner, Durham, NC: Carolina Academic Press, (2010),\n8. Lori Fisler Damrosch et al.: International Law: Cases and Materials 59 5th ed. (2009),\n9. Marry E. O'connell: Cyber Security and International Law, International Law Meeting Summary, Chatham House (2012),\n10. Michel Schmitt: Computer Network Attack and the Use of force in International law: The Columbia Journal of Transnational Law, Volume 37, (1999),\n11. NATO Parliamentary Assembly, \"NATO and Cyber defense\", 173 DSCFC 09 E BIS - NATO AND CYBER DEFENCE,\n12. Office Of General Counsel, Department Of Defense: An Assessment Of International Legal Issues In Information Operations, (May 1999),\n13. Peter Singer and Noah Shachtman: The Wrong War, Foreign Policy 21st Century Defense Initiative, Brookings, (2011), http://www.brookings.edu/research/articles/2011/08/15-cybersecurity-singer-shachtman,\n14. Report of the New England Faculty Summit on Cyber Security held at Boston University on June 28, (2011), http://www.bu.edu/hic/files/2011/07/CyberSecuritySummitReport.pdf,\n15. Rex B. Hughes, \"NATO and Global Cyber Defense\", The Bucharest Conference Paper, Romanian Ministry of Foreign Affairs, March 2008,\n16. Siobhan Gorman and Julian E. Barnes: Cyber Combat : Act of War, The Wall Street Journal, (May 30, 2011), http://online.wsj.com/article/SB10001424052702304563104576355623135782718.html,\n17. Sverre Myrli: NATO and Cyber Defense, NATO Parliamentary Assembly available at: http://www.nato-pa.int/default.Asp?SHORTCUT=1782,\n18. Sean M. Condron: Getting it Right: Protecting American Critical Infrastructure in Cyberspace, 20 Harvard J.L. &amp; Tech., (2007),\n19. The U.N. Documents: Definition of Aggression, G.A. Res. 3314, U.N. GAOR, 29th Sess. (Dec. 14, 1974),\n20. Thomas Wingfield: The Law of Information conflict: National Security Law in Cyberspace (2000),\n21. Thomas Wingfield: When is a Cyberattack an \"Armed Attack?\": Legal Thresholds for Distinguishing military activities in cyberspace, Cyber Conflict Studies Association, (2006),\n22. Yoram Dinstein: Computer Network Attacks and Self-Defense, in: Michael N. Schmitt &amp; Brian T. O'Donnell eds. Computer Network Attack And International Law, (2002),\n23. Yoram Dinstein: War, Aggression and Self-defense (4th ed. 2005),\n24. Walter G. Sharp: Cyberspace and the use of force, Aegis Research Corporation, (1999),\n25. \"Merkel's China Visit Marred by Hacking Allegations\", Der Spiegel, August 27, 2007, accessed August 25, 2013 at: http://chinadigitaltimes.net/2007/08/merkels-china-visit-marred-by-hacking-allegations-spiegel/",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 10,
          "doc_size_bytes": 70250
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "# Use of force against cyber attacks\nAuthor: Metodi Hadji-Janev\nMilitary Academy “General Mihailo Apostolski”-Skopje,\nUniversity “Goce Delcev”-Stip”, Republic of Macedonia\nAbstract. The rapid development of the technology in an age of intensified globalization has seriously affected international security. Today state and non-state actors can use telecommunication and information technologies in a disruptive way and through cyberspace remotely cause damages to the critical infrastructures that run our everyday live and on which we depend upon. Urged by this complexity some countries have considered military response including the use of force in self-defense. However international legal standards, principles and norms that regulate use of force under international law do not mention use of force against cyber attacks. Therefore it is not quite clear whether or not states can lawfully use force in self-defense against cyber attacks.\nKeywords. *Ius ad bellum*, armed attack, self-defense, cyber-attack, proportionality, necessity, anticipatory self-defense\n# Introduction\nThe development of modern technology and interconnectivity has brought both positive and negative effects. Today, thanks to a modern technology we leave in a world of global interconnectedness which through linked digital information networks brings vast benefits. Nevertheless, although designed and created for good electronic and informational interconnectivity creates tremendous vulnerabilities.\nBoth state and non-state actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Therefore, the more developed the states are the more vulnerable they are. Faced by this complexity some countries have declared to take radical measures to confront upcoming threats from cyber-attacks.\nHence cyber threats and readiness to respond to such threats by some states with the use of force in self-defense have raised some legal questions. Giving the nature of cyber attacks and the fact that current regulations for use of force in self-defense are designed for use of physical force, but not in cyberspace, it is not clear whether: (1) cyber attack could meet the standards of an armed attack; (2) cyber-attack is attributable to the state and (3) the use of force carried in self-defense could meet the standards for \"necessity\" and \"proportionality\". Therefore, the article will first explain how cyberspace affects states security. Then will examine when and under which circumstances can state (victim of a cyber attack lawfully use force in self defense).\n1. Security threats from cyberspace\nThreats from cyberspace are real and affect our everyday life. Unlike conventional threats these threats are hybrid coming both from state and non state actors. These actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Using different techniques and methods in the cyberspace both state and non-state actors generally (but not limited to) conduct cyber attacks\n- to spread misinformation,\n- for electronic espionage purposes that weakens state's competitive advantage,\n- to commit clandestine modification of sensitive data on the battlefield or\n- to affect countries' critical infrastructures\nMotives for such attacks through cyberspace differ. In general, they are usually conducted for social and criminal gain or for political and strategic military advantage. Thus, hybrid threats from cyberspace that underpins our security come from criminals, state actors, or groups and individuals with ideological and religiously violent motivation that could act independently or as a proxy to a violent state actor. Depending on the actor(s) and his/her/their motivation under current international regulations cyber attacks generally can be classified as cyber crime, cyber terror, or cyber warfare.¹\nCyber-attacks in Estonia (2007), Georgia (2008), Iran (2010), Burma (2010), USA (2011), Middle East (2012), confirm the above mentioned concerns and the effects that these attacks can cause.² Severity and the influence of these actions were also experienced during German Chancellor visit to China,³ by UK's financial, legal and retail firms, the Belgian federal government, or Pentagon in the US.⁴\nUrged by this complexity some countries and organizations such as U.S. and NATO have considered radical measures to confront upcoming threats from cyber-attacks. In its first formal cyber strategy U.S. concluded that computer sabotage coming from another country can constitute an act of war.⁵ Seeing itself as the world's premier collective defense entity, NATO believes that has a responsibility to take adequate measures to protect itself and its members from cyber threats.⁶\nHence cyber threats and readiness to respond to such threats by some states have raised some legal questions. Precisely, it is not clear whether or not such response would be legal under international norms, principles and standards. These concerns lead one to take a closer look into the international legislation with regards to use of force.\n¹ NATO Parliamentary Assembly, “NATO and Cyber defense”, 173 DSCFC 09 E BIS - NATO AND CYBER DEFENCE\n² Report of the New England Faculty Summit on Cyber Security held at Boston University on June 28, (2011), http://www.bu.edu/hic/files/2011/07/CyberSecuritySummitReport.pdf\n³ “Merkel’s China Visit Marred by Hacking Allegations”, Der Spiegel, August 27, 2007, accessed August 25, 2013 at: http://chinadigitaltimes.net/2007/08/merkels-china-visit-marred-by-hacking-allegations-spiegel/\n⁴ Rex B. Hughes, “NATO and Global Cyber Defense”, The Bucharest Conference Paper, Romanian Ministry of Foreign Affairs, March 2008, p44\n⁵ Siobhan Gorman and Julian E. Barnes: Cyber Combat : Act of War, The Wall Street Journal, (May 30, 2011), http://online.wsj.com/article/SB10001424052702304563104576355623135782718.html\n⁶ Sverre Myrli: NATO and Cyber Defense, NATO Parliamentary Assembly available at: http://www.nato-pa.int/default.Asp?SHORTCUT=1782.\n2. Use of force in international law as a response to cyber attack\nStates or international organizations could lawfully use force against cyber-attacks in two situations. First, if this is authorized by the United Nations Security Council (UNSC). Second, state(s), or international organization could use force in individual or collective self-defense. It is well known that UNSC resolutions are legally binding. This means that any decision made by the UNSC and translated into resolution to use force as a result of a cyber attack will be lawful.\nSince the UNSC mandates binding resolutions the decision to use force against an entity that had conducted cyber-attack under the Charter will be legal. However, having in mind that threat perceptions in the context of cyber attacks among member state will differ from state to state and that according to recent Security Council’s practice in such situations Council will fail to respond in a timely manner, it seems valid to assume that a state(s) will choose to respond with cyber attacks by exercising it/their right(s) to self-defense (individually or collectively).\n3. Self-defense against cyber-attack(s)?\nThe use of force by a victim state of a cyber attack(s) lawfully in self-defense would be possible only if: (1) cyber attack(s) meets the standards of an armed attack, (2) cyber-attack is attributable to the state where the self-defense is being carried out and (3) the use of force carried in self-defense is “necessary” and “proportional”. Legal analogy based debates among the scholars in the context of applicability of international legal standards and principles to cyber-attacks have stimulated numerous debates in the light of these conditions too. Precisely disagreements stem from the absence of the definition of what constitutes an armed attack under international law; challenges to attribute cyber-attack(s) to a state; and applicability of customary rules of self-defense along with the provisions under the UN Charter and interpretation.\n3.1. Cyber-attack as an armed attack?\nRelevant international organizations guidance, certain international instruments and legal scholar expressing their opinions, had tried to fill the absence of authoritative definition of armed conflict. Today it is well accepted that Jean Pictet’s guidance to determine the existence of an international armed conflict under Common Article 2 of the 1949 Geneva Conventions serve as a useful guide for assessing whether a particular use of force could be considered as an act equal to armed attack. According to Pictet’s guidance a use of force is considered an armed attack when the force is of “sufficient scope, duration, and intensity.”7 Another useful tool that helps to fill the absence of a legal definition of what constitutes armed attack is the U.N. General Assembly’s Resolution for “Definition of Aggression”. Although the Resolution does not contain a definition of armed attack this instrument provides examples of state actions that could be considered as an armed attack. Even more many argue that guidance of this instrument has gained extensive international acceptance.8\n7 Walter G. Sharp: Cyberspace and the use of force, Aegis Research Corporation, (1999) 60-61\n8 The U.N. Documents: Definition of Aggression, G.A. Res. 3314, U.N. GAOR, 29th Sess. (Dec. 14, 1974)\nSome scholars have tried to define armed conflict by explaining the distinction between terms “war” and “armed conflict”. Based on the threshold in ICRC Commentary of the Common Article 2 according to Sharp, de facto hostilities exist, and consequently the Jews in Bello apply when any use of force, regardless of its scope, duration, or intensity, occurs between the members of the armed forces of two states.\nBoth states and the International Court of Justice have frequently applied these guidance and explanations in the context of the conventional understanding of the use of force. Nevertheless, the authors disagree whether these guidance and explanations can be applied to cyber-attacks. While some legal scholars believe that it is intuitive that cyber-attacks can constitute armed attacks, especially in light of their ability to injure or kill, part of the legal community has been reluctant to classify them this way because they do not resemble \"classic attack(s) with traditional military force.\"¹⁰\nAuthors that negate the applicability of guidance and explanations of what constitutes an armed attack to cyber attacks are not united. There are authors who in fact disagree over the whole idea of applicability of *Ius ad bellum* to the cyberspace activities. Jeffrey Addicott, for example, asserts that “international laws associated with the use of force are woefully inadequate in terms of addressing the threat of cyber warfare”¹¹. On the other hand, there are authors who disagree only to the applicability limited to guidance and explanations of the conventional use of force. For the purpose and space of the given debate, we will focus on general arguments that these authors pose on their behalf in the context of the debate.\nDiscussing the conditions to meet criteria for using force as a response to unlawful armed attack Mary Oconel points that attempt to apply these conditions to cyber force actions is difficult, if not impossible. The sort of damage, according to this author’s views does not meet the condition that an armed attack must be significant to trigger Article 51. To prove her point she offers ICJ case law practice. Using *Nicaragua* case Oconel emphases Court’s views about the importance of “scale and effects” in determining whether or not specific action could be classified as an armed attack.¹²\nPeter Singer and Noah Shachtman share similar positions as *O’connel*. In their argumentation, they provide insights from recent state practice. Analyzing the effects of Russian cyber-attacks to Estonia and comparing cyber attacks against Georgian government with the actual Russian missiles and bombs in the accompanying war, they tried to point that effects from cyber attacks were incomparable with the effects from the actual armed attack.¹³ Therefore, they believe that it is even inappropriate to apply *is ad bellum* rules of the cyber domain. Similar explanations come from Duncan Hollis,\n⁹ Sharp suggests that war refers to a state of de jure hostilities invoked by a formal declaration of one party that creates an international armed conflict as a matter of law. In contrast, any other armed conflict refers to a state of de facto hostilities invoked by the use of force by one party without any declaration of war. He then concludes that determination when any other conflict exists is a factual subjective determination that centers on the use of force between states. Walter G. Sharp, (1999) 74\n¹⁰ Thomas Wingfield: *When is a Cyberattack an \"Armed Attack\"?: Legal Thresholds for Distinguishing military activities in cyberspace*, Cyber Conflict Studies Association, (2006) 6\n¹¹ Jeffrey F. Addicott, “Cyberterrorism: Legal Policy Issues,” in *Legal Issues in the Struggle against Terrorism*, eds. John N. Moore and Robert F. Turner, Durham, NC: Carolina Academic Press, (2010), 550\n¹² “...The prohibition of armed attacks may apply to the sending by a state of armed bands to the territory of another state, if such an operation, because of its scale and effects would have been classified as an armed attack rather than a mere frontier incident...” Marry E. O’connell: *Cyber Security and International Law*, International Law Meeting Summary, Chatham House (2012), 5-7\n¹³ Peter Singer and Noah Shachtman: *The Wrong War*, Foreign Policy 21st Century Defense Initiative, Brookings, (2011), http://www.brookings.edu/research/articles/2011/08/15-cybersecurity-singer-shachtman\nwho asserts that a cyber - attack alone will almost never constitute an armed attack for the purposes of Article 51. Hollis' argumentation for this position is that a cyber - attack lacks the physical characteristics traditionally associated with military coercion\".14 Although there are others who share these views many authors believe that guidance and explanations of what constitutes an armed attack in conventional terms could be also applicable to unconventional use of force including cyber-attacks.\nYoarm Dinstein is among the authors who share the view that cyber attack can constitute armed attack. Accordingly, in his analyses based on the \"instrument-based approach\" Dinstein uses the guidance and explanations of what constitutes an armed attack in conventional terms to prove that cyber-attacks can constitute armed attacks. The logic of this approach holds that if cyber-attacks could cause the destruction of a power grid than cyber-attack constitutes an armed attack. This is due to the fact that before the development of cyber capabilities such destruction could have been possible only by using kinetic force. Beside that article 3 of the \"Definition of Aggression\" provides implicit support to Dinsteins' approach.15\nUnlike Dinstein, Walter Sharp also believes that a cyber attack could constitute an armed attack. However, Sharp uses guidance and explanations of what constitutes an armed attack in conventional terms and merge them to the target of potential cyber attack. Eric Talbot along with Sharp advocates that cyber attack classifies as an armed attack if it targets a sufficiently important computer system.16 Baring in mind our previous discussion about the importance of SCADA systems and the complexity of the risks that these systems' failure could cause sound reasonable to agree with these authors' logics. Purposeful cyber-attack to SCADA systems could cause failure of these systems and therefore cascade severe consequences. We could not agree less that in situations like this, cyber-attacks would meet not just the ICRC threshold regarding the \"intensity\", but also ICJ well established test \"scale and effects\" for determining whether or not specific action could be classified as an armed attack. Nonetheless the issue with this approach in determining when a cyber - attack could constitute an armed attack is that its proponents advocate aggressive response based on the \"strict liability\". Sean Condron, for example, argues that a cyber-attack constitutes an armed attack, and would grant the target the right to use force in self-defense, whenever it penetrates any critical national infrastructure system, regardless of whether it has yet caused any physical destruction or casualties.17\nMichael Schmitt, former colonel turned professor, uses his own developed model to measure the consequences of cyber-attack under the guidance and explanations of what constitutes an armed attack in conventional terms. Schmitt propagates that one needs to consider seven factors before deciding if a cyber-attack's effects could be deemed to armed attack. These factors are severity (the type and scale of the harm); immediacy (how quickly the harm materializes after the attack); directness (the length of the causal chain between the attack and the harm); invasiveness (the degree to which the attack penetrates the victim state's territory);\n14 In other words, because it generally does not use traditional military weapons, Duncan B. Hollis: Why States Need an International Law for Information Operations, 11 Lewis &amp; Clark L. Rev. (2007), 1023-1042\n15 This view has some support in the article 41 of the U.N. Charter as well Yoram Dinstein: Computer Network Attacks and Self-Defense, in: Michael N. Schmitt &amp; Brian T. O'Donnell eds. Computer Network Attack And International Law, (2002), 99\n16 Walter Sharp, (1999), 129-130\n17 Sean M. Condron: Getting it Right: Protecting American Critical Infrastructure in Cyberspace, 20 Harvard J.L. &amp; Tech., (2007), 403, 415-16\nmeasurability (the degree to which the harm can be quantified); presumptive legitimacy, (the weight given to the fact that) and responsibility (to be able to attribute the attack).¹⁸ If the cyber-attack, in the field of cyber-activities as a whole, meets these criteria, cyber-attacks constituting an armed attack are the exception rather than the rule. These factors are illuminating, but they call for such a wide-ranging inquiry that they may not provide sufficient guidance to decision makers.¹⁹ Although widely accepted some argue that Schmitt model suffers from some inconsistencies. It could be argued that only a small number of cyber-attacks could rise to the level of armed attack.²⁰ Another issue arises from the ability to foresee the severity of the attack which could be abused since it is highly subjective.\nThe analyses of two opposing groups of authors further confirm the complexity that cyberspace poses to the society and security in a broader and law in a narrow context. In the light of our previous discussion regarding the complexity (growing asymmetry in a cyberspace and the “paradox of modernity”) it seems that second group of authors’ arguments for now, are more convincing. Just because we have not experienced a severe cyber-attack that could cause death and significant material property damage this does not mean that a cyber-attack or series of such attacks could not rise to a level of what is considered to be an armed attack under International law. Precisely, certain cyber-attacks could rise to amount of armed attack that under *Ius ad bellum* principles, standards and norms could justify the use of military force. Nevertheless, in order for victim state to be able to use force in self-defense lawfully beside the condition that state needs to be a victim of illegal action that constitutes armed attack the victim state must attribute such illegal attack(s) directly and conclusively to another state or agents under that state’s direct control.²¹\n## 3.2. The challenge of attribution\nMost of the arguments that build “pro” and “contra” views to use military force against cyber-attacks in the context of requirement to attribute responsibility steam from the premises that we discussed regarding the so-call “paradox of modernity”. Legal scholars who disagree to apply the analogy of *Ius ad bellum* standards, principles and norms to cyberspace threats generally focus on the difficulties to attribute cyber-attacks directly and conclusively to another state.\nBret Michael and Thomas Wingfiled propose that the issue of attribution in cyberspace derives from technical challenges... since the Internet was conceived without a requirement for users’ accountability. The problem according to them is even more complicated since they argue that the attribution in cyberspace is “asymmetric”.²²\nDiscussing the challenge of attribution in cyberspace Eric Jensen concludes similarly to Michael and Wingfield, that tracing cyber-attacks can be exceptionally long process. The problem with accuracy, however never ends since as he asserts even\n¹⁸ Michel Schmitt: Computer Network Attack and the Use of force in International law: The Columbia Journal of Transnational Law, Volume 37, (1999), 885-937\n¹⁹ This analytical approach is important for our debate since it seems that it would appear to be the analytical model adopted by the United States. Office Of General Counsel, Department Of Defense: An Assessment Of International Legal Issues In Information Operations, (May 1999)\n²⁰ Daniel B. Silver, Computer Network Attack as a Use of Force Under Article 2(4), 76 Int’l Law Studies 73, (2002) 92–93\n²¹ Sean M. Condron, (2007), 414\n²² Bret Michael and Thomas Wingfiled: International Legal Reform Could Make States Liable for Cyber Abuse, Per Concordiam, Journal of European Security and Defense Issues, Vol.2 Issue 2, (2011), 40-41\nif the server is located to “...identify the entity or individual directing the attack is extremely hard. Nevertheless, he advocates for changing the approach.²³ The issue with cyber terrorists’ and cyber criminal modus operandi discussed by Davis Brown seems to echo Jensens’ analyses. Cyber-terrorists and cyber criminals often hijack innocent systems and use them as “zombies” to initiate their cyber-attacks. While victim-states must try to penetrate such guises, current technology may not always allow them to do so in a timely manner.²⁴ O’connel offers state practice to point that as a source of International law, it also requires for attribution to be made with clear and convincing evidence. Nevertheless, much similarly as previously cited authors she concludes that in the case of cyber-attack such convincing evidence is hard to find.\nSince legal requirements for conclusive attribution is hard to apply in case of cyber-attacks, some have suggested that states could legally employ cross-border cyber attacks and therefore not use military force. Using the transnational criminal approach Michael and Wingfiled see this approach promising. They do believe in potentials to establish international jurisdiction where individuals and groups may be investigated and prosecuted under other countries’ domestic law.²⁵\nAuthors who advocate that cyber-attacks could trigger the use of force in self-defense lawfully under the International law in response to “attribution challenge” offer different proposals. Mainly they build their argumentation based on the same issues proposed by the authors who disagree with their positions, i.e. the complexity to directly and conclusively attribute the cyber-attack(s).\nSome recognize that attribution stubbornly permeates every aspect of cyber operations, however they consider this as a technical issue, not a legal one. Therefore they advocate that the identity of the attacker may well determine if a state of war exists.²⁶ Others have tried to materialize their argumentation emphasizing the risks that cyber-attacks pose to the states. Sean Cordon explains that if states are about to follow traditional procedures to attribute responsibility regarding the nature of cyber-attacks than they need to be ready to experience risks that a cyber attack could pose. This, according to him could create a dilemma for the states.²⁷ Similar views have echoed that such situations could put states in the limbo position between its safety traditional legislation and imperfect reality.²⁸\nFrom all of the above it is clear that direct and concessive attribution to cyber attack is not easy to achieve. Difficulty to locate the entity responsible for cyber-attack(s) is stubborn impediment that questions lawful response in self-defense. On the other hand, neither cyber-attacks are traditional nor the traditional test for state responsibility aloud victim state to exercise the inherent right of self-defense appropriately. Legal scholars’ disagreements over applicability of self-defense under international law to cyber-attacks culminate in the context of necessity, proportionality and anticipatory self-defense.\n²³ Eric Jensen: Computer Attacks on Critical National Infrastructure: A Use of Force Invoking the Right of Self-Defense, 38 Stanford Journal of International Law, (2002) 207\n²⁴ Davis Brown: A Proposal for an International Convention to Regulate the Use of Information Systems in Armed Conflict, 47 Harvard International Law Journal (2006) 181-183\n²⁵ Bret Michael and Thomas Wingfiled, (2011), 41\n²⁶ Charles Dunlap: Perspectives for Cyber Strategists on Law for Cyberwar, Strategic Study Quarterly, Spring, (2011), 88\n²⁷ Sean Condron, (2007), 414-415\n²⁸ Duncan B. Hollis, (2007), 1026\n## 3.3. Necessity and proportionality against cyber-attacks\nNecessity and proportionality are founding principles of appropriate self-defense.²⁹ As well as other elements that build the threshold of lawful self-defense against cyber-attacks these principles considered in the context of cyber-attacks are highly disputed among the legal scholars. If under the given evidences state cannot achieve a reasonable settlement of a dispute through peaceful means self-defense against cyber-attack will meet the requirement of necessity. Self-defense against cyber-attack is proportional if victim state limits its actions to the amount of force required to defeat an ongoing cyber-attack or to deter a future cyber-attacks.³⁰ Compliance with the principles of necessity and proportionality is difficult and fact-intensive even for conventional attacks, and therefore cyber-attacks present new hard challenges.\nAuthors who disagree with the overall applicability of *Ius ad bellum* to cyber-attacks believe that necessity and proportionality are difficult conditions to meet. Building on the previous discussions this part of the legal community considers that difficulties come from the complexity of cyber-attacks and as a consequence the amount of the time needed to attribute the attack. Evidences from recent cases like Estonia or Iran confirm these considerations. In both situations, attacks came from different locations. Therefore the biggest concern regarding the international legal requirements for lawful self-defense against cyber-attack is the defensive response. Technical challenge also raises considerations toward these directions. In fact the defending state would need time to consider the effects that counter measures could cause. Nevertheless, putted into the light of analytical models previously described in determining whether cyber-attacks could constitute a lawful armed attack, such evidences are not convincing. If for example one considers effect based-approach to determine if cyber-attacks qualify as an armed attack necessity is highly dependable of the effects caused by the cyber-attack(s). If victim state suffers severely and there are reasonable doubts that aggressor is preparing further cyber-attacks than the threshold of necessity change. In fact the imminence of danger aloud for victim state to respond before it is too late. At the same time proportional-limited military response to disrupt or destroy the base or the system that has caused or is about to cause further cyber-attacks sounds logically and acceptable under the recent *Ius ad bellum practice*.\nSince both analytical models “effect based” and “strict liability” model advocated for elements that consider *ex-ante* use of force in the context of our debate it is worth mentioning the issue of anticipatory self-defense.\n## 3.4. Anticipatory self-defense and cyber-attacks\nThe issue of anticipatory self-defense has been long debated among the legal scholars even in conventional terms. Measures undertaken in anticipatory self-defense are lawful when the “necessity of that self-defense is instant, overwhelming, and leaving no choice of means, and no moment for deliberation.”³¹ Since the vocabulary that explains what constitutes anticipatory self-defense differs from the course of article 51 of the Charter it is well accepted that anticipatory self-defense is considered as customary self-defense. Contrary to these views significant part of the legal community\n---\n²⁹ Thomas Wingfield: The Law of Information conflict: National Security Law in Cyberspace (2000) 42\n³⁰ Yoram Dinstein: War, Aggression and Self-defense (4th ed. 2005) 237\n³¹ Lori Fisler Damrosch et al.: International Law: Cases and Materials 59 5th ed. (2009) 1135\nbelieves that self- defense should be practiced not outside the Charter.³² Under these circumstances lawful ex-ante use of force (as “strict liability” or to a certain degree “effect based” analytical models suggest) would require victim state to sufficiently demonstrate the imminence of an anticipated attack. In the case of cyber attacks, such a requirement would invariably be difficult to meet, if not impossible.\n## Conclusion\nTelecommunication and information technologies have changed our way of leaving. Cyberspace is both necessity but also vulnerability. Abusing cyberspace state and non state actors commit cyber attacks designed to spread misinformation, weaken state’s competitive advantage through electronic espionage, commit clandestine modification of sensitive data on the battlefield or affect countries’ critical infrastructures. In order to protect themselves against violent destructive and illegal activities some states are prepared to use force in self-defense. These commitments however have raised serious legal questions.\nThe overall debate over the applicability of *Ius ad bellum* principles, standards and norms to cyber-attacks unequivocally showed that it is not quite clear whether or not, states could lawfully use force in self-defense against cyber attack. Although under specific conditions cyber-attacks could amount to armed attack(s), it is very hard to attribute such attacks to a state or non-state actors. Additionally necessity and proportionality along with the ex-ante attitude (i.e. anticipatory self – defense) are highly disputed among the legal scholars. All of these challenges require for one to reconsider legal alternatives that could provide more appropriate solutions to cyber-attacks and cyber-security.",
  "references": [
    "## References\n1. Bret Michael and Thomas Wingfiled: International Legal Reform Could Make States Liable for Cyber Abuse, Per Concordiam, Journal of European Security and Defense Issues, Vol.2 Issue 2, (2011),\n2. Charles Dunlap: Perspectives for Cyber Strategists on Law for Cyberwar, Strategic Study Quarterly, Spring, (2011),\n3. Daniel B. Silver, Computer Network Attack as a Use of Force Under Article 2(4), 76 Int’l Law Studies 73, (2002),\n4. Davis Brown: A Proposal for an International Convention to Regulate the Use of Information Systems in Armed Conflict, 47 Harvard International Law Journal (2006),\n5. Duncan B. Hollis: Why States Need an International Law for Information Operations, 11 Lewis &amp; Clark L. Rev. (2007),\n6. Eric Jensen: Computer Attacks on Critical National Infrastructure: A Use of Force Invoking the Right of Self-Defense, 38 Stanford Journal of International Law, (2002),\n³² In fact, The UN World Summit Outcome Document of 2005 restates the international community’s support for strict compliance with the “Charter rules on use of force”\n7. Jeffrey F. Addicott, \"Cyberterrorism: Legal Policy Issues,\" in *Legal Issues in the Struggle against Terrorism*, eds. John N. Moore and Robert F. Turner, Durham, NC: Carolina Academic Press, (2010),\n8. Lori Fisler Damrosch et al.: International Law: Cases and Materials 59 5th ed. (2009),\n9. Marry E. O'connell: Cyber Security and International Law, International Law Meeting Summary, Chatham House (2012),\n10. Michel Schmitt: Computer Network Attack and the Use of force in International law: The Columbia Journal of Transnational Law, Volume 37, (1999),\n11. NATO Parliamentary Assembly, \"NATO and Cyber defense\", 173 DSCFC 09 E BIS - NATO AND CYBER DEFENCE,\n12. Office Of General Counsel, Department Of Defense: An Assessment Of International Legal Issues In Information Operations, (May 1999),\n13. Peter Singer and Noah Shachtman: The Wrong War, Foreign Policy 21st Century Defense Initiative, Brookings, (2011), http://www.brookings.edu/research/articles/2011/08/15-cybersecurity-singer-shachtman,\n14. Report of the New England Faculty Summit on Cyber Security held at Boston University on June 28, (2011), http://www.bu.edu/hic/files/2011/07/CyberSecuritySummitReport.pdf,\n15. Rex B. Hughes, \"NATO and Global Cyber Defense\", The Bucharest Conference Paper, Romanian Ministry of Foreign Affairs, March 2008,\n16. Siobhan Gorman and Julian E. Barnes: Cyber Combat : Act of War, The Wall Street Journal, (May 30, 2011), http://online.wsj.com/article/SB10001424052702304563104576355623135782718.html,\n17. Sverre Myrli: NATO and Cyber Defense, NATO Parliamentary Assembly available at: http://www.nato-pa.int/default.Asp?SHORTCUT=1782,\n18. Sean M. Condron: Getting it Right: Protecting American Critical Infrastructure in Cyberspace, 20 Harvard J.L. &amp; Tech., (2007),\n19. The U.N. Documents: Definition of Aggression, G.A. Res. 3314, U.N. GAOR, 29th Sess. (Dec. 14, 1974),\n20. Thomas Wingfield: The Law of Information conflict: National Security Law in Cyberspace (2000),\n21. Thomas Wingfield: When is a Cyberattack an \"Armed Attack?\": Legal Thresholds for Distinguishing military activities in cyberspace, Cyber Conflict Studies Association, (2006),\n22. Yoram Dinstein: Computer Network Attacks and Self-Defense, in: Michael N. Schmitt &amp; Brian T. O'Donnell eds. Computer Network Attack And International Law, (2002),\n23. Yoram Dinstein: War, Aggression and Self-defense (4th ed. 2005),\n24. Walter G. Sharp: Cyberspace and the use of force, Aegis Research Corporation, (1999),\n25. \"Merkel's China Visit Marred by Hacking Allegations\", Der Spiegel, August 27, 2007, accessed August 25, 2013 at: http://chinadigitaltimes.net/2007/08/merkels-china-visit-marred-by-hacking-allegations-spiegel/"
  ],
  "flat_text": "# Use of force against cyber attacks\nAuthor: Metodi Hadji-Janev\nMilitary Academy “General Mihailo Apostolski”-Skopje,\nUniversity “Goce Delcev”-Stip”, Republic of Macedonia\nAbstract. The rapid development of the technology in an age of intensified globalization has seriously affected international security. Today state and non-state actors can use telecommunication and information technologies in a disruptive way and through cyberspace remotely cause damages to the critical infrastructures that run our everyday live and on which we depend upon. Urged by this complexity some countries have considered military response including the use of force in self-defense. However international legal standards, principles and norms that regulate use of force under international law do not mention use of force against cyber attacks. Therefore it is not quite clear whether or not states can lawfully use force in self-defense against cyber attacks.\nKeywords. *Ius ad bellum*, armed attack, self-defense, cyber-attack, proportionality, necessity, anticipatory self-defense\n# Introduction\nThe development of modern technology and interconnectivity has brought both positive and negative effects. Today, thanks to a modern technology we leave in a world of global interconnectedness which through linked digital information networks brings vast benefits. Nevertheless, although designed and created for good electronic and informational interconnectivity creates tremendous vulnerabilities.\nBoth state and non-state actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Therefore, the more developed the states are the more vulnerable they are. Faced by this complexity some countries have declared to take radical measures to confront upcoming threats from cyber-attacks.\nHence cyber threats and readiness to respond to such threats by some states with the use of force in self-defense have raised some legal questions. Giving the nature of cyber attacks and the fact that current regulations for use of force in self-defense are designed for use of physical force, but not in cyberspace, it is not clear whether: (1) cyber attack could meet the standards of an armed attack; (2) cyber-attack is attributable to the state and (3) the use of force carried in self-defense could meet the standards for \"necessity\" and \"proportionality\". Therefore, the article will first explain how cyberspace affects states security. Then will examine when and under which circumstances can state (victim of a cyber attack lawfully use force in self defense).\n1. Security threats from cyberspace\nThreats from cyberspace are real and affect our everyday life. Unlike conventional threats these threats are hybrid coming both from state and non state actors. These actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Using different techniques and methods in the cyberspace both state and non-state actors generally (but not limited to) conduct cyber attacks\n- to spread misinformation,\n- for electronic espionage purposes that weakens state's competitive advantage,\n- to commit clandestine modification of sensitive data on the battlefield or\n- to affect countries' critical infrastructures\nMotives for such attacks through cyberspace differ. In general, they are usually conducted for social and criminal gain or for political and strategic military advantage. Thus, hybrid threats from cyberspace that underpins our security come from criminals, state actors, or groups and individuals with ideological and religiously violent motivation that could act independently or as a proxy to a violent state actor. Depending on the actor(s) and his/her/their motivation under current international regulations cyber attacks generally can be classified as cyber crime, cyber terror, or cyber warfare.\nCyber-attacks in Estonia (2007), Georgia (2008), Iran (2010), Burma (2010), USA (2011), Middle East (2012), confirm the above mentioned concerns and the effects that these attacks can cause. Severity and the influence of these actions were also experienced during German Chancellor visit to China, by UK's financial, legal and retail firms, the Belgian federal government, or Pentagon in the US.\nUrged by this complexity some countries and organizations such as U.S. and NATO have considered radical measures to confront upcoming threats from cyber-attacks. In its first formal cyber strategy U.S. concluded that computer sabotage coming from another country can constitute an act of war. Seeing itself as the world's premier collective defense entity, NATO believes that has a responsibility to take adequate measures to protect itself and its members from cyber threats.\nHence cyber threats and readiness to respond to such threats by some states have raised some legal questions. Precisely, it is not clear whether or not such response would be legal under international norms, principles and standards. These concerns lead one to take a closer look into the international legislation with regards to use of force.\n NATO Parliamentary Assembly, “NATO and Cyber defense”, 173 DSCFC 09 E BIS - NATO AND CYBER DEFENCE\n Report of the New England Faculty Summit on Cyber Security held at Boston University on June 28, (2011), http://www.bu.edu/hic/files/2011/07/CyberSecuritySummitReport.pdf\n “Merkel’s China Visit Marred by Hacking Allegations”, Der Spiegel, August 27, 2007, accessed August 25, 2013 at: http://chinadigitaltimes.net/2007/08/merkels-china-visit-marred-by-hacking-allegations-spiegel/\n Rex B. Hughes, “NATO and Global Cyber Defense”, The Bucharest Conference Paper, Romanian Ministry of Foreign Affairs, March 2008, p44\n Siobhan Gorman and Julian E. Barnes: Cyber Combat : Act of War, The Wall Street Journal, (May 30, 2011), http://online.wsj.com/article/SB10001424052702304563104576355623135782718.html\n Sverre Myrli: NATO and Cyber Defense, NATO Parliamentary Assembly available at: http://www.nato-pa.int/default.Asp?SHORTCUT=1782.\n2. Use of force in international law as a response to cyber attack\nStates or international organizations could lawfully use force against cyber-attacks in two situations. First, if this is authorized by the United Nations Security Council (UNSC). Second, state(s), or international organization could use force in individual or collective self-defense. It is well known that UNSC resolutions are legally binding. This means that any decision made by the UNSC and translated into resolution to use force as a result of a cyber attack will be lawful.\nSince the UNSC mandates binding resolutions the decision to use force against an entity that had conducted cyber-attack under the Charter will be legal. However, having in mind that threat perceptions in the context of cyber attacks among member state will differ from state to state and that according to recent Security Council’s practice in such situations Council will fail to respond in a timely manner, it seems valid to assume that a state(s) will choose to respond with cyber attacks by exercising it/their right(s) to self-defense (individually or collectively).\n3. Self-defense against cyber-attack(s)?\nThe use of force by a victim state of a cyber attack(s) lawfully in self-defense would be possible only if: (1) cyber attack(s) meets the standards of an armed attack, (2) cyber-attack is attributable to the state where the self-defense is being carried out and (3) the use of force carried in self-defense is “necessary” and “proportional”. Legal analogy based debates among the scholars in the context of applicability of international legal standards and principles to cyber-attacks have stimulated numerous debates in the light of these conditions too. Precisely disagreements stem from the absence of the definition of what constitutes an armed attack under international law; challenges to attribute cyber-attack(s) to a state; and applicability of customary rules of self-defense along with the provisions under the UN Charter and interpretation.\n3.1. Cyber-attack as an armed attack?\nRelevant international organizations guidance, certain international instruments and legal scholar expressing their opinions, had tried to fill the absence of authoritative definition of armed conflict. Today it is well accepted that Jean Pictet’s guidance to determine the existence of an international armed conflict under Common Article 2 of the 1949 Geneva Conventions serve as a useful guide for assessing whether a particular use of force could be considered as an act equal to armed attack. According to Pictet’s guidance a use of force is considered an armed attack when the force is of “sufficient scope, duration, and intensity.”7 Another useful tool that helps to fill the absence of a legal definition of what constitutes armed attack is the U.N. General Assembly’s Resolution for “Definition of Aggression”. Although the Resolution does not contain a definition of armed attack this instrument provides examples of state actions that could be considered as an armed attack. Even more many argue that guidance of this instrument has gained extensive international acceptance.8\n\nSome scholars have tried to define armed conflict by explaining the distinction between terms “war” and “armed conflict”. Based on the threshold in ICRC Commentary of the Common Article 2 according to Sharp, de facto hostilities exist, and consequently the Jews in Bello apply when any use of force, regardless of its scope, duration, or intensity, occurs between the members of the armed forces of two states.\nBoth states and the International Court of Justice have frequently applied these guidance and explanations in the context of the conventional understanding of the use of force. Nevertheless, the authors disagree whether these guidance and explanations can be applied to cyber-attacks. While some legal scholars believe that it is intuitive that cyber-attacks can constitute armed attacks, especially in light of their ability to injure or kill, part of the legal community has been reluctant to classify them this way because they do not resemble \"classic attack(s) with traditional military force.\"\nAuthors that negate the applicability of guidance and explanations of what constitutes an armed attack to cyber attacks are not united. There are authors who in fact disagree over the whole idea of applicability of *Ius ad bellum* to the cyberspace activities. Jeffrey Addicott, for example, asserts that “international laws associated with the use of force are woefully inadequate in terms of addressing the threat of cyber warfare”. On the other hand, there are authors who disagree only to the applicability limited to guidance and explanations of the conventional use of force. For the purpose and space of the given debate, we will focus on general arguments that these authors pose on their behalf in the context of the debate.\nDiscussing the conditions to meet criteria for using force as a response to unlawful armed attack Mary Oconel points that attempt to apply these conditions to cyber force actions is difficult, if not impossible. The sort of damage, according to this author’s views does not meet the condition that an armed attack must be significant to trigger Article 51. To prove her point she offers ICJ case law practice. Using *Nicaragua* case Oconel emphases Court’s views about the importance of “scale and effects” in determining whether or not specific action could be classified as an armed attack.\nPeter Singer and Noah Shachtman share similar positions as *O’connel*. In their argumentation, they provide insights from recent state practice. Analyzing the effects of Russian cyber-attacks to Estonia and comparing cyber attacks against Georgian government with the actual Russian missiles and bombs in the accompanying war, they tried to point that effects from cyber attacks were incomparable with the effects from the actual armed attack. Therefore, they believe that it is even inappropriate to apply *is ad bellum* rules of the cyber domain. Similar explanations come from Duncan Hollis,\n Sharp suggests that war refers to a state of de jure hostilities invoked by a formal declaration of one party that creates an international armed conflict as a matter of law. In contrast, any other armed conflict refers to a state of de facto hostilities invoked by the use of force by one party without any declaration of war. He then concludes that determination when any other conflict exists is a factual subjective determination that centers on the use of force between states. Walter G. Sharp, (1999) 74\n Thomas Wingfield: *When is a Cyberattack an \"Armed Attack\"?: Legal Thresholds for Distinguishing military activities in cyberspace*, Cyber Conflict Studies Association, (2006) 6\n Jeffrey F. Addicott, “Cyberterrorism: Legal Policy Issues,” in *Legal Issues in the Struggle against Terrorism*, eds. John N. Moore and Robert F. Turner, Durham, NC: Carolina Academic Press, (2010), 550\n “...The prohibition of armed attacks may apply to the sending by a state of armed bands to the territory of another state, if such an operation, because of its scale and effects would have been classified as an armed attack rather than a mere frontier incident...” Marry E. O’connell: *Cyber Security and International Law*, International Law Meeting Summary, Chatham House (2012), 5-7\n Peter Singer and Noah Shachtman: *The Wrong War*, Foreign Policy 21st Century Defense Initiative, Brookings, (2011), http://www.brookings.edu/research/articles/2011/08/15-cybersecurity-singer-shachtman\nwho asserts that a cyber - attack alone will almost never constitute an armed attack for the purposes of Article 51. Hollis' argumentation for this position is that a cyber - attack lacks the physical characteristics traditionally associated with military coercion\".14 Although there are others who share these views many authors believe that guidance and explanations of what constitutes an armed attack in conventional terms could be also applicable to unconventional use of force including cyber-attacks.\nYoarm Dinstein is among the authors who share the view that cyber attack can constitute armed attack. Accordingly, in his analyses based on the \"instrument-based approach\" Dinstein uses the guidance and explanations of what constitutes an armed attack in conventional terms to prove that cyber-attacks can constitute armed attacks. The logic of this approach holds that if cyber-attacks could cause the destruction of a power grid than cyber-attack constitutes an armed attack. This is due to the fact that before the development of cyber capabilities such destruction could have been possible only by using kinetic force. Beside that article 3 of the \"Definition of Aggression\" provides implicit support to Dinsteins' approach.15\nUnlike Dinstein, Walter Sharp also believes that a cyber attack could constitute an armed attack. However, Sharp uses guidance and explanations of what constitutes an armed attack in conventional terms and merge them to the target of potential cyber attack. Eric Talbot along with Sharp advocates that cyber attack classifies as an armed attack if it targets a sufficiently important computer system.16 Baring in mind our previous discussion about the importance of SCADA systems and the complexity of the risks that these systems' failure could cause sound reasonable to agree with these authors' logics. Purposeful cyber-attack to SCADA systems could cause failure of these systems and therefore cascade severe consequences. We could not agree less that in situations like this, cyber-attacks would meet not just the ICRC threshold regarding the \"intensity\", but also ICJ well established test \"scale and effects\" for determining whether or not specific action could be classified as an armed attack. Nonetheless the issue with this approach in determining when a cyber - attack could constitute an armed attack is that its proponents advocate aggressive response based on the \"strict liability\". Sean Condron, for example, argues that a cyber-attack constitutes an armed attack, and would grant the target the right to use force in self-defense, whenever it penetrates any critical national infrastructure system, regardless of whether it has yet caused any physical destruction or casualties.17\nMichael Schmitt, former colonel turned professor, uses his own developed model to measure the consequences of cyber-attack under the guidance and explanations of what constitutes an armed attack in conventional terms. Schmitt propagates that one needs to consider seven factors before deciding if a cyber-attack's effects could be deemed to armed attack. These factors are severity (the type and scale of the harm); immediacy (how quickly the harm materializes after the attack); directness (the length of the causal chain between the attack and the harm); invasiveness (the degree to which the attack penetrates the victim state's territory);\n\nmeasurability (the degree to which the harm can be quantified); presumptive legitimacy, (the weight given to the fact that) and responsibility (to be able to attribute the attack). If the cyber-attack, in the field of cyber-activities as a whole, meets these criteria, cyber-attacks constituting an armed attack are the exception rather than the rule. These factors are illuminating, but they call for such a wide-ranging inquiry that they may not provide sufficient guidance to decision makers. Although widely accepted some argue that Schmitt model suffers from some inconsistencies. It could be argued that only a small number of cyber-attacks could rise to the level of armed attack. Another issue arises from the ability to foresee the severity of the attack which could be abused since it is highly subjective.\nThe analyses of two opposing groups of authors further confirm the complexity that cyberspace poses to the society and security in a broader and law in a narrow context. In the light of our previous discussion regarding the complexity (growing asymmetry in a cyberspace and the “paradox of modernity”) it seems that second group of authors’ arguments for now, are more convincing. Just because we have not experienced a severe cyber-attack that could cause death and significant material property damage this does not mean that a cyber-attack or series of such attacks could not rise to a level of what is considered to be an armed attack under International law. Precisely, certain cyber-attacks could rise to amount of armed attack that under *Ius ad bellum* principles, standards and norms could justify the use of military force. Nevertheless, in order for victim state to be able to use force in self-defense lawfully beside the condition that state needs to be a victim of illegal action that constitutes armed attack the victim state must attribute such illegal attack(s) directly and conclusively to another state or agents under that state’s direct control.\n## 3.2. The challenge of attribution\nMost of the arguments that build “pro” and “contra” views to use military force against cyber-attacks in the context of requirement to attribute responsibility steam from the premises that we discussed regarding the so-call “paradox of modernity”. Legal scholars who disagree to apply the analogy of *Ius ad bellum* standards, principles and norms to cyberspace threats generally focus on the difficulties to attribute cyber-attacks directly and conclusively to another state.\nBret Michael and Thomas Wingfiled propose that the issue of attribution in cyberspace derives from technical challenges... since the Internet was conceived without a requirement for users’ accountability. The problem according to them is even more complicated since they argue that the attribution in cyberspace is “asymmetric”.\nDiscussing the challenge of attribution in cyberspace Eric Jensen concludes similarly to Michael and Wingfield, that tracing cyber-attacks can be exceptionally long process. The problem with accuracy, however never ends since as he asserts even\n Michel Schmitt: Computer Network Attack and the Use of force in International law: The Columbia Journal of Transnational Law, Volume 37, (1999), 885-937\n This analytical approach is important for our debate since it seems that it would appear to be the analytical model adopted by the United States. Office Of General Counsel, Department Of Defense: An Assessment Of International Legal Issues In Information Operations, (May 1999)\n Daniel B. Silver, Computer Network Attack as a Use of Force Under Article 2(4), 76 Int’l Law Studies 73, (2002) 92–93\n Sean M. Condron, (2007), 414\n Bret Michael and Thomas Wingfiled: International Legal Reform Could Make States Liable for Cyber Abuse, Per Concordiam, Journal of European Security and Defense Issues, Vol.2 Issue 2, (2011), 40-41\nif the server is located to “...identify the entity or individual directing the attack is extremely hard. Nevertheless, he advocates for changing the approach. The issue with cyber terrorists’ and cyber criminal modus operandi discussed by Davis Brown seems to echo Jensens’ analyses. Cyber-terrorists and cyber criminals often hijack innocent systems and use them as “zombies” to initiate their cyber-attacks. While victim-states must try to penetrate such guises, current technology may not always allow them to do so in a timely manner. O’connel offers state practice to point that as a source of International law, it also requires for attribution to be made with clear and convincing evidence. Nevertheless, much similarly as previously cited authors she concludes that in the case of cyber-attack such convincing evidence is hard to find.\nSince legal requirements for conclusive attribution is hard to apply in case of cyber-attacks, some have suggested that states could legally employ cross-border cyber attacks and therefore not use military force. Using the transnational criminal approach Michael and Wingfiled see this approach promising. They do believe in potentials to establish international jurisdiction where individuals and groups may be investigated and prosecuted under other countries’ domestic law.\nAuthors who advocate that cyber-attacks could trigger the use of force in self-defense lawfully under the International law in response to “attribution challenge” offer different proposals. Mainly they build their argumentation based on the same issues proposed by the authors who disagree with their positions, i.e. the complexity to directly and conclusively attribute the cyber-attack(s).\nSome recognize that attribution stubbornly permeates every aspect of cyber operations, however they consider this as a technical issue, not a legal one. Therefore they advocate that the identity of the attacker may well determine if a state of war exists. Others have tried to materialize their argumentation emphasizing the risks that cyber-attacks pose to the states. Sean Cordon explains that if states are about to follow traditional procedures to attribute responsibility regarding the nature of cyber-attacks than they need to be ready to experience risks that a cyber attack could pose. This, according to him could create a dilemma for the states. Similar views have echoed that such situations could put states in the limbo position between its safety traditional legislation and imperfect reality.\nFrom all of the above it is clear that direct and concessive attribution to cyber attack is not easy to achieve. Difficulty to locate the entity responsible for cyber-attack(s) is stubborn impediment that questions lawful response in self-defense. On the other hand, neither cyber-attacks are traditional nor the traditional test for state responsibility aloud victim state to exercise the inherent right of self-defense appropriately. Legal scholars’ disagreements over applicability of self-defense under international law to cyber-attacks culminate in the context of necessity, proportionality and anticipatory self-defense.\n Eric Jensen: Computer Attacks on Critical National Infrastructure: A Use of Force Invoking the Right of Self-Defense, 38 Stanford Journal of International Law, (2002) 207\n Davis Brown: A Proposal for an International Convention to Regulate the Use of Information Systems in Armed Conflict, 47 Harvard International Law Journal (2006) 181-183\n Bret Michael and Thomas Wingfiled, (2011), 41\n Charles Dunlap: Perspectives for Cyber Strategists on Law for Cyberwar, Strategic Study Quarterly, Spring, (2011), 88\n Sean Condron, (2007), 414-415\n Duncan B. Hollis, (2007), 1026\n## 3.3. Necessity and proportionality against cyber-attacks\nNecessity and proportionality are founding principles of appropriate self-defense. As well as other elements that build the threshold of lawful self-defense against cyber-attacks these principles considered in the context of cyber-attacks are highly disputed among the legal scholars. If under the given evidences state cannot achieve a reasonable settlement of a dispute through peaceful means self-defense against cyber-attack will meet the requirement of necessity. Self-defense against cyber-attack is proportional if victim state limits its actions to the amount of force required to defeat an ongoing cyber-attack or to deter a future cyber-attacks. Compliance with the principles of necessity and proportionality is difficult and fact-intensive even for conventional attacks, and therefore cyber-attacks present new hard challenges.\nAuthors who disagree with the overall applicability of *Ius ad bellum* to cyber-attacks believe that necessity and proportionality are difficult conditions to meet. Building on the previous discussions this part of the legal community considers that difficulties come from the complexity of cyber-attacks and as a consequence the amount of the time needed to attribute the attack. Evidences from recent cases like Estonia or Iran confirm these considerations. In both situations, attacks came from different locations. Therefore the biggest concern regarding the international legal requirements for lawful self-defense against cyber-attack is the defensive response. Technical challenge also raises considerations toward these directions. In fact the defending state would need time to consider the effects that counter measures could cause. Nevertheless, putted into the light of analytical models previously described in determining whether cyber-attacks could constitute a lawful armed attack, such evidences are not convincing. If for example one considers effect based-approach to determine if cyber-attacks qualify as an armed attack necessity is highly dependable of the effects caused by the cyber-attack(s). If victim state suffers severely and there are reasonable doubts that aggressor is preparing further cyber-attacks than the threshold of necessity change. In fact the imminence of danger aloud for victim state to respond before it is too late. At the same time proportional-limited military response to disrupt or destroy the base or the system that has caused or is about to cause further cyber-attacks sounds logically and acceptable under the recent *Ius ad bellum practice*.\nSince both analytical models “effect based” and “strict liability” model advocated for elements that consider *ex-ante* use of force in the context of our debate it is worth mentioning the issue of anticipatory self-defense.\n## 3.4. Anticipatory self-defense and cyber-attacks\nThe issue of anticipatory self-defense has been long debated among the legal scholars even in conventional terms. Measures undertaken in anticipatory self-defense are lawful when the “necessity of that self-defense is instant, overwhelming, and leaving no choice of means, and no moment for deliberation.” Since the vocabulary that explains what constitutes anticipatory self-defense differs from the course of article 51 of the Charter it is well accepted that anticipatory self-defense is considered as customary self-defense. Contrary to these views significant part of the legal community\n---\n Thomas Wingfield: The Law of Information conflict: National Security Law in Cyberspace (2000) 42\n Yoram Dinstein: War, Aggression and Self-defense (4th ed. 2005) 237\n Lori Fisler Damrosch et al.: International Law: Cases and Materials 59 5th ed. (2009) 1135\nbelieves that self- defense should be practiced not outside the Charter. Under these circumstances lawful ex-ante use of force (as “strict liability” or to a certain degree “effect based” analytical models suggest) would require victim state to sufficiently demonstrate the imminence of an anticipated attack. In the case of cyber attacks, such a requirement would invariably be difficult to meet, if not impossible.\n## Conclusion\nTelecommunication and information technologies have changed our way of leaving. Cyberspace is both necessity but also vulnerability. Abusing cyberspace state and non state actors commit cyber attacks designed to spread misinformation, weaken state’s competitive advantage through electronic espionage, commit clandestine modification of sensitive data on the battlefield or affect countries’ critical infrastructures. In order to protect themselves against violent destructive and illegal activities some states are prepared to use force in self-defense. These commitments however have raised serious legal questions.\nThe overall debate over the applicability of *Ius ad bellum* principles, standards and norms to cyber-attacks unequivocally showed that it is not quite clear whether or not, states could lawfully use force in self-defense against cyber attack. Although under specific conditions cyber-attacks could amount to armed attack(s), it is very hard to attribute such attacks to a state or non-state actors. Additionally necessity and proportionality along with the ex-ante attitude (i.e. anticipatory self – defense) are highly disputed among the legal scholars. All of these challenges require for one to reconsider legal alternatives that could provide more appropriate solutions to cyber-attacks and cyber-security.",
  "citations": {
    "style": "superscript",
    "flat_text": "# Use of force against cyber attacks\nAuthor: Metodi Hadji-Janev\nMilitary Academy “General Mihailo Apostolski”-Skopje,\nUniversity “Goce Delcev”-Stip”, Republic of Macedonia\nAbstract. The rapid development of the technology in an age of intensified globalization has seriously affected international security. Today state and non-state actors can use telecommunication and information technologies in a disruptive way and through cyberspace remotely cause damages to the critical infrastructures that run our everyday live and on which we depend upon. Urged by this complexity some countries have considered military response including the use of force in self-defense. However international legal standards, principles and norms that regulate use of force under international law do not mention use of force against cyber attacks. Therefore it is not quite clear whether or not states can lawfully use force in self-defense against cyber attacks.\nKeywords. *Ius ad bellum*, armed attack, self-defense, cyber-attack, proportionality, necessity, anticipatory self-defense\n# Introduction\nThe development of modern technology and interconnectivity has brought both positive and negative effects. Today, thanks to a modern technology we leave in a world of global interconnectedness which through linked digital information networks brings vast benefits. Nevertheless, although designed and created for good electronic and informational interconnectivity creates tremendous vulnerabilities.\nBoth state and non-state actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Therefore, the more developed the states are the more vulnerable they are. Faced by this complexity some countries have declared to take radical measures to confront upcoming threats from cyber-attacks.\nHence cyber threats and readiness to respond to such threats by some states with the use of force in self-defense have raised some legal questions. Giving the nature of cyber attacks and the fact that current regulations for use of force in self-defense are designed for use of physical force, but not in cyberspace, it is not clear whether: (1) cyber attack could meet the standards of an armed attack; (2) cyber-attack is attributable to the state and (3) the use of force carried in self-defense could meet the standards for \"necessity\" and \"proportionality\". Therefore, the article will first explain how cyberspace affects states security. Then will examine when and under which circumstances can state (victim of a cyber attack lawfully use force in self defense).\n1. Security threats from cyberspace\nThreats from cyberspace are real and affect our everyday life. Unlike conventional threats these threats are hybrid coming both from state and non state actors. These actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Using different techniques and methods in the cyberspace both state and non-state actors generally (but not limited to) conduct cyber attacks\n- to spread misinformation,\n- for electronic espionage purposes that weakens state's competitive advantage,\n- to commit clandestine modification of sensitive data on the battlefield or\n- to affect countries' critical infrastructures\nMotives for such attacks through cyberspace differ. In general, they are usually conducted for social and criminal gain or for political and strategic military advantage. Thus, hybrid threats from cyberspace that underpins our security come from criminals, state actors, or groups and individuals with ideological and religiously violent motivation that could act independently or as a proxy to a violent state actor. Depending on the actor(s) and his/her/their motivation under current international regulations cyber attacks generally can be classified as cyber crime, cyber terror, or cyber warfare.\nCyber-attacks in Estonia (2007), Georgia (2008), Iran (2010), Burma (2010), USA (2011), Middle East (2012), confirm the above mentioned concerns and the effects that these attacks can cause. Severity and the influence of these actions were also experienced during German Chancellor visit to China, by UK's financial, legal and retail firms, the Belgian federal government, or Pentagon in the US.\nUrged by this complexity some countries and organizations such as U.S. and NATO have considered radical measures to confront upcoming threats from cyber-attacks. In its first formal cyber strategy U.S. concluded that computer sabotage coming from another country can constitute an act of war. Seeing itself as the world's premier collective defense entity, NATO believes that has a responsibility to take adequate measures to protect itself and its members from cyber threats.\nHence cyber threats and readiness to respond to such threats by some states have raised some legal questions. Precisely, it is not clear whether or not such response would be legal under international norms, principles and standards. These concerns lead one to take a closer look into the international legislation with regards to use of force.\n NATO Parliamentary Assembly, “NATO and Cyber defense”, 173 DSCFC 09 E BIS - NATO AND CYBER DEFENCE\n Report of the New England Faculty Summit on Cyber Security held at Boston University on June 28, (2011), http://www.bu.edu/hic/files/2011/07/CyberSecuritySummitReport.pdf\n “Merkel’s China Visit Marred by Hacking Allegations”, Der Spiegel, August 27, 2007, accessed August 25, 2013 at: http://chinadigitaltimes.net/2007/08/merkels-china-visit-marred-by-hacking-allegations-spiegel/\n Rex B. Hughes, “NATO and Global Cyber Defense”, The Bucharest Conference Paper, Romanian Ministry of Foreign Affairs, March 2008, p44\n Siobhan Gorman and Julian E. Barnes: Cyber Combat : Act of War, The Wall Street Journal, (May 30, 2011), http://online.wsj.com/article/SB10001424052702304563104576355623135782718.html\n Sverre Myrli: NATO and Cyber Defense, NATO Parliamentary Assembly available at: http://www.nato-pa.int/default.Asp?SHORTCUT=1782.\n2. Use of force in international law as a response to cyber attack\nStates or international organizations could lawfully use force against cyber-attacks in two situations. First, if this is authorized by the United Nations Security Council (UNSC). Second, state(s), or international organization could use force in individual or collective self-defense. It is well known that UNSC resolutions are legally binding. This means that any decision made by the UNSC and translated into resolution to use force as a result of a cyber attack will be lawful.\nSince the UNSC mandates binding resolutions the decision to use force against an entity that had conducted cyber-attack under the Charter will be legal. However, having in mind that threat perceptions in the context of cyber attacks among member state will differ from state to state and that according to recent Security Council’s practice in such situations Council will fail to respond in a timely manner, it seems valid to assume that a state(s) will choose to respond with cyber attacks by exercising it/their right(s) to self-defense (individually or collectively).\n3. Self-defense against cyber-attack(s)?\nThe use of force by a victim state of a cyber attack(s) lawfully in self-defense would be possible only if: (1) cyber attack(s) meets the standards of an armed attack, (2) cyber-attack is attributable to the state where the self-defense is being carried out and (3) the use of force carried in self-defense is “necessary” and “proportional”. Legal analogy based debates among the scholars in the context of applicability of international legal standards and principles to cyber-attacks have stimulated numerous debates in the light of these conditions too. Precisely disagreements stem from the absence of the definition of what constitutes an armed attack under international law; challenges to attribute cyber-attack(s) to a state; and applicability of customary rules of self-defense along with the provisions under the UN Charter and interpretation.\n3.1. Cyber-attack as an armed attack?\nRelevant international organizations guidance, certain international instruments and legal scholar expressing their opinions, had tried to fill the absence of authoritative definition of armed conflict. Today it is well accepted that Jean Pictet’s guidance to determine the existence of an international armed conflict under Common Article 2 of the 1949 Geneva Conventions serve as a useful guide for assessing whether a particular use of force could be considered as an act equal to armed attack. According to Pictet’s guidance a use of force is considered an armed attack when the force is of “sufficient scope, duration, and intensity.”7 Another useful tool that helps to fill the absence of a legal definition of what constitutes armed attack is the U.N. General Assembly’s Resolution for “Definition of Aggression”. Although the Resolution does not contain a definition of armed attack this instrument provides examples of state actions that could be considered as an armed attack. Even more many argue that guidance of this instrument has gained extensive international acceptance.8\n\nSome scholars have tried to define armed conflict by explaining the distinction between terms “war” and “armed conflict”. Based on the threshold in ICRC Commentary of the Common Article 2 according to Sharp, de facto hostilities exist, and consequently the Jews in Bello apply when any use of force, regardless of its scope, duration, or intensity, occurs between the members of the armed forces of two states.\nBoth states and the International Court of Justice have frequently applied these guidance and explanations in the context of the conventional understanding of the use of force. Nevertheless, the authors disagree whether these guidance and explanations can be applied to cyber-attacks. While some legal scholars believe that it is intuitive that cyber-attacks can constitute armed attacks, especially in light of their ability to injure or kill, part of the legal community has been reluctant to classify them this way because they do not resemble \"classic attack(s) with traditional military force.\"\nAuthors that negate the applicability of guidance and explanations of what constitutes an armed attack to cyber attacks are not united. There are authors who in fact disagree over the whole idea of applicability of *Ius ad bellum* to the cyberspace activities. Jeffrey Addicott, for example, asserts that “international laws associated with the use of force are woefully inadequate in terms of addressing the threat of cyber warfare”. On the other hand, there are authors who disagree only to the applicability limited to guidance and explanations of the conventional use of force. For the purpose and space of the given debate, we will focus on general arguments that these authors pose on their behalf in the context of the debate.\nDiscussing the conditions to meet criteria for using force as a response to unlawful armed attack Mary Oconel points that attempt to apply these conditions to cyber force actions is difficult, if not impossible. The sort of damage, according to this author’s views does not meet the condition that an armed attack must be significant to trigger Article 51. To prove her point she offers ICJ case law practice. Using *Nicaragua* case Oconel emphases Court’s views about the importance of “scale and effects” in determining whether or not specific action could be classified as an armed attack.\nPeter Singer and Noah Shachtman share similar positions as *O’connel*. In their argumentation, they provide insights from recent state practice. Analyzing the effects of Russian cyber-attacks to Estonia and comparing cyber attacks against Georgian government with the actual Russian missiles and bombs in the accompanying war, they tried to point that effects from cyber attacks were incomparable with the effects from the actual armed attack. Therefore, they believe that it is even inappropriate to apply *is ad bellum* rules of the cyber domain. Similar explanations come from Duncan Hollis,\n Sharp suggests that war refers to a state of de jure hostilities invoked by a formal declaration of one party that creates an international armed conflict as a matter of law. In contrast, any other armed conflict refers to a state of de facto hostilities invoked by the use of force by one party without any declaration of war. He then concludes that determination when any other conflict exists is a factual subjective determination that centers on the use of force between states. Walter G. Sharp, (1999) 74\n Thomas Wingfield: *When is a Cyberattack an \"Armed Attack\"?: Legal Thresholds for Distinguishing military activities in cyberspace*, Cyber Conflict Studies Association, (2006) 6\n Jeffrey F. Addicott, “Cyberterrorism: Legal Policy Issues,” in *Legal Issues in the Struggle against Terrorism*, eds. John N. Moore and Robert F. Turner, Durham, NC: Carolina Academic Press, (2010), 550\n “...The prohibition of armed attacks may apply to the sending by a state of armed bands to the territory of another state, if such an operation, because of its scale and effects would have been classified as an armed attack rather than a mere frontier incident...” Marry E. O’connell: *Cyber Security and International Law*, International Law Meeting Summary, Chatham House (2012), 5-7\n Peter Singer and Noah Shachtman: *The Wrong War*, Foreign Policy 21st Century Defense Initiative, Brookings, (2011), http://www.brookings.edu/research/articles/2011/08/15-cybersecurity-singer-shachtman\nwho asserts that a cyber - attack alone will almost never constitute an armed attack for the purposes of Article 51. Hollis' argumentation for this position is that a cyber - attack lacks the physical characteristics traditionally associated with military coercion\".14 Although there are others who share these views many authors believe that guidance and explanations of what constitutes an armed attack in conventional terms could be also applicable to unconventional use of force including cyber-attacks.\nYoarm Dinstein is among the authors who share the view that cyber attack can constitute armed attack. Accordingly, in his analyses based on the \"instrument-based approach\" Dinstein uses the guidance and explanations of what constitutes an armed attack in conventional terms to prove that cyber-attacks can constitute armed attacks. The logic of this approach holds that if cyber-attacks could cause the destruction of a power grid than cyber-attack constitutes an armed attack. This is due to the fact that before the development of cyber capabilities such destruction could have been possible only by using kinetic force. Beside that article 3 of the \"Definition of Aggression\" provides implicit support to Dinsteins' approach.15\nUnlike Dinstein, Walter Sharp also believes that a cyber attack could constitute an armed attack. However, Sharp uses guidance and explanations of what constitutes an armed attack in conventional terms and merge them to the target of potential cyber attack. Eric Talbot along with Sharp advocates that cyber attack classifies as an armed attack if it targets a sufficiently important computer system.16 Baring in mind our previous discussion about the importance of SCADA systems and the complexity of the risks that these systems' failure could cause sound reasonable to agree with these authors' logics. Purposeful cyber-attack to SCADA systems could cause failure of these systems and therefore cascade severe consequences. We could not agree less that in situations like this, cyber-attacks would meet not just the ICRC threshold regarding the \"intensity\", but also ICJ well established test \"scale and effects\" for determining whether or not specific action could be classified as an armed attack. Nonetheless the issue with this approach in determining when a cyber - attack could constitute an armed attack is that its proponents advocate aggressive response based on the \"strict liability\". Sean Condron, for example, argues that a cyber-attack constitutes an armed attack, and would grant the target the right to use force in self-defense, whenever it penetrates any critical national infrastructure system, regardless of whether it has yet caused any physical destruction or casualties.17\nMichael Schmitt, former colonel turned professor, uses his own developed model to measure the consequences of cyber-attack under the guidance and explanations of what constitutes an armed attack in conventional terms. Schmitt propagates that one needs to consider seven factors before deciding if a cyber-attack's effects could be deemed to armed attack. These factors are severity (the type and scale of the harm); immediacy (how quickly the harm materializes after the attack); directness (the length of the causal chain between the attack and the harm); invasiveness (the degree to which the attack penetrates the victim state's territory);\n\nmeasurability (the degree to which the harm can be quantified); presumptive legitimacy, (the weight given to the fact that) and responsibility (to be able to attribute the attack). If the cyber-attack, in the field of cyber-activities as a whole, meets these criteria, cyber-attacks constituting an armed attack are the exception rather than the rule. These factors are illuminating, but they call for such a wide-ranging inquiry that they may not provide sufficient guidance to decision makers. Although widely accepted some argue that Schmitt model suffers from some inconsistencies. It could be argued that only a small number of cyber-attacks could rise to the level of armed attack. Another issue arises from the ability to foresee the severity of the attack which could be abused since it is highly subjective.\nThe analyses of two opposing groups of authors further confirm the complexity that cyberspace poses to the society and security in a broader and law in a narrow context. In the light of our previous discussion regarding the complexity (growing asymmetry in a cyberspace and the “paradox of modernity”) it seems that second group of authors’ arguments for now, are more convincing. Just because we have not experienced a severe cyber-attack that could cause death and significant material property damage this does not mean that a cyber-attack or series of such attacks could not rise to a level of what is considered to be an armed attack under International law. Precisely, certain cyber-attacks could rise to amount of armed attack that under *Ius ad bellum* principles, standards and norms could justify the use of military force. Nevertheless, in order for victim state to be able to use force in self-defense lawfully beside the condition that state needs to be a victim of illegal action that constitutes armed attack the victim state must attribute such illegal attack(s) directly and conclusively to another state or agents under that state’s direct control.\n## 3.2. The challenge of attribution\nMost of the arguments that build “pro” and “contra” views to use military force against cyber-attacks in the context of requirement to attribute responsibility steam from the premises that we discussed regarding the so-call “paradox of modernity”. Legal scholars who disagree to apply the analogy of *Ius ad bellum* standards, principles and norms to cyberspace threats generally focus on the difficulties to attribute cyber-attacks directly and conclusively to another state.\nBret Michael and Thomas Wingfiled propose that the issue of attribution in cyberspace derives from technical challenges... since the Internet was conceived without a requirement for users’ accountability. The problem according to them is even more complicated since they argue that the attribution in cyberspace is “asymmetric”.\nDiscussing the challenge of attribution in cyberspace Eric Jensen concludes similarly to Michael and Wingfield, that tracing cyber-attacks can be exceptionally long process. The problem with accuracy, however never ends since as he asserts even\n Michel Schmitt: Computer Network Attack and the Use of force in International law: The Columbia Journal of Transnational Law, Volume 37, (1999), 885-937\n This analytical approach is important for our debate since it seems that it would appear to be the analytical model adopted by the United States. Office Of General Counsel, Department Of Defense: An Assessment Of International Legal Issues In Information Operations, (May 1999)\n Daniel B. Silver, Computer Network Attack as a Use of Force Under Article 2(4), 76 Int’l Law Studies 73, (2002) 92–93\n Sean M. Condron, (2007), 414\n Bret Michael and Thomas Wingfiled: International Legal Reform Could Make States Liable for Cyber Abuse, Per Concordiam, Journal of European Security and Defense Issues, Vol.2 Issue 2, (2011), 40-41\nif the server is located to “...identify the entity or individual directing the attack is extremely hard. Nevertheless, he advocates for changing the approach. The issue with cyber terrorists’ and cyber criminal modus operandi discussed by Davis Brown seems to echo Jensens’ analyses. Cyber-terrorists and cyber criminals often hijack innocent systems and use them as “zombies” to initiate their cyber-attacks. While victim-states must try to penetrate such guises, current technology may not always allow them to do so in a timely manner. O’connel offers state practice to point that as a source of International law, it also requires for attribution to be made with clear and convincing evidence. Nevertheless, much similarly as previously cited authors she concludes that in the case of cyber-attack such convincing evidence is hard to find.\nSince legal requirements for conclusive attribution is hard to apply in case of cyber-attacks, some have suggested that states could legally employ cross-border cyber attacks and therefore not use military force. Using the transnational criminal approach Michael and Wingfiled see this approach promising. They do believe in potentials to establish international jurisdiction where individuals and groups may be investigated and prosecuted under other countries’ domestic law.\nAuthors who advocate that cyber-attacks could trigger the use of force in self-defense lawfully under the International law in response to “attribution challenge” offer different proposals. Mainly they build their argumentation based on the same issues proposed by the authors who disagree with their positions, i.e. the complexity to directly and conclusively attribute the cyber-attack(s).\nSome recognize that attribution stubbornly permeates every aspect of cyber operations, however they consider this as a technical issue, not a legal one. Therefore they advocate that the identity of the attacker may well determine if a state of war exists. Others have tried to materialize their argumentation emphasizing the risks that cyber-attacks pose to the states. Sean Cordon explains that if states are about to follow traditional procedures to attribute responsibility regarding the nature of cyber-attacks than they need to be ready to experience risks that a cyber attack could pose. This, according to him could create a dilemma for the states. Similar views have echoed that such situations could put states in the limbo position between its safety traditional legislation and imperfect reality.\nFrom all of the above it is clear that direct and concessive attribution to cyber attack is not easy to achieve. Difficulty to locate the entity responsible for cyber-attack(s) is stubborn impediment that questions lawful response in self-defense. On the other hand, neither cyber-attacks are traditional nor the traditional test for state responsibility aloud victim state to exercise the inherent right of self-defense appropriately. Legal scholars’ disagreements over applicability of self-defense under international law to cyber-attacks culminate in the context of necessity, proportionality and anticipatory self-defense.\n Eric Jensen: Computer Attacks on Critical National Infrastructure: A Use of Force Invoking the Right of Self-Defense, 38 Stanford Journal of International Law, (2002) 207\n Davis Brown: A Proposal for an International Convention to Regulate the Use of Information Systems in Armed Conflict, 47 Harvard International Law Journal (2006) 181-183\n Bret Michael and Thomas Wingfiled, (2011), 41\n Charles Dunlap: Perspectives for Cyber Strategists on Law for Cyberwar, Strategic Study Quarterly, Spring, (2011), 88\n Sean Condron, (2007), 414-415\n Duncan B. Hollis, (2007), 1026\n## 3.3. Necessity and proportionality against cyber-attacks\nNecessity and proportionality are founding principles of appropriate self-defense. As well as other elements that build the threshold of lawful self-defense against cyber-attacks these principles considered in the context of cyber-attacks are highly disputed among the legal scholars. If under the given evidences state cannot achieve a reasonable settlement of a dispute through peaceful means self-defense against cyber-attack will meet the requirement of necessity. Self-defense against cyber-attack is proportional if victim state limits its actions to the amount of force required to defeat an ongoing cyber-attack or to deter a future cyber-attacks. Compliance with the principles of necessity and proportionality is difficult and fact-intensive even for conventional attacks, and therefore cyber-attacks present new hard challenges.\nAuthors who disagree with the overall applicability of *Ius ad bellum* to cyber-attacks believe that necessity and proportionality are difficult conditions to meet. Building on the previous discussions this part of the legal community considers that difficulties come from the complexity of cyber-attacks and as a consequence the amount of the time needed to attribute the attack. Evidences from recent cases like Estonia or Iran confirm these considerations. In both situations, attacks came from different locations. Therefore the biggest concern regarding the international legal requirements for lawful self-defense against cyber-attack is the defensive response. Technical challenge also raises considerations toward these directions. In fact the defending state would need time to consider the effects that counter measures could cause. Nevertheless, putted into the light of analytical models previously described in determining whether cyber-attacks could constitute a lawful armed attack, such evidences are not convincing. If for example one considers effect based-approach to determine if cyber-attacks qualify as an armed attack necessity is highly dependable of the effects caused by the cyber-attack(s). If victim state suffers severely and there are reasonable doubts that aggressor is preparing further cyber-attacks than the threshold of necessity change. In fact the imminence of danger aloud for victim state to respond before it is too late. At the same time proportional-limited military response to disrupt or destroy the base or the system that has caused or is about to cause further cyber-attacks sounds logically and acceptable under the recent *Ius ad bellum practice*.\nSince both analytical models “effect based” and “strict liability” model advocated for elements that consider *ex-ante* use of force in the context of our debate it is worth mentioning the issue of anticipatory self-defense.\n## 3.4. Anticipatory self-defense and cyber-attacks\nThe issue of anticipatory self-defense has been long debated among the legal scholars even in conventional terms. Measures undertaken in anticipatory self-defense are lawful when the “necessity of that self-defense is instant, overwhelming, and leaving no choice of means, and no moment for deliberation.” Since the vocabulary that explains what constitutes anticipatory self-defense differs from the course of article 51 of the Charter it is well accepted that anticipatory self-defense is considered as customary self-defense. Contrary to these views significant part of the legal community\n---\n Thomas Wingfield: The Law of Information conflict: National Security Law in Cyberspace (2000) 42\n Yoram Dinstein: War, Aggression and Self-defense (4th ed. 2005) 237\n Lori Fisler Damrosch et al.: International Law: Cases and Materials 59 5th ed. (2009) 1135\nbelieves that self- defense should be practiced not outside the Charter. Under these circumstances lawful ex-ante use of force (as “strict liability” or to a certain degree “effect based” analytical models suggest) would require victim state to sufficiently demonstrate the imminence of an anticipated attack. In the case of cyber attacks, such a requirement would invariably be difficult to meet, if not impossible.\n## Conclusion\nTelecommunication and information technologies have changed our way of leaving. Cyberspace is both necessity but also vulnerability. Abusing cyberspace state and non state actors commit cyber attacks designed to spread misinformation, weaken state’s competitive advantage through electronic espionage, commit clandestine modification of sensitive data on the battlefield or affect countries’ critical infrastructures. In order to protect themselves against violent destructive and illegal activities some states are prepared to use force in self-defense. These commitments however have raised serious legal questions.\nThe overall debate over the applicability of *Ius ad bellum* principles, standards and norms to cyber-attacks unequivocally showed that it is not quite clear whether or not, states could lawfully use force in self-defense against cyber attack. Although under specific conditions cyber-attacks could amount to armed attack(s), it is very hard to attribute such attacks to a state or non-state actors. Additionally necessity and proportionality along with the ex-ante attitude (i.e. anticipatory self – defense) are highly disputed among the legal scholars. All of these challenges require for one to reconsider legal alternatives that could provide more appropriate solutions to cyber-attacks and cyber-security.",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 49,
        "success_occurrences": 49,
        "success_unique": 25,
        "bib_unique_total": 31,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.8064516129032258,
        "success_percentage": 100.0,
        "style": "superscript"
      },
      "results": [
        {
          "index": 1,
          "intext_citation": "¹",
          "preceding_text": "",
          "footnote": "NATO Parliamentary Assembly, “NATO and Cyber defense”, 173 DSCFC 09 E BIS - NATO AND CYBER DEFENCE",
          "position": 4040
        },
        {
          "index": 2,
          "intext_citation": "²",
          "preceding_text": "",
          "footnote": "Report of the New England Faculty Summit on Cyber Security held at Boston University on June 28, (2011), http://www.bu.edu/hic/files/2011/07/CyberSecuritySummitReport.pdf",
          "position": 4232
        },
        {
          "index": 3,
          "intext_citation": "³",
          "preceding_text": "man Chancellor visit to China,",
          "footnote": "“Merkel’s China Visit Marred by Hacking Allegations”, Der Spiegel, August 27, 2007, accessed August 25, 2013 at: http://chinadigitaltimes.net/2007/08/merkels-china-visit-marred-by-hacking-allegations-spiegel/",
          "position": 4340
        },
        {
          "index": 4,
          "intext_citation": "⁴",
          "preceding_text": "",
          "footnote": "Rex B. Hughes, “NATO and Global Cyber Defense”, The Bucharest Conference Paper, Romanian Ministry of Foreign Affairs, March 2008, p44",
          "position": 4439
        },
        {
          "index": 5,
          "intext_citation": "⁵",
          "preceding_text": "",
          "footnote": "Siobhan Gorman and Julian E. Barnes: Cyber Combat : Act of War, The Wall Street Journal, (May 30, 2011), http://online.wsj.com/article/SB10001424052702304563104576355623135782718.html",
          "position": 4733
        },
        {
          "index": 6,
          "intext_citation": "⁶",
          "preceding_text": "",
          "footnote": "Sverre Myrli: NATO and Cyber Defense, NATO Parliamentary Assembly available at: http://www.nato-pa.int/default.Asp?SHORTCUT=1782.",
          "position": 4918
        },
        {
          "index": 1,
          "intext_citation": "¹",
          "preceding_text": "",
          "footnote": "NATO Parliamentary Assembly, “NATO and Cyber defense”, 173 DSCFC 09 E BIS - NATO AND CYBER DEFENCE",
          "position": 5265
        },
        {
          "index": 2,
          "intext_citation": "²",
          "preceding_text": " BIS - NATO AND CYBER DEFENCE\n",
          "footnote": "Report of the New England Faculty Summit on Cyber Security held at Boston University on June 28, (2011), http://www.bu.edu/hic/files/2011/07/CyberSecuritySummitReport.pdf",
          "position": 5366
        },
        {
          "index": 3,
          "intext_citation": "³",
          "preceding_text": "pdf",
          "footnote": "“Merkel’s China Visit Marred by Hacking Allegations”, Der Spiegel, August 27, 2007, accessed August 25, 2013 at: http://chinadigitaltimes.net/2007/08/merkels-china-visit-marred-by-hacking-allegations-spiegel/",
          "position": 5539
        },
        {
          "index": 4,
          "intext_citation": "⁴",
          "preceding_text": "-hacking-allegations-spiegel/\n",
          "footnote": "Rex B. Hughes, “NATO and Global Cyber Defense”, The Bucharest Conference Paper, Romanian Ministry of Foreign Affairs, March 2008, p44",
          "position": 5750
        },
        {
          "index": 5,
          "intext_citation": "⁵",
          "preceding_text": "eign Affairs, March 2008, p44\n",
          "footnote": "Siobhan Gorman and Julian E. Barnes: Cyber Combat : Act of War, The Wall Street Journal, (May 30, 2011), http://online.wsj.com/article/SB10001424052702304563104576355623135782718.html",
          "position": 5886
        },
        {
          "index": 6,
          "intext_citation": "⁶",
          "preceding_text": "html",
          "footnote": "Sverre Myrli: NATO and Cyber Defense, NATO Parliamentary Assembly available at: http://www.nato-pa.int/default.Asp?SHORTCUT=1782.",
          "position": 6072
        },
        {
          "index": 10,
          "intext_citation": "¹⁰",
          "preceding_text": "\"",
          "footnote": "Thomas Wingfield: *When is a Cyberattack an \"Armed Attack\"?: Legal Thresholds for Distinguishing military activities in cyberspace*, Cyber Conflict Studies Association, (2006) 6",
          "position": 10552
        },
        {
          "index": 11,
          "intext_citation": "¹¹",
          "preceding_text": "g the threat of cyber warfare”",
          "footnote": "Jeffrey F. Addicott, “Cyberterrorism: Legal Policy Issues,” in *Legal Issues in the Struggle against Terrorism*, eds. John N. Moore and Robert F. Turner, Durham, NC: Carolina Academic Press, (2010), 550",
          "position": 10988
        },
        {
          "index": 12,
          "intext_citation": "¹²",
          "preceding_text": "",
          "footnote": "“...The prohibition of armed attacks may apply to the sending by a state of armed bands to the territory of another state, if such an operation, because of its scale and effects would have been classified as an armed attack rather than a mere frontier incident...” Marry E. O’connell: *Cyber Security and International Law*, International Law Meeting Summary, Chatham House (2012), 5-7",
          "position": 11883
        },
        {
          "index": 13,
          "intext_citation": "¹³",
          "preceding_text": "",
          "footnote": "Peter Singer and Noah Shachtman: *The Wrong War*, Foreign Policy 21st Century Defense Initiative, Brookings, (2011), http://www.brookings.edu/research/articles/2011/08/15-cybersecurity-singer-shachtman",
          "position": 12329
        },
        {
          "index": 9,
          "intext_citation": "⁹",
          "preceding_text": "ions come from Duncan Hollis,\n",
          "footnote": "Sharp suggests that war refers to a state of de jure hostilities invoked by a formal declaration of one party that creates an international armed conflict as a matter of law. In contrast, any other armed conflict refers to a state of de facto hostilities invoked by the use of force by one party without any declaration of war. He then concludes that determination when any other conflict exists is a factual subjective determination that centers on the use of force between states. Walter G. Sharp, (1999) 74",
          "position": 12483
        },
        {
          "index": 10,
          "intext_citation": "¹⁰",
          "preceding_text": "Sharp, (1999) 74",
          "footnote": "Thomas Wingfield: *When is a Cyberattack an \"Armed Attack\"?: Legal Thresholds for Distinguishing military activities in cyberspace*, Cyber Conflict Studies Association, (2006) 6",
          "position": 12995
        },
        {
          "index": 11,
          "intext_citation": "¹¹",
          "preceding_text": "Studies Association, (2006) 6\n",
          "footnote": "Jeffrey F. Addicott, “Cyberterrorism: Legal Policy Issues,” in *Legal Issues in the Struggle against Terrorism*, eds. John N. Moore and Robert F. Turner, Durham, NC: Carolina Academic Press, (2010), 550",
          "position": 13176
        },
        {
          "index": 12,
          "intext_citation": "¹²",
          "preceding_text": "a Academic Press, (2010), 550\n",
          "footnote": "“...The prohibition of armed attacks may apply to the sending by a state of armed bands to the territory of another state, if such an operation, because of its scale and effects would have been classified as an armed attack rather than a mere frontier incident...” Marry E. O’connell: *Cyber Security and International Law*, International Law Meeting Summary, Chatham House (2012), 5-7",
          "position": 13382
        },
        {
          "index": 13,
          "intext_citation": "¹³",
          "preceding_text": "ry, Chatham House (2012), 5-7\n",
          "footnote": "Peter Singer and Noah Shachtman: *The Wrong War*, Foreign Policy 21st Century Defense Initiative, Brookings, (2011), http://www.brookings.edu/research/articles/2011/08/15-cybersecurity-singer-shachtman",
          "position": 13771
        },
        {
          "index": 18,
          "intext_citation": "¹⁸",
          "preceding_text": "",
          "footnote": "Michel Schmitt: Computer Network Attack and the Use of force in International law: The Columbia Journal of Transnational Law, Volume 37, (1999), 885-937",
          "position": 18176
        },
        {
          "index": 19,
          "intext_citation": "¹⁹",
          "preceding_text": "",
          "footnote": "This analytical approach is important for our debate since it seems that it would appear to be the analytical model adopted by the United States. Office Of General Counsel, Department Of Defense: An Assessment Of International Legal Issues In Information Operations, (May 1999)",
          "position": 18493
        },
        {
          "index": 20,
          "intext_citation": "²⁰",
          "preceding_text": "",
          "footnote": "Daniel B. Silver, Computer Network Attack as a Use of Force Under Article 2(4), 76 Int’l Law Studies 73, (2002) 92–93",
          "position": 18687
        },
        {
          "index": 21,
          "intext_citation": "²¹",
          "preceding_text": "",
          "footnote": "Sean M. Condron, (2007), 414",
          "position": 19985
        },
        {
          "index": 22,
          "intext_citation": "²²",
          "preceding_text": "",
          "footnote": "Bret Michael and Thomas Wingfiled: International Legal Reform Could Make States Liable for Cyber Abuse, Per Concordiam, Journal of European Security and Defense Issues, Vol.2 Issue 2, (2011), 40-41",
          "position": 20830
        },
        {
          "index": 18,
          "intext_citation": "¹⁸",
          "preceding_text": "ends since as he asserts even\n",
          "footnote": "Michel Schmitt: Computer Network Attack and the Use of force in International law: The Columbia Journal of Transnational Law, Volume 37, (1999), 885-937",
          "position": 21078
        },
        {
          "index": 19,
          "intext_citation": "¹⁹",
          "preceding_text": "w, Volume 37, (1999), 885-937\n",
          "footnote": "This analytical approach is important for our debate since it seems that it would appear to be the analytical model adopted by the United States. Office Of General Counsel, Department Of Defense: An Assessment Of International Legal Issues In Information Operations, (May 1999)",
          "position": 21234
        },
        {
          "index": 20,
          "intext_citation": "²⁰",
          "preceding_text": "mation Operations, (May 1999)\n",
          "footnote": "Daniel B. Silver, Computer Network Attack as a Use of Force Under Article 2(4), 76 Int’l Law Studies 73, (2002) 92–93",
          "position": 21515
        },
        {
          "index": 21,
          "intext_citation": "²¹",
          "preceding_text": " Law Studies 73, (2002) 92–93\n",
          "footnote": "Sean M. Condron, (2007), 414",
          "position": 21636
        },
        {
          "index": 22,
          "intext_citation": "²²",
          "preceding_text": "Condron, (2007), 414",
          "footnote": "Bret Michael and Thomas Wingfiled: International Legal Reform Could Make States Liable for Cyber Abuse, Per Concordiam, Journal of European Security and Defense Issues, Vol.2 Issue 2, (2011), 40-41",
          "position": 21668
        },
        {
          "index": 23,
          "intext_citation": "²³",
          "preceding_text": "",
          "footnote": "Eric Jensen: Computer Attacks on Critical National Infrastructure: A Use of Force Invoking the Right of Self-Defense, 38 Stanford Journal of International Law, (2002) 207",
          "position": 22028
        },
        {
          "index": 24,
          "intext_citation": "²⁴",
          "preceding_text": "",
          "footnote": "Davis Brown: A Proposal for an International Convention to Regulate the Use of Information Systems in Armed Conflict, 47 Harvard International Law Journal (2006) 181-183",
          "position": 22410
        },
        {
          "index": 25,
          "intext_citation": "²⁵",
          "preceding_text": "",
          "footnote": "Bret Michael and Thomas Wingfiled, (2011), 41",
          "position": 23194
        },
        {
          "index": 26,
          "intext_citation": "²⁶",
          "preceding_text": "",
          "footnote": "Charles Dunlap: Perspectives for Cyber Strategists on Law for Cyberwar, Strategic Study Quarterly, Spring, (2011), 88",
          "position": 23844
        },
        {
          "index": 27,
          "intext_citation": "²⁷",
          "preceding_text": "",
          "footnote": "Sean Condron, (2007), 414-415",
          "position": 24246
        },
        {
          "index": 28,
          "intext_citation": "²⁸",
          "preceding_text": "",
          "footnote": "Duncan B. Hollis, (2007), 1026",
          "position": 24400
        },
        {
          "index": 23,
          "intext_citation": "²³",
          "preceding_text": "",
          "footnote": "Eric Jensen: Computer Attacks on Critical National Infrastructure: A Use of Force Invoking the Right of Self-Defense, 38 Stanford Journal of International Law, (2002) 207",
          "position": 25031
        },
        {
          "index": 24,
          "intext_citation": "²⁴",
          "preceding_text": "International Law, (2002) 207\n",
          "footnote": "Davis Brown: A Proposal for an International Convention to Regulate the Use of Information Systems in Armed Conflict, 47 Harvard International Law Journal (2006) 181-183",
          "position": 25205
        },
        {
          "index": 25,
          "intext_citation": "²⁵",
          "preceding_text": "al Law Journal (2006) 181-183\n",
          "footnote": "Bret Michael and Thomas Wingfiled, (2011), 41",
          "position": 25378
        },
        {
          "index": 26,
          "intext_citation": "²⁶",
          "preceding_text": " Thomas Wingfiled, (2011), 41\n",
          "footnote": "Charles Dunlap: Perspectives for Cyber Strategists on Law for Cyberwar, Strategic Study Quarterly, Spring, (2011), 88",
          "position": 25427
        },
        {
          "index": 27,
          "intext_citation": "²⁷",
          "preceding_text": "Quarterly, Spring, (2011), 88\n",
          "footnote": "Sean Condron, (2007), 414-415",
          "position": 25548
        },
        {
          "index": 28,
          "intext_citation": "²⁸",
          "preceding_text": "Sean Condron, (2007), 414-415\n",
          "footnote": "Duncan B. Hollis, (2007), 1026",
          "position": 25581
        },
        {
          "index": 29,
          "intext_citation": "²⁹",
          "preceding_text": "",
          "footnote": "Thomas Wingfield: The Law of Information conflict: National Security Law in Cyberspace (2000) 42",
          "position": 25757
        },
        {
          "index": 30,
          "intext_citation": "³⁰",
          "preceding_text": "",
          "footnote": "Yoram Dinstein: War, Aggression and Self-defense (4th ed. 2005) 237",
          "position": 26332
        },
        {
          "index": 31,
          "intext_citation": "³¹",
          "preceding_text": "”",
          "footnote": "Lori Fisler Damrosch et al.: International Law: Cases and Materials 59 5th ed. (2009) 1135",
          "position": 28798
        },
        {
          "index": 29,
          "intext_citation": "²⁹",
          "preceding_text": "rt of the legal community\n---\n",
          "footnote": "Thomas Wingfield: The Law of Information conflict: National Security Law in Cyberspace (2000) 42",
          "position": 29092
        },
        {
          "index": 30,
          "intext_citation": "³⁰",
          "preceding_text": "y Law in Cyberspace (2000) 42\n",
          "footnote": "Yoram Dinstein: War, Aggression and Self-defense (4th ed. 2005) 237",
          "position": 29192
        },
        {
          "index": 31,
          "intext_citation": "³¹",
          "preceding_text": "2005) 237",
          "footnote": "Lori Fisler Damrosch et al.: International Law: Cases and Materials 59 5th ed. (2009) 1135",
          "position": 29263
        }
      ],
      "flat_text": "# Use of force against cyber attacks\nAuthor: Metodi Hadji-Janev\nMilitary Academy “General Mihailo Apostolski”-Skopje,\nUniversity “Goce Delcev”-Stip”, Republic of Macedonia\nAbstract. The rapid development of the technology in an age of intensified globalization has seriously affected international security. Today state and non-state actors can use telecommunication and information technologies in a disruptive way and through cyberspace remotely cause damages to the critical infrastructures that run our everyday live and on which we depend upon. Urged by this complexity some countries have considered military response including the use of force in self-defense. However international legal standards, principles and norms that regulate use of force under international law do not mention use of force against cyber attacks. Therefore it is not quite clear whether or not states can lawfully use force in self-defense against cyber attacks.\nKeywords. *Ius ad bellum*, armed attack, self-defense, cyber-attack, proportionality, necessity, anticipatory self-defense\n# Introduction\nThe development of modern technology and interconnectivity has brought both positive and negative effects. Today, thanks to a modern technology we leave in a world of global interconnectedness which through linked digital information networks brings vast benefits. Nevertheless, although designed and created for good electronic and informational interconnectivity creates tremendous vulnerabilities.\nBoth state and non-state actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Therefore, the more developed the states are the more vulnerable they are. Faced by this complexity some countries have declared to take radical measures to confront upcoming threats from cyber-attacks.\nHence cyber threats and readiness to respond to such threats by some states with the use of force in self-defense have raised some legal questions. Giving the nature of cyber attacks and the fact that current regulations for use of force in self-defense are designed for use of physical force, but not in cyberspace, it is not clear whether: (1) cyber attack could meet the standards of an armed attack; (2) cyber-attack is attributable to the state and (3) the use of force carried in self-defense could meet the standards for \"necessity\" and \"proportionality\". Therefore, the article will first explain how cyberspace affects states security. Then will examine when and under which circumstances can state (victim of a cyber attack lawfully use force in self defense).\n1. Security threats from cyberspace\nThreats from cyberspace are real and affect our everyday life. Unlike conventional threats these threats are hybrid coming both from state and non state actors. These actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Using different techniques and methods in the cyberspace both state and non-state actors generally (but not limited to) conduct cyber attacks\n- to spread misinformation,\n- for electronic espionage purposes that weakens state's competitive advantage,\n- to commit clandestine modification of sensitive data on the battlefield or\n- to affect countries' critical infrastructures\nMotives for such attacks through cyberspace differ. In general, they are usually conducted for social and criminal gain or for political and strategic military advantage. Thus, hybrid threats from cyberspace that underpins our security come from criminals, state actors, or groups and individuals with ideological and religiously violent motivation that could act independently or as a proxy to a violent state actor. Depending on the actor(s) and his/her/their motivation under current international regulations cyber attacks generally can be classified as cyber crime, cyber terror, or cyber warfare.\nCyber-attacks in Estonia (2007), Georgia (2008), Iran (2010), Burma (2010), USA (2011), Middle East (2012), confirm the above mentioned concerns and the effects that these attacks can cause. Severity and the influence of these actions were also experienced during German Chancellor visit to China, by UK's financial, legal and retail firms, the Belgian federal government, or Pentagon in the US.\nUrged by this complexity some countries and organizations such as U.S. and NATO have considered radical measures to confront upcoming threats from cyber-attacks. In its first formal cyber strategy U.S. concluded that computer sabotage coming from another country can constitute an act of war. Seeing itself as the world's premier collective defense entity, NATO believes that has a responsibility to take adequate measures to protect itself and its members from cyber threats.\nHence cyber threats and readiness to respond to such threats by some states have raised some legal questions. Precisely, it is not clear whether or not such response would be legal under international norms, principles and standards. These concerns lead one to take a closer look into the international legislation with regards to use of force.\n NATO Parliamentary Assembly, “NATO and Cyber defense”, 173 DSCFC 09 E BIS - NATO AND CYBER DEFENCE\n Report of the New England Faculty Summit on Cyber Security held at Boston University on June 28, (2011), http://www.bu.edu/hic/files/2011/07/CyberSecuritySummitReport.pdf\n “Merkel’s China Visit Marred by Hacking Allegations”, Der Spiegel, August 27, 2007, accessed August 25, 2013 at: http://chinadigitaltimes.net/2007/08/merkels-china-visit-marred-by-hacking-allegations-spiegel/\n Rex B. Hughes, “NATO and Global Cyber Defense”, The Bucharest Conference Paper, Romanian Ministry of Foreign Affairs, March 2008, p44\n Siobhan Gorman and Julian E. Barnes: Cyber Combat : Act of War, The Wall Street Journal, (May 30, 2011), http://online.wsj.com/article/SB10001424052702304563104576355623135782718.html\n Sverre Myrli: NATO and Cyber Defense, NATO Parliamentary Assembly available at: http://www.nato-pa.int/default.Asp?SHORTCUT=1782.\n2. Use of force in international law as a response to cyber attack\nStates or international organizations could lawfully use force against cyber-attacks in two situations. First, if this is authorized by the United Nations Security Council (UNSC). Second, state(s), or international organization could use force in individual or collective self-defense. It is well known that UNSC resolutions are legally binding. This means that any decision made by the UNSC and translated into resolution to use force as a result of a cyber attack will be lawful.\nSince the UNSC mandates binding resolutions the decision to use force against an entity that had conducted cyber-attack under the Charter will be legal. However, having in mind that threat perceptions in the context of cyber attacks among member state will differ from state to state and that according to recent Security Council’s practice in such situations Council will fail to respond in a timely manner, it seems valid to assume that a state(s) will choose to respond with cyber attacks by exercising it/their right(s) to self-defense (individually or collectively).\n3. Self-defense against cyber-attack(s)?\nThe use of force by a victim state of a cyber attack(s) lawfully in self-defense would be possible only if: (1) cyber attack(s) meets the standards of an armed attack, (2) cyber-attack is attributable to the state where the self-defense is being carried out and (3) the use of force carried in self-defense is “necessary” and “proportional”. Legal analogy based debates among the scholars in the context of applicability of international legal standards and principles to cyber-attacks have stimulated numerous debates in the light of these conditions too. Precisely disagreements stem from the absence of the definition of what constitutes an armed attack under international law; challenges to attribute cyber-attack(s) to a state; and applicability of customary rules of self-defense along with the provisions under the UN Charter and interpretation.\n3.1. Cyber-attack as an armed attack?\nRelevant international organizations guidance, certain international instruments and legal scholar expressing their opinions, had tried to fill the absence of authoritative definition of armed conflict. Today it is well accepted that Jean Pictet’s guidance to determine the existence of an international armed conflict under Common Article 2 of the 1949 Geneva Conventions serve as a useful guide for assessing whether a particular use of force could be considered as an act equal to armed attack. According to Pictet’s guidance a use of force is considered an armed attack when the force is of “sufficient scope, duration, and intensity.”7 Another useful tool that helps to fill the absence of a legal definition of what constitutes armed attack is the U.N. General Assembly’s Resolution for “Definition of Aggression”. Although the Resolution does not contain a definition of armed attack this instrument provides examples of state actions that could be considered as an armed attack. Even more many argue that guidance of this instrument has gained extensive international acceptance.8\n\nSome scholars have tried to define armed conflict by explaining the distinction between terms “war” and “armed conflict”. Based on the threshold in ICRC Commentary of the Common Article 2 according to Sharp, de facto hostilities exist, and consequently the Jews in Bello apply when any use of force, regardless of its scope, duration, or intensity, occurs between the members of the armed forces of two states.\nBoth states and the International Court of Justice have frequently applied these guidance and explanations in the context of the conventional understanding of the use of force. Nevertheless, the authors disagree whether these guidance and explanations can be applied to cyber-attacks. While some legal scholars believe that it is intuitive that cyber-attacks can constitute armed attacks, especially in light of their ability to injure or kill, part of the legal community has been reluctant to classify them this way because they do not resemble \"classic attack(s) with traditional military force.\"\nAuthors that negate the applicability of guidance and explanations of what constitutes an armed attack to cyber attacks are not united. There are authors who in fact disagree over the whole idea of applicability of *Ius ad bellum* to the cyberspace activities. Jeffrey Addicott, for example, asserts that “international laws associated with the use of force are woefully inadequate in terms of addressing the threat of cyber warfare”. On the other hand, there are authors who disagree only to the applicability limited to guidance and explanations of the conventional use of force. For the purpose and space of the given debate, we will focus on general arguments that these authors pose on their behalf in the context of the debate.\nDiscussing the conditions to meet criteria for using force as a response to unlawful armed attack Mary Oconel points that attempt to apply these conditions to cyber force actions is difficult, if not impossible. The sort of damage, according to this author’s views does not meet the condition that an armed attack must be significant to trigger Article 51. To prove her point she offers ICJ case law practice. Using *Nicaragua* case Oconel emphases Court’s views about the importance of “scale and effects” in determining whether or not specific action could be classified as an armed attack.\nPeter Singer and Noah Shachtman share similar positions as *O’connel*. In their argumentation, they provide insights from recent state practice. Analyzing the effects of Russian cyber-attacks to Estonia and comparing cyber attacks against Georgian government with the actual Russian missiles and bombs in the accompanying war, they tried to point that effects from cyber attacks were incomparable with the effects from the actual armed attack. Therefore, they believe that it is even inappropriate to apply *is ad bellum* rules of the cyber domain. Similar explanations come from Duncan Hollis,\n Sharp suggests that war refers to a state of de jure hostilities invoked by a formal declaration of one party that creates an international armed conflict as a matter of law. In contrast, any other armed conflict refers to a state of de facto hostilities invoked by the use of force by one party without any declaration of war. He then concludes that determination when any other conflict exists is a factual subjective determination that centers on the use of force between states. Walter G. Sharp, (1999) 74\n Thomas Wingfield: *When is a Cyberattack an \"Armed Attack\"?: Legal Thresholds for Distinguishing military activities in cyberspace*, Cyber Conflict Studies Association, (2006) 6\n Jeffrey F. Addicott, “Cyberterrorism: Legal Policy Issues,” in *Legal Issues in the Struggle against Terrorism*, eds. John N. Moore and Robert F. Turner, Durham, NC: Carolina Academic Press, (2010), 550\n “...The prohibition of armed attacks may apply to the sending by a state of armed bands to the territory of another state, if such an operation, because of its scale and effects would have been classified as an armed attack rather than a mere frontier incident...” Marry E. O’connell: *Cyber Security and International Law*, International Law Meeting Summary, Chatham House (2012), 5-7\n Peter Singer and Noah Shachtman: *The Wrong War*, Foreign Policy 21st Century Defense Initiative, Brookings, (2011), http://www.brookings.edu/research/articles/2011/08/15-cybersecurity-singer-shachtman\nwho asserts that a cyber - attack alone will almost never constitute an armed attack for the purposes of Article 51. Hollis' argumentation for this position is that a cyber - attack lacks the physical characteristics traditionally associated with military coercion\".14 Although there are others who share these views many authors believe that guidance and explanations of what constitutes an armed attack in conventional terms could be also applicable to unconventional use of force including cyber-attacks.\nYoarm Dinstein is among the authors who share the view that cyber attack can constitute armed attack. Accordingly, in his analyses based on the \"instrument-based approach\" Dinstein uses the guidance and explanations of what constitutes an armed attack in conventional terms to prove that cyber-attacks can constitute armed attacks. The logic of this approach holds that if cyber-attacks could cause the destruction of a power grid than cyber-attack constitutes an armed attack. This is due to the fact that before the development of cyber capabilities such destruction could have been possible only by using kinetic force. Beside that article 3 of the \"Definition of Aggression\" provides implicit support to Dinsteins' approach.15\nUnlike Dinstein, Walter Sharp also believes that a cyber attack could constitute an armed attack. However, Sharp uses guidance and explanations of what constitutes an armed attack in conventional terms and merge them to the target of potential cyber attack. Eric Talbot along with Sharp advocates that cyber attack classifies as an armed attack if it targets a sufficiently important computer system.16 Baring in mind our previous discussion about the importance of SCADA systems and the complexity of the risks that these systems' failure could cause sound reasonable to agree with these authors' logics. Purposeful cyber-attack to SCADA systems could cause failure of these systems and therefore cascade severe consequences. We could not agree less that in situations like this, cyber-attacks would meet not just the ICRC threshold regarding the \"intensity\", but also ICJ well established test \"scale and effects\" for determining whether or not specific action could be classified as an armed attack. Nonetheless the issue with this approach in determining when a cyber - attack could constitute an armed attack is that its proponents advocate aggressive response based on the \"strict liability\". Sean Condron, for example, argues that a cyber-attack constitutes an armed attack, and would grant the target the right to use force in self-defense, whenever it penetrates any critical national infrastructure system, regardless of whether it has yet caused any physical destruction or casualties.17\nMichael Schmitt, former colonel turned professor, uses his own developed model to measure the consequences of cyber-attack under the guidance and explanations of what constitutes an armed attack in conventional terms. Schmitt propagates that one needs to consider seven factors before deciding if a cyber-attack's effects could be deemed to armed attack. These factors are severity (the type and scale of the harm); immediacy (how quickly the harm materializes after the attack); directness (the length of the causal chain between the attack and the harm); invasiveness (the degree to which the attack penetrates the victim state's territory);\n\nmeasurability (the degree to which the harm can be quantified); presumptive legitimacy, (the weight given to the fact that) and responsibility (to be able to attribute the attack). If the cyber-attack, in the field of cyber-activities as a whole, meets these criteria, cyber-attacks constituting an armed attack are the exception rather than the rule. These factors are illuminating, but they call for such a wide-ranging inquiry that they may not provide sufficient guidance to decision makers. Although widely accepted some argue that Schmitt model suffers from some inconsistencies. It could be argued that only a small number of cyber-attacks could rise to the level of armed attack. Another issue arises from the ability to foresee the severity of the attack which could be abused since it is highly subjective.\nThe analyses of two opposing groups of authors further confirm the complexity that cyberspace poses to the society and security in a broader and law in a narrow context. In the light of our previous discussion regarding the complexity (growing asymmetry in a cyberspace and the “paradox of modernity”) it seems that second group of authors’ arguments for now, are more convincing. Just because we have not experienced a severe cyber-attack that could cause death and significant material property damage this does not mean that a cyber-attack or series of such attacks could not rise to a level of what is considered to be an armed attack under International law. Precisely, certain cyber-attacks could rise to amount of armed attack that under *Ius ad bellum* principles, standards and norms could justify the use of military force. Nevertheless, in order for victim state to be able to use force in self-defense lawfully beside the condition that state needs to be a victim of illegal action that constitutes armed attack the victim state must attribute such illegal attack(s) directly and conclusively to another state or agents under that state’s direct control.\n## 3.2. The challenge of attribution\nMost of the arguments that build “pro” and “contra” views to use military force against cyber-attacks in the context of requirement to attribute responsibility steam from the premises that we discussed regarding the so-call “paradox of modernity”. Legal scholars who disagree to apply the analogy of *Ius ad bellum* standards, principles and norms to cyberspace threats generally focus on the difficulties to attribute cyber-attacks directly and conclusively to another state.\nBret Michael and Thomas Wingfiled propose that the issue of attribution in cyberspace derives from technical challenges... since the Internet was conceived without a requirement for users’ accountability. The problem according to them is even more complicated since they argue that the attribution in cyberspace is “asymmetric”.\nDiscussing the challenge of attribution in cyberspace Eric Jensen concludes similarly to Michael and Wingfield, that tracing cyber-attacks can be exceptionally long process. The problem with accuracy, however never ends since as he asserts even\n Michel Schmitt: Computer Network Attack and the Use of force in International law: The Columbia Journal of Transnational Law, Volume 37, (1999), 885-937\n This analytical approach is important for our debate since it seems that it would appear to be the analytical model adopted by the United States. Office Of General Counsel, Department Of Defense: An Assessment Of International Legal Issues In Information Operations, (May 1999)\n Daniel B. Silver, Computer Network Attack as a Use of Force Under Article 2(4), 76 Int’l Law Studies 73, (2002) 92–93\n Sean M. Condron, (2007), 414\n Bret Michael and Thomas Wingfiled: International Legal Reform Could Make States Liable for Cyber Abuse, Per Concordiam, Journal of European Security and Defense Issues, Vol.2 Issue 2, (2011), 40-41\nif the server is located to “...identify the entity or individual directing the attack is extremely hard. Nevertheless, he advocates for changing the approach. The issue with cyber terrorists’ and cyber criminal modus operandi discussed by Davis Brown seems to echo Jensens’ analyses. Cyber-terrorists and cyber criminals often hijack innocent systems and use them as “zombies” to initiate their cyber-attacks. While victim-states must try to penetrate such guises, current technology may not always allow them to do so in a timely manner. O’connel offers state practice to point that as a source of International law, it also requires for attribution to be made with clear and convincing evidence. Nevertheless, much similarly as previously cited authors she concludes that in the case of cyber-attack such convincing evidence is hard to find.\nSince legal requirements for conclusive attribution is hard to apply in case of cyber-attacks, some have suggested that states could legally employ cross-border cyber attacks and therefore not use military force. Using the transnational criminal approach Michael and Wingfiled see this approach promising. They do believe in potentials to establish international jurisdiction where individuals and groups may be investigated and prosecuted under other countries’ domestic law.\nAuthors who advocate that cyber-attacks could trigger the use of force in self-defense lawfully under the International law in response to “attribution challenge” offer different proposals. Mainly they build their argumentation based on the same issues proposed by the authors who disagree with their positions, i.e. the complexity to directly and conclusively attribute the cyber-attack(s).\nSome recognize that attribution stubbornly permeates every aspect of cyber operations, however they consider this as a technical issue, not a legal one. Therefore they advocate that the identity of the attacker may well determine if a state of war exists. Others have tried to materialize their argumentation emphasizing the risks that cyber-attacks pose to the states. Sean Cordon explains that if states are about to follow traditional procedures to attribute responsibility regarding the nature of cyber-attacks than they need to be ready to experience risks that a cyber attack could pose. This, according to him could create a dilemma for the states. Similar views have echoed that such situations could put states in the limbo position between its safety traditional legislation and imperfect reality.\nFrom all of the above it is clear that direct and concessive attribution to cyber attack is not easy to achieve. Difficulty to locate the entity responsible for cyber-attack(s) is stubborn impediment that questions lawful response in self-defense. On the other hand, neither cyber-attacks are traditional nor the traditional test for state responsibility aloud victim state to exercise the inherent right of self-defense appropriately. Legal scholars’ disagreements over applicability of self-defense under international law to cyber-attacks culminate in the context of necessity, proportionality and anticipatory self-defense.\n Eric Jensen: Computer Attacks on Critical National Infrastructure: A Use of Force Invoking the Right of Self-Defense, 38 Stanford Journal of International Law, (2002) 207\n Davis Brown: A Proposal for an International Convention to Regulate the Use of Information Systems in Armed Conflict, 47 Harvard International Law Journal (2006) 181-183\n Bret Michael and Thomas Wingfiled, (2011), 41\n Charles Dunlap: Perspectives for Cyber Strategists on Law for Cyberwar, Strategic Study Quarterly, Spring, (2011), 88\n Sean Condron, (2007), 414-415\n Duncan B. Hollis, (2007), 1026\n## 3.3. Necessity and proportionality against cyber-attacks\nNecessity and proportionality are founding principles of appropriate self-defense. As well as other elements that build the threshold of lawful self-defense against cyber-attacks these principles considered in the context of cyber-attacks are highly disputed among the legal scholars. If under the given evidences state cannot achieve a reasonable settlement of a dispute through peaceful means self-defense against cyber-attack will meet the requirement of necessity. Self-defense against cyber-attack is proportional if victim state limits its actions to the amount of force required to defeat an ongoing cyber-attack or to deter a future cyber-attacks. Compliance with the principles of necessity and proportionality is difficult and fact-intensive even for conventional attacks, and therefore cyber-attacks present new hard challenges.\nAuthors who disagree with the overall applicability of *Ius ad bellum* to cyber-attacks believe that necessity and proportionality are difficult conditions to meet. Building on the previous discussions this part of the legal community considers that difficulties come from the complexity of cyber-attacks and as a consequence the amount of the time needed to attribute the attack. Evidences from recent cases like Estonia or Iran confirm these considerations. In both situations, attacks came from different locations. Therefore the biggest concern regarding the international legal requirements for lawful self-defense against cyber-attack is the defensive response. Technical challenge also raises considerations toward these directions. In fact the defending state would need time to consider the effects that counter measures could cause. Nevertheless, putted into the light of analytical models previously described in determining whether cyber-attacks could constitute a lawful armed attack, such evidences are not convincing. If for example one considers effect based-approach to determine if cyber-attacks qualify as an armed attack necessity is highly dependable of the effects caused by the cyber-attack(s). If victim state suffers severely and there are reasonable doubts that aggressor is preparing further cyber-attacks than the threshold of necessity change. In fact the imminence of danger aloud for victim state to respond before it is too late. At the same time proportional-limited military response to disrupt or destroy the base or the system that has caused or is about to cause further cyber-attacks sounds logically and acceptable under the recent *Ius ad bellum practice*.\nSince both analytical models “effect based” and “strict liability” model advocated for elements that consider *ex-ante* use of force in the context of our debate it is worth mentioning the issue of anticipatory self-defense.\n## 3.4. Anticipatory self-defense and cyber-attacks\nThe issue of anticipatory self-defense has been long debated among the legal scholars even in conventional terms. Measures undertaken in anticipatory self-defense are lawful when the “necessity of that self-defense is instant, overwhelming, and leaving no choice of means, and no moment for deliberation.” Since the vocabulary that explains what constitutes anticipatory self-defense differs from the course of article 51 of the Charter it is well accepted that anticipatory self-defense is considered as customary self-defense. Contrary to these views significant part of the legal community\n---\n Thomas Wingfield: The Law of Information conflict: National Security Law in Cyberspace (2000) 42\n Yoram Dinstein: War, Aggression and Self-defense (4th ed. 2005) 237\n Lori Fisler Damrosch et al.: International Law: Cases and Materials 59 5th ed. (2009) 1135\nbelieves that self- defense should be practiced not outside the Charter. Under these circumstances lawful ex-ante use of force (as “strict liability” or to a certain degree “effect based” analytical models suggest) would require victim state to sufficiently demonstrate the imminence of an anticipated attack. In the case of cyber attacks, such a requirement would invariably be difficult to meet, if not impossible.\n## Conclusion\nTelecommunication and information technologies have changed our way of leaving. Cyberspace is both necessity but also vulnerability. Abusing cyberspace state and non state actors commit cyber attacks designed to spread misinformation, weaken state’s competitive advantage through electronic espionage, commit clandestine modification of sensitive data on the battlefield or affect countries’ critical infrastructures. In order to protect themselves against violent destructive and illegal activities some states are prepared to use force in self-defense. These commitments however have raised serious legal questions.\nThe overall debate over the applicability of *Ius ad bellum* principles, standards and norms to cyber-attacks unequivocally showed that it is not quite clear whether or not, states could lawfully use force in self-defense against cyber attack. Although under specific conditions cyber-attacks could amount to armed attack(s), it is very hard to attribute such attacks to a state or non-state actors. Additionally necessity and proportionality along with the ex-ante attitude (i.e. anticipatory self – defense) are highly disputed among the legal scholars. All of these challenges require for one to reconsider legal alternatives that could provide more appropriate solutions to cyber-attacks and cyber-security."
    },
    "numeric": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 25,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "# Use of force against cyber attacks\nAuthor: Metodi Hadji-Janev\nMilitary Academy “General Mihailo Apostolski”-Skopje,\nUniversity “Goce Delcev”-Stip”, Republic of Macedonia\nAbstract. The rapid development of the technology in an age of intensified globalization has seriously affected international security. Today state and non-state actors can use telecommunication and information technologies in a disruptive way and through cyberspace remotely cause damages to the critical infrastructures that run our everyday live and on which we depend upon. Urged by this complexity some countries have considered military response including the use of force in self-defense. However international legal standards, principles and norms that regulate use of force under international law do not mention use of force against cyber attacks. Therefore it is not quite clear whether or not states can lawfully use force in self-defense against cyber attacks.\nKeywords. *Ius ad bellum*, armed attack, self-defense, cyber-attack, proportionality, necessity, anticipatory self-defense\n# Introduction\nThe development of modern technology and interconnectivity has brought both positive and negative effects. Today, thanks to a modern technology we leave in a world of global interconnectedness which through linked digital information networks brings vast benefits. Nevertheless, although designed and created for good electronic and informational interconnectivity creates tremendous vulnerabilities.\nBoth state and non-state actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Therefore, the more developed the states are the more vulnerable they are. Faced by this complexity some countries have declared to take radical measures to confront upcoming threats from cyber-attacks.\nHence cyber threats and readiness to respond to such threats by some states with the use of force in self-defense have raised some legal questions. Giving the nature of cyber attacks and the fact that current regulations for use of force in self-defense are designed for use of physical force, but not in cyberspace, it is not clear whether: (1) cyber attack could meet the standards of an armed attack; (2) cyber-attack is attributable to the state and (3) the use of force carried in self-defense could meet the standards for \"necessity\" and \"proportionality\". Therefore, the article will first explain how cyberspace affects states security. Then will examine when and under which circumstances can state (victim of a cyber attack lawfully use force in self defense).\n1. Security threats from cyberspace\nThreats from cyberspace are real and affect our everyday life. Unlike conventional threats these threats are hybrid coming both from state and non state actors. These actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Using different techniques and methods in the cyberspace both state and non-state actors generally (but not limited to) conduct cyber attacks\n- to spread misinformation,\n- for electronic espionage purposes that weakens state's competitive advantage,\n- to commit clandestine modification of sensitive data on the battlefield or\n- to affect countries' critical infrastructures\nMotives for such attacks through cyberspace differ. In general, they are usually conducted for social and criminal gain or for political and strategic military advantage. Thus, hybrid threats from cyberspace that underpins our security come from criminals, state actors, or groups and individuals with ideological and religiously violent motivation that could act independently or as a proxy to a violent state actor. Depending on the actor(s) and his/her/their motivation under current international regulations cyber attacks generally can be classified as cyber crime, cyber terror, or cyber warfare.¹\nCyber-attacks in Estonia (2007), Georgia (2008), Iran (2010), Burma (2010), USA (2011), Middle East (2012), confirm the above mentioned concerns and the effects that these attacks can cause.² Severity and the influence of these actions were also experienced during German Chancellor visit to China,³ by UK's financial, legal and retail firms, the Belgian federal government, or Pentagon in the US.⁴\nUrged by this complexity some countries and organizations such as U.S. and NATO have considered radical measures to confront upcoming threats from cyber-attacks. In its first formal cyber strategy U.S. concluded that computer sabotage coming from another country can constitute an act of war.⁵ Seeing itself as the world's premier collective defense entity, NATO believes that has a responsibility to take adequate measures to protect itself and its members from cyber threats.⁶\nHence cyber threats and readiness to respond to such threats by some states have raised some legal questions. Precisely, it is not clear whether or not such response would be legal under international norms, principles and standards. These concerns lead one to take a closer look into the international legislation with regards to use of force.\n¹ NATO Parliamentary Assembly, “NATO and Cyber defense”, 173 DSCFC 09 E BIS - NATO AND CYBER DEFENCE\n² Report of the New England Faculty Summit on Cyber Security held at Boston University on June 28, (2011), http://www.bu.edu/hic/files/2011/07/CyberSecuritySummitReport.pdf\n³ “Merkel’s China Visit Marred by Hacking Allegations”, Der Spiegel, August 27, 2007, accessed August 25, 2013 at: http://chinadigitaltimes.net/2007/08/merkels-china-visit-marred-by-hacking-allegations-spiegel/\n⁴ Rex B. Hughes, “NATO and Global Cyber Defense”, The Bucharest Conference Paper, Romanian Ministry of Foreign Affairs, March 2008, p44\n⁵ Siobhan Gorman and Julian E. Barnes: Cyber Combat : Act of War, The Wall Street Journal, (May 30, 2011), http://online.wsj.com/article/SB10001424052702304563104576355623135782718.html\n⁶ Sverre Myrli: NATO and Cyber Defense, NATO Parliamentary Assembly available at: http://www.nato-pa.int/default.Asp?SHORTCUT=1782.\n2. Use of force in international law as a response to cyber attack\nStates or international organizations could lawfully use force against cyber-attacks in two situations. First, if this is authorized by the United Nations Security Council (UNSC). Second, state(s), or international organization could use force in individual or collective self-defense. It is well known that UNSC resolutions are legally binding. This means that any decision made by the UNSC and translated into resolution to use force as a result of a cyber attack will be lawful.\nSince the UNSC mandates binding resolutions the decision to use force against an entity that had conducted cyber-attack under the Charter will be legal. However, having in mind that threat perceptions in the context of cyber attacks among member state will differ from state to state and that according to recent Security Council’s practice in such situations Council will fail to respond in a timely manner, it seems valid to assume that a state(s) will choose to respond with cyber attacks by exercising it/their right(s) to self-defense (individually or collectively).\n3. Self-defense against cyber-attack(s)?\nThe use of force by a victim state of a cyber attack(s) lawfully in self-defense would be possible only if: (1) cyber attack(s) meets the standards of an armed attack, (2) cyber-attack is attributable to the state where the self-defense is being carried out and (3) the use of force carried in self-defense is “necessary” and “proportional”. Legal analogy based debates among the scholars in the context of applicability of international legal standards and principles to cyber-attacks have stimulated numerous debates in the light of these conditions too. Precisely disagreements stem from the absence of the definition of what constitutes an armed attack under international law; challenges to attribute cyber-attack(s) to a state; and applicability of customary rules of self-defense along with the provisions under the UN Charter and interpretation.\n3.1. Cyber-attack as an armed attack?\nRelevant international organizations guidance, certain international instruments and legal scholar expressing their opinions, had tried to fill the absence of authoritative definition of armed conflict. Today it is well accepted that Jean Pictet’s guidance to determine the existence of an international armed conflict under Common Article 2 of the 1949 Geneva Conventions serve as a useful guide for assessing whether a particular use of force could be considered as an act equal to armed attack. According to Pictet’s guidance a use of force is considered an armed attack when the force is of “sufficient scope, duration, and intensity.”7 Another useful tool that helps to fill the absence of a legal definition of what constitutes armed attack is the U.N. General Assembly’s Resolution for “Definition of Aggression”. Although the Resolution does not contain a definition of armed attack this instrument provides examples of state actions that could be considered as an armed attack. Even more many argue that guidance of this instrument has gained extensive international acceptance.8\n7 Walter G. Sharp: Cyberspace and the use of force, Aegis Research Corporation, (1999) 60-61\n8 The U.N. Documents: Definition of Aggression, G.A. Res. 3314, U.N. GAOR, 29th Sess. (Dec. 14, 1974)\nSome scholars have tried to define armed conflict by explaining the distinction between terms “war” and “armed conflict”. Based on the threshold in ICRC Commentary of the Common Article 2 according to Sharp, de facto hostilities exist, and consequently the Jews in Bello apply when any use of force, regardless of its scope, duration, or intensity, occurs between the members of the armed forces of two states.\nBoth states and the International Court of Justice have frequently applied these guidance and explanations in the context of the conventional understanding of the use of force. Nevertheless, the authors disagree whether these guidance and explanations can be applied to cyber-attacks. While some legal scholars believe that it is intuitive that cyber-attacks can constitute armed attacks, especially in light of their ability to injure or kill, part of the legal community has been reluctant to classify them this way because they do not resemble \"classic attack(s) with traditional military force.\"¹⁰\nAuthors that negate the applicability of guidance and explanations of what constitutes an armed attack to cyber attacks are not united. There are authors who in fact disagree over the whole idea of applicability of *Ius ad bellum* to the cyberspace activities. Jeffrey Addicott, for example, asserts that “international laws associated with the use of force are woefully inadequate in terms of addressing the threat of cyber warfare”¹¹. On the other hand, there are authors who disagree only to the applicability limited to guidance and explanations of the conventional use of force. For the purpose and space of the given debate, we will focus on general arguments that these authors pose on their behalf in the context of the debate.\nDiscussing the conditions to meet criteria for using force as a response to unlawful armed attack Mary Oconel points that attempt to apply these conditions to cyber force actions is difficult, if not impossible. The sort of damage, according to this author’s views does not meet the condition that an armed attack must be significant to trigger Article 51. To prove her point she offers ICJ case law practice. Using *Nicaragua* case Oconel emphases Court’s views about the importance of “scale and effects” in determining whether or not specific action could be classified as an armed attack.¹²\nPeter Singer and Noah Shachtman share similar positions as *O’connel*. In their argumentation, they provide insights from recent state practice. Analyzing the effects of Russian cyber-attacks to Estonia and comparing cyber attacks against Georgian government with the actual Russian missiles and bombs in the accompanying war, they tried to point that effects from cyber attacks were incomparable with the effects from the actual armed attack.¹³ Therefore, they believe that it is even inappropriate to apply *is ad bellum* rules of the cyber domain. Similar explanations come from Duncan Hollis,\n⁹ Sharp suggests that war refers to a state of de jure hostilities invoked by a formal declaration of one party that creates an international armed conflict as a matter of law. In contrast, any other armed conflict refers to a state of de facto hostilities invoked by the use of force by one party without any declaration of war. He then concludes that determination when any other conflict exists is a factual subjective determination that centers on the use of force between states. Walter G. Sharp, (1999) 74\n¹⁰ Thomas Wingfield: *When is a Cyberattack an \"Armed Attack\"?: Legal Thresholds for Distinguishing military activities in cyberspace*, Cyber Conflict Studies Association, (2006) 6\n¹¹ Jeffrey F. Addicott, “Cyberterrorism: Legal Policy Issues,” in *Legal Issues in the Struggle against Terrorism*, eds. John N. Moore and Robert F. Turner, Durham, NC: Carolina Academic Press, (2010), 550\n¹² “...The prohibition of armed attacks may apply to the sending by a state of armed bands to the territory of another state, if such an operation, because of its scale and effects would have been classified as an armed attack rather than a mere frontier incident...” Marry E. O’connell: *Cyber Security and International Law*, International Law Meeting Summary, Chatham House (2012), 5-7\n¹³ Peter Singer and Noah Shachtman: *The Wrong War*, Foreign Policy 21st Century Defense Initiative, Brookings, (2011), http://www.brookings.edu/research/articles/2011/08/15-cybersecurity-singer-shachtman\nwho asserts that a cyber - attack alone will almost never constitute an armed attack for the purposes of Article 51. Hollis' argumentation for this position is that a cyber - attack lacks the physical characteristics traditionally associated with military coercion\".14 Although there are others who share these views many authors believe that guidance and explanations of what constitutes an armed attack in conventional terms could be also applicable to unconventional use of force including cyber-attacks.\nYoarm Dinstein is among the authors who share the view that cyber attack can constitute armed attack. Accordingly, in his analyses based on the \"instrument-based approach\" Dinstein uses the guidance and explanations of what constitutes an armed attack in conventional terms to prove that cyber-attacks can constitute armed attacks. The logic of this approach holds that if cyber-attacks could cause the destruction of a power grid than cyber-attack constitutes an armed attack. This is due to the fact that before the development of cyber capabilities such destruction could have been possible only by using kinetic force. Beside that article 3 of the \"Definition of Aggression\" provides implicit support to Dinsteins' approach.15\nUnlike Dinstein, Walter Sharp also believes that a cyber attack could constitute an armed attack. However, Sharp uses guidance and explanations of what constitutes an armed attack in conventional terms and merge them to the target of potential cyber attack. Eric Talbot along with Sharp advocates that cyber attack classifies as an armed attack if it targets a sufficiently important computer system.16 Baring in mind our previous discussion about the importance of SCADA systems and the complexity of the risks that these systems' failure could cause sound reasonable to agree with these authors' logics. Purposeful cyber-attack to SCADA systems could cause failure of these systems and therefore cascade severe consequences. We could not agree less that in situations like this, cyber-attacks would meet not just the ICRC threshold regarding the \"intensity\", but also ICJ well established test \"scale and effects\" for determining whether or not specific action could be classified as an armed attack. Nonetheless the issue with this approach in determining when a cyber - attack could constitute an armed attack is that its proponents advocate aggressive response based on the \"strict liability\". Sean Condron, for example, argues that a cyber-attack constitutes an armed attack, and would grant the target the right to use force in self-defense, whenever it penetrates any critical national infrastructure system, regardless of whether it has yet caused any physical destruction or casualties.17\nMichael Schmitt, former colonel turned professor, uses his own developed model to measure the consequences of cyber-attack under the guidance and explanations of what constitutes an armed attack in conventional terms. Schmitt propagates that one needs to consider seven factors before deciding if a cyber-attack's effects could be deemed to armed attack. These factors are severity (the type and scale of the harm); immediacy (how quickly the harm materializes after the attack); directness (the length of the causal chain between the attack and the harm); invasiveness (the degree to which the attack penetrates the victim state's territory);\n14 In other words, because it generally does not use traditional military weapons, Duncan B. Hollis: Why States Need an International Law for Information Operations, 11 Lewis &amp; Clark L. Rev. (2007), 1023-1042\n15 This view has some support in the article 41 of the U.N. Charter as well Yoram Dinstein: Computer Network Attacks and Self-Defense, in: Michael N. Schmitt &amp; Brian T. O'Donnell eds. Computer Network Attack And International Law, (2002), 99\n16 Walter Sharp, (1999), 129-130\n17 Sean M. Condron: Getting it Right: Protecting American Critical Infrastructure in Cyberspace, 20 Harvard J.L. &amp; Tech., (2007), 403, 415-16\nmeasurability (the degree to which the harm can be quantified); presumptive legitimacy, (the weight given to the fact that) and responsibility (to be able to attribute the attack).¹⁸ If the cyber-attack, in the field of cyber-activities as a whole, meets these criteria, cyber-attacks constituting an armed attack are the exception rather than the rule. These factors are illuminating, but they call for such a wide-ranging inquiry that they may not provide sufficient guidance to decision makers.¹⁹ Although widely accepted some argue that Schmitt model suffers from some inconsistencies. It could be argued that only a small number of cyber-attacks could rise to the level of armed attack.²⁰ Another issue arises from the ability to foresee the severity of the attack which could be abused since it is highly subjective.\nThe analyses of two opposing groups of authors further confirm the complexity that cyberspace poses to the society and security in a broader and law in a narrow context. In the light of our previous discussion regarding the complexity (growing asymmetry in a cyberspace and the “paradox of modernity”) it seems that second group of authors’ arguments for now, are more convincing. Just because we have not experienced a severe cyber-attack that could cause death and significant material property damage this does not mean that a cyber-attack or series of such attacks could not rise to a level of what is considered to be an armed attack under International law. Precisely, certain cyber-attacks could rise to amount of armed attack that under *Ius ad bellum* principles, standards and norms could justify the use of military force. Nevertheless, in order for victim state to be able to use force in self-defense lawfully beside the condition that state needs to be a victim of illegal action that constitutes armed attack the victim state must attribute such illegal attack(s) directly and conclusively to another state or agents under that state’s direct control.²¹\n## 3.2. The challenge of attribution\nMost of the arguments that build “pro” and “contra” views to use military force against cyber-attacks in the context of requirement to attribute responsibility steam from the premises that we discussed regarding the so-call “paradox of modernity”. Legal scholars who disagree to apply the analogy of *Ius ad bellum* standards, principles and norms to cyberspace threats generally focus on the difficulties to attribute cyber-attacks directly and conclusively to another state.\nBret Michael and Thomas Wingfiled propose that the issue of attribution in cyberspace derives from technical challenges... since the Internet was conceived without a requirement for users’ accountability. The problem according to them is even more complicated since they argue that the attribution in cyberspace is “asymmetric”.²²\nDiscussing the challenge of attribution in cyberspace Eric Jensen concludes similarly to Michael and Wingfield, that tracing cyber-attacks can be exceptionally long process. The problem with accuracy, however never ends since as he asserts even\n¹⁸ Michel Schmitt: Computer Network Attack and the Use of force in International law: The Columbia Journal of Transnational Law, Volume 37, (1999), 885-937\n¹⁹ This analytical approach is important for our debate since it seems that it would appear to be the analytical model adopted by the United States. Office Of General Counsel, Department Of Defense: An Assessment Of International Legal Issues In Information Operations, (May 1999)\n²⁰ Daniel B. Silver, Computer Network Attack as a Use of Force Under Article 2(4), 76 Int’l Law Studies 73, (2002) 92–93\n²¹ Sean M. Condron, (2007), 414\n²² Bret Michael and Thomas Wingfiled: International Legal Reform Could Make States Liable for Cyber Abuse, Per Concordiam, Journal of European Security and Defense Issues, Vol.2 Issue 2, (2011), 40-41\nif the server is located to “...identify the entity or individual directing the attack is extremely hard. Nevertheless, he advocates for changing the approach.²³ The issue with cyber terrorists’ and cyber criminal modus operandi discussed by Davis Brown seems to echo Jensens’ analyses. Cyber-terrorists and cyber criminals often hijack innocent systems and use them as “zombies” to initiate their cyber-attacks. While victim-states must try to penetrate such guises, current technology may not always allow them to do so in a timely manner.²⁴ O’connel offers state practice to point that as a source of International law, it also requires for attribution to be made with clear and convincing evidence. Nevertheless, much similarly as previously cited authors she concludes that in the case of cyber-attack such convincing evidence is hard to find.\nSince legal requirements for conclusive attribution is hard to apply in case of cyber-attacks, some have suggested that states could legally employ cross-border cyber attacks and therefore not use military force. Using the transnational criminal approach Michael and Wingfiled see this approach promising. They do believe in potentials to establish international jurisdiction where individuals and groups may be investigated and prosecuted under other countries’ domestic law.²⁵\nAuthors who advocate that cyber-attacks could trigger the use of force in self-defense lawfully under the International law in response to “attribution challenge” offer different proposals. Mainly they build their argumentation based on the same issues proposed by the authors who disagree with their positions, i.e. the complexity to directly and conclusively attribute the cyber-attack(s).\nSome recognize that attribution stubbornly permeates every aspect of cyber operations, however they consider this as a technical issue, not a legal one. Therefore they advocate that the identity of the attacker may well determine if a state of war exists.²⁶ Others have tried to materialize their argumentation emphasizing the risks that cyber-attacks pose to the states. Sean Cordon explains that if states are about to follow traditional procedures to attribute responsibility regarding the nature of cyber-attacks than they need to be ready to experience risks that a cyber attack could pose. This, according to him could create a dilemma for the states.²⁷ Similar views have echoed that such situations could put states in the limbo position between its safety traditional legislation and imperfect reality.²⁸\nFrom all of the above it is clear that direct and concessive attribution to cyber attack is not easy to achieve. Difficulty to locate the entity responsible for cyber-attack(s) is stubborn impediment that questions lawful response in self-defense. On the other hand, neither cyber-attacks are traditional nor the traditional test for state responsibility aloud victim state to exercise the inherent right of self-defense appropriately. Legal scholars’ disagreements over applicability of self-defense under international law to cyber-attacks culminate in the context of necessity, proportionality and anticipatory self-defense.\n²³ Eric Jensen: Computer Attacks on Critical National Infrastructure: A Use of Force Invoking the Right of Self-Defense, 38 Stanford Journal of International Law, (2002) 207\n²⁴ Davis Brown: A Proposal for an International Convention to Regulate the Use of Information Systems in Armed Conflict, 47 Harvard International Law Journal (2006) 181-183\n²⁵ Bret Michael and Thomas Wingfiled, (2011), 41\n²⁶ Charles Dunlap: Perspectives for Cyber Strategists on Law for Cyberwar, Strategic Study Quarterly, Spring, (2011), 88\n²⁷ Sean Condron, (2007), 414-415\n²⁸ Duncan B. Hollis, (2007), 1026\n## 3.3. Necessity and proportionality against cyber-attacks\nNecessity and proportionality are founding principles of appropriate self-defense.²⁹ As well as other elements that build the threshold of lawful self-defense against cyber-attacks these principles considered in the context of cyber-attacks are highly disputed among the legal scholars. If under the given evidences state cannot achieve a reasonable settlement of a dispute through peaceful means self-defense against cyber-attack will meet the requirement of necessity. Self-defense against cyber-attack is proportional if victim state limits its actions to the amount of force required to defeat an ongoing cyber-attack or to deter a future cyber-attacks.³⁰ Compliance with the principles of necessity and proportionality is difficult and fact-intensive even for conventional attacks, and therefore cyber-attacks present new hard challenges.\nAuthors who disagree with the overall applicability of *Ius ad bellum* to cyber-attacks believe that necessity and proportionality are difficult conditions to meet. Building on the previous discussions this part of the legal community considers that difficulties come from the complexity of cyber-attacks and as a consequence the amount of the time needed to attribute the attack. Evidences from recent cases like Estonia or Iran confirm these considerations. In both situations, attacks came from different locations. Therefore the biggest concern regarding the international legal requirements for lawful self-defense against cyber-attack is the defensive response. Technical challenge also raises considerations toward these directions. In fact the defending state would need time to consider the effects that counter measures could cause. Nevertheless, putted into the light of analytical models previously described in determining whether cyber-attacks could constitute a lawful armed attack, such evidences are not convincing. If for example one considers effect based-approach to determine if cyber-attacks qualify as an armed attack necessity is highly dependable of the effects caused by the cyber-attack(s). If victim state suffers severely and there are reasonable doubts that aggressor is preparing further cyber-attacks than the threshold of necessity change. In fact the imminence of danger aloud for victim state to respond before it is too late. At the same time proportional-limited military response to disrupt or destroy the base or the system that has caused or is about to cause further cyber-attacks sounds logically and acceptable under the recent *Ius ad bellum practice*.\nSince both analytical models “effect based” and “strict liability” model advocated for elements that consider *ex-ante* use of force in the context of our debate it is worth mentioning the issue of anticipatory self-defense.\n## 3.4. Anticipatory self-defense and cyber-attacks\nThe issue of anticipatory self-defense has been long debated among the legal scholars even in conventional terms. Measures undertaken in anticipatory self-defense are lawful when the “necessity of that self-defense is instant, overwhelming, and leaving no choice of means, and no moment for deliberation.”³¹ Since the vocabulary that explains what constitutes anticipatory self-defense differs from the course of article 51 of the Charter it is well accepted that anticipatory self-defense is considered as customary self-defense. Contrary to these views significant part of the legal community\n---\n²⁹ Thomas Wingfield: The Law of Information conflict: National Security Law in Cyberspace (2000) 42\n³⁰ Yoram Dinstein: War, Aggression and Self-defense (4th ed. 2005) 237\n³¹ Lori Fisler Damrosch et al.: International Law: Cases and Materials 59 5th ed. (2009) 1135\nbelieves that self- defense should be practiced not outside the Charter.³² Under these circumstances lawful ex-ante use of force (as “strict liability” or to a certain degree “effect based” analytical models suggest) would require victim state to sufficiently demonstrate the imminence of an anticipated attack. In the case of cyber attacks, such a requirement would invariably be difficult to meet, if not impossible.\n## Conclusion\nTelecommunication and information technologies have changed our way of leaving. Cyberspace is both necessity but also vulnerability. Abusing cyberspace state and non state actors commit cyber attacks designed to spread misinformation, weaken state’s competitive advantage through electronic espionage, commit clandestine modification of sensitive data on the battlefield or affect countries’ critical infrastructures. In order to protect themselves against violent destructive and illegal activities some states are prepared to use force in self-defense. These commitments however have raised serious legal questions.\nThe overall debate over the applicability of *Ius ad bellum* principles, standards and norms to cyber-attacks unequivocally showed that it is not quite clear whether or not, states could lawfully use force in self-defense against cyber attack. Although under specific conditions cyber-attacks could amount to armed attack(s), it is very hard to attribute such attacks to a state or non-state actors. Additionally necessity and proportionality along with the ex-ante attitude (i.e. anticipatory self – defense) are highly disputed among the legal scholars. All of these challenges require for one to reconsider legal alternatives that could provide more appropriate solutions to cyber-attacks and cyber-security."
    },
    "author_year": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 55,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "author_year"
      },
      "results": [],
      "flat_text": "# Use of force against cyber attacks\nAuthor: Metodi Hadji-Janev\nMilitary Academy “General Mihailo Apostolski”-Skopje,\nUniversity “Goce Delcev”-Stip”, Republic of Macedonia\nAbstract. The rapid development of the technology in an age of intensified globalization has seriously affected international security. Today state and non-state actors can use telecommunication and information technologies in a disruptive way and through cyberspace remotely cause damages to the critical infrastructures that run our everyday live and on which we depend upon. Urged by this complexity some countries have considered military response including the use of force in self-defense. However international legal standards, principles and norms that regulate use of force under international law do not mention use of force against cyber attacks. Therefore it is not quite clear whether or not states can lawfully use force in self-defense against cyber attacks.\nKeywords. *Ius ad bellum*, armed attack, self-defense, cyber-attack, proportionality, necessity, anticipatory self-defense\n# Introduction\nThe development of modern technology and interconnectivity has brought both positive and negative effects. Today, thanks to a modern technology we leave in a world of global interconnectedness which through linked digital information networks brings vast benefits. Nevertheless, although designed and created for good electronic and informational interconnectivity creates tremendous vulnerabilities.\nBoth state and non-state actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Therefore, the more developed the states are the more vulnerable they are. Faced by this complexity some countries have declared to take radical measures to confront upcoming threats from cyber-attacks.\nHence cyber threats and readiness to respond to such threats by some states with the use of force in self-defense have raised some legal questions. Giving the nature of cyber attacks and the fact that current regulations for use of force in self-defense are designed for use of physical force, but not in cyberspace, it is not clear whether: (1) cyber attack could meet the standards of an armed attack; (2) cyber-attack is attributable to the state and (3) the use of force carried in self-defense could meet the standards for \"necessity\" and \"proportionality\". Therefore, the article will first explain how cyberspace affects states security. Then will examine when and under which circumstances can state (victim of a cyber attack lawfully use force in self defense).\n\nThreats from cyberspace are real and affect our everyday life. Unlike conventional threats these threats are hybrid coming both from state and non state actors. These actors conduct cyber attacks designed to disrupt states and international organizations' physical or informational assets, their actions in the international system or their public image. Using different techniques and methods in the cyberspace both state and non-state actors generally (but not limited to) conduct cyber attacks - to spread misinformation, - for electronic espionage purposes that weakens state's competitive advantage, - to commit clandestine modification of sensitive data on the battlefield or - to affect countries' critical infrastructures Motives for such attacks through cyberspace differ. In general, they are usually conducted for social and criminal gain or for political and strategic military advantage. Thus, hybrid threats from cyberspace that underpins our security come from criminals, state actors, or groups and individuals with ideological and religiously violent motivation that could act independently or as a proxy to a violent state actor. Depending on the actor(s) and his/her/their motivation under current international regulations cyber attacks generally can be classified as cyber crime, cyber terror, or cyber warfare.¹ Cyber-attacks in Estonia (2007), Georgia (2008), Iran (2010), Burma (2010), USA (2011), Middle East (2012), confirm the above mentioned concerns and the effects that these attacks can cause.² Severity and the influence of these actions were also experienced during German Chancellor visit to China,³ by UK's financial, legal and retail firms, the Belgian federal government, or Pentagon in the US.⁴ Urged by this complexity some countries and organizations such as U.S. and NATO have considered radical measures to confront upcoming threats from cyber-attacks. In its first formal cyber strategy U.S. concluded that computer sabotage coming from another country can constitute an act of war.⁵ Seeing itself as the world's premier collective defense entity, NATO believes that has a responsibility to take adequate measures to protect itself and its members from cyber threats.⁶ Hence cyber threats and readiness to respond to such threats by some states have raised some legal questions. Precisely, it is not clear whether or not such response would be legal under international norms, principles and standards. These concerns lead one to take a closer look into the international legislation with regards to use of force.\n¹ NATO Parliamentary Assembly, “NATO and Cyber defense”, 173 DSCFC 09 E BIS - NATO AND CYBER DEFENCE ² Report of the New England Faculty Summit on Cyber Security held at Boston University on June 28, (2011), http://www.bu.edu/hic/files/2011/07/CyberSecuritySummitReport.pdf ³ “Merkel’s China Visit Marred by Hacking Allegations”, Der Spiegel, August 27, 2007, accessed August 25, 2013 at: http://chinadigitaltimes.net/2007/08/merkels-china-visit-marred-by-hacking-allegations-spiegel/ ⁴ Rex B. Hughes, “NATO and Global Cyber Defense”, The Bucharest Conference Paper, Romanian Ministry of Foreign Affairs, March 2008, p44 ⁵ Siobhan Gorman and Julian E. Barnes: Cyber Combat: Act of War, The Wall Street Journal, (May 30, 2011), http://online.wsj.com/article/SB10001424052702304563104576355623135782718.html ⁶ Sverre Myrli: NATO and Cyber Defense, NATO Parliamentary Assembly available at: http://www.nato-pa.int/default.Asp?SHORTCUT=1782.\n\nStates or international organizations could lawfully use force against cyber-attacks in two situations. First, if this is authorized by the United Nations Security Council (UNSC). Second, state(s), or international organization could use force in individual or collective self-defense. It is well known that UNSC resolutions are legally binding. This means that any decision made by the UNSC and translated into resolution to use force as a result of a cyber attack will be lawful.\nSince the UNSC mandates binding resolutions the decision to use force against an entity that had conducted cyber-attack under the Charter will be legal. However, having in mind that threat perceptions in the context of cyber attacks among member state will differ from state to state and that according to recent Security Council’s practice in such situations Council will fail to respond in a timely manner, it seems valid to assume that a state(s) will choose to respond with cyber attacks by exercising it/their right(s) to self-defense (individually or collectively).\n\nThe use of force by a victim state of a cyber attack(s) lawfully in self-defense would be possible only if: (1) cyber attack(s) meets the standards of an armed attack, (2) cyber-attack is attributable to the state where the self-defense is being carried out and (3) the use of force carried in self-defense is “necessary” and “proportional”. Legal analogy based debates among the scholars in the context of applicability of international legal standards and principles to cyber-attacks have stimulated numerous debates in the light of these conditions too. Precisely disagreements stem from the absence of the definition of what constitutes an armed attack under international law; challenges to attribute cyber-attack(s) to a state; and applicability of customary rules of self-defense along with the provisions under the UN Charter and interpretation.\n3.1. Cyber-attack as an armed attack?\nRelevant international organizations guidance, certain international instruments and legal scholar expressing their opinions, had tried to fill the absence of authoritative definition of armed conflict. Today it is well accepted that Jean Pictet’s guidance to determine the existence of an international armed conflict under Common Article 2 of the 1949 Geneva Conventions serve as a useful guide for assessing whether a particular use of force could be considered as an act equal to armed attack. According to Pictet’s guidance a use of force is considered an armed attack when the force is of “sufficient scope, duration, and intensity.”7 Another useful tool that helps to fill the absence of a legal definition of what constitutes armed attack is the U.N. General Assembly’s Resolution for “Definition of Aggression”. Although the Resolution does not contain a definition of armed attack this instrument provides examples of state actions that could be considered as an armed attack. Even more many argue that guidance of this instrument has gained extensive international acceptance.8 Some scholars have tried to define armed conflict by explaining the distinction between terms “war” and “armed conflict”. Based on the threshold in ICRC Commentary of the Common Article 2 according to Sharp, de facto hostilities exist, and consequently the Jews in Bello apply when any use of force, regardless of its scope, duration, or intensity, occurs between the members of the armed forces of two states.\nBoth states and the International Court of Justice have frequently applied these guidance and explanations in the context of the conventional understanding of the use of force. Nevertheless, the authors disagree whether these guidance and explanations can be applied to cyber-attacks. While some legal scholars believe that it is intuitive that cyber-attacks can constitute armed attacks, especially in light of their ability to injure or kill, part of the legal community has been reluctant to classify them this way because they do not resemble\"classic attack(s) with traditional military force.\"¹⁰ Authors that negate the applicability of guidance and explanations of what constitutes an armed attack to cyber attacks are not united. There are authors who in fact disagree over the whole idea of applicability of *Ius ad bellum* to the cyberspace activities. Jeffrey Addicott, for example, asserts that “international laws associated with the use of force are woefully inadequate in terms of addressing the threat of cyber warfare”¹¹. On the other hand, there are authors who disagree only to the applicability limited to guidance and explanations of the conventional use of force. For the purpose and space of the given debate, we will focus on general arguments that these authors pose on their behalf in the context of the debate.\nDiscussing the conditions to meet criteria for using force as a response to unlawful armed attack Mary Oconel points that attempt to apply these conditions to cyber force actions is difficult, if not impossible. The sort of damage, according to this author’s views does not meet the condition that an armed attack must be significant to trigger Article 51. To prove her point she offers ICJ case law practice. Using *Nicaragua* case Oconel emphases Court’s views about the importance of “scale and effects” in determining whether or not specific action could be classified as an armed attack.¹² Peter Singer and Noah Shachtman share similar positions as *O’connel*. In their argumentation, they provide insights from recent state practice. Analyzing the effects of Russian cyber-attacks to Estonia and comparing cyber attacks against Georgian government with the actual Russian missiles and bombs in the accompanying war, they tried to point that effects from cyber attacks were incomparable with the effects from the actual armed attack.¹³ Therefore, they believe that it is even inappropriate to apply *is ad bellum* rules of the cyber domain. Similar explanations come from Duncan Hollis, ⁹ Sharp suggests that war refers to a state of de jure hostilities invoked by a formal declaration of one party that creates an international armed conflict as a matter of law. In contrast, any other armed conflict refers to a state of de facto hostilities invoked by the use of force by one party without any declaration of war. He then concludes that determination when any other conflict exists is a factual subjective determination that centers on the use of force between states. Walter G. Sharp, (1999) 74 ¹⁰ Thomas Wingfield: *When is a Cyberattack an\"Armed Attack\"?: Legal Thresholds for Distinguishing military activities in cyberspace*, Cyber Conflict Studies Association, (2006) 6 ¹¹ Jeffrey F. Addicott, “Cyberterrorism: Legal Policy Issues,” in *Legal Issues in the Struggle against Terrorism*, eds. John N. Moore and Robert F. Turner, Durham, NC: Carolina Academic Press, (2010), 550 ¹² “...The prohibition of armed attacks may apply to the sending by a state of armed bands to the territory of another state, if such an operation, because of its scale and effects would have been classified as an armed attack rather than a mere frontier incident...” Marry E. O’connell: *Cyber Security and International Law*, International Law Meeting Summary, Chatham House (2012), 5-7 ¹³ Peter Singer and Noah Shachtman: *The Wrong War*, Foreign Policy 21st Century Defense Initiative, Brookings, (2011), http://www.brookings.edu/research/articles/2011/08/15-cybersecurity-singer-shachtman who asserts that a cyber - attack alone will almost never constitute an armed attack for the purposes of Article 51. Hollis' argumentation for this position is that a cyber - attack lacks the physical characteristics traditionally associated with military coercion\".14 Although there are others who share these views many authors believe that guidance and explanations of what constitutes an armed attack in conventional terms could be also applicable to unconventional use of force including cyber-attacks.\nYoarm Dinstein is among the authors who share the view that cyber attack can constitute armed attack. Accordingly, in his analyses based on the\"instrument-based approach\"Dinstein uses the guidance and explanations of what constitutes an armed attack in conventional terms to prove that cyber-attacks can constitute armed attacks. The logic of this approach holds that if cyber-attacks could cause the destruction of a power grid than cyber-attack constitutes an armed attack. This is due to the fact that before the development of cyber capabilities such destruction could have been possible only by using kinetic force. Beside that article 3 of the\"Definition of Aggression\"provides implicit support to Dinsteins' approach.15 Unlike Dinstein, Walter Sharp also believes that a cyber attack could constitute an armed attack. However, Sharp uses guidance and explanations of what constitutes an armed attack in conventional terms and merge them to the target of potential cyber attack. Eric Talbot along with Sharp advocates that cyber attack classifies as an armed attack if it targets a sufficiently important computer system.16 Baring in mind our previous discussion about the importance of SCADA systems and the complexity of the risks that these systems' failure could cause sound reasonable to agree with these authors' logics. Purposeful cyber-attack to SCADA systems could cause failure of these systems and therefore cascade severe consequences. We could not agree less that in situations like this, cyber-attacks would meet not just the ICRC threshold regarding the\"intensity\", but also ICJ well established test\"scale and effects\"for determining whether or not specific action could be classified as an armed attack. Nonetheless the issue with this approach in determining when a cyber - attack could constitute an armed attack is that its proponents advocate aggressive response based on the\"strict liability\". Sean Condron, for example, argues that a cyber-attack constitutes an armed attack, and would grant the target the right to use force in self-defense, whenever it penetrates any critical national infrastructure system, regardless of whether it has yet caused any physical destruction or casualties.17 Michael Schmitt, former colonel turned professor, uses his own developed model to measure the consequences of cyber-attack under the guidance and explanations of what constitutes an armed attack in conventional terms. Schmitt propagates that one needs to consider seven factors before deciding if a cyber-attack's effects could be deemed to armed attack. These factors are severity (the type and scale of the harm); immediacy (how quickly the harm materializes after the attack); directness (the length of the causal chain between the attack and the harm); invasiveness (the degree to which the attack penetrates the victim state's territory); measurability (the degree to which the harm can be quantified); presumptive legitimacy, (the weight given to the fact that) and responsibility (to be able to attribute the attack).¹⁸ If the cyber-attack, in the field of cyber-activities as a whole, meets these criteria, cyber-attacks constituting an armed attack are the exception rather than the rule. These factors are illuminating, but they call for such a wide-ranging inquiry that they may not provide sufficient guidance to decision makers.¹⁹ Although widely accepted some argue that Schmitt model suffers from some inconsistencies. It could be argued that only a small number of cyber-attacks could rise to the level of armed attack.²⁰ Another issue arises from the ability to foresee the severity of the attack which could be abused since it is highly subjective.\nThe analyses of two opposing groups of authors further confirm the complexity that cyberspace poses to the society and security in a broader and law in a narrow context. In the light of our previous discussion regarding the complexity (growing asymmetry in a cyberspace and the “paradox of modernity”) it seems that second group of authors’ arguments for now, are more convincing. Just because we have not experienced a severe cyber-attack that could cause death and significant material property damage this does not mean that a cyber-attack or series of such attacks could not rise to a level of what is considered to be an armed attack under International law. Precisely, certain cyber-attacks could rise to amount of armed attack that under *Ius ad bellum* principles, standards and norms could justify the use of military force. Nevertheless, in order for victim state to be able to use force in self-defense lawfully beside the condition that state needs to be a victim of illegal action that constitutes armed attack the victim state must attribute such illegal attack(s) directly and conclusively to another state or agents under that state’s direct control.²¹ ## 3.2. The challenge of attribution Most of the arguments that build “pro” and “contra” views to use military force against cyber-attacks in the context of requirement to attribute responsibility steam from the premises that we discussed regarding the so-call “paradox of modernity”. Legal scholars who disagree to apply the analogy of *Ius ad bellum* standards, principles and norms to cyberspace threats generally focus on the difficulties to attribute cyber-attacks directly and conclusively to another state.\nBret Michael and Thomas Wingfiled propose that the issue of attribution in cyberspace derives from technical challenges... since the Internet was conceived without a requirement for users’ accountability. The problem according to them is even more complicated since they argue that the attribution in cyberspace is “asymmetric”.²² Discussing the challenge of attribution in cyberspace Eric Jensen concludes similarly to Michael and Wingfield, that tracing cyber-attacks can be exceptionally long process. The problem with accuracy, however never ends since as he asserts even ¹⁸ Michel Schmitt: Computer Network Attack and the Use of force in International law: The Columbia Journal of Transnational Law, Volume 37, (1999), 885-937 ¹⁹ This analytical approach is important for our debate since it seems that it would appear to be the analytical model adopted by the United States. Office Of General Counsel, Department Of Defense: An Assessment Of International Legal Issues In Information Operations, ²⁰ Daniel B. Silver, Computer Network Attack as a Use of Force Under Article 2(4), 76 Int’l Law Studies 73, (2002) 92–93 ²¹ Sean M. Condron, (2007), 414 ²² Bret Michael and Thomas Wingfiled: International Legal Reform Could Make States Liable for Cyber Abuse, Per Concordiam, Journal of European Security and Defense Issues, Vol.2 Issue 2, (2011), 40-41 if the server is located to “...identify the entity or individual directing the attack is extremely hard. Nevertheless, he advocates for changing the approach.²³ The issue with cyber terrorists’ and cyber criminal modus operandi discussed by Davis Brown seems to echo Jensens’ analyses. Cyber-terrorists and cyber criminals often hijack innocent systems and use them as “zombies” to initiate their cyber-attacks. While victim-states must try to penetrate such guises, current technology may not always allow them to do so in a timely manner.²⁴ O’connel offers state practice to point that as a source of International law, it also requires for attribution to be made with clear and convincing evidence. Nevertheless, much similarly as previously cited authors she concludes that in the case of cyber-attack such convincing evidence is hard to find.\nSince legal requirements for conclusive attribution is hard to apply in case of cyber-attacks, some have suggested that states could legally employ cross-border cyber attacks and therefore not use military force. Using the transnational criminal approach Michael and Wingfiled see this approach promising. They do believe in potentials to establish international jurisdiction where individuals and groups may be investigated and prosecuted under other countries’ domestic law.²⁵ Authors who advocate that cyber-attacks could trigger the use of force in self-defense lawfully under the International law in response to “attribution challenge” offer different proposals. Mainly they build their argumentation based on the same issues proposed by the authors who disagree with their positions, i.e. the complexity to directly and conclusively attribute the cyber-attack(s).\nSome recognize that attribution stubbornly permeates every aspect of cyber operations, however they consider this as a technical issue, not a legal one. Therefore they advocate that the identity of the attacker may well determine if a state of war exists.²⁶ Others have tried to materialize their argumentation emphasizing the risks that cyber-attacks pose to the states. Sean Cordon explains that if states are about to follow traditional procedures to attribute responsibility regarding the nature of cyber-attacks than they need to be ready to experience risks that a cyber attack could pose. This, according to him could create a dilemma for the states.²⁷ Similar views have echoed that such situations could put states in the limbo position between its safety traditional legislation and imperfect reality.²⁸ From all of the above it is clear that direct and concessive attribution to cyber attack is not easy to achieve. Difficulty to locate the entity responsible for cyber-attack(s) is stubborn impediment that questions lawful response in self-defense. On the other hand, neither cyber-attacks are traditional nor the traditional test for state responsibility aloud victim state to exercise the inherent right of self-defense appropriately. Legal scholars’ disagreements over applicability of self-defense under international law to cyber-attacks culminate in the context of necessity, proportionality and anticipatory self-defense.\n²³ Eric Jensen: Computer Attacks on Critical National Infrastructure: A Use of Force Invoking the Right of Self-Defense, 38 Stanford Journal of International Law, (2002) 207 ²⁴ Davis Brown: A Proposal for an International Convention to Regulate the Use of Information Systems in Armed Conflict, 47 Harvard International Law Journal (2006) 181-183 ²⁵ Bret Michael and Thomas Wingfiled, (2011), 41 ²⁶ Charles Dunlap: Perspectives for Cyber Strategists on Law for Cyberwar, Strategic Study Quarterly, Spring, (2011), 88 ²⁷ Sean Condron, (2007), 414-415 ²⁸ Duncan B. Hollis, (2007), 1026 ## 3.3. Necessity and proportionality against cyber-attacks Necessity and proportionality are founding principles of appropriate self-defense.²⁹ As well as other elements that build the threshold of lawful self-defense against cyber-attacks these principles considered in the context of cyber-attacks are highly disputed among the legal scholars. If under the given evidences state cannot achieve a reasonable settlement of a dispute through peaceful means self-defense against cyber-attack will meet the requirement of necessity. Self-defense against cyber-attack is proportional if victim state limits its actions to the amount of force required to defeat an ongoing cyber-attack or to deter a future cyber-attacks.³⁰ Compliance with the principles of necessity and proportionality is difficult and fact-intensive even for conventional attacks, and therefore cyber-attacks present new hard challenges.\nAuthors who disagree with the overall applicability of *Ius ad bellum* to cyber-attacks believe that necessity and proportionality are difficult conditions to meet. Building on the previous discussions this part of the legal community considers that difficulties come from the complexity of cyber-attacks and as a consequence the amount of the time needed to attribute the attack. Evidences from recent cases like Estonia or Iran confirm these considerations. In both situations, attacks came from different locations. Therefore the biggest concern regarding the international legal requirements for lawful self-defense against cyber-attack is the defensive response. Technical challenge also raises considerations toward these directions. In fact the defending state would need time to consider the effects that counter measures could cause. Nevertheless, putted into the light of analytical models previously described in determining whether cyber-attacks could constitute a lawful armed attack, such evidences are not convincing. If for example one considers effect based-approach to determine if cyber-attacks qualify as an armed attack necessity is highly dependable of the effects caused by the cyber-attack(s). If victim state suffers severely and there are reasonable doubts that aggressor is preparing further cyber-attacks than the threshold of necessity change. In fact the imminence of danger aloud for victim state to respond before it is too late. At the same time proportional-limited military response to disrupt or destroy the base or the system that has caused or is about to cause further cyber-attacks sounds logically and acceptable under the recent *Ius ad bellum practice*.\nSince both analytical models “effect based” and “strict liability” model advocated for elements that consider *ex-ante* use of force in the context of our debate it is worth mentioning the issue of anticipatory self-defense.\n## 3.4. Anticipatory self-defense and cyber-attacks The issue of anticipatory self-defense has been long debated among the legal scholars even in conventional terms. Measures undertaken in anticipatory self-defense are lawful when the “necessity of that self-defense is instant, overwhelming, and leaving no choice of means, and no moment for deliberation.”³¹ Since the vocabulary that explains what constitutes anticipatory self-defense differs from the course of article 51 of the Charter it is well accepted that anticipatory self-defense is considered as customary self-defense. Contrary to these views significant part of the legal community --- ²⁹ Thomas Wingfield: The Law of Information conflict: National Security Law in Cyberspace (2000) 42 ³⁰ Yoram Dinstein: War, Aggression and Self-defense (4th ed. 2005) 237 ³¹ Lori Fisler Damrosch et al.: International Law: Cases and Materials 59 5th ed. (2009) 1135 believes that self- defense should be practiced not outside the Charter.³² Under these circumstances lawful ex-ante use of force (as “strict liability” or to a certain degree “effect based” analytical models suggest) would require victim state to sufficiently demonstrate the imminence of an anticipated attack. In the case of cyber attacks, such a requirement would invariably be difficult to meet, if not impossible.\n## Conclusion Telecommunication and information technologies have changed our way of leaving. Cyberspace is both necessity but also vulnerability. Abusing cyberspace state and non state actors commit cyber attacks designed to spread misinformation, weaken state’s competitive advantage through electronic espionage, commit clandestine modification of sensitive data on the battlefield or affect countries’ critical infrastructures. In order to protect themselves against violent destructive and illegal activities some states are prepared to use force in self-defense. These commitments however have raised serious legal questions.\nThe overall debate over the applicability of *Ius ad bellum* principles, standards and norms to cyber-attacks unequivocally showed that it is not quite clear whether or not, states could lawfully use force in self-defense against cyber attack. Although under specific conditions cyber-attacks could amount to armed attack(s), it is very hard to attribute such attacks to a state or non-state actors. Additionally necessity and proportionality along with the ex-ante attitude (i.e. anticipatory self – defense) are highly disputed among the legal scholars. All of these challenges require for one to reconsider legal alternatives that could provide more appropriate solutions to cyber-attacks and cyber-security."
    }
  },
  "citation_summary": {
    "style": "superscript",
    "dominant_bucket": "tex",
    "dominant": {
      "intext_total": 49.0,
      "success_occurrences": 49.0,
      "success_unique": 25.0,
      "bib_unique_total": 31.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 0.8064516129032258,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "superscript"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 49.0,
        "success_occurrences": 49.0,
        "success_unique": 25.0,
        "bib_unique_total": 31.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.8064516129032258,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "superscript"
      },
      "numeric": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 25.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 55.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "Use of force against cyber attacks",
    "subtitle": "Author: Metodi Hadji-Janev",
    "document_type": "unknown",
    "venue": "",
    "publication_year": null,
    "authors": [
      "Republic of Macedonia"
    ],
    "affiliations": [
      "Military Academy “General Mihailo Apostolski”-Skopje,",
      "University “Goce Delcev”-Stip”, Republic of Macedonia"
    ],
    "emails": [],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": ". The rapid development of the technology in an age of intensified globalization has seriously affected international security. Today state and non-state actors can use telecommunication and information technologies in a disruptive way and through cyberspace remotely cause damages to the critical infrastructures that run our everyday live and on which we depend upon. Urged by this complexity some countries have considered military response including the use of force in self-defense. However international legal standards, principles and norms that regulate use of force under international law do not mention use of force against cyber attacks. Therefore it is not quite clear whether or not states can lawfully use force in self-defense against cyber attacks.",
    "keywords": [],
    "publication_dates": {},
    "identifiers": {
      "doi": [],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "http://www.bu.edu/hic/files/2011/07/CyberSecuritySummitReport.pdf",
        "http://chinadigitaltimes.net/2007/08/merkels-china-visit-marred-by-hacking-allegations-spiegel",
        "http://online.wsj.com/article/SB10001424052702304563104576355623135782718.html",
        "http://www.nato-pa.int/default.Asp?SHORTCUT=1782",
        "http://www.brookings.edu/research/articles/2011/08/15-cybersecurity-singer-shachtman"
      ]
    },
    "references_block_count": 1,
    "references_entries_estimated": 25,
    "heading_count": 7,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "no_identifier"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 49,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 0.5510204081632653,
      "footnote_coverage": 1.0,
      "unique_index_count": 25
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "superscript",
      "recommended_style": "superscript",
      "aligned": true,
      "signals": {
        "superscript_hits": 50,
        "superscript_definition_lines": 25,
        "numeric_bracket_hits": 0,
        "numeric_endnote_lines": 3,
        "author_year_hits": 0
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 31.0,
      "dominant_bib_coverage_rate": 0.8064516129032258,
      "dominant_link_target": "footnotes",
      "dominant_unresolved_flag": "unresolved_footnote_links"
    },
    "heading_validation": {
      "heading_count": 7,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 3,
      "has_reference_heading": true,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": true,
        "emails": false,
        "orcids": false,
        "abstract": true,
        "keywords": false,
        "venue": false,
        "persistent_identifier": false,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 1,
        "affiliations": 2,
        "emails": 0,
        "orcids": 0,
        "keywords": 0,
        "doi": 0,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 5
      },
      "coverage": {
        "core_coverage": 0.8333333333333334,
        "email_author_link_rate": 0.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "no_identifier"
        ],
        "toc_dot_lines": 0
      },
      "flags": [
        "meta_missing_persistent_identifier"
      ]
    },
    "flags": [
      "missing_preceding_text",
      "heading_numbering_parent_violation",
      "meta_missing_persistent_identifier"
    ]
  },
  "updated_at_utc": "2026-02-14T08:28:29.872631+00:00"
}