{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\R55RNBDG\\RCWTG8Q4.pdf",
  "custom_id": "404",
  "response": {
    "id": "batch-b6235e9e-405-e883ed57-46e4-4c61-8c4a-c7a6091131b8",
    "custom_id": "404",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "91\n\n# Modelling Attribution\n\nClement Guitton\nWar Studies, King's College London, UK\nclement.guitton@kcl.ac.uk\n\nAbstract: This article posits that attribution is better approached as a process than as a problem. Departing from models for attribution emphasising its technical constraints, the article distinguishes between two distinct attribution processes operating in two different contexts and answering two different questions. On one hand, in a criminal context, the attribution process seeks to identify individuals who launched cyber attacks. On the other hand, in a national security context, the process seeks to identify adversaries which may have sponsored cyber attacks. Five elements can serve as determinants to distinguish between the two processes: the type of target, the severity and scale of the damage, the apparent origin of the instigator of the attack, the means of the attack, and lastly the claims by political groups. After reviewing these elements, the article analyses how the constraints and characteristics of the two different attribution processes vary in terms of responsible authority, standard of evidence, stake in play and relevance of timing for attribution. In a criminal context, the collection of digital evidence is of primary importance to be able to reach a high level of judicial proof. However, in a national security context, investigators will likely not have access to evidence but only to intelligence, and the decision of attribution will not be taken within the judiciary but within the executive (e.g. a government). As such, attribution of national security incidents requires a form of political judgement to heed the political context and circumstances of the incidents that courts do not need to consider when examining the guilt of criminals. Political judgement is also required to balance the consequences of attribution on a political level, potentially resulting in a straining of relations with other international actors. As the constraints between the two different attribution processes differ, their requirements for easing the constraints also vary.\n\nKeywords: attribution, sponsorship, cyber attacks, national security threats\n\n# 1. Introduction\n\nIn August 2012, a malware called Shamoon infected the computers of Saudi Arabia's national oil company Aramco, and wiped out the hard drives of 30,000 computers. The attack prompted US Secretary of Defense Leon Panetta to mention the attack in a widely quoted speech in front of business executives (Panetta, 2012) and to answer further questions in a briefing at the Pentagon (Panetta and Dempsey, 2012). While Panetta fell short in his speech of accusing Iran for the attacks, a journalist, quoting an unnamed US government official mentioned that Iranian hackers carried out the attack with the support from the Iranian government (The Associated Press, 2012). Officially, the attack remains unattributed to this day. In contrast, many other malware have in the past infected many computers without prompting high political officials to react about the identity of the instigators. For instance, in 2004, the Sasser worm infected millions of computers including those of rail systems in New South Wales, the Italian Interior Ministry, the European Commission and British coastguard stations (Jesdanun, 2004) without stirring such a response. The police later found its author, Sven Jaschan, thanks to an information reward program set up by Microsoft (Lemos, 2005).\n\nHow and why does the attribution of an incident become politicised? Does attribution require the involvement of political figures? How do the processes of attributing a criminal incident and attributing an incident of national security relevance differ?\n\nAs attribution informs states' responses to cyber attacks, finding answers to these questions is essential. But there is currently no overall model for attribution that can answer these questions and explain how attribution occurs by taking into account the disparities between the responsible authorities, the standards of evidence, the stakes in play and the relevance of timing for attribution of cases either similar to the Aramco incident or to the Sasser worm. This article proposes such a model for attribution based on the nature of the attribution process either as apolitical or political. Apolitical cases are cases of purely criminal nature that do not rise to the level of 'national threat'. When an incident crosses the 'national threat' threshold, the question of knowing the identity of the attackers becomes less relevant than knowing who the enemy is, for instance a state actor or a terrorist organisation. The process of reaching conclusions on the identity of the instigator or on the",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 1,
            "markdown": "Clement Guitton\n\nsponsorship of an attack differs in great regards. Assessing enmity is a matter of political judgement, and not for a domestic court to decide. Evidence to support the judgement for enmity hence does not have to reach the level of judicial proof that the conviction of a criminal requires. Distinguishing between the two processes allow the discernment of solutions to the attribution problem that is inherently political in some instances, and not technical as often characterised.\n\nThis article presents the model, namely the two attribution processes, in two steps. Firstly, it shows the criteria that lead to the politicisation of incidents. Secondly, it delves into the different characteristics of these two distinct processes.\n\n## 2. Politicised attribution: A set of conditions for the model\n\nThree main models have previously emerged to characterise attribution, one having its root in computer science, a second one in political science, and a third one in both fields. Firstly, the cyber security expert Tom Parker suggested assigning values to three variables to characterise the attacker: the attacker's intrinsic characteristics (e.g. resources, motivation), the target, and the general environment of the attack (Parker et al., 2004). Within this model, analysts compute values using Bayesian probabilities obliging them to assess the certainty of assumptions and known information. But this model suffers two pitfalls: many variables do not lend themselves to being ascribed numerical values; and Parker's attempt to draw the line between criminal and terrorist cyber attacks based on the unknown motivation of the attacker is unrealistic. The motivation of an attacker usually follows at least partial attribution, and does not precede it.\n\nSecondly, the lawyer Susanne W. Brenner proposed a model for attribution as a political decision based on the trichotomy war – terrorism – crime, a trichotomy whose relevance she acknowledged is eroding in cyberspace (Brenner, 2009: 96). Brenner suggested starting with attempting to classify the incident within this trichotomy also based on three variables: the origin, the target, and the motive for the attack (Brenner, 2009: 87). Yet, determining if an incident is an act of war, hence originating from a state actor, requires solving attribution first, a problem Brenner also acknowledged. Brenner's solution to the eroding relevance of the trichotomy focused on the dilemma the erosion poses on an institutional level between military and civilian entities involved in responding to the threat rather than on the core problem it poses for attribution (Brenner, 2013). Such a solution did not address the main flaw in her model for attribution, namely that knowing the sponsorship of an attack cannot be at the same time the sought solution of the problem, and the variable on which the problem depends.\n\nLastly, the computer scientists David Clark, Susan Landau and Earl Boebert have separated the attribution problem into two sub-problems: one technical and consisting in identifying the attacking machine, and one human consisting in identifying the machine's owners and potentially their sponsor (Clark and Landau, 2010: 37; Boebert, 2010: 43). The computer scientists delved into technical procedures to attribute a machine and left aside the details of the identification of individuals and sponsors. While much research has been carried out to improve tracing back attacks (Wheeler et al., 2003; Clayton, 2005), many researchers have also acknowledged that technical considerations alone cannot be sufficient to solve the attribution problem (Hunker et al., 2008: 10; Clark and Landau, 2010: 39). It is hence important to continue expending the model for attribution of cyber attacks without focusing on its technological aspects. The focus away from technology is further justified as political considerations dwarf technical ones when the incident meets certain criteria constraining the access to evidence.\n\nTo remedy the shortcomings of each of the three existing models, attribution can be approached as two distinct processes: on one hand, as an apolitical process following well-established criminal procedures; and on the other hand, as an act requiring a political decision, such as classifying an incident as an act of war or terrorism. Considering attribution as a process and not as a problem allows the identification of steps where different questions arise with different saliency within the process. For instance, only when attribution is politicised does the question of the different degrees of involvement of a state arise (Healey, 2012), as well as strategic questions about instrumental use of cyber attacks as covert means to achieve foreign policy objectives (Libicki, 2012).\n\nThe determinants indicating which process an incident fall within need to be assessable from the outset of the investigation and cannot rely on the formulation of early assumptions, as Parker's and Brenner's model\n\n92",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 2,
            "markdown": "Clement Guitton\n\nrequired for determining the motive of the attack. Five determinants influence the attribution of an incident as becoming the resort of politics rather than of the criminal justice system.\n\n## 2.1 The target\n\nThe profile of the attack rises in function of the target according to two different elements: firstly, the political nature of the target, and secondly, the threat to national security that the target can constitute. Attackers can focus on these two types of targets in an instrumental way to try to weaken a state and achieve a political objective.\n\nTargets creating a threat to national security are attacks either on critical national infrastructures (e.g. Stuxnet), or on companies losing their intellectual property on a great scale. The loss of intellectual property impacts companies' productivity and, in turn, harms the national economies of countries hosting them. In the UK, tackling the threat to the economy is the very first objective of its national cyber security strategy, aiming at placing the UK as 'one of the most secure places in the world to do business in cyberspace' (Cabinet Office, 2011: 8). The theft of intellectual property via cyber attacks is therefore a topic taken seriously as a threat to national security, and is as such, approached by high-ranking officials.\n\nNot all attacks on companies that correspond to corporate espionage will fall within the national security threat category. Rogue corporations, even within the same country, can attack each other to gain economic advantages. Solely considering a company victim of espionage may therefore not be sufficient to raise the political profile of the attack. But the systematic loss of intellectual property from a range of companies is sufficient to constitute an economic threat for the victim country.\n\n## 2.2 The severity and scale of the damage\n\nOne of the reasons the targeting of critical infrastructure moves attribution to the higher end of the political spectrum is because of the high severity of damage an attack can potentially cause. The assessment of the severity of an attack is not always evident. In espionage cases, the severity is dependent upon the information accessed by the hackers. But in most cases it is difficult to know which information the attacker accessed, and what the attacker will do with this information. Based on the information that a victim company provides to law enforcement agencies, state officials can attempt to gauge the severity of an attack and assess if it crosses the threshold of threat to national security. In the case of an attack on a ministry or on a private defence contractor for instance, the sensibility of the information potentially accessed automatically scales up the potential threat it poses. State officials do not particularly need to feel confident that a state actor is behind the attack to become involved in the attribution process. The mere potentiality that the damage can be important is sufficient to reflect a deviation from the criminal attribution process.\n\n## 2.3 The apparent origin of the instigator\n\nState officials are often cognisant that the IP address showing the origin of an attack from a particular state can be deceptive. Hackers can easily falsify the address, and use it for instance to pit one state against another, or to use underlying existing strained relations to spark an escalation of tensions. The apparent origin of the instigator can justify the implication of state officials for at least two reasons. Firstly, officials from the victim state may need to intervene to coerce the seemingly state of origin into providing more information about the attackers. Secondly, the apparent origin of the attack may be from a country that the victim state regards as an adversary. Each state has at least a vague idea of who their enemies are, or who they regard as a threat. The instability of the political situation with the enemy state can lead even a small incident with low damage to an escalation of tensions. Again, the involvement of political actors will be necessary to make a trade-off in order to decide if pursuing the investigation is possible and worth taking the risk of a political setback in case of refusal for cooperation.\n\n## 2.4 The means of the attack\n\nInstigators of cyber attacks have a wide variety of tools at their disposal to commit cyber attacks. Attackers can discover a new vulnerability in a system and exploit it. While finding new vulnerabilities is difficult and time-consuming, it also indicates a level of technical sophistication to which analysts of cyber attacks have not remained insensitive. Stuxnet, the worm that destroyed Iranian centrifuges in Natanz in 2010, utilised in its",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 3,
            "markdown": "Clement Guitton\n\nlatest version four of these vulnerabilities. When the cyber security company Kaspersky started examining Stuxnet, it very quickly declared that 'Stuxnet's sophistication, purpose and the intelligence behind it suggest the involvement of a state' (Halliday, 2010). Currently, only certain states and few criminal groups if any possess the means to carry out very sophisticated attacks alike to Stuxnet. Considering the means of attacks, according to analysts' reasoning, allows the group of potential suspects to be narrowed down, and may even indicate state sponsorship. Although it is disputable if sophistication is really of any help to achieve attribution as many different actors can have the skill and resources to engineer 'sophisticated' attacks, it is incontestable that associated with the type of victim organisation it raises the profile of the attack.\n\n## 2.5 Claims by a political group\n\nAny cyber attacks claimed to have been carried out for a political reason, and substantiated by enough evidence, will have to be assessed within its political context. The claim may be unfunded, unrealistic, and an entity other than the claimant may truly be behind the attack. But they will necessitate a certain assessment involving political judgement, and not solely the analysis of technical and forensic evidence. Yet, within a purely criminal context, the police and cyber security firms will lack this political judgement and the authority to wield it. The mere claim by a political group may not be completely sufficient for it to be credible. The level of confidence in the credibility of the claim plays a role in considering the attack still within the realm of criminal justice or as a threat to national security.\n\n## 3. Descriptions of the attribution processes\n\nWhat is so different between the attribution process of criminal act and the attribution process of threat to national security? Firstly, it is necessary to recognise that the two processes have different goals. While the attribution process of criminal apolitical cases seek to unravel the identity of the individuals launching the cyber attack, the attribution process of cases threatening national security focuses on discovering the sponsorship of an attack. The underlying processes to reach these two different goals are fundamentally different.\n\n## 3.1 The criminal context\n\nBoth attribution processes start with the discovery of a breach of an information system and its subsequent classification as an attack (i.e. as malicious and intentional). Following the discovery of the attack, and if none of the five aforementioned criteria apply, the case will follow the path of a criminal investigation, a well-understood process dependent on the country's good functioning of its judicial system. The next steps are then as follows: investigators from cyber security companies or from law enforcement agencies attempt to gain information to find the attacker; investigators find evidence by seizing incriminating material on the person's computer; and lastly, a court validates the inferences made from the collected evidence proving that the person was indeed the criminal using the computer from which the cyber attack was launched. In this regard, the way digital forensics are collected need to respect high standards to show that the police did not tamper with them, and that the defendant's actions, and not only his machine, caused the alleged attack 'beyond reasonable doubt'.\n\nThe access to evidence is predicated on first finding information about the identity of the individual. Finding information can broadly occur from three different ways: from discovering forensics left behind the attack, from information tracing back the attack to its origin (e.g. an IP address, the place where a malware first appeared), or from informants. This information does not usually prove 'beyond reasonable doubt' the individual's involvement in the attack, but evidence seized on his computer can. Two complications in the acquisition of information and evidence often arise, as many cases are spread across several jurisdictions. Firstly, the victim country's law enforcement agencies will require cooperation from the state hosting the Internet service provider which assigned the attacker's IP address. The state where the attack originated will have to request the service provider to give the match between the IP address and a name, before relaying this information to the victim country. Both steps are strongly contingent upon the state of affairs between the two countries and the tools at the disposal of the victim state to incentivise or coerce the other state into cooperating. Secondly, gathering evidence, which requires physical access to the accused's computers, can also be sensitive. Law enforcement in the originating country may be willing to seize evidence based on the information provided by their foreign counterpart, but in function of their decision to prosecute the attacker in their country or not, they may be unwilling to share the collected evidence. In case they refuse to extradite the\n\n94",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 4,
            "markdown": "Clement Guitton\n\nattacker, the country in which the attacker was located will still rely upon the victim country to exchange information about the attack it suffered in order to successfully convict the accused. These legally time-consuming and twisted procedures are mostly formalised within mutual legal assistance treaties. However, the lack of an existing treaty covering cyber attacks does not have to thwart the attribution process, as much as the existence of a treaty between two countries does not ensure its applicability. Politics often trump the law, even for the attribution process in a criminal context where cooperation to exchange information or to extradite attackers is mainly dependent on political will.\n\nLastly, the conviction of the attacker by a court represents the highest level of attribution possible in a criminal context. But even if the court does not convict the attacker, it can remain clear that he is the one to whom the cyber attacks are attributable. The lack of legal framework criminalising cyber attacks or the high cost of the trial involving flying witnesses over from another country have in the past prevented conviction despite the accused admitting to the charges. A conviction by a court, while preferable, is hence not an absolute necessity.\n\n## 3.2 The national security context\n\nWithin the national security context, the access to evidence is much more difficult. The four-step process for attribution of criminal cases (discovery of the attack, finding information, finding evidence, and conviction) becomes the following four-step process: discovery of the attack, finding information, formulating an assessment, and publicly acting upon the assessment. The first two steps are similar to the attribution process in a criminal context.\n\nThe entities formulating the assessment of attribution in cases of national security are more various than in criminal cases where only the court has the monopoly of doing so, but formal attribution still only occurs via a single formal channel, a representative of the government. The assessment by state institutions and the decision to attribute are the only forms of 'binding' attribution that will bear consequences, as the state is the only institution with the authority to take a decision of attribution accepted and recognised by whom they affect. Placing the onus on governmental institutions rather than on judicial entities for attribution has several implications. The methodology changes from the mere assessment of digital forensics to using political judgement; the standard of evidence becomes lower and proving 'beyond reasonable doubt' is not required anymore; the stakes in play are by nature political; and the timing for attribution, while important when the judiciary would pronounce a verdict, is far more crucial when it is a form of political act carried out by a political entity.\n\nAccepting political judgement as a methodology for attribution (Lin, 2012: 350) also implies accepting that attribution in some cases fall between beliefs and reasons (Arendt, 1992: 4), is prone to expectation biases, and operates in an environment mainly defined by an acute lack of certain information (6, 2011: 21). The difficulty of accessing evidence and the dependence on intelligence rather than evidence for attribution in this context confirms the appropriateness of resorting to this methodology. Good judgement will however rest upon the analysts being able to show the thought process as being as removed from feelings and preconceived ideas as possible, and following strict methodologies to ensure it (Heuer, 1999).\n\nIn this light, the most appropriate organisation to formulate judgements will be intelligence services. Intelligence services bring together both the political and technical expertise required for attribution. Analysts from private companies specialising in cyber security, such as Kaspersky and Symantec, can also mention potential authors for the attacks when they report new attack vectors. But while these companies are at the forefront of technical developments in cyber security, they certainly lack the experience of heeding political elements to ascertain the origin of attacks. On the other hand, investigative journalists have the experience of taking into account in their analysis political elements, but not technical ones. Furthermore, as they use non-technical investigation techniques, they also bring other pieces of information relevant to the assessment of sponsorship of attacks. For instance, the sponsors of Stuxnet, namely the US and Israel, only emerged when unnamed US officials with knowledge of the operation leaked information to David Sanger, a journalist at The New York Times (Sanger, 2012).\n\nJournalists very often protect their sources and it is not possible to independently verify their sources' credibility. The lack of verifiability of the information, either collected by investigative journalists or its analysis by state officials, is a defining constraint for incidents falling within the attribution process of national security\n\n95",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 5,
            "markdown": "Clement Guitton\n\nincidents. Relevant information feeding into political judgement, apart from being non-testable in contrast to evidence presented in front of a court, is also mainly non-technical. Technical evidence is indeed not best suited to inform on sponsorship, which is what attribution is set to achieve in this context. Instead of using technical forensics, human intelligence gained from informants and whistle-blowers is more appropriate. This means that investigators of incidents of national threats are more interested in intelligence than in digital forensic evidence, when the opposite is true for the attribution of criminal cases.\n\nIntelligence services are also well acquainted with the task of estimating their adversary's strength and capabilities to launch attacks, which a priori could help narrow down the number of potential attackers if one assumes that sophistication can inform on state-sponsorship – a contestable thesis regarding that criminals can also engineer sophisticated attacks. The 'strength' variable can however be difficult to estimate for cyber attacks, especially in comparison with estimating the military strength of a country. It is much easier to subcontract cyber attacks and buy zero day exploits in a hacker underground market than it is to buy military grade weapons. Furthermore, hiring a single very talented hacker can be sufficient to engineer malware with far ranging effects. It is hence difficult to assess with high certainty any groups' capability to launch cyber attacks. Such a difficulty hinders the work of intelligence services to neatly differentiate between potential enemies with capabilities and those with only low resources to launch cyber attacks. Further blurring the picture, it is strategically advantageous for actors to hide their offensive capabilities as much as possible. Such a conclusion can appear at first counter intuitive considering that on the other hand displaying one's capabilities can act as a deterrent measure against an adversary. However, if the adversary knows that the likeliness for a threat of retaliation is low due to the uncertainty of attribution, deterrence is unlikely to function. Keeping possibilities of using covert cyber attacks as a tool for foreign policy hence becomes a reasonable strategic decision.\n\nBut once intelligence services attribute an attack, and as the intelligence services are by design an opaque structure, the decision of making the attribution public is somewhat a completely different decision. This decision differs from the judgement pronounced by a court in two regards. Firstly, the decision, by the nature of the parties potentially involved as state actors or as terrorist organisations, becomes a political decision for a state official to take. The decision to make attribution public also requires political judgement to balance the risks of misattribution, certainty, timing, and potential benefits of attributing the attack. The decision is likely to be taken by senior and high elected officials only. As Francis Maude, British Minister for Cabinet Office, pointed out in a hearing in the House of Commons (2012), 'if something looked like it could be a sovereign attack', the judgement of deciding sponsorship 'would clearly be for the Prime Minister' to make. Secondly, a legal judgement aims at instating justice, while a political judgement has wider possible ramifications. Following an assessment of the potential instigators of an attack, state officials can refuse to publicly name an attacker as a state with which they have strategic partnerships in order to preserve economic ties with the country. Such a decision will have followed the different steps of the attribution process, and stopped at the third one. Refusing to publicly name the attacker would be morally wrong, as the victim state would fail in its duty of owing transparency and the truth to its citizens. But it could also be a politically shrewd decision. As the level of damage caused by cyber attacks increases, the political argument will increasingly trump the moral one, leading to more frequent formal attribution.\n\n# 4. Conclusion\n\nThe new proposed model for attribution challenges three previously accepted arguments. Firstly, it challenges that attribution is a problem and posits that it is better described as a process. Secondly, it challenges that attribution is mainly a technical issue. Lastly, it challenges that identifying a criminal and identifying the sponsor of an attack follow similar characteristics. Brought under the common umbrella term of 'attribution problem', many officials and researchers have as such advocated the same solutions for what appears in fact as two distinct attribution processes. The process within which a case falls determines the responsible authority (judiciary vs. executive), the methodology (digital forensics vs. political judgement), the standard of evidence ('beyond reasonable doubt' vs. dependent upon judgement), the stake in play (individual vs. political), and finally, the timing (irrelevant vs. critical) that will apply for attribution. The separation of attribution into two processes leads to the conclusion that they face different constraints with different requirements to relax these constraints.\n\n96",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 6,
            "markdown": "Clement Guitton\n\n# References\n\n(2012) Defence and Cyber Security. House of Commons. London: Parliament.\n6 P. (2011) Explaining Political Judgement, Cambridge: Cambridge University Press.\nArendt H. (1992) Postscritum to Thinking. Hannah Arendt Lectures on Kant's Political Philosophy. Chicago: The University of Chicago Press.\nBoebert WE. (2010) A Survey of Challenges in Attribution. Workshop on Deterring Cyber Attacks: Informing Strategies and Developing Options for U.S. Policy. Washington DC: The National Academies Press.\nBrenner SW. (2009) Cyber Threats: The Emerging Fault Lines of the Nation State, Oxford: Oxford Scholarship Online.\nBrenner SW. (2013) Cyber-threats and the Limits of Bureaucratic Control. Minnesota Journal of Law, Science, and Technology 14.\nCabinet Office. (2011) The UK Cyber Security Strategy - Protecting and promoting the UK in a digital world. London: Cabinet Office.\nClark DD and Landau S. (2010) Untangling Attribution. Workshop on Deterring CyberAttacks: Informing Strategies and Developing Options for U.S. Policy. Washington, DC: The National Academy Press, 25-40.\nClayton R. (2005) Anonymity and traceability in cyberspace. Computer Laboratory. Cambridge: University of Cambridge, 189.\nHalliday J. (2010) Stuxnet worm is the 'work of a national government agency'. The Guardian, 24 September.\nHealey J. (2012) Beyond Attribution: Seeking National Responsibility for Cyber Attacks. Washington, DC: Atlantic Council, 1-7.\nHeuer RJ. (1999) Psychology of Intelligence Analysis, Washington, D.C.: Centre for the Study of Intelligence.\nHunker J, Hutchinson B and Margulies J. (2008) Role and Challenges for Sufficient Cyber-Attack Attribution. Institute for Information Infrastructure Protection. Hanover, New Hampshire: Dartmouth College.\nJesdanun A. (2004) New virus snarls hundreds of thousands of machines worldwide. The Associated Press, 3 May.\nLemos R. (2005) Microsoft to reward informants after Sasser conviction. SecurityFocus, 8 July.\nLibicki M. (2012) The Specter of Non-Obvious Warfare. Strategic Studies Quarterly Fall: 88-101.\nLin H. (2012) Thoughts on Threat Assessment in Cyberspace. I/S: A Journal of Law and Policy for the Information Society 8: 337-355.\nPanetta L. (2012) Text of Speech by Secretary of Defense Leon Panetta. Business Executives for National Security, 11 October.\nPanetta L and Dempsey M. (2012) News Briefing. Department of Defense, 25 October.\nParker T, Devost MG, Sach MH, et al. (2004) Cyber Adversary Characterisation, Rockland: Syngress Publishing.\nSanger DE. (2012) Obama Order Sped Up Wave of Cyberattacks Against Iran. The New York Times, 1 June.\nThe Associated Press. (2012) Official: US blames Iran hackers for cyberattacks. The Washington Post, 11 October.\nWheeler DA, Larsen GN and Leader T. (2003) Techniques for Cyber Attack Attribution. Alexandria, Virginia: Institute for Defense Analyses.\n\n97",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1653
            }
          },
          {
            "index": 7,
            "markdown": "versity, Taiwan in 1997, and both a M.Sc. degree and a Ph.D. (Computer Science and Engineering) from National Sun Yat-sen University, Taiwan in 1999 and 2010, respectively. His research interests include Internet security, wireless network, home network system, IoT, and learning cloud services.\n\nEric Filiol is the head of the Operational Cryptology and Virology at ESIEA. He has spent 21 years in the French Army. He holds an Engineer diploma in Cryptology, a PhD and a Habilitation Thesis in applied mathematics and computer science. He is also the Scientific Director of EICAR and the Editor-in-chief of the Journal in Computer Virology.\n\nJason Flood, MSc is currently an Ethical Hacking Architect at IBM in Dublin. He is also a PhD student at the Institute of Technology Blanchardstown where he investigates better ways of training Network Administrators. Jason is the co-founder Irish Chapter of the Honeynet Project and works with OWASP and Facebook in running CTF competitions.\n\nGrigorios Fragkos, BSc, MSc, PhD, Certified TigerScheme, AST and QSTM. He has a number of publications in Computer Security and Computer Forensics. He has been part of the CyberDefense dept. of the Hellenic Army acting as Information Security consultant and Penetration tester. Currently, works for Sysnet Global Solutions as Sr. Consultant and Penetration tester.\n\nWendy Goucher is about to enter the final phase of her PhD research. She is a part time student at University of Glasgow and is also an information security consultant with Idrach Ltd. where she specialises in assisting in the design and communication of operationally effective security policy.\n\nDijana Grd comes from Croatia. She is a second year student of graduate study programme Information and Software Engineering at Faculty of Organization and Informatics in Varazdin. Her studies have provided her an insight into area of identification, collection, processing, analysis and production of electronically stored information. She has some work experience as a student assistant in Informatics and as a project manager in student organization AIESEC. She enjoys participating in all kind of international conferences and projects. She also likes to travel and meet new people.\n\nClement Guitton is a PhD candidate in War Studies at King's College London focusing on cyber security. He holds a master degree both in international relations and in electrical engineering. Fluent in English, French, and German, he previously worked at the International Telecommunication Union, the United Nation agency specialised on information and communication technologies.\n\nHåkan Gunneriusson has a PhD in History 2002, Uppsala University. Hakan is interested in sociological and historical perspectives on current and coming issues regarding military tactical and cultural issues. Hakan is currently head of research ground operative and tactical areas, Swedish National Defence College.\n\nSamuli Haataja is a PhD candidate in the Griffith Law School at Griffith University on the Gold Coast, Australia. He holds a Bachelor of Laws (Hons) and Bachelor of International Relations from Griffith University. His research focuses on cyber attacks and international law – specifically on the relationship of technology, violence and law in this context.\n\nMikko Hakuli is currently employed as security specialist at JyvSecTec-project in Jyväskylä University of Applied Sciences (JAMK), where his main responsible are technical security testing and development of various situational awareness \"best practices\" in cyber-security area. Formerly he worked as Head of information security on Finnish Airforces. Currently he also make studies in University of Jyväskylä and Jyväskylä University of Applied Sciences.\n\nJuhani Hämäläinen received his PhD degree in theoretical physics from the University of Jyväskylä in 2004. He is currently in the position of principal scientist at Finnish Defense Forces Technical Research Centre (PVTT). His research interests include mathematical model development and operational analysis.\n\nMajor Arto Hirvelä is an instructor (leadership) in a research group at the Finnish National Defence University. He is preparing a doctoral dissertation in Military Science (leadership). His research interests are information environment, strategic communication, and information operations.\n\nIlona Ilvonen is a doctoral student at Tampere University of Technology, department of Information Management and Logistics. Her doctoral thesis topic is the management of knowledge security, and the thesis is due in 2013. She has published conference papers on information security management, knowledge management and relating topics since the year 2003.\n\nMargarita Jaitner is a research intern at the Finnish National Defence University. She received a Bachelor's degree in Political Science at the Swedish Defence College and is currently pursuing a Master's degree in Societal Risk Management at the Karlstad University in Sweden.\n\nx",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 8,
            "markdown": "Reproduced with permission of the copyright owner. Further reproduction prohibited without permission.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2200,
              "width": 1700
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 9,
          "doc_size_bytes": 850924
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "91\n# Modelling Attribution\nClement Guitton\nWar Studies, King's College London, UK\nclement.guitton@kcl.ac.uk\nAbstract: This article posits that attribution is better approached as a process than as a problem. Departing from models for attribution emphasising its technical constraints, the article distinguishes between two distinct attribution processes operating in two different contexts and answering two different questions. On one hand, in a criminal context, the attribution process seeks to identify individuals who launched cyber attacks. On the other hand, in a national security context, the process seeks to identify adversaries which may have sponsored cyber attacks. Five elements can serve as determinants to distinguish between the two processes: the type of target, the severity and scale of the damage, the apparent origin of the instigator of the attack, the means of the attack, and lastly the claims by political groups. After reviewing these elements, the article analyses how the constraints and characteristics of the two different attribution processes vary in terms of responsible authority, standard of evidence, stake in play and relevance of timing for attribution. In a criminal context, the collection of digital evidence is of primary importance to be able to reach a high level of judicial proof. However, in a national security context, investigators will likely not have access to evidence but only to intelligence, and the decision of attribution will not be taken within the judiciary but within the executive (e.g. a government). As such, attribution of national security incidents requires a form of political judgement to heed the political context and circumstances of the incidents that courts do not need to consider when examining the guilt of criminals. Political judgement is also required to balance the consequences of attribution on a political level, potentially resulting in a straining of relations with other international actors. As the constraints between the two different attribution processes differ, their requirements for easing the constraints also vary.\nKeywords: attribution, sponsorship, cyber attacks, national security threats\n# 1. Introduction\nIn August 2012, a malware called Shamoon infected the computers of Saudi Arabia's national oil company Aramco, and wiped out the hard drives of 30,000 computers. The attack prompted US Secretary of Defense Leon Panetta to mention the attack in a widely quoted speech in front of business executives (Panetta, 2012) and to answer further questions in a briefing at the Pentagon (Panetta and Dempsey, 2012). While Panetta fell short in his speech of accusing Iran for the attacks, a journalist, quoting an unnamed US government official mentioned that Iranian hackers carried out the attack with the support from the Iranian government (The Associated Press, 2012). Officially, the attack remains unattributed to this day. In contrast, many other malware have in the past infected many computers without prompting high political officials to react about the identity of the instigators. For instance, in 2004, the Sasser worm infected millions of computers including those of rail systems in New South Wales, the Italian Interior Ministry, the European Commission and British coastguard stations (Jesdanun, 2004) without stirring such a response. The police later found its author, Sven Jaschan, thanks to an information reward program set up by Microsoft (Lemos, 2005).\nHow and why does the attribution of an incident become politicised? Does attribution require the involvement of political figures? How do the processes of attributing a criminal incident and attributing an incident of national security relevance differ?\nAs attribution informs states' responses to cyber attacks, finding answers to these questions is essential. But there is currently no overall model for attribution that can answer these questions and explain how attribution occurs by taking into account the disparities between the responsible authorities, the standards of evidence, the stakes in play and the relevance of timing for attribution of cases either similar to the Aramco incident or to the Sasser worm. This article proposes such a model for attribution based on the nature of the attribution process either as apolitical or political. Apolitical cases are cases of purely criminal nature that do not rise to the level of 'national threat'. When an incident crosses the 'national threat' threshold, the question of knowing the identity of the attackers becomes less relevant than knowing who the enemy is, for instance a state actor or a terrorist organisation. The process of reaching conclusions on the identity of the instigator or on the\nClement Guitton\nsponsorship of an attack differs in great regards. Assessing enmity is a matter of political judgement, and not for a domestic court to decide. Evidence to support the judgement for enmity hence does not have to reach the level of judicial proof that the conviction of a criminal requires. Distinguishing between the two processes allow the discernment of solutions to the attribution problem that is inherently political in some instances, and not technical as often characterised.\nThis article presents the model, namely the two attribution processes, in two steps. Firstly, it shows the criteria that lead to the politicisation of incidents. Secondly, it delves into the different characteristics of these two distinct processes.\n## 2. Politicised attribution: A set of conditions for the model\nThree main models have previously emerged to characterise attribution, one having its root in computer science, a second one in political science, and a third one in both fields. Firstly, the cyber security expert Tom Parker suggested assigning values to three variables to characterise the attacker: the attacker's intrinsic characteristics (e.g. resources, motivation), the target, and the general environment of the attack (Parker et al., 2004). Within this model, analysts compute values using Bayesian probabilities obliging them to assess the certainty of assumptions and known information. But this model suffers two pitfalls: many variables do not lend themselves to being ascribed numerical values; and Parker's attempt to draw the line between criminal and terrorist cyber attacks based on the unknown motivation of the attacker is unrealistic. The motivation of an attacker usually follows at least partial attribution, and does not precede it.\nSecondly, the lawyer Susanne W. Brenner proposed a model for attribution as a political decision based on the trichotomy war – terrorism – crime, a trichotomy whose relevance she acknowledged is eroding in cyberspace (Brenner, 2009: 96). Brenner suggested starting with attempting to classify the incident within this trichotomy also based on three variables: the origin, the target, and the motive for the attack (Brenner, 2009: 87). Yet, determining if an incident is an act of war, hence originating from a state actor, requires solving attribution first, a problem Brenner also acknowledged. Brenner's solution to the eroding relevance of the trichotomy focused on the dilemma the erosion poses on an institutional level between military and civilian entities involved in responding to the threat rather than on the core problem it poses for attribution (Brenner, 2013). Such a solution did not address the main flaw in her model for attribution, namely that knowing the sponsorship of an attack cannot be at the same time the sought solution of the problem, and the variable on which the problem depends.\nLastly, the computer scientists David Clark, Susan Landau and Earl Boebert have separated the attribution problem into two sub-problems: one technical and consisting in identifying the attacking machine, and one human consisting in identifying the machine's owners and potentially their sponsor (Clark and Landau, 2010: 37; Boebert, 2010: 43). The computer scientists delved into technical procedures to attribute a machine and left aside the details of the identification of individuals and sponsors. While much research has been carried out to improve tracing back attacks (Wheeler et al., 2003; Clayton, 2005), many researchers have also acknowledged that technical considerations alone cannot be sufficient to solve the attribution problem (Hunker et al., 2008: 10; Clark and Landau, 2010: 39). It is hence important to continue expending the model for attribution of cyber attacks without focusing on its technological aspects. The focus away from technology is further justified as political considerations dwarf technical ones when the incident meets certain criteria constraining the access to evidence.\nTo remedy the shortcomings of each of the three existing models, attribution can be approached as two distinct processes: on one hand, as an apolitical process following well-established criminal procedures; and on the other hand, as an act requiring a political decision, such as classifying an incident as an act of war or terrorism. Considering attribution as a process and not as a problem allows the identification of steps where different questions arise with different saliency within the process. For instance, only when attribution is politicised does the question of the different degrees of involvement of a state arise (Healey, 2012), as well as strategic questions about instrumental use of cyber attacks as covert means to achieve foreign policy objectives (Libicki, 2012).\nThe determinants indicating which process an incident fall within need to be assessable from the outset of the investigation and cannot rely on the formulation of early assumptions, as Parker's and Brenner's model\n92\nClement Guitton\nrequired for determining the motive of the attack. Five determinants influence the attribution of an incident as becoming the resort of politics rather than of the criminal justice system.\n## 2.1 The target\nThe profile of the attack rises in function of the target according to two different elements: firstly, the political nature of the target, and secondly, the threat to national security that the target can constitute. Attackers can focus on these two types of targets in an instrumental way to try to weaken a state and achieve a political objective.\nTargets creating a threat to national security are attacks either on critical national infrastructures (e.g. Stuxnet), or on companies losing their intellectual property on a great scale. The loss of intellectual property impacts companies' productivity and, in turn, harms the national economies of countries hosting them. In the UK, tackling the threat to the economy is the very first objective of its national cyber security strategy, aiming at placing the UK as 'one of the most secure places in the world to do business in cyberspace' (Cabinet Office, 2011: 8). The theft of intellectual property via cyber attacks is therefore a topic taken seriously as a threat to national security, and is as such, approached by high-ranking officials.\nNot all attacks on companies that correspond to corporate espionage will fall within the national security threat category. Rogue corporations, even within the same country, can attack each other to gain economic advantages. Solely considering a company victim of espionage may therefore not be sufficient to raise the political profile of the attack. But the systematic loss of intellectual property from a range of companies is sufficient to constitute an economic threat for the victim country.\n## 2.2 The severity and scale of the damage\nOne of the reasons the targeting of critical infrastructure moves attribution to the higher end of the political spectrum is because of the high severity of damage an attack can potentially cause. The assessment of the severity of an attack is not always evident. In espionage cases, the severity is dependent upon the information accessed by the hackers. But in most cases it is difficult to know which information the attacker accessed, and what the attacker will do with this information. Based on the information that a victim company provides to law enforcement agencies, state officials can attempt to gauge the severity of an attack and assess if it crosses the threshold of threat to national security. In the case of an attack on a ministry or on a private defence contractor for instance, the sensibility of the information potentially accessed automatically scales up the potential threat it poses. State officials do not particularly need to feel confident that a state actor is behind the attack to become involved in the attribution process. The mere potentiality that the damage can be important is sufficient to reflect a deviation from the criminal attribution process.\n## 2.3 The apparent origin of the instigator\nState officials are often cognisant that the IP address showing the origin of an attack from a particular state can be deceptive. Hackers can easily falsify the address, and use it for instance to pit one state against another, or to use underlying existing strained relations to spark an escalation of tensions. The apparent origin of the instigator can justify the implication of state officials for at least two reasons. Firstly, officials from the victim state may need to intervene to coerce the seemingly state of origin into providing more information about the attackers. Secondly, the apparent origin of the attack may be from a country that the victim state regards as an adversary. Each state has at least a vague idea of who their enemies are, or who they regard as a threat. The instability of the political situation with the enemy state can lead even a small incident with low damage to an escalation of tensions. Again, the involvement of political actors will be necessary to make a trade-off in order to decide if pursuing the investigation is possible and worth taking the risk of a political setback in case of refusal for cooperation.\n## 2.4 The means of the attack\nInstigators of cyber attacks have a wide variety of tools at their disposal to commit cyber attacks. Attackers can discover a new vulnerability in a system and exploit it. While finding new vulnerabilities is difficult and time-consuming, it also indicates a level of technical sophistication to which analysts of cyber attacks have not remained insensitive. Stuxnet, the worm that destroyed Iranian centrifuges in Natanz in 2010, utilised in its\nClement Guitton\nlatest version four of these vulnerabilities. When the cyber security company Kaspersky started examining Stuxnet, it very quickly declared that 'Stuxnet's sophistication, purpose and the intelligence behind it suggest the involvement of a state' (Halliday, 2010). Currently, only certain states and few criminal groups if any possess the means to carry out very sophisticated attacks alike to Stuxnet. Considering the means of attacks, according to analysts' reasoning, allows the group of potential suspects to be narrowed down, and may even indicate state sponsorship. Although it is disputable if sophistication is really of any help to achieve attribution as many different actors can have the skill and resources to engineer 'sophisticated' attacks, it is incontestable that associated with the type of victim organisation it raises the profile of the attack.\n## 2.5 Claims by a political group\nAny cyber attacks claimed to have been carried out for a political reason, and substantiated by enough evidence, will have to be assessed within its political context. The claim may be unfunded, unrealistic, and an entity other than the claimant may truly be behind the attack. But they will necessitate a certain assessment involving political judgement, and not solely the analysis of technical and forensic evidence. Yet, within a purely criminal context, the police and cyber security firms will lack this political judgement and the authority to wield it. The mere claim by a political group may not be completely sufficient for it to be credible. The level of confidence in the credibility of the claim plays a role in considering the attack still within the realm of criminal justice or as a threat to national security.\n## 3. Descriptions of the attribution processes\nWhat is so different between the attribution process of criminal act and the attribution process of threat to national security? Firstly, it is necessary to recognise that the two processes have different goals. While the attribution process of criminal apolitical cases seek to unravel the identity of the individuals launching the cyber attack, the attribution process of cases threatening national security focuses on discovering the sponsorship of an attack. The underlying processes to reach these two different goals are fundamentally different.\n## 3.1 The criminal context\nBoth attribution processes start with the discovery of a breach of an information system and its subsequent classification as an attack (i.e. as malicious and intentional). Following the discovery of the attack, and if none of the five aforementioned criteria apply, the case will follow the path of a criminal investigation, a well-understood process dependent on the country's good functioning of its judicial system. The next steps are then as follows: investigators from cyber security companies or from law enforcement agencies attempt to gain information to find the attacker; investigators find evidence by seizing incriminating material on the person's computer; and lastly, a court validates the inferences made from the collected evidence proving that the person was indeed the criminal using the computer from which the cyber attack was launched. In this regard, the way digital forensics are collected need to respect high standards to show that the police did not tamper with them, and that the defendant's actions, and not only his machine, caused the alleged attack 'beyond reasonable doubt'.\nThe access to evidence is predicated on first finding information about the identity of the individual. Finding information can broadly occur from three different ways: from discovering forensics left behind the attack, from information tracing back the attack to its origin (e.g. an IP address, the place where a malware first appeared), or from informants. This information does not usually prove 'beyond reasonable doubt' the individual's involvement in the attack, but evidence seized on his computer can. Two complications in the acquisition of information and evidence often arise, as many cases are spread across several jurisdictions. Firstly, the victim country's law enforcement agencies will require cooperation from the state hosting the Internet service provider which assigned the attacker's IP address. The state where the attack originated will have to request the service provider to give the match between the IP address and a name, before relaying this information to the victim country. Both steps are strongly contingent upon the state of affairs between the two countries and the tools at the disposal of the victim state to incentivise or coerce the other state into cooperating. Secondly, gathering evidence, which requires physical access to the accused's computers, can also be sensitive. Law enforcement in the originating country may be willing to seize evidence based on the information provided by their foreign counterpart, but in function of their decision to prosecute the attacker in their country or not, they may be unwilling to share the collected evidence. In case they refuse to extradite the\n94\nClement Guitton\nattacker, the country in which the attacker was located will still rely upon the victim country to exchange information about the attack it suffered in order to successfully convict the accused. These legally time-consuming and twisted procedures are mostly formalised within mutual legal assistance treaties. However, the lack of an existing treaty covering cyber attacks does not have to thwart the attribution process, as much as the existence of a treaty between two countries does not ensure its applicability. Politics often trump the law, even for the attribution process in a criminal context where cooperation to exchange information or to extradite attackers is mainly dependent on political will.\nLastly, the conviction of the attacker by a court represents the highest level of attribution possible in a criminal context. But even if the court does not convict the attacker, it can remain clear that he is the one to whom the cyber attacks are attributable. The lack of legal framework criminalising cyber attacks or the high cost of the trial involving flying witnesses over from another country have in the past prevented conviction despite the accused admitting to the charges. A conviction by a court, while preferable, is hence not an absolute necessity.\n## 3.2 The national security context\nWithin the national security context, the access to evidence is much more difficult. The four-step process for attribution of criminal cases (discovery of the attack, finding information, finding evidence, and conviction) becomes the following four-step process: discovery of the attack, finding information, formulating an assessment, and publicly acting upon the assessment. The first two steps are similar to the attribution process in a criminal context.\nThe entities formulating the assessment of attribution in cases of national security are more various than in criminal cases where only the court has the monopoly of doing so, but formal attribution still only occurs via a single formal channel, a representative of the government. The assessment by state institutions and the decision to attribute are the only forms of 'binding' attribution that will bear consequences, as the state is the only institution with the authority to take a decision of attribution accepted and recognised by whom they affect. Placing the onus on governmental institutions rather than on judicial entities for attribution has several implications. The methodology changes from the mere assessment of digital forensics to using political judgement; the standard of evidence becomes lower and proving 'beyond reasonable doubt' is not required anymore; the stakes in play are by nature political; and the timing for attribution, while important when the judiciary would pronounce a verdict, is far more crucial when it is a form of political act carried out by a political entity.\nAccepting political judgement as a methodology for attribution (Lin, 2012: 350) also implies accepting that attribution in some cases fall between beliefs and reasons (Arendt, 1992: 4), is prone to expectation biases, and operates in an environment mainly defined by an acute lack of certain information (6, 2011: 21). The difficulty of accessing evidence and the dependence on intelligence rather than evidence for attribution in this context confirms the appropriateness of resorting to this methodology. Good judgement will however rest upon the analysts being able to show the thought process as being as removed from feelings and preconceived ideas as possible, and following strict methodologies to ensure it (Heuer, 1999).\nIn this light, the most appropriate organisation to formulate judgements will be intelligence services. Intelligence services bring together both the political and technical expertise required for attribution. Analysts from private companies specialising in cyber security, such as Kaspersky and Symantec, can also mention potential authors for the attacks when they report new attack vectors. But while these companies are at the forefront of technical developments in cyber security, they certainly lack the experience of heeding political elements to ascertain the origin of attacks. On the other hand, investigative journalists have the experience of taking into account in their analysis political elements, but not technical ones. Furthermore, as they use non-technical investigation techniques, they also bring other pieces of information relevant to the assessment of sponsorship of attacks. For instance, the sponsors of Stuxnet, namely the US and Israel, only emerged when unnamed US officials with knowledge of the operation leaked information to David Sanger, a journalist at The New York Times (Sanger, 2012).\nJournalists very often protect their sources and it is not possible to independently verify their sources' credibility. The lack of verifiability of the information, either collected by investigative journalists or its analysis by state officials, is a defining constraint for incidents falling within the attribution process of national security\n95\nClement Guitton\nincidents. Relevant information feeding into political judgement, apart from being non-testable in contrast to evidence presented in front of a court, is also mainly non-technical. Technical evidence is indeed not best suited to inform on sponsorship, which is what attribution is set to achieve in this context. Instead of using technical forensics, human intelligence gained from informants and whistle-blowers is more appropriate. This means that investigators of incidents of national threats are more interested in intelligence than in digital forensic evidence, when the opposite is true for the attribution of criminal cases.\nIntelligence services are also well acquainted with the task of estimating their adversary's strength and capabilities to launch attacks, which a priori could help narrow down the number of potential attackers if one assumes that sophistication can inform on state-sponsorship – a contestable thesis regarding that criminals can also engineer sophisticated attacks. The 'strength' variable can however be difficult to estimate for cyber attacks, especially in comparison with estimating the military strength of a country. It is much easier to subcontract cyber attacks and buy zero day exploits in a hacker underground market than it is to buy military grade weapons. Furthermore, hiring a single very talented hacker can be sufficient to engineer malware with far ranging effects. It is hence difficult to assess with high certainty any groups' capability to launch cyber attacks. Such a difficulty hinders the work of intelligence services to neatly differentiate between potential enemies with capabilities and those with only low resources to launch cyber attacks. Further blurring the picture, it is strategically advantageous for actors to hide their offensive capabilities as much as possible. Such a conclusion can appear at first counter intuitive considering that on the other hand displaying one's capabilities can act as a deterrent measure against an adversary. However, if the adversary knows that the likeliness for a threat of retaliation is low due to the uncertainty of attribution, deterrence is unlikely to function. Keeping possibilities of using covert cyber attacks as a tool for foreign policy hence becomes a reasonable strategic decision.\nBut once intelligence services attribute an attack, and as the intelligence services are by design an opaque structure, the decision of making the attribution public is somewhat a completely different decision. This decision differs from the judgement pronounced by a court in two regards. Firstly, the decision, by the nature of the parties potentially involved as state actors or as terrorist organisations, becomes a political decision for a state official to take. The decision to make attribution public also requires political judgement to balance the risks of misattribution, certainty, timing, and potential benefits of attributing the attack. The decision is likely to be taken by senior and high elected officials only. As Francis Maude, British Minister for Cabinet Office, pointed out in a hearing in the House of Commons (2012), 'if something looked like it could be a sovereign attack', the judgement of deciding sponsorship 'would clearly be for the Prime Minister' to make. Secondly, a legal judgement aims at instating justice, while a political judgement has wider possible ramifications. Following an assessment of the potential instigators of an attack, state officials can refuse to publicly name an attacker as a state with which they have strategic partnerships in order to preserve economic ties with the country. Such a decision will have followed the different steps of the attribution process, and stopped at the third one. Refusing to publicly name the attacker would be morally wrong, as the victim state would fail in its duty of owing transparency and the truth to its citizens. But it could also be a politically shrewd decision. As the level of damage caused by cyber attacks increases, the political argument will increasingly trump the moral one, leading to more frequent formal attribution.\n# 4. Conclusion\nThe new proposed model for attribution challenges three previously accepted arguments. Firstly, it challenges that attribution is a problem and posits that it is better described as a process. Secondly, it challenges that attribution is mainly a technical issue. Lastly, it challenges that identifying a criminal and identifying the sponsor of an attack follow similar characteristics. Brought under the common umbrella term of 'attribution problem', many officials and researchers have as such advocated the same solutions for what appears in fact as two distinct attribution processes. The process within which a case falls determines the responsible authority (judiciary vs. executive), the methodology (digital forensics vs. political judgement), the standard of evidence ('beyond reasonable doubt' vs. dependent upon judgement), the stake in play (individual vs. political), and finally, the timing (irrelevant vs. critical) that will apply for attribution. The separation of attribution into two processes leads to the conclusion that they face different constraints with different requirements to relax these constraints.\n96\nClement Guitton",
  "references": [
    "# References\n(2012) Defence and Cyber Security. House of Commons. London: Parliament.\n6 P. (2011) Explaining Political Judgement, Cambridge: Cambridge University Press.\nArendt H. (1992) Postscritum to Thinking. Hannah Arendt Lectures on Kant's Political Philosophy. Chicago: The University of Chicago Press.\nBoebert WE. (2010) A Survey of Challenges in Attribution. Workshop on Deterring Cyber Attacks: Informing Strategies and Developing Options for U.S. Policy. Washington DC: The National Academies Press.\nBrenner SW. (2009) Cyber Threats: The Emerging Fault Lines of the Nation State, Oxford: Oxford Scholarship Online.\nBrenner SW. (2013) Cyber-threats and the Limits of Bureaucratic Control. Minnesota Journal of Law, Science, and Technology 14.\nCabinet Office. (2011) The UK Cyber Security Strategy - Protecting and promoting the UK in a digital world. London: Cabinet Office.\nClark DD and Landau S. (2010) Untangling Attribution. Workshop on Deterring CyberAttacks: Informing Strategies and Developing Options for U.S. Policy. Washington, DC: The National Academy Press, 25-40.\nClayton R. (2005) Anonymity and traceability in cyberspace. Computer Laboratory. Cambridge: University of Cambridge, 189.\nHalliday J. (2010) Stuxnet worm is the 'work of a national government agency'. The Guardian, 24 September.\nHealey J. (2012) Beyond Attribution: Seeking National Responsibility for Cyber Attacks. Washington, DC: Atlantic Council, 1-7.\nHeuer RJ. (1999) Psychology of Intelligence Analysis, Washington, D.C.: Centre for the Study of Intelligence.\nHunker J, Hutchinson B and Margulies J. (2008) Role and Challenges for Sufficient Cyber-Attack Attribution. Institute for Information Infrastructure Protection. Hanover, New Hampshire: Dartmouth College.\nJesdanun A. (2004) New virus snarls hundreds of thousands of machines worldwide. The Associated Press, 3 May.\nLemos R. (2005) Microsoft to reward informants after Sasser conviction. SecurityFocus, 8 July.\nLibicki M. (2012) The Specter of Non-Obvious Warfare. Strategic Studies Quarterly Fall: 88-101.\nLin H. (2012) Thoughts on Threat Assessment in Cyberspace. I/S: A Journal of Law and Policy for the Information Society 8: 337-355.\nPanetta L. (2012) Text of Speech by Secretary of Defense Leon Panetta. Business Executives for National Security, 11 October.\nPanetta L and Dempsey M. (2012) News Briefing. Department of Defense, 25 October.\nParker T, Devost MG, Sach MH, et al. (2004) Cyber Adversary Characterisation, Rockland: Syngress Publishing.\nSanger DE. (2012) Obama Order Sped Up Wave of Cyberattacks Against Iran. The New York Times, 1 June.\nThe Associated Press. (2012) Official: US blames Iran hackers for cyberattacks. The Washington Post, 11 October.\nWheeler DA, Larsen GN and Leader T. (2003) Techniques for Cyber Attack Attribution. Alexandria, Virginia: Institute for Defense Analyses.\n97\nversity, Taiwan in 1997, and both a M.Sc. degree and a Ph.D. (Computer Science and Engineering) from National Sun Yat-sen University, Taiwan in 1999 and 2010, respectively. His research interests include Internet security, wireless network, home network system, IoT, and learning cloud services.\nEric Filiol is the head of the Operational Cryptology and Virology at ESIEA. He has spent 21 years in the French Army. He holds an Engineer diploma in Cryptology, a PhD and a Habilitation Thesis in applied mathematics and computer science. He is also the Scientific Director of EICAR and the Editor-in-chief of the Journal in Computer Virology.\nJason Flood, MSc is currently an Ethical Hacking Architect at IBM in Dublin. He is also a PhD student at the Institute of Technology Blanchardstown where he investigates better ways of training Network Administrators. Jason is the co-founder Irish Chapter of the Honeynet Project and works with OWASP and Facebook in running CTF competitions.\nGrigorios Fragkos, BSc, MSc, PhD, Certified TigerScheme, AST and QSTM. He has a number of publications in Computer Security and Computer Forensics. He has been part of the CyberDefense dept. of the Hellenic Army acting as Information Security consultant and Penetration tester. Currently, works for Sysnet Global Solutions as Sr. Consultant and Penetration tester.\nWendy Goucher is about to enter the final phase of her PhD research. She is a part time student at University of Glasgow and is also an information security consultant with Idrach Ltd. where she specialises in assisting in the design and communication of operationally effective security policy.\nDijana Grd comes from Croatia. She is a second year student of graduate study programme Information and Software Engineering at Faculty of Organization and Informatics in Varazdin. Her studies have provided her an insight into area of identification, collection, processing, analysis and production of electronically stored information. She has some work experience as a student assistant in Informatics and as a project manager in student organization AIESEC. She enjoys participating in all kind of international conferences and projects. She also likes to travel and meet new people.\nClement Guitton is a PhD candidate in War Studies at King's College London focusing on cyber security. He holds a master degree both in international relations and in electrical engineering. Fluent in English, French, and German, he previously worked at the International Telecommunication Union, the United Nation agency specialised on information and communication technologies.\nHåkan Gunneriusson has a PhD in History 2002, Uppsala University. Hakan is interested in sociological and historical perspectives on current and coming issues regarding military tactical and cultural issues. Hakan is currently head of research ground operative and tactical areas, Swedish National Defence College.\nSamuli Haataja is a PhD candidate in the Griffith Law School at Griffith University on the Gold Coast, Australia. He holds a Bachelor of Laws (Hons) and Bachelor of International Relations from Griffith University. His research focuses on cyber attacks and international law – specifically on the relationship of technology, violence and law in this context.\nMikko Hakuli is currently employed as security specialist at JyvSecTec-project in Jyväskylä University of Applied Sciences (JAMK), where his main responsible are technical security testing and development of various situational awareness \"best practices\" in cyber-security area. Formerly he worked as Head of information security on Finnish Airforces. Currently he also make studies in University of Jyväskylä and Jyväskylä University of Applied Sciences.\nJuhani Hämäläinen received his PhD degree in theoretical physics from the University of Jyväskylä in 2004. He is currently in the position of principal scientist at Finnish Defense Forces Technical Research Centre (PVTT). His research interests include mathematical model development and operational analysis.\nMajor Arto Hirvelä is an instructor (leadership) in a research group at the Finnish National Defence University. He is preparing a doctoral dissertation in Military Science (leadership). His research interests are information environment, strategic communication, and information operations.\nIlona Ilvonen is a doctoral student at Tampere University of Technology, department of Information Management and Logistics. Her doctoral thesis topic is the management of knowledge security, and the thesis is due in 2013. She has published conference papers on information security management, knowledge management and relating topics since the year 2003.\nMargarita Jaitner is a research intern at the Finnish National Defence University. She received a Bachelor's degree in Political Science at the Swedish Defence College and is currently pursuing a Master's degree in Societal Risk Management at the Karlstad University in Sweden.\nx\nReproduced with permission of the copyright owner. Further reproduction prohibited without permission."
  ],
  "flat_text": "Clement Guitton War Studies, King's College London, UK clement.guitton@kcl.ac.uk Abstract: This article posits that attribution is better approached as a process than as a problem. Departing from models for attribution emphasising its technical constraints, the article distinguishes between two distinct attribution processes operating in two different contexts and answering two different questions. On one hand, in a criminal context, the attribution process seeks to identify individuals who launched cyber attacks. On the other hand, in a national security context, the process seeks to identify adversaries which may have sponsored cyber attacks. Five elements can serve as determinants to distinguish between the two processes: the type of target, the severity and scale of the damage, the apparent origin of the instigator of the attack, the means of the attack, and lastly the claims by political groups. After reviewing these elements, the article analyses how the constraints and characteristics of the two different attribution processes vary in terms of responsible authority, standard of evidence, stake in play and relevance of timing for attribution. In a criminal context, the collection of digital evidence is of primary importance to be able to reach a high level of judicial proof. However, in a national security context, investigators will likely not have access to evidence but only to intelligence, and the decision of attribution will not be taken within the judiciary but within the executive (e.g. a government). As such, attribution of national security incidents requires a form of political judgement to heed the political context and circumstances of the incidents that courts do not need to consider when examining the guilt of criminals. Political judgement is also required to balance the consequences of attribution on a political level, potentially resulting in a straining of relations with other international actors. As the constraints between the two different attribution processes differ, their requirements for easing the constraints also vary.\nKeywords: attribution, sponsorship, cyber attacks, national security threats # 1. Introduction In August 2012, a malware called Shamoon infected the computers of Saudi Arabia's national oil company Aramco, and wiped out the hard drives of 30,000 computers. The attack prompted US Secretary of Defense Leon Panetta to mention the attack in a widely quoted speech in front of business executives and to answer further questions in a briefing at the Pentagon. While Panetta fell short in his speech of accusing Iran for the attacks, a journalist, quoting an unnamed US government official mentioned that Iranian hackers carried out the attack with the support from the Iranian government (The Associated Press, 2012). Officially, the attack remains unattributed to this day. In contrast, many other malware have in the past infected many computers without prompting high political officials to react about the identity of the instigators. For instance, in 2004, the Sasser worm infected millions of computers including those of rail systems in New South Wales, the Italian Interior Ministry, the European Commission and British coastguard stations without stirring such a response. The police later found its author, Sven Jaschan, thanks to an information reward program set up by Microsoft.\nHow and why does the attribution of an incident become politicised? Does attribution require the involvement of political figures? How do the processes of attributing a criminal incident and attributing an incident of national security relevance differ?\nAs attribution informs states' responses to cyber attacks, finding answers to these questions is essential. But there is currently no overall model for attribution that can answer these questions and explain how attribution occurs by taking into account the disparities between the responsible authorities, the standards of evidence, the stakes in play and the relevance of timing for attribution of cases either similar to the Aramco incident or to the Sasser worm. This article proposes such a model for attribution based on the nature of the attribution process either as apolitical or political. Apolitical cases are cases of purely criminal nature that do not rise to the level of 'national threat'. When an incident crosses the 'national threat' threshold, the question of knowing the identity of the attackers becomes less relevant than knowing who the enemy is, for instance a state actor or a terrorist organisation. The process of reaching conclusions on the identity of the instigator or on the Clement Guitton sponsorship of an attack differs in great regards. Assessing enmity is a matter of political judgement, and not for a domestic court to decide. Evidence to support the judgement for enmity hence does not have to reach the level of judicial proof that the conviction of a criminal requires. Distinguishing between the two processes allow the discernment of solutions to the attribution problem that is inherently political in some instances, and not technical as often characterised.\nThis article presents the model, namely the two attribution processes, in two steps. Firstly, it shows the criteria that lead to the politicisation of incidents. Secondly, it delves into the different characteristics of these two distinct processes.\n## 2. Politicised attribution: A set of conditions for the model Three main models have previously emerged to characterise attribution, one having its root in computer science, a second one in political science, and a third one in both fields. Firstly, the cyber security expert Tom Parker suggested assigning values to three variables to characterise the attacker: the attacker's intrinsic characteristics (e.g. resources, motivation), the target, and the general environment of the attack. Within this model, analysts compute values using Bayesian probabilities obliging them to assess the certainty of assumptions and known information. But this model suffers two pitfalls: many variables do not lend themselves to being ascribed numerical values; and Parker's attempt to draw the line between criminal and terrorist cyber attacks based on the unknown motivation of the attacker is unrealistic. The motivation of an attacker usually follows at least partial attribution, and does not precede it.\nSecondly, the lawyer Susanne W. Brenner proposed a model for attribution as a political decision based on the trichotomy war – terrorism – crime, a trichotomy whose relevance she acknowledged is eroding in cyberspace. Brenner suggested starting with attempting to classify the incident within this trichotomy also based on three variables: the origin, the target, and the motive for the attack. Yet, determining if an incident is an act of war, hence originating from a state actor, requires solving attribution first, a problem Brenner also acknowledged. Brenner's solution to the eroding relevance of the trichotomy focused on the dilemma the erosion poses on an institutional level between military and civilian entities involved in responding to the threat rather than on the core problem it poses for attribution. Such a solution did not address the main flaw in her model for attribution, namely that knowing the sponsorship of an attack cannot be at the same time the sought solution of the problem, and the variable on which the problem depends.\nLastly, the computer scientists David Clark, Susan Landau and Earl Boebert have separated the attribution problem into two sub-problems: one technical and consisting in identifying the attacking machine, and one human consisting in identifying the machine's owners and potentially their sponsor. The computer scientists delved into technical procedures to attribute a machine and left aside the details of the identification of individuals and sponsors. While much research has been carried out to improve tracing back attacks, many researchers have also acknowledged that technical considerations alone cannot be sufficient to solve the attribution problem. It is hence important to continue expending the model for attribution of cyber attacks without focusing on its technological aspects. The focus away from technology is further justified as political considerations dwarf technical ones when the incident meets certain criteria constraining the access to evidence.\nTo remedy the shortcomings of each of the three existing models, attribution can be approached as two distinct processes: on one hand, as an apolitical process following well-established criminal procedures; and on the other hand, as an act requiring a political decision, such as classifying an incident as an act of war or terrorism. Considering attribution as a process and not as a problem allows the identification of steps where different questions arise with different saliency within the process. For instance, only when attribution is politicised does the question of the different degrees of involvement of a state arise, as well as strategic questions about instrumental use of cyber attacks as covert means to achieve foreign policy objectives.\nThe determinants indicating which process an incident fall within need to be assessable from the outset of the investigation and cannot rely on the formulation of early assumptions, as Parker's and Brenner's model required for determining the motive of the attack. Five determinants influence the attribution of an incident as becoming the resort of politics rather than of the criminal justice system.\n## 2.1 The target The profile of the attack rises in function of the target according to two different elements: firstly, the political nature of the target, and secondly, the threat to national security that the target can constitute. Attackers can focus on these two types of targets in an instrumental way to try to weaken a state and achieve a political objective.\nTargets creating a threat to national security are attacks either on critical national infrastructures (e.g. Stuxnet), or on companies losing their intellectual property on a great scale. The loss of intellectual property impacts companies' productivity and, in turn, harms the national economies of countries hosting them. In the UK, tackling the threat to the economy is the very first objective of its national cyber security strategy, aiming at placing the UK as 'one of the most secure places in the world to do business in cyberspace' (Cabinet Office, 2011: 8). The theft of intellectual property via cyber attacks is therefore a topic taken seriously as a threat to national security, and is as such, approached by high-ranking officials.\nNot all attacks on companies that correspond to corporate espionage will fall within the national security threat category. Rogue corporations, even within the same country, can attack each other to gain economic advantages. Solely considering a company victim of espionage may therefore not be sufficient to raise the political profile of the attack. But the systematic loss of intellectual property from a range of companies is sufficient to constitute an economic threat for the victim country.\n## 2.2 The severity and scale of the damage One of the reasons the targeting of critical infrastructure moves attribution to the higher end of the political spectrum is because of the high severity of damage an attack can potentially cause. The assessment of the severity of an attack is not always evident. In espionage cases, the severity is dependent upon the information accessed by the hackers. But in most cases it is difficult to know which information the attacker accessed, and what the attacker will do with this information. Based on the information that a victim company provides to law enforcement agencies, state officials can attempt to gauge the severity of an attack and assess if it crosses the threshold of threat to national security. In the case of an attack on a ministry or on a private defence contractor for instance, the sensibility of the information potentially accessed automatically scales up the potential threat it poses. State officials do not particularly need to feel confident that a state actor is behind the attack to become involved in the attribution process. The mere potentiality that the damage can be important is sufficient to reflect a deviation from the criminal attribution process.\n## 2.3 The apparent origin of the instigator State officials are often cognisant that the IP address showing the origin of an attack from a particular state can be deceptive. Hackers can easily falsify the address, and use it for instance to pit one state against another, or to use underlying existing strained relations to spark an escalation of tensions. The apparent origin of the instigator can justify the implication of state officials for at least two reasons. Firstly, officials from the victim state may need to intervene to coerce the seemingly state of origin into providing more information about the attackers. Secondly, the apparent origin of the attack may be from a country that the victim state regards as an adversary. Each state has at least a vague idea of who their enemies are, or who they regard as a threat. The instability of the political situation with the enemy state can lead even a small incident with low damage to an escalation of tensions. Again, the involvement of political actors will be necessary to make a trade-off in order to decide if pursuing the investigation is possible and worth taking the risk of a political setback in case of refusal for cooperation.\n## 2.4 The means of the attack Instigators of cyber attacks have a wide variety of tools at their disposal to commit cyber attacks. Attackers can discover a new vulnerability in a system and exploit it. While finding new vulnerabilities is difficult and time-consuming, it also indicates a level of technical sophistication to which analysts of cyber attacks have not remained insensitive. Stuxnet, the worm that destroyed Iranian centrifuges in Natanz in 2010, utilised in its Clement Guitton latest version four of these vulnerabilities. When the cyber security company Kaspersky started examining Stuxnet, it very quickly declared that 'Stuxnet's sophistication, purpose and the intelligence behind it suggest the involvement of a state'. Currently, only certain states and few criminal groups if any possess the means to carry out very sophisticated attacks alike to Stuxnet. Considering the means of attacks, according to analysts' reasoning, allows the group of potential suspects to be narrowed down, and may even indicate state sponsorship. Although it is disputable if sophistication is really of any help to achieve attribution as many different actors can have the skill and resources to engineer 'sophisticated' attacks, it is incontestable that associated with the type of victim organisation it raises the profile of the attack.\n## 2.5 Claims by a political group Any cyber attacks claimed to have been carried out for a political reason, and substantiated by enough evidence, will have to be assessed within its political context. The claim may be unfunded, unrealistic, and an entity other than the claimant may truly be behind the attack. But they will necessitate a certain assessment involving political judgement, and not solely the analysis of technical and forensic evidence. Yet, within a purely criminal context, the police and cyber security firms will lack this political judgement and the authority to wield it. The mere claim by a political group may not be completely sufficient for it to be credible. The level of confidence in the credibility of the claim plays a role in considering the attack still within the realm of criminal justice or as a threat to national security.\n## 3. Descriptions of the attribution processes What is so different between the attribution process of criminal act and the attribution process of threat to national security? Firstly, it is necessary to recognise that the two processes have different goals. While the attribution process of criminal apolitical cases seek to unravel the identity of the individuals launching the cyber attack, the attribution process of cases threatening national security focuses on discovering the sponsorship of an attack. The underlying processes to reach these two different goals are fundamentally different.\n## 3.1 The criminal context Both attribution processes start with the discovery of a breach of an information system and its subsequent classification as an attack (i.e. as malicious and intentional). Following the discovery of the attack, and if none of the five aforementioned criteria apply, the case will follow the path of a criminal investigation, a well-understood process dependent on the country's good functioning of its judicial system. The next steps are then as follows: investigators from cyber security companies or from law enforcement agencies attempt to gain information to find the attacker; investigators find evidence by seizing incriminating material on the person's computer; and lastly, a court validates the inferences made from the collected evidence proving that the person was indeed the criminal using the computer from which the cyber attack was launched. In this regard, the way digital forensics are collected need to respect high standards to show that the police did not tamper with them, and that the defendant's actions, and not only his machine, caused the alleged attack 'beyond reasonable doubt'.\nThe access to evidence is predicated on first finding information about the identity of the individual. Finding information can broadly occur from three different ways: from discovering forensics left behind the attack, from information tracing back the attack to its origin (e.g. an IP address, the place where a malware first appeared), or from informants. This information does not usually prove 'beyond reasonable doubt' the individual's involvement in the attack, but evidence seized on his computer can. Two complications in the acquisition of information and evidence often arise, as many cases are spread across several jurisdictions. Firstly, the victim country's law enforcement agencies will require cooperation from the state hosting the Internet service provider which assigned the attacker's IP address. The state where the attack originated will have to request the service provider to give the match between the IP address and a name, before relaying this information to the victim country. Both steps are strongly contingent upon the state of affairs between the two countries and the tools at the disposal of the victim state to incentivise or coerce the other state into cooperating. Secondly, gathering evidence, which requires physical access to the accused's computers, can also be sensitive. Law enforcement in the originating country may be willing to seize evidence based on the information provided by their foreign counterpart, but in function of their decision to prosecute the attacker in their country or not, they may be unwilling to share the collected evidence. In case they refuse to extradite the attacker, the country in which the attacker was located will still rely upon the victim country to exchange information about the attack it suffered in order to successfully convict the accused. These legally time-consuming and twisted procedures are mostly formalised within mutual legal assistance treaties. However, the lack of an existing treaty covering cyber attacks does not have to thwart the attribution process, as much as the existence of a treaty between two countries does not ensure its applicability. Politics often trump the law, even for the attribution process in a criminal context where cooperation to exchange information or to extradite attackers is mainly dependent on political will.\nLastly, the conviction of the attacker by a court represents the highest level of attribution possible in a criminal context. But even if the court does not convict the attacker, it can remain clear that he is the one to whom the cyber attacks are attributable. The lack of legal framework criminalising cyber attacks or the high cost of the trial involving flying witnesses over from another country have in the past prevented conviction despite the accused admitting to the charges. A conviction by a court, while preferable, is hence not an absolute necessity.\n## 3.2 The national security context Within the national security context, the access to evidence is much more difficult. The four-step process for attribution of criminal cases (discovery of the attack, finding information, finding evidence, and conviction) becomes the following four-step process: discovery of the attack, finding information, formulating an assessment, and publicly acting upon the assessment. The first two steps are similar to the attribution process in a criminal context.\nThe entities formulating the assessment of attribution in cases of national security are more various than in criminal cases where only the court has the monopoly of doing so, but formal attribution still only occurs via a single formal channel, a representative of the government. The assessment by state institutions and the decision to attribute are the only forms of 'binding' attribution that will bear consequences, as the state is the only institution with the authority to take a decision of attribution accepted and recognised by whom they affect. Placing the onus on governmental institutions rather than on judicial entities for attribution has several implications. The methodology changes from the mere assessment of digital forensics to using political judgement; the standard of evidence becomes lower and proving 'beyond reasonable doubt' is not required anymore; the stakes in play are by nature political; and the timing for attribution, while important when the judiciary would pronounce a verdict, is far more crucial when it is a form of political act carried out by a political entity.\nAccepting political judgement as a methodology for attribution also implies accepting that attribution in some cases fall between beliefs and reasons, is prone to expectation biases, and operates in an environment mainly defined by an acute lack of certain information (6, 2011: 21). The difficulty of accessing evidence and the dependence on intelligence rather than evidence for attribution in this context confirms the appropriateness of resorting to this methodology. Good judgement will however rest upon the analysts being able to show the thought process as being as removed from feelings and preconceived ideas as possible, and following strict methodologies to ensure it.\nIn this light, the most appropriate organisation to formulate judgements will be intelligence services. Intelligence services bring together both the political and technical expertise required for attribution. Analysts from private companies specialising in cyber security, such as Kaspersky and Symantec, can also mention potential authors for the attacks when they report new attack vectors. But while these companies are at the forefront of technical developments in cyber security, they certainly lack the experience of heeding political elements to ascertain the origin of attacks. On the other hand, investigative journalists have the experience of taking into account in their analysis political elements, but not technical ones. Furthermore, as they use non-technical investigation techniques, they also bring other pieces of information relevant to the assessment of sponsorship of attacks. For instance, the sponsors of Stuxnet, namely the US and Israel, only emerged when unnamed US officials with knowledge of the operation leaked information to David Sanger, a journalist at The New York Times.\nJournalists very often protect their sources and it is not possible to independently verify their sources' credibility. The lack of verifiability of the information, either collected by investigative journalists or its analysis by state officials, is a defining constraint for incidents falling within the attribution process of national security incidents. Relevant information feeding into political judgement, apart from being non-testable in contrast to evidence presented in front of a court, is also mainly non-technical. Technical evidence is indeed not best suited to inform on sponsorship, which is what attribution is set to achieve in this context. Instead of using technical forensics, human intelligence gained from informants and whistle-blowers is more appropriate. This means that investigators of incidents of national threats are more interested in intelligence than in digital forensic evidence, when the opposite is true for the attribution of criminal cases.\nIntelligence services are also well acquainted with the task of estimating their adversary's strength and capabilities to launch attacks, which a priori could help narrow down the number of potential attackers if one assumes that sophistication can inform on state-sponsorship – a contestable thesis regarding that criminals can also engineer sophisticated attacks. The 'strength' variable can however be difficult to estimate for cyber attacks, especially in comparison with estimating the military strength of a country. It is much easier to subcontract cyber attacks and buy zero day exploits in a hacker underground market than it is to buy military grade weapons. Furthermore, hiring a single very talented hacker can be sufficient to engineer malware with far ranging effects. It is hence difficult to assess with high certainty any groups' capability to launch cyber attacks. Such a difficulty hinders the work of intelligence services to neatly differentiate between potential enemies with capabilities and those with only low resources to launch cyber attacks. Further blurring the picture, it is strategically advantageous for actors to hide their offensive capabilities as much as possible. Such a conclusion can appear at first counter intuitive considering that on the other hand displaying one's capabilities can act as a deterrent measure against an adversary. However, if the adversary knows that the likeliness for a threat of retaliation is low due to the uncertainty of attribution, deterrence is unlikely to function. Keeping possibilities of using covert cyber attacks as a tool for foreign policy hence becomes a reasonable strategic decision.\nBut once intelligence services attribute an attack, and as the intelligence services are by design an opaque structure, the decision of making the attribution public is somewhat a completely different decision. This decision differs from the judgement pronounced by a court in two regards. Firstly, the decision, by the nature of the parties potentially involved as state actors or as terrorist organisations, becomes a political decision for a state official to take. The decision to make attribution public also requires political judgement to balance the risks of misattribution, certainty, timing, and potential benefits of attributing the attack. The decision is likely to be taken by senior and high elected officials only. As Francis Maude, British Minister for Cabinet Office, pointed out in a hearing in the House of Commons (2012), 'if something looked like it could be a sovereign attack', the judgement of deciding sponsorship 'would clearly be for the Prime Minister' to make. Secondly, a legal judgement aims at instating justice, while a political judgement has wider possible ramifications. Following an assessment of the potential instigators of an attack, state officials can refuse to publicly name an attacker as a state with which they have strategic partnerships in order to preserve economic ties with the country. Such a decision will have followed the different steps of the attribution process, and stopped at the third one. Refusing to publicly name the attacker would be morally wrong, as the victim state would fail in its duty of owing transparency and the truth to its citizens. But it could also be a politically shrewd decision. As the level of damage caused by cyber attacks increases, the political argument will increasingly trump the moral one, leading to more frequent formal attribution.\n# 4. Conclusion The new proposed model for attribution challenges three previously accepted arguments. Firstly, it challenges that attribution is a problem and posits that it is better described as a process. Secondly, it challenges that attribution is mainly a technical issue. Lastly, it challenges that identifying a criminal and identifying the sponsor of an attack follow similar characteristics. Brought under the common umbrella term of 'attribution problem', many officials and researchers have as such advocated the same solutions for what appears in fact as two distinct attribution processes. The process within which a case falls determines the responsible authority (judiciary vs. executive), the methodology (digital forensics vs. political judgement), the standard of evidence ('beyond reasonable doubt' vs. dependent upon judgement), the stake in play (individual vs. political), and finally, the timing (irrelevant vs. critical) that will apply for attribution. The separation of attribution into two processes leads to the conclusion that they face different constraints with different requirements to relax these constraints.",
  "citations": {
    "style": "author_year",
    "flat_text": "Clement Guitton War Studies, King's College London, UK clement.guitton@kcl.ac.uk Abstract: This article posits that attribution is better approached as a process than as a problem. Departing from models for attribution emphasising its technical constraints, the article distinguishes between two distinct attribution processes operating in two different contexts and answering two different questions. On one hand, in a criminal context, the attribution process seeks to identify individuals who launched cyber attacks. On the other hand, in a national security context, the process seeks to identify adversaries which may have sponsored cyber attacks. Five elements can serve as determinants to distinguish between the two processes: the type of target, the severity and scale of the damage, the apparent origin of the instigator of the attack, the means of the attack, and lastly the claims by political groups. After reviewing these elements, the article analyses how the constraints and characteristics of the two different attribution processes vary in terms of responsible authority, standard of evidence, stake in play and relevance of timing for attribution. In a criminal context, the collection of digital evidence is of primary importance to be able to reach a high level of judicial proof. However, in a national security context, investigators will likely not have access to evidence but only to intelligence, and the decision of attribution will not be taken within the judiciary but within the executive (e.g. a government). As such, attribution of national security incidents requires a form of political judgement to heed the political context and circumstances of the incidents that courts do not need to consider when examining the guilt of criminals. Political judgement is also required to balance the consequences of attribution on a political level, potentially resulting in a straining of relations with other international actors. As the constraints between the two different attribution processes differ, their requirements for easing the constraints also vary.\nKeywords: attribution, sponsorship, cyber attacks, national security threats # 1. Introduction In August 2012, a malware called Shamoon infected the computers of Saudi Arabia's national oil company Aramco, and wiped out the hard drives of 30,000 computers. The attack prompted US Secretary of Defense Leon Panetta to mention the attack in a widely quoted speech in front of business executives and to answer further questions in a briefing at the Pentagon. While Panetta fell short in his speech of accusing Iran for the attacks, a journalist, quoting an unnamed US government official mentioned that Iranian hackers carried out the attack with the support from the Iranian government (The Associated Press, 2012). Officially, the attack remains unattributed to this day. In contrast, many other malware have in the past infected many computers without prompting high political officials to react about the identity of the instigators. For instance, in 2004, the Sasser worm infected millions of computers including those of rail systems in New South Wales, the Italian Interior Ministry, the European Commission and British coastguard stations without stirring such a response. The police later found its author, Sven Jaschan, thanks to an information reward program set up by Microsoft.\nHow and why does the attribution of an incident become politicised? Does attribution require the involvement of political figures? How do the processes of attributing a criminal incident and attributing an incident of national security relevance differ?\nAs attribution informs states' responses to cyber attacks, finding answers to these questions is essential. But there is currently no overall model for attribution that can answer these questions and explain how attribution occurs by taking into account the disparities between the responsible authorities, the standards of evidence, the stakes in play and the relevance of timing for attribution of cases either similar to the Aramco incident or to the Sasser worm. This article proposes such a model for attribution based on the nature of the attribution process either as apolitical or political. Apolitical cases are cases of purely criminal nature that do not rise to the level of 'national threat'. When an incident crosses the 'national threat' threshold, the question of knowing the identity of the attackers becomes less relevant than knowing who the enemy is, for instance a state actor or a terrorist organisation. The process of reaching conclusions on the identity of the instigator or on the Clement Guitton sponsorship of an attack differs in great regards. Assessing enmity is a matter of political judgement, and not for a domestic court to decide. Evidence to support the judgement for enmity hence does not have to reach the level of judicial proof that the conviction of a criminal requires. Distinguishing between the two processes allow the discernment of solutions to the attribution problem that is inherently political in some instances, and not technical as often characterised.\nThis article presents the model, namely the two attribution processes, in two steps. Firstly, it shows the criteria that lead to the politicisation of incidents. Secondly, it delves into the different characteristics of these two distinct processes.\n## 2. Politicised attribution: A set of conditions for the model Three main models have previously emerged to characterise attribution, one having its root in computer science, a second one in political science, and a third one in both fields. Firstly, the cyber security expert Tom Parker suggested assigning values to three variables to characterise the attacker: the attacker's intrinsic characteristics (e.g. resources, motivation), the target, and the general environment of the attack. Within this model, analysts compute values using Bayesian probabilities obliging them to assess the certainty of assumptions and known information. But this model suffers two pitfalls: many variables do not lend themselves to being ascribed numerical values; and Parker's attempt to draw the line between criminal and terrorist cyber attacks based on the unknown motivation of the attacker is unrealistic. The motivation of an attacker usually follows at least partial attribution, and does not precede it.\nSecondly, the lawyer Susanne W. Brenner proposed a model for attribution as a political decision based on the trichotomy war – terrorism – crime, a trichotomy whose relevance she acknowledged is eroding in cyberspace. Brenner suggested starting with attempting to classify the incident within this trichotomy also based on three variables: the origin, the target, and the motive for the attack. Yet, determining if an incident is an act of war, hence originating from a state actor, requires solving attribution first, a problem Brenner also acknowledged. Brenner's solution to the eroding relevance of the trichotomy focused on the dilemma the erosion poses on an institutional level between military and civilian entities involved in responding to the threat rather than on the core problem it poses for attribution. Such a solution did not address the main flaw in her model for attribution, namely that knowing the sponsorship of an attack cannot be at the same time the sought solution of the problem, and the variable on which the problem depends.\nLastly, the computer scientists David Clark, Susan Landau and Earl Boebert have separated the attribution problem into two sub-problems: one technical and consisting in identifying the attacking machine, and one human consisting in identifying the machine's owners and potentially their sponsor. The computer scientists delved into technical procedures to attribute a machine and left aside the details of the identification of individuals and sponsors. While much research has been carried out to improve tracing back attacks, many researchers have also acknowledged that technical considerations alone cannot be sufficient to solve the attribution problem. It is hence important to continue expending the model for attribution of cyber attacks without focusing on its technological aspects. The focus away from technology is further justified as political considerations dwarf technical ones when the incident meets certain criteria constraining the access to evidence.\nTo remedy the shortcomings of each of the three existing models, attribution can be approached as two distinct processes: on one hand, as an apolitical process following well-established criminal procedures; and on the other hand, as an act requiring a political decision, such as classifying an incident as an act of war or terrorism. Considering attribution as a process and not as a problem allows the identification of steps where different questions arise with different saliency within the process. For instance, only when attribution is politicised does the question of the different degrees of involvement of a state arise, as well as strategic questions about instrumental use of cyber attacks as covert means to achieve foreign policy objectives.\nThe determinants indicating which process an incident fall within need to be assessable from the outset of the investigation and cannot rely on the formulation of early assumptions, as Parker's and Brenner's model required for determining the motive of the attack. Five determinants influence the attribution of an incident as becoming the resort of politics rather than of the criminal justice system.\n## 2.1 The target The profile of the attack rises in function of the target according to two different elements: firstly, the political nature of the target, and secondly, the threat to national security that the target can constitute. Attackers can focus on these two types of targets in an instrumental way to try to weaken a state and achieve a political objective.\nTargets creating a threat to national security are attacks either on critical national infrastructures (e.g. Stuxnet), or on companies losing their intellectual property on a great scale. The loss of intellectual property impacts companies' productivity and, in turn, harms the national economies of countries hosting them. In the UK, tackling the threat to the economy is the very first objective of its national cyber security strategy, aiming at placing the UK as 'one of the most secure places in the world to do business in cyberspace' (Cabinet Office, 2011: 8). The theft of intellectual property via cyber attacks is therefore a topic taken seriously as a threat to national security, and is as such, approached by high-ranking officials.\nNot all attacks on companies that correspond to corporate espionage will fall within the national security threat category. Rogue corporations, even within the same country, can attack each other to gain economic advantages. Solely considering a company victim of espionage may therefore not be sufficient to raise the political profile of the attack. But the systematic loss of intellectual property from a range of companies is sufficient to constitute an economic threat for the victim country.\n## 2.2 The severity and scale of the damage One of the reasons the targeting of critical infrastructure moves attribution to the higher end of the political spectrum is because of the high severity of damage an attack can potentially cause. The assessment of the severity of an attack is not always evident. In espionage cases, the severity is dependent upon the information accessed by the hackers. But in most cases it is difficult to know which information the attacker accessed, and what the attacker will do with this information. Based on the information that a victim company provides to law enforcement agencies, state officials can attempt to gauge the severity of an attack and assess if it crosses the threshold of threat to national security. In the case of an attack on a ministry or on a private defence contractor for instance, the sensibility of the information potentially accessed automatically scales up the potential threat it poses. State officials do not particularly need to feel confident that a state actor is behind the attack to become involved in the attribution process. The mere potentiality that the damage can be important is sufficient to reflect a deviation from the criminal attribution process.\n## 2.3 The apparent origin of the instigator State officials are often cognisant that the IP address showing the origin of an attack from a particular state can be deceptive. Hackers can easily falsify the address, and use it for instance to pit one state against another, or to use underlying existing strained relations to spark an escalation of tensions. The apparent origin of the instigator can justify the implication of state officials for at least two reasons. Firstly, officials from the victim state may need to intervene to coerce the seemingly state of origin into providing more information about the attackers. Secondly, the apparent origin of the attack may be from a country that the victim state regards as an adversary. Each state has at least a vague idea of who their enemies are, or who they regard as a threat. The instability of the political situation with the enemy state can lead even a small incident with low damage to an escalation of tensions. Again, the involvement of political actors will be necessary to make a trade-off in order to decide if pursuing the investigation is possible and worth taking the risk of a political setback in case of refusal for cooperation.\n## 2.4 The means of the attack Instigators of cyber attacks have a wide variety of tools at their disposal to commit cyber attacks. Attackers can discover a new vulnerability in a system and exploit it. While finding new vulnerabilities is difficult and time-consuming, it also indicates a level of technical sophistication to which analysts of cyber attacks have not remained insensitive. Stuxnet, the worm that destroyed Iranian centrifuges in Natanz in 2010, utilised in its Clement Guitton latest version four of these vulnerabilities. When the cyber security company Kaspersky started examining Stuxnet, it very quickly declared that 'Stuxnet's sophistication, purpose and the intelligence behind it suggest the involvement of a state'. Currently, only certain states and few criminal groups if any possess the means to carry out very sophisticated attacks alike to Stuxnet. Considering the means of attacks, according to analysts' reasoning, allows the group of potential suspects to be narrowed down, and may even indicate state sponsorship. Although it is disputable if sophistication is really of any help to achieve attribution as many different actors can have the skill and resources to engineer 'sophisticated' attacks, it is incontestable that associated with the type of victim organisation it raises the profile of the attack.\n## 2.5 Claims by a political group Any cyber attacks claimed to have been carried out for a political reason, and substantiated by enough evidence, will have to be assessed within its political context. The claim may be unfunded, unrealistic, and an entity other than the claimant may truly be behind the attack. But they will necessitate a certain assessment involving political judgement, and not solely the analysis of technical and forensic evidence. Yet, within a purely criminal context, the police and cyber security firms will lack this political judgement and the authority to wield it. The mere claim by a political group may not be completely sufficient for it to be credible. The level of confidence in the credibility of the claim plays a role in considering the attack still within the realm of criminal justice or as a threat to national security.\n## 3. Descriptions of the attribution processes What is so different between the attribution process of criminal act and the attribution process of threat to national security? Firstly, it is necessary to recognise that the two processes have different goals. While the attribution process of criminal apolitical cases seek to unravel the identity of the individuals launching the cyber attack, the attribution process of cases threatening national security focuses on discovering the sponsorship of an attack. The underlying processes to reach these two different goals are fundamentally different.\n## 3.1 The criminal context Both attribution processes start with the discovery of a breach of an information system and its subsequent classification as an attack (i.e. as malicious and intentional). Following the discovery of the attack, and if none of the five aforementioned criteria apply, the case will follow the path of a criminal investigation, a well-understood process dependent on the country's good functioning of its judicial system. The next steps are then as follows: investigators from cyber security companies or from law enforcement agencies attempt to gain information to find the attacker; investigators find evidence by seizing incriminating material on the person's computer; and lastly, a court validates the inferences made from the collected evidence proving that the person was indeed the criminal using the computer from which the cyber attack was launched. In this regard, the way digital forensics are collected need to respect high standards to show that the police did not tamper with them, and that the defendant's actions, and not only his machine, caused the alleged attack 'beyond reasonable doubt'.\nThe access to evidence is predicated on first finding information about the identity of the individual. Finding information can broadly occur from three different ways: from discovering forensics left behind the attack, from information tracing back the attack to its origin (e.g. an IP address, the place where a malware first appeared), or from informants. This information does not usually prove 'beyond reasonable doubt' the individual's involvement in the attack, but evidence seized on his computer can. Two complications in the acquisition of information and evidence often arise, as many cases are spread across several jurisdictions. Firstly, the victim country's law enforcement agencies will require cooperation from the state hosting the Internet service provider which assigned the attacker's IP address. The state where the attack originated will have to request the service provider to give the match between the IP address and a name, before relaying this information to the victim country. Both steps are strongly contingent upon the state of affairs between the two countries and the tools at the disposal of the victim state to incentivise or coerce the other state into cooperating. Secondly, gathering evidence, which requires physical access to the accused's computers, can also be sensitive. Law enforcement in the originating country may be willing to seize evidence based on the information provided by their foreign counterpart, but in function of their decision to prosecute the attacker in their country or not, they may be unwilling to share the collected evidence. In case they refuse to extradite the attacker, the country in which the attacker was located will still rely upon the victim country to exchange information about the attack it suffered in order to successfully convict the accused. These legally time-consuming and twisted procedures are mostly formalised within mutual legal assistance treaties. However, the lack of an existing treaty covering cyber attacks does not have to thwart the attribution process, as much as the existence of a treaty between two countries does not ensure its applicability. Politics often trump the law, even for the attribution process in a criminal context where cooperation to exchange information or to extradite attackers is mainly dependent on political will.\nLastly, the conviction of the attacker by a court represents the highest level of attribution possible in a criminal context. But even if the court does not convict the attacker, it can remain clear that he is the one to whom the cyber attacks are attributable. The lack of legal framework criminalising cyber attacks or the high cost of the trial involving flying witnesses over from another country have in the past prevented conviction despite the accused admitting to the charges. A conviction by a court, while preferable, is hence not an absolute necessity.\n## 3.2 The national security context Within the national security context, the access to evidence is much more difficult. The four-step process for attribution of criminal cases (discovery of the attack, finding information, finding evidence, and conviction) becomes the following four-step process: discovery of the attack, finding information, formulating an assessment, and publicly acting upon the assessment. The first two steps are similar to the attribution process in a criminal context.\nThe entities formulating the assessment of attribution in cases of national security are more various than in criminal cases where only the court has the monopoly of doing so, but formal attribution still only occurs via a single formal channel, a representative of the government. The assessment by state institutions and the decision to attribute are the only forms of 'binding' attribution that will bear consequences, as the state is the only institution with the authority to take a decision of attribution accepted and recognised by whom they affect. Placing the onus on governmental institutions rather than on judicial entities for attribution has several implications. The methodology changes from the mere assessment of digital forensics to using political judgement; the standard of evidence becomes lower and proving 'beyond reasonable doubt' is not required anymore; the stakes in play are by nature political; and the timing for attribution, while important when the judiciary would pronounce a verdict, is far more crucial when it is a form of political act carried out by a political entity.\nAccepting political judgement as a methodology for attribution also implies accepting that attribution in some cases fall between beliefs and reasons, is prone to expectation biases, and operates in an environment mainly defined by an acute lack of certain information (6, 2011: 21). The difficulty of accessing evidence and the dependence on intelligence rather than evidence for attribution in this context confirms the appropriateness of resorting to this methodology. Good judgement will however rest upon the analysts being able to show the thought process as being as removed from feelings and preconceived ideas as possible, and following strict methodologies to ensure it.\nIn this light, the most appropriate organisation to formulate judgements will be intelligence services. Intelligence services bring together both the political and technical expertise required for attribution. Analysts from private companies specialising in cyber security, such as Kaspersky and Symantec, can also mention potential authors for the attacks when they report new attack vectors. But while these companies are at the forefront of technical developments in cyber security, they certainly lack the experience of heeding political elements to ascertain the origin of attacks. On the other hand, investigative journalists have the experience of taking into account in their analysis political elements, but not technical ones. Furthermore, as they use non-technical investigation techniques, they also bring other pieces of information relevant to the assessment of sponsorship of attacks. For instance, the sponsors of Stuxnet, namely the US and Israel, only emerged when unnamed US officials with knowledge of the operation leaked information to David Sanger, a journalist at The New York Times.\nJournalists very often protect their sources and it is not possible to independently verify their sources' credibility. The lack of verifiability of the information, either collected by investigative journalists or its analysis by state officials, is a defining constraint for incidents falling within the attribution process of national security incidents. Relevant information feeding into political judgement, apart from being non-testable in contrast to evidence presented in front of a court, is also mainly non-technical. Technical evidence is indeed not best suited to inform on sponsorship, which is what attribution is set to achieve in this context. Instead of using technical forensics, human intelligence gained from informants and whistle-blowers is more appropriate. This means that investigators of incidents of national threats are more interested in intelligence than in digital forensic evidence, when the opposite is true for the attribution of criminal cases.\nIntelligence services are also well acquainted with the task of estimating their adversary's strength and capabilities to launch attacks, which a priori could help narrow down the number of potential attackers if one assumes that sophistication can inform on state-sponsorship – a contestable thesis regarding that criminals can also engineer sophisticated attacks. The 'strength' variable can however be difficult to estimate for cyber attacks, especially in comparison with estimating the military strength of a country. It is much easier to subcontract cyber attacks and buy zero day exploits in a hacker underground market than it is to buy military grade weapons. Furthermore, hiring a single very talented hacker can be sufficient to engineer malware with far ranging effects. It is hence difficult to assess with high certainty any groups' capability to launch cyber attacks. Such a difficulty hinders the work of intelligence services to neatly differentiate between potential enemies with capabilities and those with only low resources to launch cyber attacks. Further blurring the picture, it is strategically advantageous for actors to hide their offensive capabilities as much as possible. Such a conclusion can appear at first counter intuitive considering that on the other hand displaying one's capabilities can act as a deterrent measure against an adversary. However, if the adversary knows that the likeliness for a threat of retaliation is low due to the uncertainty of attribution, deterrence is unlikely to function. Keeping possibilities of using covert cyber attacks as a tool for foreign policy hence becomes a reasonable strategic decision.\nBut once intelligence services attribute an attack, and as the intelligence services are by design an opaque structure, the decision of making the attribution public is somewhat a completely different decision. This decision differs from the judgement pronounced by a court in two regards. Firstly, the decision, by the nature of the parties potentially involved as state actors or as terrorist organisations, becomes a political decision for a state official to take. The decision to make attribution public also requires political judgement to balance the risks of misattribution, certainty, timing, and potential benefits of attributing the attack. The decision is likely to be taken by senior and high elected officials only. As Francis Maude, British Minister for Cabinet Office, pointed out in a hearing in the House of Commons (2012), 'if something looked like it could be a sovereign attack', the judgement of deciding sponsorship 'would clearly be for the Prime Minister' to make. Secondly, a legal judgement aims at instating justice, while a political judgement has wider possible ramifications. Following an assessment of the potential instigators of an attack, state officials can refuse to publicly name an attacker as a state with which they have strategic partnerships in order to preserve economic ties with the country. Such a decision will have followed the different steps of the attribution process, and stopped at the third one. Refusing to publicly name the attacker would be morally wrong, as the victim state would fail in its duty of owing transparency and the truth to its citizens. But it could also be a politically shrewd decision. As the level of damage caused by cyber attacks increases, the political argument will increasingly trump the moral one, leading to more frequent formal attribution.\n# 4. Conclusion The new proposed model for attribution challenges three previously accepted arguments. Firstly, it challenges that attribution is a problem and posits that it is better described as a process. Secondly, it challenges that attribution is mainly a technical issue. Lastly, it challenges that identifying a criminal and identifying the sponsor of an attack follow similar characteristics. Brought under the common umbrella term of 'attribution problem', many officials and researchers have as such advocated the same solutions for what appears in fact as two distinct attribution processes. The process within which a case falls determines the responsible authority (judiciary vs. executive), the methodology (digital forensics vs. political judgement), the standard of evidence ('beyond reasonable doubt' vs. dependent upon judgement), the stake in play (individual vs. political), and finally, the timing (irrelevant vs. critical) that will apply for attribution. The separation of attribution into two processes leads to the conclusion that they face different constraints with different requirements to relax these constraints.",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "91\n# Modelling Attribution\nClement Guitton\nWar Studies, King's College London, UK\nclement.guitton@kcl.ac.uk\nAbstract: This article posits that attribution is better approached as a process than as a problem. Departing from models for attribution emphasising its technical constraints, the article distinguishes between two distinct attribution processes operating in two different contexts and answering two different questions. On one hand, in a criminal context, the attribution process seeks to identify individuals who launched cyber attacks. On the other hand, in a national security context, the process seeks to identify adversaries which may have sponsored cyber attacks. Five elements can serve as determinants to distinguish between the two processes: the type of target, the severity and scale of the damage, the apparent origin of the instigator of the attack, the means of the attack, and lastly the claims by political groups. After reviewing these elements, the article analyses how the constraints and characteristics of the two different attribution processes vary in terms of responsible authority, standard of evidence, stake in play and relevance of timing for attribution. In a criminal context, the collection of digital evidence is of primary importance to be able to reach a high level of judicial proof. However, in a national security context, investigators will likely not have access to evidence but only to intelligence, and the decision of attribution will not be taken within the judiciary but within the executive (e.g. a government). As such, attribution of national security incidents requires a form of political judgement to heed the political context and circumstances of the incidents that courts do not need to consider when examining the guilt of criminals. Political judgement is also required to balance the consequences of attribution on a political level, potentially resulting in a straining of relations with other international actors. As the constraints between the two different attribution processes differ, their requirements for easing the constraints also vary.\nKeywords: attribution, sponsorship, cyber attacks, national security threats\n# 1. Introduction\nIn August 2012, a malware called Shamoon infected the computers of Saudi Arabia's national oil company Aramco, and wiped out the hard drives of 30,000 computers. The attack prompted US Secretary of Defense Leon Panetta to mention the attack in a widely quoted speech in front of business executives (Panetta, 2012) and to answer further questions in a briefing at the Pentagon (Panetta and Dempsey, 2012). While Panetta fell short in his speech of accusing Iran for the attacks, a journalist, quoting an unnamed US government official mentioned that Iranian hackers carried out the attack with the support from the Iranian government (The Associated Press, 2012). Officially, the attack remains unattributed to this day. In contrast, many other malware have in the past infected many computers without prompting high political officials to react about the identity of the instigators. For instance, in 2004, the Sasser worm infected millions of computers including those of rail systems in New South Wales, the Italian Interior Ministry, the European Commission and British coastguard stations (Jesdanun, 2004) without stirring such a response. The police later found its author, Sven Jaschan, thanks to an information reward program set up by Microsoft (Lemos, 2005).\nHow and why does the attribution of an incident become politicised? Does attribution require the involvement of political figures? How do the processes of attributing a criminal incident and attributing an incident of national security relevance differ?\nAs attribution informs states' responses to cyber attacks, finding answers to these questions is essential. But there is currently no overall model for attribution that can answer these questions and explain how attribution occurs by taking into account the disparities between the responsible authorities, the standards of evidence, the stakes in play and the relevance of timing for attribution of cases either similar to the Aramco incident or to the Sasser worm. This article proposes such a model for attribution based on the nature of the attribution process either as apolitical or political. Apolitical cases are cases of purely criminal nature that do not rise to the level of 'national threat'. When an incident crosses the 'national threat' threshold, the question of knowing the identity of the attackers becomes less relevant than knowing who the enemy is, for instance a state actor or a terrorist organisation. The process of reaching conclusions on the identity of the instigator or on the\nClement Guitton\nsponsorship of an attack differs in great regards. Assessing enmity is a matter of political judgement, and not for a domestic court to decide. Evidence to support the judgement for enmity hence does not have to reach the level of judicial proof that the conviction of a criminal requires. Distinguishing between the two processes allow the discernment of solutions to the attribution problem that is inherently political in some instances, and not technical as often characterised.\nThis article presents the model, namely the two attribution processes, in two steps. Firstly, it shows the criteria that lead to the politicisation of incidents. Secondly, it delves into the different characteristics of these two distinct processes.\n## 2. Politicised attribution: A set of conditions for the model\nThree main models have previously emerged to characterise attribution, one having its root in computer science, a second one in political science, and a third one in both fields. Firstly, the cyber security expert Tom Parker suggested assigning values to three variables to characterise the attacker: the attacker's intrinsic characteristics (e.g. resources, motivation), the target, and the general environment of the attack (Parker et al., 2004). Within this model, analysts compute values using Bayesian probabilities obliging them to assess the certainty of assumptions and known information. But this model suffers two pitfalls: many variables do not lend themselves to being ascribed numerical values; and Parker's attempt to draw the line between criminal and terrorist cyber attacks based on the unknown motivation of the attacker is unrealistic. The motivation of an attacker usually follows at least partial attribution, and does not precede it.\nSecondly, the lawyer Susanne W. Brenner proposed a model for attribution as a political decision based on the trichotomy war – terrorism – crime, a trichotomy whose relevance she acknowledged is eroding in cyberspace (Brenner, 2009: 96). Brenner suggested starting with attempting to classify the incident within this trichotomy also based on three variables: the origin, the target, and the motive for the attack (Brenner, 2009: 87). Yet, determining if an incident is an act of war, hence originating from a state actor, requires solving attribution first, a problem Brenner also acknowledged. Brenner's solution to the eroding relevance of the trichotomy focused on the dilemma the erosion poses on an institutional level between military and civilian entities involved in responding to the threat rather than on the core problem it poses for attribution (Brenner, 2013). Such a solution did not address the main flaw in her model for attribution, namely that knowing the sponsorship of an attack cannot be at the same time the sought solution of the problem, and the variable on which the problem depends.\nLastly, the computer scientists David Clark, Susan Landau and Earl Boebert have separated the attribution problem into two sub-problems: one technical and consisting in identifying the attacking machine, and one human consisting in identifying the machine's owners and potentially their sponsor (Clark and Landau, 2010: 37; Boebert, 2010: 43). The computer scientists delved into technical procedures to attribute a machine and left aside the details of the identification of individuals and sponsors. While much research has been carried out to improve tracing back attacks (Wheeler et al., 2003; Clayton, 2005), many researchers have also acknowledged that technical considerations alone cannot be sufficient to solve the attribution problem (Hunker et al., 2008: 10; Clark and Landau, 2010: 39). It is hence important to continue expending the model for attribution of cyber attacks without focusing on its technological aspects. The focus away from technology is further justified as political considerations dwarf technical ones when the incident meets certain criteria constraining the access to evidence.\nTo remedy the shortcomings of each of the three existing models, attribution can be approached as two distinct processes: on one hand, as an apolitical process following well-established criminal procedures; and on the other hand, as an act requiring a political decision, such as classifying an incident as an act of war or terrorism. Considering attribution as a process and not as a problem allows the identification of steps where different questions arise with different saliency within the process. For instance, only when attribution is politicised does the question of the different degrees of involvement of a state arise (Healey, 2012), as well as strategic questions about instrumental use of cyber attacks as covert means to achieve foreign policy objectives (Libicki, 2012).\nThe determinants indicating which process an incident fall within need to be assessable from the outset of the investigation and cannot rely on the formulation of early assumptions, as Parker's and Brenner's model\n92\nClement Guitton\nrequired for determining the motive of the attack. Five determinants influence the attribution of an incident as becoming the resort of politics rather than of the criminal justice system.\n## 2.1 The target\nThe profile of the attack rises in function of the target according to two different elements: firstly, the political nature of the target, and secondly, the threat to national security that the target can constitute. Attackers can focus on these two types of targets in an instrumental way to try to weaken a state and achieve a political objective.\nTargets creating a threat to national security are attacks either on critical national infrastructures (e.g. Stuxnet), or on companies losing their intellectual property on a great scale. The loss of intellectual property impacts companies' productivity and, in turn, harms the national economies of countries hosting them. In the UK, tackling the threat to the economy is the very first objective of its national cyber security strategy, aiming at placing the UK as 'one of the most secure places in the world to do business in cyberspace' (Cabinet Office, 2011: 8). The theft of intellectual property via cyber attacks is therefore a topic taken seriously as a threat to national security, and is as such, approached by high-ranking officials.\nNot all attacks on companies that correspond to corporate espionage will fall within the national security threat category. Rogue corporations, even within the same country, can attack each other to gain economic advantages. Solely considering a company victim of espionage may therefore not be sufficient to raise the political profile of the attack. But the systematic loss of intellectual property from a range of companies is sufficient to constitute an economic threat for the victim country.\n## 2.2 The severity and scale of the damage\nOne of the reasons the targeting of critical infrastructure moves attribution to the higher end of the political spectrum is because of the high severity of damage an attack can potentially cause. The assessment of the severity of an attack is not always evident. In espionage cases, the severity is dependent upon the information accessed by the hackers. But in most cases it is difficult to know which information the attacker accessed, and what the attacker will do with this information. Based on the information that a victim company provides to law enforcement agencies, state officials can attempt to gauge the severity of an attack and assess if it crosses the threshold of threat to national security. In the case of an attack on a ministry or on a private defence contractor for instance, the sensibility of the information potentially accessed automatically scales up the potential threat it poses. State officials do not particularly need to feel confident that a state actor is behind the attack to become involved in the attribution process. The mere potentiality that the damage can be important is sufficient to reflect a deviation from the criminal attribution process.\n## 2.3 The apparent origin of the instigator\nState officials are often cognisant that the IP address showing the origin of an attack from a particular state can be deceptive. Hackers can easily falsify the address, and use it for instance to pit one state against another, or to use underlying existing strained relations to spark an escalation of tensions. The apparent origin of the instigator can justify the implication of state officials for at least two reasons. Firstly, officials from the victim state may need to intervene to coerce the seemingly state of origin into providing more information about the attackers. Secondly, the apparent origin of the attack may be from a country that the victim state regards as an adversary. Each state has at least a vague idea of who their enemies are, or who they regard as a threat. The instability of the political situation with the enemy state can lead even a small incident with low damage to an escalation of tensions. Again, the involvement of political actors will be necessary to make a trade-off in order to decide if pursuing the investigation is possible and worth taking the risk of a political setback in case of refusal for cooperation.\n## 2.4 The means of the attack\nInstigators of cyber attacks have a wide variety of tools at their disposal to commit cyber attacks. Attackers can discover a new vulnerability in a system and exploit it. While finding new vulnerabilities is difficult and time-consuming, it also indicates a level of technical sophistication to which analysts of cyber attacks have not remained insensitive. Stuxnet, the worm that destroyed Iranian centrifuges in Natanz in 2010, utilised in its\nClement Guitton\nlatest version four of these vulnerabilities. When the cyber security company Kaspersky started examining Stuxnet, it very quickly declared that 'Stuxnet's sophistication, purpose and the intelligence behind it suggest the involvement of a state' (Halliday, 2010). Currently, only certain states and few criminal groups if any possess the means to carry out very sophisticated attacks alike to Stuxnet. Considering the means of attacks, according to analysts' reasoning, allows the group of potential suspects to be narrowed down, and may even indicate state sponsorship. Although it is disputable if sophistication is really of any help to achieve attribution as many different actors can have the skill and resources to engineer 'sophisticated' attacks, it is incontestable that associated with the type of victim organisation it raises the profile of the attack.\n## 2.5 Claims by a political group\nAny cyber attacks claimed to have been carried out for a political reason, and substantiated by enough evidence, will have to be assessed within its political context. The claim may be unfunded, unrealistic, and an entity other than the claimant may truly be behind the attack. But they will necessitate a certain assessment involving political judgement, and not solely the analysis of technical and forensic evidence. Yet, within a purely criminal context, the police and cyber security firms will lack this political judgement and the authority to wield it. The mere claim by a political group may not be completely sufficient for it to be credible. The level of confidence in the credibility of the claim plays a role in considering the attack still within the realm of criminal justice or as a threat to national security.\n## 3. Descriptions of the attribution processes\nWhat is so different between the attribution process of criminal act and the attribution process of threat to national security? Firstly, it is necessary to recognise that the two processes have different goals. While the attribution process of criminal apolitical cases seek to unravel the identity of the individuals launching the cyber attack, the attribution process of cases threatening national security focuses on discovering the sponsorship of an attack. The underlying processes to reach these two different goals are fundamentally different.\n## 3.1 The criminal context\nBoth attribution processes start with the discovery of a breach of an information system and its subsequent classification as an attack (i.e. as malicious and intentional). Following the discovery of the attack, and if none of the five aforementioned criteria apply, the case will follow the path of a criminal investigation, a well-understood process dependent on the country's good functioning of its judicial system. The next steps are then as follows: investigators from cyber security companies or from law enforcement agencies attempt to gain information to find the attacker; investigators find evidence by seizing incriminating material on the person's computer; and lastly, a court validates the inferences made from the collected evidence proving that the person was indeed the criminal using the computer from which the cyber attack was launched. In this regard, the way digital forensics are collected need to respect high standards to show that the police did not tamper with them, and that the defendant's actions, and not only his machine, caused the alleged attack 'beyond reasonable doubt'.\nThe access to evidence is predicated on first finding information about the identity of the individual. Finding information can broadly occur from three different ways: from discovering forensics left behind the attack, from information tracing back the attack to its origin (e.g. an IP address, the place where a malware first appeared), or from informants. This information does not usually prove 'beyond reasonable doubt' the individual's involvement in the attack, but evidence seized on his computer can. Two complications in the acquisition of information and evidence often arise, as many cases are spread across several jurisdictions. Firstly, the victim country's law enforcement agencies will require cooperation from the state hosting the Internet service provider which assigned the attacker's IP address. The state where the attack originated will have to request the service provider to give the match between the IP address and a name, before relaying this information to the victim country. Both steps are strongly contingent upon the state of affairs between the two countries and the tools at the disposal of the victim state to incentivise or coerce the other state into cooperating. Secondly, gathering evidence, which requires physical access to the accused's computers, can also be sensitive. Law enforcement in the originating country may be willing to seize evidence based on the information provided by their foreign counterpart, but in function of their decision to prosecute the attacker in their country or not, they may be unwilling to share the collected evidence. In case they refuse to extradite the\n94\nClement Guitton\nattacker, the country in which the attacker was located will still rely upon the victim country to exchange information about the attack it suffered in order to successfully convict the accused. These legally time-consuming and twisted procedures are mostly formalised within mutual legal assistance treaties. However, the lack of an existing treaty covering cyber attacks does not have to thwart the attribution process, as much as the existence of a treaty between two countries does not ensure its applicability. Politics often trump the law, even for the attribution process in a criminal context where cooperation to exchange information or to extradite attackers is mainly dependent on political will.\nLastly, the conviction of the attacker by a court represents the highest level of attribution possible in a criminal context. But even if the court does not convict the attacker, it can remain clear that he is the one to whom the cyber attacks are attributable. The lack of legal framework criminalising cyber attacks or the high cost of the trial involving flying witnesses over from another country have in the past prevented conviction despite the accused admitting to the charges. A conviction by a court, while preferable, is hence not an absolute necessity.\n## 3.2 The national security context\nWithin the national security context, the access to evidence is much more difficult. The four-step process for attribution of criminal cases (discovery of the attack, finding information, finding evidence, and conviction) becomes the following four-step process: discovery of the attack, finding information, formulating an assessment, and publicly acting upon the assessment. The first two steps are similar to the attribution process in a criminal context.\nThe entities formulating the assessment of attribution in cases of national security are more various than in criminal cases where only the court has the monopoly of doing so, but formal attribution still only occurs via a single formal channel, a representative of the government. The assessment by state institutions and the decision to attribute are the only forms of 'binding' attribution that will bear consequences, as the state is the only institution with the authority to take a decision of attribution accepted and recognised by whom they affect. Placing the onus on governmental institutions rather than on judicial entities for attribution has several implications. The methodology changes from the mere assessment of digital forensics to using political judgement; the standard of evidence becomes lower and proving 'beyond reasonable doubt' is not required anymore; the stakes in play are by nature political; and the timing for attribution, while important when the judiciary would pronounce a verdict, is far more crucial when it is a form of political act carried out by a political entity.\nAccepting political judgement as a methodology for attribution (Lin, 2012: 350) also implies accepting that attribution in some cases fall between beliefs and reasons (Arendt, 1992: 4), is prone to expectation biases, and operates in an environment mainly defined by an acute lack of certain information (6, 2011: 21). The difficulty of accessing evidence and the dependence on intelligence rather than evidence for attribution in this context confirms the appropriateness of resorting to this methodology. Good judgement will however rest upon the analysts being able to show the thought process as being as removed from feelings and preconceived ideas as possible, and following strict methodologies to ensure it (Heuer, 1999).\nIn this light, the most appropriate organisation to formulate judgements will be intelligence services. Intelligence services bring together both the political and technical expertise required for attribution. Analysts from private companies specialising in cyber security, such as Kaspersky and Symantec, can also mention potential authors for the attacks when they report new attack vectors. But while these companies are at the forefront of technical developments in cyber security, they certainly lack the experience of heeding political elements to ascertain the origin of attacks. On the other hand, investigative journalists have the experience of taking into account in their analysis political elements, but not technical ones. Furthermore, as they use non-technical investigation techniques, they also bring other pieces of information relevant to the assessment of sponsorship of attacks. For instance, the sponsors of Stuxnet, namely the US and Israel, only emerged when unnamed US officials with knowledge of the operation leaked information to David Sanger, a journalist at The New York Times (Sanger, 2012).\nJournalists very often protect their sources and it is not possible to independently verify their sources' credibility. The lack of verifiability of the information, either collected by investigative journalists or its analysis by state officials, is a defining constraint for incidents falling within the attribution process of national security\n95\nClement Guitton\nincidents. Relevant information feeding into political judgement, apart from being non-testable in contrast to evidence presented in front of a court, is also mainly non-technical. Technical evidence is indeed not best suited to inform on sponsorship, which is what attribution is set to achieve in this context. Instead of using technical forensics, human intelligence gained from informants and whistle-blowers is more appropriate. This means that investigators of incidents of national threats are more interested in intelligence than in digital forensic evidence, when the opposite is true for the attribution of criminal cases.\nIntelligence services are also well acquainted with the task of estimating their adversary's strength and capabilities to launch attacks, which a priori could help narrow down the number of potential attackers if one assumes that sophistication can inform on state-sponsorship – a contestable thesis regarding that criminals can also engineer sophisticated attacks. The 'strength' variable can however be difficult to estimate for cyber attacks, especially in comparison with estimating the military strength of a country. It is much easier to subcontract cyber attacks and buy zero day exploits in a hacker underground market than it is to buy military grade weapons. Furthermore, hiring a single very talented hacker can be sufficient to engineer malware with far ranging effects. It is hence difficult to assess with high certainty any groups' capability to launch cyber attacks. Such a difficulty hinders the work of intelligence services to neatly differentiate between potential enemies with capabilities and those with only low resources to launch cyber attacks. Further blurring the picture, it is strategically advantageous for actors to hide their offensive capabilities as much as possible. Such a conclusion can appear at first counter intuitive considering that on the other hand displaying one's capabilities can act as a deterrent measure against an adversary. However, if the adversary knows that the likeliness for a threat of retaliation is low due to the uncertainty of attribution, deterrence is unlikely to function. Keeping possibilities of using covert cyber attacks as a tool for foreign policy hence becomes a reasonable strategic decision.\nBut once intelligence services attribute an attack, and as the intelligence services are by design an opaque structure, the decision of making the attribution public is somewhat a completely different decision. This decision differs from the judgement pronounced by a court in two regards. Firstly, the decision, by the nature of the parties potentially involved as state actors or as terrorist organisations, becomes a political decision for a state official to take. The decision to make attribution public also requires political judgement to balance the risks of misattribution, certainty, timing, and potential benefits of attributing the attack. The decision is likely to be taken by senior and high elected officials only. As Francis Maude, British Minister for Cabinet Office, pointed out in a hearing in the House of Commons (2012), 'if something looked like it could be a sovereign attack', the judgement of deciding sponsorship 'would clearly be for the Prime Minister' to make. Secondly, a legal judgement aims at instating justice, while a political judgement has wider possible ramifications. Following an assessment of the potential instigators of an attack, state officials can refuse to publicly name an attacker as a state with which they have strategic partnerships in order to preserve economic ties with the country. Such a decision will have followed the different steps of the attribution process, and stopped at the third one. Refusing to publicly name the attacker would be morally wrong, as the victim state would fail in its duty of owing transparency and the truth to its citizens. But it could also be a politically shrewd decision. As the level of damage caused by cyber attacks increases, the political argument will increasingly trump the moral one, leading to more frequent formal attribution.\n# 4. Conclusion\nThe new proposed model for attribution challenges three previously accepted arguments. Firstly, it challenges that attribution is a problem and posits that it is better described as a process. Secondly, it challenges that attribution is mainly a technical issue. Lastly, it challenges that identifying a criminal and identifying the sponsor of an attack follow similar characteristics. Brought under the common umbrella term of 'attribution problem', many officials and researchers have as such advocated the same solutions for what appears in fact as two distinct attribution processes. The process within which a case falls determines the responsible authority (judiciary vs. executive), the methodology (digital forensics vs. political judgement), the standard of evidence ('beyond reasonable doubt' vs. dependent upon judgement), the stake in play (individual vs. political), and finally, the timing (irrelevant vs. critical) that will apply for attribution. The separation of attribution into two processes leads to the conclusion that they face different constraints with different requirements to relax these constraints.\n96\nClement Guitton"
    },
    "numeric": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "91\n# Modelling Attribution\nClement Guitton\nWar Studies, King's College London, UK\nclement.guitton@kcl.ac.uk\nAbstract: This article posits that attribution is better approached as a process than as a problem. Departing from models for attribution emphasising its technical constraints, the article distinguishes between two distinct attribution processes operating in two different contexts and answering two different questions. On one hand, in a criminal context, the attribution process seeks to identify individuals who launched cyber attacks. On the other hand, in a national security context, the process seeks to identify adversaries which may have sponsored cyber attacks. Five elements can serve as determinants to distinguish between the two processes: the type of target, the severity and scale of the damage, the apparent origin of the instigator of the attack, the means of the attack, and lastly the claims by political groups. After reviewing these elements, the article analyses how the constraints and characteristics of the two different attribution processes vary in terms of responsible authority, standard of evidence, stake in play and relevance of timing for attribution. In a criminal context, the collection of digital evidence is of primary importance to be able to reach a high level of judicial proof. However, in a national security context, investigators will likely not have access to evidence but only to intelligence, and the decision of attribution will not be taken within the judiciary but within the executive (e.g. a government). As such, attribution of national security incidents requires a form of political judgement to heed the political context and circumstances of the incidents that courts do not need to consider when examining the guilt of criminals. Political judgement is also required to balance the consequences of attribution on a political level, potentially resulting in a straining of relations with other international actors. As the constraints between the two different attribution processes differ, their requirements for easing the constraints also vary.\nKeywords: attribution, sponsorship, cyber attacks, national security threats\n# 1. Introduction\nIn August 2012, a malware called Shamoon infected the computers of Saudi Arabia's national oil company Aramco, and wiped out the hard drives of 30,000 computers. The attack prompted US Secretary of Defense Leon Panetta to mention the attack in a widely quoted speech in front of business executives (Panetta, 2012) and to answer further questions in a briefing at the Pentagon (Panetta and Dempsey, 2012). While Panetta fell short in his speech of accusing Iran for the attacks, a journalist, quoting an unnamed US government official mentioned that Iranian hackers carried out the attack with the support from the Iranian government (The Associated Press, 2012). Officially, the attack remains unattributed to this day. In contrast, many other malware have in the past infected many computers without prompting high political officials to react about the identity of the instigators. For instance, in 2004, the Sasser worm infected millions of computers including those of rail systems in New South Wales, the Italian Interior Ministry, the European Commission and British coastguard stations (Jesdanun, 2004) without stirring such a response. The police later found its author, Sven Jaschan, thanks to an information reward program set up by Microsoft (Lemos, 2005).\nHow and why does the attribution of an incident become politicised? Does attribution require the involvement of political figures? How do the processes of attributing a criminal incident and attributing an incident of national security relevance differ?\nAs attribution informs states' responses to cyber attacks, finding answers to these questions is essential. But there is currently no overall model for attribution that can answer these questions and explain how attribution occurs by taking into account the disparities between the responsible authorities, the standards of evidence, the stakes in play and the relevance of timing for attribution of cases either similar to the Aramco incident or to the Sasser worm. This article proposes such a model for attribution based on the nature of the attribution process either as apolitical or political. Apolitical cases are cases of purely criminal nature that do not rise to the level of 'national threat'. When an incident crosses the 'national threat' threshold, the question of knowing the identity of the attackers becomes less relevant than knowing who the enemy is, for instance a state actor or a terrorist organisation. The process of reaching conclusions on the identity of the instigator or on the\nClement Guitton\nsponsorship of an attack differs in great regards. Assessing enmity is a matter of political judgement, and not for a domestic court to decide. Evidence to support the judgement for enmity hence does not have to reach the level of judicial proof that the conviction of a criminal requires. Distinguishing between the two processes allow the discernment of solutions to the attribution problem that is inherently political in some instances, and not technical as often characterised.\nThis article presents the model, namely the two attribution processes, in two steps. Firstly, it shows the criteria that lead to the politicisation of incidents. Secondly, it delves into the different characteristics of these two distinct processes.\n## 2. Politicised attribution: A set of conditions for the model\nThree main models have previously emerged to characterise attribution, one having its root in computer science, a second one in political science, and a third one in both fields. Firstly, the cyber security expert Tom Parker suggested assigning values to three variables to characterise the attacker: the attacker's intrinsic characteristics (e.g. resources, motivation), the target, and the general environment of the attack (Parker et al., 2004). Within this model, analysts compute values using Bayesian probabilities obliging them to assess the certainty of assumptions and known information. But this model suffers two pitfalls: many variables do not lend themselves to being ascribed numerical values; and Parker's attempt to draw the line between criminal and terrorist cyber attacks based on the unknown motivation of the attacker is unrealistic. The motivation of an attacker usually follows at least partial attribution, and does not precede it.\nSecondly, the lawyer Susanne W. Brenner proposed a model for attribution as a political decision based on the trichotomy war – terrorism – crime, a trichotomy whose relevance she acknowledged is eroding in cyberspace (Brenner, 2009: 96). Brenner suggested starting with attempting to classify the incident within this trichotomy also based on three variables: the origin, the target, and the motive for the attack (Brenner, 2009: 87). Yet, determining if an incident is an act of war, hence originating from a state actor, requires solving attribution first, a problem Brenner also acknowledged. Brenner's solution to the eroding relevance of the trichotomy focused on the dilemma the erosion poses on an institutional level between military and civilian entities involved in responding to the threat rather than on the core problem it poses for attribution (Brenner, 2013). Such a solution did not address the main flaw in her model for attribution, namely that knowing the sponsorship of an attack cannot be at the same time the sought solution of the problem, and the variable on which the problem depends.\nLastly, the computer scientists David Clark, Susan Landau and Earl Boebert have separated the attribution problem into two sub-problems: one technical and consisting in identifying the attacking machine, and one human consisting in identifying the machine's owners and potentially their sponsor (Clark and Landau, 2010: 37; Boebert, 2010: 43). The computer scientists delved into technical procedures to attribute a machine and left aside the details of the identification of individuals and sponsors. While much research has been carried out to improve tracing back attacks (Wheeler et al., 2003; Clayton, 2005), many researchers have also acknowledged that technical considerations alone cannot be sufficient to solve the attribution problem (Hunker et al., 2008: 10; Clark and Landau, 2010: 39). It is hence important to continue expending the model for attribution of cyber attacks without focusing on its technological aspects. The focus away from technology is further justified as political considerations dwarf technical ones when the incident meets certain criteria constraining the access to evidence.\nTo remedy the shortcomings of each of the three existing models, attribution can be approached as two distinct processes: on one hand, as an apolitical process following well-established criminal procedures; and on the other hand, as an act requiring a political decision, such as classifying an incident as an act of war or terrorism. Considering attribution as a process and not as a problem allows the identification of steps where different questions arise with different saliency within the process. For instance, only when attribution is politicised does the question of the different degrees of involvement of a state arise (Healey, 2012), as well as strategic questions about instrumental use of cyber attacks as covert means to achieve foreign policy objectives (Libicki, 2012).\nThe determinants indicating which process an incident fall within need to be assessable from the outset of the investigation and cannot rely on the formulation of early assumptions, as Parker's and Brenner's model\n92\nClement Guitton\nrequired for determining the motive of the attack. Five determinants influence the attribution of an incident as becoming the resort of politics rather than of the criminal justice system.\n## 2.1 The target\nThe profile of the attack rises in function of the target according to two different elements: firstly, the political nature of the target, and secondly, the threat to national security that the target can constitute. Attackers can focus on these two types of targets in an instrumental way to try to weaken a state and achieve a political objective.\nTargets creating a threat to national security are attacks either on critical national infrastructures (e.g. Stuxnet), or on companies losing their intellectual property on a great scale. The loss of intellectual property impacts companies' productivity and, in turn, harms the national economies of countries hosting them. In the UK, tackling the threat to the economy is the very first objective of its national cyber security strategy, aiming at placing the UK as 'one of the most secure places in the world to do business in cyberspace' (Cabinet Office, 2011: 8). The theft of intellectual property via cyber attacks is therefore a topic taken seriously as a threat to national security, and is as such, approached by high-ranking officials.\nNot all attacks on companies that correspond to corporate espionage will fall within the national security threat category. Rogue corporations, even within the same country, can attack each other to gain economic advantages. Solely considering a company victim of espionage may therefore not be sufficient to raise the political profile of the attack. But the systematic loss of intellectual property from a range of companies is sufficient to constitute an economic threat for the victim country.\n## 2.2 The severity and scale of the damage\nOne of the reasons the targeting of critical infrastructure moves attribution to the higher end of the political spectrum is because of the high severity of damage an attack can potentially cause. The assessment of the severity of an attack is not always evident. In espionage cases, the severity is dependent upon the information accessed by the hackers. But in most cases it is difficult to know which information the attacker accessed, and what the attacker will do with this information. Based on the information that a victim company provides to law enforcement agencies, state officials can attempt to gauge the severity of an attack and assess if it crosses the threshold of threat to national security. In the case of an attack on a ministry or on a private defence contractor for instance, the sensibility of the information potentially accessed automatically scales up the potential threat it poses. State officials do not particularly need to feel confident that a state actor is behind the attack to become involved in the attribution process. The mere potentiality that the damage can be important is sufficient to reflect a deviation from the criminal attribution process.\n## 2.3 The apparent origin of the instigator\nState officials are often cognisant that the IP address showing the origin of an attack from a particular state can be deceptive. Hackers can easily falsify the address, and use it for instance to pit one state against another, or to use underlying existing strained relations to spark an escalation of tensions. The apparent origin of the instigator can justify the implication of state officials for at least two reasons. Firstly, officials from the victim state may need to intervene to coerce the seemingly state of origin into providing more information about the attackers. Secondly, the apparent origin of the attack may be from a country that the victim state regards as an adversary. Each state has at least a vague idea of who their enemies are, or who they regard as a threat. The instability of the political situation with the enemy state can lead even a small incident with low damage to an escalation of tensions. Again, the involvement of political actors will be necessary to make a trade-off in order to decide if pursuing the investigation is possible and worth taking the risk of a political setback in case of refusal for cooperation.\n## 2.4 The means of the attack\nInstigators of cyber attacks have a wide variety of tools at their disposal to commit cyber attacks. Attackers can discover a new vulnerability in a system and exploit it. While finding new vulnerabilities is difficult and time-consuming, it also indicates a level of technical sophistication to which analysts of cyber attacks have not remained insensitive. Stuxnet, the worm that destroyed Iranian centrifuges in Natanz in 2010, utilised in its\nClement Guitton\nlatest version four of these vulnerabilities. When the cyber security company Kaspersky started examining Stuxnet, it very quickly declared that 'Stuxnet's sophistication, purpose and the intelligence behind it suggest the involvement of a state' (Halliday, 2010). Currently, only certain states and few criminal groups if any possess the means to carry out very sophisticated attacks alike to Stuxnet. Considering the means of attacks, according to analysts' reasoning, allows the group of potential suspects to be narrowed down, and may even indicate state sponsorship. Although it is disputable if sophistication is really of any help to achieve attribution as many different actors can have the skill and resources to engineer 'sophisticated' attacks, it is incontestable that associated with the type of victim organisation it raises the profile of the attack.\n## 2.5 Claims by a political group\nAny cyber attacks claimed to have been carried out for a political reason, and substantiated by enough evidence, will have to be assessed within its political context. The claim may be unfunded, unrealistic, and an entity other than the claimant may truly be behind the attack. But they will necessitate a certain assessment involving political judgement, and not solely the analysis of technical and forensic evidence. Yet, within a purely criminal context, the police and cyber security firms will lack this political judgement and the authority to wield it. The mere claim by a political group may not be completely sufficient for it to be credible. The level of confidence in the credibility of the claim plays a role in considering the attack still within the realm of criminal justice or as a threat to national security.\n## 3. Descriptions of the attribution processes\nWhat is so different between the attribution process of criminal act and the attribution process of threat to national security? Firstly, it is necessary to recognise that the two processes have different goals. While the attribution process of criminal apolitical cases seek to unravel the identity of the individuals launching the cyber attack, the attribution process of cases threatening national security focuses on discovering the sponsorship of an attack. The underlying processes to reach these two different goals are fundamentally different.\n## 3.1 The criminal context\nBoth attribution processes start with the discovery of a breach of an information system and its subsequent classification as an attack (i.e. as malicious and intentional). Following the discovery of the attack, and if none of the five aforementioned criteria apply, the case will follow the path of a criminal investigation, a well-understood process dependent on the country's good functioning of its judicial system. The next steps are then as follows: investigators from cyber security companies or from law enforcement agencies attempt to gain information to find the attacker; investigators find evidence by seizing incriminating material on the person's computer; and lastly, a court validates the inferences made from the collected evidence proving that the person was indeed the criminal using the computer from which the cyber attack was launched. In this regard, the way digital forensics are collected need to respect high standards to show that the police did not tamper with them, and that the defendant's actions, and not only his machine, caused the alleged attack 'beyond reasonable doubt'.\nThe access to evidence is predicated on first finding information about the identity of the individual. Finding information can broadly occur from three different ways: from discovering forensics left behind the attack, from information tracing back the attack to its origin (e.g. an IP address, the place where a malware first appeared), or from informants. This information does not usually prove 'beyond reasonable doubt' the individual's involvement in the attack, but evidence seized on his computer can. Two complications in the acquisition of information and evidence often arise, as many cases are spread across several jurisdictions. Firstly, the victim country's law enforcement agencies will require cooperation from the state hosting the Internet service provider which assigned the attacker's IP address. The state where the attack originated will have to request the service provider to give the match between the IP address and a name, before relaying this information to the victim country. Both steps are strongly contingent upon the state of affairs between the two countries and the tools at the disposal of the victim state to incentivise or coerce the other state into cooperating. Secondly, gathering evidence, which requires physical access to the accused's computers, can also be sensitive. Law enforcement in the originating country may be willing to seize evidence based on the information provided by their foreign counterpart, but in function of their decision to prosecute the attacker in their country or not, they may be unwilling to share the collected evidence. In case they refuse to extradite the\n94\nClement Guitton\nattacker, the country in which the attacker was located will still rely upon the victim country to exchange information about the attack it suffered in order to successfully convict the accused. These legally time-consuming and twisted procedures are mostly formalised within mutual legal assistance treaties. However, the lack of an existing treaty covering cyber attacks does not have to thwart the attribution process, as much as the existence of a treaty between two countries does not ensure its applicability. Politics often trump the law, even for the attribution process in a criminal context where cooperation to exchange information or to extradite attackers is mainly dependent on political will.\nLastly, the conviction of the attacker by a court represents the highest level of attribution possible in a criminal context. But even if the court does not convict the attacker, it can remain clear that he is the one to whom the cyber attacks are attributable. The lack of legal framework criminalising cyber attacks or the high cost of the trial involving flying witnesses over from another country have in the past prevented conviction despite the accused admitting to the charges. A conviction by a court, while preferable, is hence not an absolute necessity.\n## 3.2 The national security context\nWithin the national security context, the access to evidence is much more difficult. The four-step process for attribution of criminal cases (discovery of the attack, finding information, finding evidence, and conviction) becomes the following four-step process: discovery of the attack, finding information, formulating an assessment, and publicly acting upon the assessment. The first two steps are similar to the attribution process in a criminal context.\nThe entities formulating the assessment of attribution in cases of national security are more various than in criminal cases where only the court has the monopoly of doing so, but formal attribution still only occurs via a single formal channel, a representative of the government. The assessment by state institutions and the decision to attribute are the only forms of 'binding' attribution that will bear consequences, as the state is the only institution with the authority to take a decision of attribution accepted and recognised by whom they affect. Placing the onus on governmental institutions rather than on judicial entities for attribution has several implications. The methodology changes from the mere assessment of digital forensics to using political judgement; the standard of evidence becomes lower and proving 'beyond reasonable doubt' is not required anymore; the stakes in play are by nature political; and the timing for attribution, while important when the judiciary would pronounce a verdict, is far more crucial when it is a form of political act carried out by a political entity.\nAccepting political judgement as a methodology for attribution (Lin, 2012: 350) also implies accepting that attribution in some cases fall between beliefs and reasons (Arendt, 1992: 4), is prone to expectation biases, and operates in an environment mainly defined by an acute lack of certain information (6, 2011: 21). The difficulty of accessing evidence and the dependence on intelligence rather than evidence for attribution in this context confirms the appropriateness of resorting to this methodology. Good judgement will however rest upon the analysts being able to show the thought process as being as removed from feelings and preconceived ideas as possible, and following strict methodologies to ensure it (Heuer, 1999).\nIn this light, the most appropriate organisation to formulate judgements will be intelligence services. Intelligence services bring together both the political and technical expertise required for attribution. Analysts from private companies specialising in cyber security, such as Kaspersky and Symantec, can also mention potential authors for the attacks when they report new attack vectors. But while these companies are at the forefront of technical developments in cyber security, they certainly lack the experience of heeding political elements to ascertain the origin of attacks. On the other hand, investigative journalists have the experience of taking into account in their analysis political elements, but not technical ones. Furthermore, as they use non-technical investigation techniques, they also bring other pieces of information relevant to the assessment of sponsorship of attacks. For instance, the sponsors of Stuxnet, namely the US and Israel, only emerged when unnamed US officials with knowledge of the operation leaked information to David Sanger, a journalist at The New York Times (Sanger, 2012).\nJournalists very often protect their sources and it is not possible to independently verify their sources' credibility. The lack of verifiability of the information, either collected by investigative journalists or its analysis by state officials, is a defining constraint for incidents falling within the attribution process of national security\n95\nClement Guitton\nincidents. Relevant information feeding into political judgement, apart from being non-testable in contrast to evidence presented in front of a court, is also mainly non-technical. Technical evidence is indeed not best suited to inform on sponsorship, which is what attribution is set to achieve in this context. Instead of using technical forensics, human intelligence gained from informants and whistle-blowers is more appropriate. This means that investigators of incidents of national threats are more interested in intelligence than in digital forensic evidence, when the opposite is true for the attribution of criminal cases.\nIntelligence services are also well acquainted with the task of estimating their adversary's strength and capabilities to launch attacks, which a priori could help narrow down the number of potential attackers if one assumes that sophistication can inform on state-sponsorship – a contestable thesis regarding that criminals can also engineer sophisticated attacks. The 'strength' variable can however be difficult to estimate for cyber attacks, especially in comparison with estimating the military strength of a country. It is much easier to subcontract cyber attacks and buy zero day exploits in a hacker underground market than it is to buy military grade weapons. Furthermore, hiring a single very talented hacker can be sufficient to engineer malware with far ranging effects. It is hence difficult to assess with high certainty any groups' capability to launch cyber attacks. Such a difficulty hinders the work of intelligence services to neatly differentiate between potential enemies with capabilities and those with only low resources to launch cyber attacks. Further blurring the picture, it is strategically advantageous for actors to hide their offensive capabilities as much as possible. Such a conclusion can appear at first counter intuitive considering that on the other hand displaying one's capabilities can act as a deterrent measure against an adversary. However, if the adversary knows that the likeliness for a threat of retaliation is low due to the uncertainty of attribution, deterrence is unlikely to function. Keeping possibilities of using covert cyber attacks as a tool for foreign policy hence becomes a reasonable strategic decision.\nBut once intelligence services attribute an attack, and as the intelligence services are by design an opaque structure, the decision of making the attribution public is somewhat a completely different decision. This decision differs from the judgement pronounced by a court in two regards. Firstly, the decision, by the nature of the parties potentially involved as state actors or as terrorist organisations, becomes a political decision for a state official to take. The decision to make attribution public also requires political judgement to balance the risks of misattribution, certainty, timing, and potential benefits of attributing the attack. The decision is likely to be taken by senior and high elected officials only. As Francis Maude, British Minister for Cabinet Office, pointed out in a hearing in the House of Commons (2012), 'if something looked like it could be a sovereign attack', the judgement of deciding sponsorship 'would clearly be for the Prime Minister' to make. Secondly, a legal judgement aims at instating justice, while a political judgement has wider possible ramifications. Following an assessment of the potential instigators of an attack, state officials can refuse to publicly name an attacker as a state with which they have strategic partnerships in order to preserve economic ties with the country. Such a decision will have followed the different steps of the attribution process, and stopped at the third one. Refusing to publicly name the attacker would be morally wrong, as the victim state would fail in its duty of owing transparency and the truth to its citizens. But it could also be a politically shrewd decision. As the level of damage caused by cyber attacks increases, the political argument will increasingly trump the moral one, leading to more frequent formal attribution.\n# 4. Conclusion\nThe new proposed model for attribution challenges three previously accepted arguments. Firstly, it challenges that attribution is a problem and posits that it is better described as a process. Secondly, it challenges that attribution is mainly a technical issue. Lastly, it challenges that identifying a criminal and identifying the sponsor of an attack follow similar characteristics. Brought under the common umbrella term of 'attribution problem', many officials and researchers have as such advocated the same solutions for what appears in fact as two distinct attribution processes. The process within which a case falls determines the responsible authority (judiciary vs. executive), the methodology (digital forensics vs. political judgement), the standard of evidence ('beyond reasonable doubt' vs. dependent upon judgement), the stake in play (individual vs. political), and finally, the timing (irrelevant vs. critical) that will apply for attribution. The separation of attribution into two processes leads to the conclusion that they face different constraints with different requirements to relax these constraints.\n96\nClement Guitton"
    },
    "author_year": {
      "total": {
        "intext_total": 18,
        "success_occurrences": 18,
        "success_unique": 16,
        "bib_unique_total": 28,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.5714285714285714,
        "success_percentage": 100.0,
        "style": "author_year"
      },
      "results": [
        {
          "index": "panetta|2012",
          "intext_citation": "(Panetta, 2012)",
          "preceding_text": "The attack prompted US Secretary of Defense Leon Panetta to mention the attack in a widely quoted speech in front of business executives",
          "footnote": "Panetta L. (2012) Text of Speech by Secretary of Defense Leon Panetta. Business Executives for National Security, 11 October."
        },
        {
          "index": "panetta|2012",
          "intext_citation": "(Panetta and Dempsey, 2012)",
          "preceding_text": "ped out the hard drives of 30,000 computers. The attack prompted US Secretary of Defense Leon Panetta to mention the attack in a widely quoted speech in front of business executives (Panetta, 2012) and to answer further questions in a briefing at the Pentagon",
          "footnote": "Panetta L. (2012) Text of Speech by Secretary of Defense Leon Panetta. Business Executives for National Security, 11 October."
        },
        {
          "index": "jesdanun|2004",
          "intext_citation": "(Jesdanun, 2004)",
          "preceding_text": "ls to react about the identity of the instigators. For instance, in 2004, the Sasser worm infected millions of computers including those of rail systems in New South Wales, the Italian Interior Ministry, the European Commission and British coastguard stations",
          "footnote": "Jesdanun A. (2004) New virus snarls hundreds of thousands of machines worldwide. The Associated Press, 3 May."
        },
        {
          "index": "lemos|2005",
          "intext_citation": "(Lemos, 2005)",
          "preceding_text": "The police later found its author, Sven Jaschan, thanks to an information reward program set up by Microsoft",
          "footnote": "Lemos R. (2005) Microsoft to reward informants after Sasser conviction. SecurityFocus, 8 July."
        },
        {
          "index": "parker|2004",
          "intext_citation": "(Parker et al., 2004)",
          "preceding_text": "resources, motivation), the target, and the general environment of the attack",
          "footnote": "Parker T, Devost MG, Sach MH, et al. (2004) Cyber Adversary Characterisation, Rockland: Syngress Publishing."
        },
        {
          "index": "brenner|2009",
          "intext_citation": "(Brenner, 2009: 96)",
          "preceding_text": "Brenner proposed a model for attribution as a political decision based on the trichotomy war – terrorism – crime, a trichotomy whose relevance she acknowledged is eroding in cyberspace",
          "footnote": "Brenner SW. (2009) Cyber Threats: The Emerging Fault Lines of the Nation State, Oxford: Oxford Scholarship Online."
        },
        {
          "index": "brenner|2009",
          "intext_citation": "(Brenner, 2009: 87)",
          "preceding_text": "Brenner suggested starting with attempting to classify the incident within this trichotomy also based on three variables: the origin, the target, and the motive for the attack",
          "footnote": "Brenner SW. (2009) Cyber Threats: The Emerging Fault Lines of the Nation State, Oxford: Oxford Scholarship Online."
        },
        {
          "index": "brenner|2013",
          "intext_citation": "(Brenner, 2013)",
          "preceding_text": "enner's solution to the eroding relevance of the trichotomy focused on the dilemma the erosion poses on an institutional level between military and civilian entities involved in responding to the threat rather than on the core problem it poses for attribution",
          "footnote": "Brenner SW. (2013) Cyber-threats and the Limits of Bureaucratic Control. Minnesota Journal of Law, Science, and Technology 14."
        },
        {
          "index": "clark|2010",
          "intext_citation": "(Clark and Landau, 2010: 37; Boebert, 2010: 43)",
          "preceding_text": "id Clark, Susan Landau and Earl Boebert have separated the attribution problem into two sub-problems: one technical and consisting in identifying the attacking machine, and one human consisting in identifying the machine's owners and potentially their sponsor",
          "footnote": "Clark DD and Landau S. (2010) Untangling Attribution. Workshop on Deterring CyberAttacks: Informing Strategies and Developing Options for U.S. Policy. Washington, DC: The National Academy Press, 25-40."
        },
        {
          "index": "wheeler|2003",
          "intext_citation": "(Wheeler et al., 2003; Clayton, 2005)",
          "preceding_text": "While much research has been carried out to improve tracing back attacks",
          "footnote": "Wheeler DA, Larsen GN and Leader T. (2003) Techniques for Cyber Attack Attribution. Alexandria, Virginia: Institute for Defense Analyses."
        },
        {
          "index": "hunker|2008",
          "intext_citation": "(Hunker et al., 2008: 10; Clark and Landau, 2010: 39)",
          "preceding_text": "als and sponsors. While much research has been carried out to improve tracing back attacks (Wheeler et al., 2003; Clayton, 2005), many researchers have also acknowledged that technical considerations alone cannot be sufficient to solve the attribution problem",
          "footnote": "Hunker J, Hutchinson B and Margulies J. (2008) Role and Challenges for Sufficient Cyber-Attack Attribution. Institute for Information Infrastructure Protection. Hanover, New Hampshire: Dartmouth College."
        },
        {
          "index": "healey|2012",
          "intext_citation": "(Healey, 2012)",
          "preceding_text": "For instance, only when attribution is politicised does the question of the different degrees of involvement of a state arise",
          "footnote": "Healey J. (2012) Beyond Attribution: Seeking National Responsibility for Cyber Attacks. Washington, DC: Atlantic Council, 1-7."
        },
        {
          "index": "libicki|2012",
          "intext_citation": "(Libicki, 2012)",
          "preceding_text": "stance, only when attribution is politicised does the question of the different degrees of involvement of a state arise (Healey, 2012), as well as strategic questions about instrumental use of cyber attacks as covert means to achieve foreign policy objectives",
          "footnote": "Libicki M. (2012) The Specter of Non-Obvious Warfare. Strategic Studies Quarterly Fall: 88-101."
        },
        {
          "index": "halliday|2010",
          "intext_citation": "(Halliday, 2010)",
          "preceding_text": "latest version four of these vulnerabilities. When the cyber security company Kaspersky started examining Stuxnet, it very quickly declared that 'Stuxnet's sophistication, purpose and the intelligence behind it suggest the involvement of a state'",
          "footnote": "Halliday J. (2010) Stuxnet worm is the 'work of a national government agency'. The Guardian, 24 September."
        },
        {
          "index": "lin|2012",
          "intext_citation": "(Lin, 2012: 350)",
          "preceding_text": "Accepting political judgement as a methodology for attribution",
          "footnote": "Lin H. (2012) Thoughts on Threat Assessment in Cyberspace. I/S: A Journal of Law and Policy for the Information Society 8: 337-355."
        },
        {
          "index": "arendt|1992",
          "intext_citation": "(Arendt, 1992: 4)",
          "preceding_text": "Accepting political judgement as a methodology for attribution (Lin, 2012: 350) also implies accepting that attribution in some cases fall between beliefs and reasons",
          "footnote": "Arendt H. (1992) Postscritum to Thinking. Hannah Arendt Lectures on Kant's Political Philosophy. Chicago: The University of Chicago Press."
        },
        {
          "index": "heuer|1999",
          "intext_citation": "(Heuer, 1999)",
          "preceding_text": "e appropriateness of resorting to this methodology. Good judgement will however rest upon the analysts being able to show the thought process as being as removed from feelings and preconceived ideas as possible, and following strict methodologies to ensure it",
          "footnote": "Heuer RJ. (1999) Psychology of Intelligence Analysis, Washington, D.C.: Centre for the Study of Intelligence."
        },
        {
          "index": "sanger|2012",
          "intext_citation": "(Sanger, 2012)",
          "preceding_text": "elevant to the assessment of sponsorship of attacks. For instance, the sponsors of Stuxnet, namely the US and Israel, only emerged when unnamed US officials with knowledge of the operation leaked information to David Sanger, a journalist at The New York Times",
          "footnote": "Sanger DE. (2012) Obama Order Sped Up Wave of Cyberattacks Against Iran. The New York Times, 1 June."
        }
      ],
      "flat_text": "Clement Guitton War Studies, King's College London, UK clement.guitton@kcl.ac.uk Abstract: This article posits that attribution is better approached as a process than as a problem. Departing from models for attribution emphasising its technical constraints, the article distinguishes between two distinct attribution processes operating in two different contexts and answering two different questions. On one hand, in a criminal context, the attribution process seeks to identify individuals who launched cyber attacks. On the other hand, in a national security context, the process seeks to identify adversaries which may have sponsored cyber attacks. Five elements can serve as determinants to distinguish between the two processes: the type of target, the severity and scale of the damage, the apparent origin of the instigator of the attack, the means of the attack, and lastly the claims by political groups. After reviewing these elements, the article analyses how the constraints and characteristics of the two different attribution processes vary in terms of responsible authority, standard of evidence, stake in play and relevance of timing for attribution. In a criminal context, the collection of digital evidence is of primary importance to be able to reach a high level of judicial proof. However, in a national security context, investigators will likely not have access to evidence but only to intelligence, and the decision of attribution will not be taken within the judiciary but within the executive (e.g. a government). As such, attribution of national security incidents requires a form of political judgement to heed the political context and circumstances of the incidents that courts do not need to consider when examining the guilt of criminals. Political judgement is also required to balance the consequences of attribution on a political level, potentially resulting in a straining of relations with other international actors. As the constraints between the two different attribution processes differ, their requirements for easing the constraints also vary.\nKeywords: attribution, sponsorship, cyber attacks, national security threats # 1. Introduction In August 2012, a malware called Shamoon infected the computers of Saudi Arabia's national oil company Aramco, and wiped out the hard drives of 30,000 computers. The attack prompted US Secretary of Defense Leon Panetta to mention the attack in a widely quoted speech in front of business executives and to answer further questions in a briefing at the Pentagon. While Panetta fell short in his speech of accusing Iran for the attacks, a journalist, quoting an unnamed US government official mentioned that Iranian hackers carried out the attack with the support from the Iranian government (The Associated Press, 2012). Officially, the attack remains unattributed to this day. In contrast, many other malware have in the past infected many computers without prompting high political officials to react about the identity of the instigators. For instance, in 2004, the Sasser worm infected millions of computers including those of rail systems in New South Wales, the Italian Interior Ministry, the European Commission and British coastguard stations without stirring such a response. The police later found its author, Sven Jaschan, thanks to an information reward program set up by Microsoft.\nHow and why does the attribution of an incident become politicised? Does attribution require the involvement of political figures? How do the processes of attributing a criminal incident and attributing an incident of national security relevance differ?\nAs attribution informs states' responses to cyber attacks, finding answers to these questions is essential. But there is currently no overall model for attribution that can answer these questions and explain how attribution occurs by taking into account the disparities between the responsible authorities, the standards of evidence, the stakes in play and the relevance of timing for attribution of cases either similar to the Aramco incident or to the Sasser worm. This article proposes such a model for attribution based on the nature of the attribution process either as apolitical or political. Apolitical cases are cases of purely criminal nature that do not rise to the level of 'national threat'. When an incident crosses the 'national threat' threshold, the question of knowing the identity of the attackers becomes less relevant than knowing who the enemy is, for instance a state actor or a terrorist organisation. The process of reaching conclusions on the identity of the instigator or on the Clement Guitton sponsorship of an attack differs in great regards. Assessing enmity is a matter of political judgement, and not for a domestic court to decide. Evidence to support the judgement for enmity hence does not have to reach the level of judicial proof that the conviction of a criminal requires. Distinguishing between the two processes allow the discernment of solutions to the attribution problem that is inherently political in some instances, and not technical as often characterised.\nThis article presents the model, namely the two attribution processes, in two steps. Firstly, it shows the criteria that lead to the politicisation of incidents. Secondly, it delves into the different characteristics of these two distinct processes.\n## 2. Politicised attribution: A set of conditions for the model Three main models have previously emerged to characterise attribution, one having its root in computer science, a second one in political science, and a third one in both fields. Firstly, the cyber security expert Tom Parker suggested assigning values to three variables to characterise the attacker: the attacker's intrinsic characteristics (e.g. resources, motivation), the target, and the general environment of the attack. Within this model, analysts compute values using Bayesian probabilities obliging them to assess the certainty of assumptions and known information. But this model suffers two pitfalls: many variables do not lend themselves to being ascribed numerical values; and Parker's attempt to draw the line between criminal and terrorist cyber attacks based on the unknown motivation of the attacker is unrealistic. The motivation of an attacker usually follows at least partial attribution, and does not precede it.\nSecondly, the lawyer Susanne W. Brenner proposed a model for attribution as a political decision based on the trichotomy war – terrorism – crime, a trichotomy whose relevance she acknowledged is eroding in cyberspace. Brenner suggested starting with attempting to classify the incident within this trichotomy also based on three variables: the origin, the target, and the motive for the attack. Yet, determining if an incident is an act of war, hence originating from a state actor, requires solving attribution first, a problem Brenner also acknowledged. Brenner's solution to the eroding relevance of the trichotomy focused on the dilemma the erosion poses on an institutional level between military and civilian entities involved in responding to the threat rather than on the core problem it poses for attribution. Such a solution did not address the main flaw in her model for attribution, namely that knowing the sponsorship of an attack cannot be at the same time the sought solution of the problem, and the variable on which the problem depends.\nLastly, the computer scientists David Clark, Susan Landau and Earl Boebert have separated the attribution problem into two sub-problems: one technical and consisting in identifying the attacking machine, and one human consisting in identifying the machine's owners and potentially their sponsor. The computer scientists delved into technical procedures to attribute a machine and left aside the details of the identification of individuals and sponsors. While much research has been carried out to improve tracing back attacks, many researchers have also acknowledged that technical considerations alone cannot be sufficient to solve the attribution problem. It is hence important to continue expending the model for attribution of cyber attacks without focusing on its technological aspects. The focus away from technology is further justified as political considerations dwarf technical ones when the incident meets certain criteria constraining the access to evidence.\nTo remedy the shortcomings of each of the three existing models, attribution can be approached as two distinct processes: on one hand, as an apolitical process following well-established criminal procedures; and on the other hand, as an act requiring a political decision, such as classifying an incident as an act of war or terrorism. Considering attribution as a process and not as a problem allows the identification of steps where different questions arise with different saliency within the process. For instance, only when attribution is politicised does the question of the different degrees of involvement of a state arise, as well as strategic questions about instrumental use of cyber attacks as covert means to achieve foreign policy objectives.\nThe determinants indicating which process an incident fall within need to be assessable from the outset of the investigation and cannot rely on the formulation of early assumptions, as Parker's and Brenner's model required for determining the motive of the attack. Five determinants influence the attribution of an incident as becoming the resort of politics rather than of the criminal justice system.\n## 2.1 The target The profile of the attack rises in function of the target according to two different elements: firstly, the political nature of the target, and secondly, the threat to national security that the target can constitute. Attackers can focus on these two types of targets in an instrumental way to try to weaken a state and achieve a political objective.\nTargets creating a threat to national security are attacks either on critical national infrastructures (e.g. Stuxnet), or on companies losing their intellectual property on a great scale. The loss of intellectual property impacts companies' productivity and, in turn, harms the national economies of countries hosting them. In the UK, tackling the threat to the economy is the very first objective of its national cyber security strategy, aiming at placing the UK as 'one of the most secure places in the world to do business in cyberspace' (Cabinet Office, 2011: 8). The theft of intellectual property via cyber attacks is therefore a topic taken seriously as a threat to national security, and is as such, approached by high-ranking officials.\nNot all attacks on companies that correspond to corporate espionage will fall within the national security threat category. Rogue corporations, even within the same country, can attack each other to gain economic advantages. Solely considering a company victim of espionage may therefore not be sufficient to raise the political profile of the attack. But the systematic loss of intellectual property from a range of companies is sufficient to constitute an economic threat for the victim country.\n## 2.2 The severity and scale of the damage One of the reasons the targeting of critical infrastructure moves attribution to the higher end of the political spectrum is because of the high severity of damage an attack can potentially cause. The assessment of the severity of an attack is not always evident. In espionage cases, the severity is dependent upon the information accessed by the hackers. But in most cases it is difficult to know which information the attacker accessed, and what the attacker will do with this information. Based on the information that a victim company provides to law enforcement agencies, state officials can attempt to gauge the severity of an attack and assess if it crosses the threshold of threat to national security. In the case of an attack on a ministry or on a private defence contractor for instance, the sensibility of the information potentially accessed automatically scales up the potential threat it poses. State officials do not particularly need to feel confident that a state actor is behind the attack to become involved in the attribution process. The mere potentiality that the damage can be important is sufficient to reflect a deviation from the criminal attribution process.\n## 2.3 The apparent origin of the instigator State officials are often cognisant that the IP address showing the origin of an attack from a particular state can be deceptive. Hackers can easily falsify the address, and use it for instance to pit one state against another, or to use underlying existing strained relations to spark an escalation of tensions. The apparent origin of the instigator can justify the implication of state officials for at least two reasons. Firstly, officials from the victim state may need to intervene to coerce the seemingly state of origin into providing more information about the attackers. Secondly, the apparent origin of the attack may be from a country that the victim state regards as an adversary. Each state has at least a vague idea of who their enemies are, or who they regard as a threat. The instability of the political situation with the enemy state can lead even a small incident with low damage to an escalation of tensions. Again, the involvement of political actors will be necessary to make a trade-off in order to decide if pursuing the investigation is possible and worth taking the risk of a political setback in case of refusal for cooperation.\n## 2.4 The means of the attack Instigators of cyber attacks have a wide variety of tools at their disposal to commit cyber attacks. Attackers can discover a new vulnerability in a system and exploit it. While finding new vulnerabilities is difficult and time-consuming, it also indicates a level of technical sophistication to which analysts of cyber attacks have not remained insensitive. Stuxnet, the worm that destroyed Iranian centrifuges in Natanz in 2010, utilised in its Clement Guitton latest version four of these vulnerabilities. When the cyber security company Kaspersky started examining Stuxnet, it very quickly declared that 'Stuxnet's sophistication, purpose and the intelligence behind it suggest the involvement of a state'. Currently, only certain states and few criminal groups if any possess the means to carry out very sophisticated attacks alike to Stuxnet. Considering the means of attacks, according to analysts' reasoning, allows the group of potential suspects to be narrowed down, and may even indicate state sponsorship. Although it is disputable if sophistication is really of any help to achieve attribution as many different actors can have the skill and resources to engineer 'sophisticated' attacks, it is incontestable that associated with the type of victim organisation it raises the profile of the attack.\n## 2.5 Claims by a political group Any cyber attacks claimed to have been carried out for a political reason, and substantiated by enough evidence, will have to be assessed within its political context. The claim may be unfunded, unrealistic, and an entity other than the claimant may truly be behind the attack. But they will necessitate a certain assessment involving political judgement, and not solely the analysis of technical and forensic evidence. Yet, within a purely criminal context, the police and cyber security firms will lack this political judgement and the authority to wield it. The mere claim by a political group may not be completely sufficient for it to be credible. The level of confidence in the credibility of the claim plays a role in considering the attack still within the realm of criminal justice or as a threat to national security.\n## 3. Descriptions of the attribution processes What is so different between the attribution process of criminal act and the attribution process of threat to national security? Firstly, it is necessary to recognise that the two processes have different goals. While the attribution process of criminal apolitical cases seek to unravel the identity of the individuals launching the cyber attack, the attribution process of cases threatening national security focuses on discovering the sponsorship of an attack. The underlying processes to reach these two different goals are fundamentally different.\n## 3.1 The criminal context Both attribution processes start with the discovery of a breach of an information system and its subsequent classification as an attack (i.e. as malicious and intentional). Following the discovery of the attack, and if none of the five aforementioned criteria apply, the case will follow the path of a criminal investigation, a well-understood process dependent on the country's good functioning of its judicial system. The next steps are then as follows: investigators from cyber security companies or from law enforcement agencies attempt to gain information to find the attacker; investigators find evidence by seizing incriminating material on the person's computer; and lastly, a court validates the inferences made from the collected evidence proving that the person was indeed the criminal using the computer from which the cyber attack was launched. In this regard, the way digital forensics are collected need to respect high standards to show that the police did not tamper with them, and that the defendant's actions, and not only his machine, caused the alleged attack 'beyond reasonable doubt'.\nThe access to evidence is predicated on first finding information about the identity of the individual. Finding information can broadly occur from three different ways: from discovering forensics left behind the attack, from information tracing back the attack to its origin (e.g. an IP address, the place where a malware first appeared), or from informants. This information does not usually prove 'beyond reasonable doubt' the individual's involvement in the attack, but evidence seized on his computer can. Two complications in the acquisition of information and evidence often arise, as many cases are spread across several jurisdictions. Firstly, the victim country's law enforcement agencies will require cooperation from the state hosting the Internet service provider which assigned the attacker's IP address. The state where the attack originated will have to request the service provider to give the match between the IP address and a name, before relaying this information to the victim country. Both steps are strongly contingent upon the state of affairs between the two countries and the tools at the disposal of the victim state to incentivise or coerce the other state into cooperating. Secondly, gathering evidence, which requires physical access to the accused's computers, can also be sensitive. Law enforcement in the originating country may be willing to seize evidence based on the information provided by their foreign counterpart, but in function of their decision to prosecute the attacker in their country or not, they may be unwilling to share the collected evidence. In case they refuse to extradite the attacker, the country in which the attacker was located will still rely upon the victim country to exchange information about the attack it suffered in order to successfully convict the accused. These legally time-consuming and twisted procedures are mostly formalised within mutual legal assistance treaties. However, the lack of an existing treaty covering cyber attacks does not have to thwart the attribution process, as much as the existence of a treaty between two countries does not ensure its applicability. Politics often trump the law, even for the attribution process in a criminal context where cooperation to exchange information or to extradite attackers is mainly dependent on political will.\nLastly, the conviction of the attacker by a court represents the highest level of attribution possible in a criminal context. But even if the court does not convict the attacker, it can remain clear that he is the one to whom the cyber attacks are attributable. The lack of legal framework criminalising cyber attacks or the high cost of the trial involving flying witnesses over from another country have in the past prevented conviction despite the accused admitting to the charges. A conviction by a court, while preferable, is hence not an absolute necessity.\n## 3.2 The national security context Within the national security context, the access to evidence is much more difficult. The four-step process for attribution of criminal cases (discovery of the attack, finding information, finding evidence, and conviction) becomes the following four-step process: discovery of the attack, finding information, formulating an assessment, and publicly acting upon the assessment. The first two steps are similar to the attribution process in a criminal context.\nThe entities formulating the assessment of attribution in cases of national security are more various than in criminal cases where only the court has the monopoly of doing so, but formal attribution still only occurs via a single formal channel, a representative of the government. The assessment by state institutions and the decision to attribute are the only forms of 'binding' attribution that will bear consequences, as the state is the only institution with the authority to take a decision of attribution accepted and recognised by whom they affect. Placing the onus on governmental institutions rather than on judicial entities for attribution has several implications. The methodology changes from the mere assessment of digital forensics to using political judgement; the standard of evidence becomes lower and proving 'beyond reasonable doubt' is not required anymore; the stakes in play are by nature political; and the timing for attribution, while important when the judiciary would pronounce a verdict, is far more crucial when it is a form of political act carried out by a political entity.\nAccepting political judgement as a methodology for attribution also implies accepting that attribution in some cases fall between beliefs and reasons, is prone to expectation biases, and operates in an environment mainly defined by an acute lack of certain information (6, 2011: 21). The difficulty of accessing evidence and the dependence on intelligence rather than evidence for attribution in this context confirms the appropriateness of resorting to this methodology. Good judgement will however rest upon the analysts being able to show the thought process as being as removed from feelings and preconceived ideas as possible, and following strict methodologies to ensure it.\nIn this light, the most appropriate organisation to formulate judgements will be intelligence services. Intelligence services bring together both the political and technical expertise required for attribution. Analysts from private companies specialising in cyber security, such as Kaspersky and Symantec, can also mention potential authors for the attacks when they report new attack vectors. But while these companies are at the forefront of technical developments in cyber security, they certainly lack the experience of heeding political elements to ascertain the origin of attacks. On the other hand, investigative journalists have the experience of taking into account in their analysis political elements, but not technical ones. Furthermore, as they use non-technical investigation techniques, they also bring other pieces of information relevant to the assessment of sponsorship of attacks. For instance, the sponsors of Stuxnet, namely the US and Israel, only emerged when unnamed US officials with knowledge of the operation leaked information to David Sanger, a journalist at The New York Times.\nJournalists very often protect their sources and it is not possible to independently verify their sources' credibility. The lack of verifiability of the information, either collected by investigative journalists or its analysis by state officials, is a defining constraint for incidents falling within the attribution process of national security incidents. Relevant information feeding into political judgement, apart from being non-testable in contrast to evidence presented in front of a court, is also mainly non-technical. Technical evidence is indeed not best suited to inform on sponsorship, which is what attribution is set to achieve in this context. Instead of using technical forensics, human intelligence gained from informants and whistle-blowers is more appropriate. This means that investigators of incidents of national threats are more interested in intelligence than in digital forensic evidence, when the opposite is true for the attribution of criminal cases.\nIntelligence services are also well acquainted with the task of estimating their adversary's strength and capabilities to launch attacks, which a priori could help narrow down the number of potential attackers if one assumes that sophistication can inform on state-sponsorship – a contestable thesis regarding that criminals can also engineer sophisticated attacks. The 'strength' variable can however be difficult to estimate for cyber attacks, especially in comparison with estimating the military strength of a country. It is much easier to subcontract cyber attacks and buy zero day exploits in a hacker underground market than it is to buy military grade weapons. Furthermore, hiring a single very talented hacker can be sufficient to engineer malware with far ranging effects. It is hence difficult to assess with high certainty any groups' capability to launch cyber attacks. Such a difficulty hinders the work of intelligence services to neatly differentiate between potential enemies with capabilities and those with only low resources to launch cyber attacks. Further blurring the picture, it is strategically advantageous for actors to hide their offensive capabilities as much as possible. Such a conclusion can appear at first counter intuitive considering that on the other hand displaying one's capabilities can act as a deterrent measure against an adversary. However, if the adversary knows that the likeliness for a threat of retaliation is low due to the uncertainty of attribution, deterrence is unlikely to function. Keeping possibilities of using covert cyber attacks as a tool for foreign policy hence becomes a reasonable strategic decision.\nBut once intelligence services attribute an attack, and as the intelligence services are by design an opaque structure, the decision of making the attribution public is somewhat a completely different decision. This decision differs from the judgement pronounced by a court in two regards. Firstly, the decision, by the nature of the parties potentially involved as state actors or as terrorist organisations, becomes a political decision for a state official to take. The decision to make attribution public also requires political judgement to balance the risks of misattribution, certainty, timing, and potential benefits of attributing the attack. The decision is likely to be taken by senior and high elected officials only. As Francis Maude, British Minister for Cabinet Office, pointed out in a hearing in the House of Commons (2012), 'if something looked like it could be a sovereign attack', the judgement of deciding sponsorship 'would clearly be for the Prime Minister' to make. Secondly, a legal judgement aims at instating justice, while a political judgement has wider possible ramifications. Following an assessment of the potential instigators of an attack, state officials can refuse to publicly name an attacker as a state with which they have strategic partnerships in order to preserve economic ties with the country. Such a decision will have followed the different steps of the attribution process, and stopped at the third one. Refusing to publicly name the attacker would be morally wrong, as the victim state would fail in its duty of owing transparency and the truth to its citizens. But it could also be a politically shrewd decision. As the level of damage caused by cyber attacks increases, the political argument will increasingly trump the moral one, leading to more frequent formal attribution.\n# 4. Conclusion The new proposed model for attribution challenges three previously accepted arguments. Firstly, it challenges that attribution is a problem and posits that it is better described as a process. Secondly, it challenges that attribution is mainly a technical issue. Lastly, it challenges that identifying a criminal and identifying the sponsor of an attack follow similar characteristics. Brought under the common umbrella term of 'attribution problem', many officials and researchers have as such advocated the same solutions for what appears in fact as two distinct attribution processes. The process within which a case falls determines the responsible authority (judiciary vs. executive), the methodology (digital forensics vs. political judgement), the standard of evidence ('beyond reasonable doubt' vs. dependent upon judgement), the stake in play (individual vs. political), and finally, the timing (irrelevant vs. critical) that will apply for attribution. The separation of attribution into two processes leads to the conclusion that they face different constraints with different requirements to relax these constraints."
    }
  },
  "citation_summary": {
    "style": "author_year",
    "dominant_bucket": "author_year",
    "dominant": {
      "intext_total": 18.0,
      "success_occurrences": 18.0,
      "success_unique": 16.0,
      "bib_unique_total": 28.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 0.5714285714285714,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "author_year"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "numeric": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 18.0,
        "success_occurrences": 18.0,
        "success_unique": 16.0,
        "bib_unique_total": 28.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.5714285714285714,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "Modelling Attribution",
    "subtitle": "War Studies, King's College London, UK",
    "document_type": "journal_article",
    "venue": "Abstract: This article posits that attribution is better approached as a process than as a problem. Departing from models for attribution emphasising its technical constraints, the article distinguishes between two distinct attribution processes operating in two different contexts and answering two different questions. On one hand, in a criminal context, the attribution process seeks to identify individuals who launched cyber attacks. On the other hand, in a national security context, the process seeks to identify adversaries which may have sponsored cyber attacks. Five elements can serve as determinants to distinguish between the two processes: the type of target, the severity and scale of the damage, the apparent origin of the instigator of the attack, the means of the attack, and lastly the claims by political groups. After reviewing these elements, the article analyses how the constraints and characteristics of the two different attribution processes vary in terms of responsible authority, standard of evidence, stake in play and relevance of timing for attribution. In a criminal context, the collection of digital evidence is of primary importance to be able to reach a high level of judicial proof. However, in a national security context, investigators will likely not have access to evidence but only to intelligence, and the decision of attribution will not be taken within the judiciary but within the executive (e.g. a government). As such, attribution of national security incidents requires a form of political judgement to heed the political context and circumstances of the incidents that courts do not need to consider when examining the guilt of criminals. Political judgement is also required to balance the consequences of attribution on a political level, potentially resulting in a straining of relations with other international actors. As the constraints between the two different attribution processes differ, their requirements for easing the constraints also vary.",
    "publication_year": null,
    "authors": [
      "Clement Guitton"
    ],
    "affiliations": [
      "War Studies, King's College London, UK"
    ],
    "emails": [
      "clement.guitton@kcl.ac.uk"
    ],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "This article posits that attribution is better approached as a process than as a problem. Departing from models for attribution emphasising its technical constraints, the article distinguishes between two distinct attribution processes operating in two different contexts and answering two different questions. On one hand, in a criminal context, the attribution process seeks to identify individuals who launched cyber attacks. On the other hand, in a national security context, the process seeks to identify adversaries which may have sponsored cyber attacks. Five elements can serve as determinants to distinguish between the two processes: the type of target, the severity and scale of the damage, the apparent origin of the instigator of the attack, the means of the attack, and lastly the claims by political groups. After reviewing these elements, the article analyses how the constraints and characteristics of the two different attribution processes vary in terms of responsible authority, standard of evidence, stake in play and relevance of timing for attribution. In a criminal context, the collection of digital evidence is of primary importance to be able to reach a high level of judicial proof. However, in a national security context, investigators will likely not have access to evidence but only to intelligence, and the decision of attribution will not be taken within the judiciary but within the executive (e.g. a government). As such, attribution of national security incidents requires a form of political judgement to heed the political context and circumstances of the incidents that courts do not need to consider when examining the guilt of criminals. Political judgement is also required to balance the consequences of attribution on a political level, potentially resulting in a straining of relations with other international actors. As the constraints between the two different attribution processes differ, their requirements for easing the constraints also vary.",
    "keywords": [
      "attribution",
      "sponsorship",
      "cyber attacks",
      "national security threats"
    ],
    "publication_dates": {},
    "identifiers": {
      "doi": [],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": []
    },
    "references_block_count": 1,
    "references_entries_estimated": 1,
    "heading_count": 13,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "no_identifier"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 18,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 1.0,
      "footnote_coverage": 1.0,
      "unique_index_count": 16
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "author_year",
      "recommended_style": "author_year",
      "aligned": true,
      "signals": {
        "superscript_hits": 0,
        "superscript_definition_lines": 0,
        "numeric_bracket_hits": 0,
        "numeric_endnote_lines": 0,
        "author_year_hits": 10
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 28.0,
      "dominant_bib_coverage_rate": 0.5714285714285714,
      "dominant_link_target": "bibliography",
      "dominant_unresolved_flag": "unresolved_reference_links"
    },
    "heading_validation": {
      "heading_count": 13,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 7,
      "has_reference_heading": true,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": true,
        "emails": true,
        "orcids": false,
        "abstract": true,
        "keywords": true,
        "venue": true,
        "persistent_identifier": false,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 1,
        "affiliations": 1,
        "emails": 1,
        "orcids": 0,
        "keywords": 4,
        "doi": 0,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 0
      },
      "coverage": {
        "core_coverage": 0.8333333333333334,
        "email_author_link_rate": 1.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "no_identifier"
        ],
        "toc_dot_lines": 0
      },
      "flags": [
        "meta_missing_persistent_identifier"
      ]
    },
    "flags": [
      "heading_numbering_parent_violation",
      "meta_missing_persistent_identifier"
    ]
  },
  "updated_at_utc": "2026-02-14T08:28:30.895676+00:00"
}