{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\LJJ6ILJJ\\(V Greiman, 2021).pdf",
  "custom_id": "331",
  "response": {
    "id": "batch-b6235e9e-332-99a57b85-507f-43e7-bf26-73896da3d01b",
    "custom_id": "331",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "The Politics and Practice of Cyber Attribution: A Global Legal Perspective\n\nVirginia Greiman\nBoston University, USA\nggreiman@bu.edu\nDOI: 10.34190/IWS.21.116\n\nAbstract: The conundrum of attribution has long been an issue in cyberspace where actors can secretly go about their business without fear of retaliation or retribution. Identifying the responsible actors for cyber- attacks is a monumental challenge though politics usually determines whether attributions are made public. When and how to accuse governments of a cyber-crime, cyber espionage or even an act of cyber war is a critical issue in reducing cyber conflicts and encouraging cyber cooperation. There is no international legal obligation to reveal the grounds on which attribution is based prior to taking appropriate action. States are likewise not obligated to provide evidence of attribution when responding to another state's cyber intrusions. Recognizing that customary international law has not developed a set of understandings or recognized state practice on what level of attribution is acceptable or necessary for establishing state responsibility for cyber actions this paper intends to address that gap. National governments, scholars, private industry, and think tanks have recently offered proposals and standards for the handling of attribution of state sponsored cyber-attacks. The focus of this article is to explore these proposals and standards from an international perspective through the analysis of national practice and international norms and regulations to determine how the international community might develop a system of law on attribution that would meet universal acceptance.\n\nKeywords: cyber attribution, cyber law standards, law and regulation of cyber attribution\n\n# 1. Introduction\n\nFollowing a cyber-attack, States have to deal with the challenge of attribution defined as \"identifying the agent responsible for the action\" (Clark and Landau, 2011). Cyber attribution is the process by which evidence of a malicious cyber activity is collected, analyzed, and identified with the attacker (Rid and Buchanan, 2015). This is not an easy task due to technological challenges and the ability to hide behind the anonymity of other actors and agents (Tallin 2.0, 2017). Though identifying the machines has become much easier for sophisticated cyber states, identifying the persons, organization, or states that are legally responsible for the cyberattack remains the ultimate challenge (Carlin, 2016). Significant technological strides in attributing cyber events in the last decade have made the task \"more nuanced, more common, and more political than has typically been acknowledged\" (Rid and Buchanan, 2015). The political aspect includes assessing what is at stake in making the attribution judgment, starting with the damage incurred, whether physical, financial, or reputational (Rid and Buchanan, p. 7). As such, attribution is often expressed in degrees of certainty, and it requires input from a range of actors and sources, including technical forensics, human intelligence, signals intelligence, history, and diplomatic relations (Banks, 2019).\n\nNo international laws or treaties expressly regulate the use of cyber-attacks. While scholars point to the potential application of the law of armed conflict, such law has notably not been invoked thus far to respond to cyber-attacks (Eichensehr, 2020). The problems derive from technical means of deception and anonymity, but they are also due to the vagaries of the process of fixing responsibility for cyberattacks within the international community and the malleability and open-endedness of the few attribution rules that currently exist in international law (Banks, 2019)\n\nThe problems of attribution are illustrated by a recent cyber-attack causing massive damage on a global scale. On December 13, 2020, the United States Cybersecurity and Infrastructure Security Agency (CISA) issued its fifth-ever emergency directive, which mandated government users disconnect from its monitoring service, SolarWinds Orion due to the determination that an \"outside nation state\" had found a back door into some updated versions of the software (CISA, 2020). Widely believed to be Russian backed hackers it was described by Microsoft's President, Brad Smith as Washington's worst cyberespionage failure on record impacting private companies and governments across the globe calling for more collaborative leadership by the government and the tech sector in the United States (Smith, 2020). Though no formal attribution has been issued to date, the attack continues to raise serious concerns on the regulation of cyber-attacks and cyber attribution.\n\n102",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 1,
            "markdown": "Virginia Greiman\n\nThe challenges of attribution are also evident whenever there is a failure to charge the perpetrators of a serious cyber event until years after the attack. On January 29, 2015, it was discovered that Anthem, Inc, one of the nation's leading health insurers, was the victim of a massive cyberattack. The hackers began accessing the information in early December 2014 and, during a nearly 7-week window, perpetrators were able to gain access to nearly 80 million records (McGee, 2017). In 2017, seven state insurance commissioners, issued a report on their investigation into the cyberattack against Anthem and concluded that a nation-state was behind the attack. But they stopped short of naming the nation involved (McGee, 2017). It was not until 2019 that U.S. DOJ charged a Chinese hacker for the 2015 Anthem breach.\n\nCyber attribution is a topic covered quite extensively in the literature however, the legal requirements of attribution are clearly lacking due to the failure of a universal consensus on the laws, regulations and standards that are applicable when attributing a cyber-attack to a state-sponsored entity. As shown in figure 1, this paper explores the relationship between the law of attribution, the evidence required to prove attribution, and the responses that nation states have chosen when faced with decisions that require careful evaluation of the interests faced by the victim nation including economic, social, political, and national security interests. The research comprises a review and comparative analysis of the international law governing attribution, the applicable rules of evidence, and the analysis of recent literature including government and private sector studies that analyze state responses to cyber-attacks.\n\n![img-0.jpeg](img-0.jpeg)\nFigure 1: The attribution laws, evidence and responses\n\n# 2. The law and challenges of attribution\n\nLegal challenges for attribution can be brought under international law based on two types of acts: (1) responsibility of states for Internationally wrongful acts; and (2) an unlawful cyber intrusion (Tallinn 2.0, 2017). The law of attribution for cyber intrusions aims to identify and place responsibility for internationally wrongful acts (Banks, 2019). The customary law of state responsibility for violations of international law, and with it the law of attribution, is drawn primarily from the long-term work of the International Law Commission (ILC) and its Draft Articles on Responsibility of States for Internationally Wrongful Acts (ILC, 2001). Although not a treaty, the ILC rules were commended to the member states by the UN General Assembly in 2001 and have become the authoritative guidepost for public international cyber law. The Rules have been cited repeatedly by courts, tribunals, and other bodies. Drawing from the ILC rules, the threshold point in the cyber context is that \"a State bears international responsibility for a cyber-related act that is attributable to the State and that constitutes a breach of an international legal obligation\" (Tallinn at 84). In essence, according to the Tallinn Manual 2.0, rule 15, states are responsible for the wrongful cyber-related acts of their own officials, agents, contractors, nonstate actors, and other states, to the extent they actually control the operations.\n\nRule 20 of the Tallinn Manual 2.0 provides that if a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Though punitive countermeasures are forbidden (Tallinn at 124), states must give prior notice to the offending state, and their purpose must include compliance with international law (Tallinn at 120). Importantly, there is no prohibition against injured states turning to a private firm, including foreign companies, to conduct cyber countermeasures on their behalf against responsible stares though the company's operations would generally be attributable to the injured States (Tallinn, rule 17).",
            "images": [
              {
                "id": "img-0.jpeg",
                "top_left_x": 254,
                "top_left_y": 837,
                "bottom_right_x": 1394,
                "bottom_right_y": 1188,
                "image_base64": null,
                "image_annotation": null
              }
            ],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 2,
            "markdown": "Virginia Greiman\n\nThe second part of any legal analysis of attribution requires an understanding of the right of a victim state to take countermeasures against a state sponsored attack (Banks, 2019). If a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Countermeasures are responses that otherwise would violate international law, designed to prevent a responsible state from continuing its unlawful cyber intervention\" (Tallinn at 111).\n\n# 3. Options after attributing an attack\n\nAssuming a State's technical and legal analysis is capable of attributing an attack, what are the options available to a victim nation after an attack? Cyber-attacks in the United States and around the globe have demonstrated various responses by nation states. The most common form of response is through economic punishment or denial of benefits offered by international treaties or conventions. In cases where the evidence is clear as to the attacker it might justify retaliation through counter measures. In the case of a cyber war the response may be a declaration of war against the nation state. According to the Council on Foreign Relations Cyber Operations Tracker, since 2005, thirty-four countries are suspected of sponsoring cyber operations. China, Russia, Iran, and North Korea sponsored 77 percent of all suspected operations. In 2019, there were a total of seventy-six operations, most being acts of espionage (CFR, 2020). Recent attacks shown in table 1 highlight this reality. In a recent study of private sector attribution of cyber incidents, sponsored by the Office of the Secretary of Defense and the RAND National Defense Research Institute, the most commonly stated motive for U.S. government attribution was to promote deterrence in cyberspace. Participants also noted that public attribution may help build international consensus on what constitutes irresponsible or inappropriate behavior in cyberspace (Romanosky and Boudreaux, 2020).\n\nImportantly, the United States has not taken a standardized approach to attribution—either in the timing of attribution, the mode, the type, or the extent of evidence supporting the attribution, the confidence level, or whether attribution is followed by other punitive measures (Romanosky and Boudreaux, 2020). For example, the 2017 attribution of WannaCry and the 2018 attribution of NotPetya involved coordinated statements with international partners; however, in the Equifax cyber-attack, it was the private company that worked with the UK and Canadian regulators to determine appropriate next steps. Leveraging the capabilities of the private sector is a significant strategy that has been used by the United States and other countries.\n\nRussia, meanwhile, hardly seems to have been chastened by the US government's sanctions for NotPetya, which arrived a full eight months after the worm hit and whose punishments were muddled with other messages chastising Russia for everything from 2016 election disinformation to hacker probes of the US power grid (Greenberg, 2018). \"The lack of a proper response has been almost an invitation to escalate more,\" says Thomas Rid, a political science professor at Johns Hopkins' School of Advanced International Studies (Greenberg, 2018). Escalation was the fear in the case of the 2014 attack on the Office of Personnel Management (OPM). As noted by the Congressional Research Services investigation, \"criminal charges appear to be unlikely.\" \"As a matter of policy, the United States has sought to distinguish between cyber intrusions to collect data for national security purposes — to which the United States deems counterintelligence to be an appropriate response — and cyber intrusions to steal data for commercial purposes, to which the United States deems a criminal justice response to be appropriate\" (CRS, 2015).\n\nThe United States has used its improved capabilities to make a number of public attributions in recent years. Public attributions by the U.S. government take one of four forms: (1) criminal indictments; (2) economic sanctions; (3) technical alerts; and (4) official statements or press releases. If a public attribution is not made it does not mean that attribution has not taken place. For example, attribution can take place through various forms of retaliation including unattributed attacks. Table 1 highlights some recent cyber-attacks and the type of threat, impact on the victims, and how the victim state chose to attribute the attack. It is important to note that to date no cyber threat or attack has been treated as an act of war despite the seriousness and the extent of the damage. As we will see in the next section the decision to treat an attack as a criminal act depends largely on the ability to prove the case in a court of a law based on widely disparate legal systems around the world.\n\nTable 1: Major cyber events, impact and attribution\n\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|  2020 Solar Wind Hack | Espionage-based assault | Broad attack on confidential information of U.S. Government | Alleged Russian Hacker Group. No formal attribution to date  |",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 3,
            "markdown": "Virginia Greiman\n\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|   |  | including Homeland Security and the Pentagon and the tech tools used by companies to protect them. |   |\n|  2017 NotPetya | Conspiracy, Ransomware and Espionage | Homeland Security estimated the total damages to more than $10 billion involving damage to businesses and governments in Ukraine, Georgia, France, and other European Countries. | On October 20, 2020, the U.S. DOJ indicted six members of the Russian military  |\n|  2017 Equifax Data Breach | Aggressive Act of Espionage | Equifax databases were attacked impacting 143 million people | In February 2020, the U.S. charged 4 members of the Chinese military  |\n|  2014 U.S. OPM Data Breach | Aggressive Act of Espionage | Data Breach of 21.5 million current and former U.S. government employees | No public attribution due to national security concerns (CRS, 2015)  |\n|  2014 Sony Attacks | Critical Infrastructure Cyber-Attack and Economic Crime | US $171M damage, attacked 77 million accounts, described as worse computer data breach in U.S. history | Following the FBI's attribution of the Sony Pictures hack to North Korea on Dec. 19, 2014 The U.S. imposed sanctions against 10 individuals and three entities associated with the country's Pyongyang-based government  |\n|  2010 Stuxnet Attack | Criminal Act – Economic Crime | Infected an estimated 100,000 computers and set-back Iran's Nuclear Program | No formal attribution  |\n\n# 4. The evidence: Attribution through criminal indictments\n\nInvariably, one of the first responses after a cyber-attack is: Who did it and how do we know? In legal terminology the legal process for charging someone with a wrongful act is known as burden of proof. In the attribution world this concept is little discussed in the context of a cyber-attack. The law of attribution conjures up numerous questions on the procedural side as even if the substantive law is clear the procedural rules may be ridden with twists and turns that make it difficult to prove your case. In international disputes the ICJ has held that “[a]s a general rule it is for the party which alleges a fact in support of its claims to prove the existence of that fact” (ICJ, 2010).\n\nAs highlighted in Delbert Tran's (2018) overview of the law of attribution, before developing rules for attribution it is important to note the distinctions in adversarial v. inquisitorial legal systems which govern most of the legal world. The features of adversarial and inquisitorial systems include common characteristics such as burdens of proof and persuasion, state responsibility doctrines, and rules governing evidentiary production. Though the features are similar they can be administered in different ways. The adversarial system assumes that the best way to get to the truth of a matter is through a competitive process to determine the facts and application of the law accurately. The inquisitorial system associated with civil law legal systems, is characterized by extensive pre-trial investigation and interrogations with the objective to avoid bringing an innocent person to trial. The inquisitorial process can be described as an official inquiry to ascertain the truth, whereas the adversarial system uses a competitive process between prosecution and defence to determine the facts. (Reichel, 2018). For example, in the United States, the burden of production is a minimal burden to produce at least enough evidence for the trier of fact to consider a disputed claim. After litigants have met the burden of production, they have the burden of persuasion: that enough evidence has been presented to persuade the trier of fact that their side is correct.\n\nTo be committed of a crime under U.S. law does not require absolute certainty but rather demands only that there be no reasonable doubt. The lowest standard is \"prima facie evidence,\" which requires merely indicative or plausible proof. An intermediate standard is \"preponderance of probability,\" under which the existence of the fact to be proved must be more likely than not, or, in other words, that it is reasonably probable (Green, 2009). Whereas common law jurisdictions apply all three standards of proof depending on the situation, civil law jurisdiction tend to limit the standard of proof to a single general rule: the judge must be \"convinced\" that a disputed fact is true (Dederer and Singer, 2019).",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 4,
            "markdown": "Virginia Greiman\n\nThe burden of proof may be different, however, in instances where the response is a countermeasure against the State of origin of the adverse cyber operation. The victim State may have to prove only that the State of origin breached its duty to prevent significant transboundary harm by not taking reasonable measures to prevent imminent, or stop ongoing adverse cyber operations carried from within its territory (Roscini, 2015).\n\nThe first public attribution by the U.S. Department of Justice came in the form of an indictment in 2014, when a grand jury in the Western District of Pennsylvania indicted five members of China's PLA Unit 61398, for hacking and conspiring to hack companies, including Westinghouse and U.S. Steel, in order to steal intellectual property (USDOJ, 2014). The fifty-six-page indictment alleges violations of the Computer Fraud and Abuse Act, including conspiracy, unauthorized access to computers, and computer damage. The indictment also includes charges of economic espionage and trade secret theft. Other indictments have followed. For example, in 2017, a federal grand jury indicted two Russian Federal Security Service (FSB) officers for directing a hack that compromised 500 million Yahoo accounts. And in early 2020, a federal grand jury indicted four members of China's PLA for the 2017 hack of consumer credit reporting agency Equifax--a breach that compromised the personal information of 145 million U.S. victims (USDOJ, 2020).\n\nThe problem, then, is not in identifying the source of an attack. The challenge is in convincing other states that a source has correctly been identified. A state that wishes to employ countermeasures needs to convince other states of the accuracy of its attribution in order to establish the legitimacy of its attack. This issue may arise for two main reasons: (1) attribution may be based on data collected through state espionage or intelligence-gathering efforts that states may wish to keep secret; and (2) when states have plausible factual bases for attributing an attack, they may not want to disclose such evidence, since cyber attackers could learn from those mistakes and avoid leaving the same fingerprints in the future (Tran, 2019)\n\nAs the most advanced cyber states recognize the risks of cyber escalation, those states have good reason to become more transparent about attribution in service of the mutual restraint that could be gained by sharing attribution information. But to date, state concerns about revealing intelligence sources and methods counsel against transparency. (Banks, 2019)\n\n## 5. The response: Public cyber attribution: A political tool or a consensus of states\n\nCyber attribution has been widely discussed in the literature, yet there is still no international consensus on what rules of attribution may be needed to meet the needs and concerns of the international community (Clark and Landau, 2010; Dunn Cavelty, 2008; Lindsay, 2015; Lupovici, 2016; Nye, 2017; Rid and Buchanan, 2015). Recent decisions on attribution by governments and private industry have shown the desire to share these findings publicly even if the findings are, or will be, contested (Egloff, 2020). Two areas of concern in public attribution are (1) the mechanisms that lead to attribution; and (2) what happens after attribution. Governments have a strong incentive to use public attribution as a political tool, to understand better how the sharing of information may provide an impetus for governments, private sector participants, international organizations, and academics to come forward to contribute to the attribution dialogue. In 2016 the Department of Defense Law of War Manual was updated. Although it does discuss cyber operations, the Manual does not include standards of attribution, rules of targeting, or the requirement to review cyber weapons (DoD, 2016). Considering the importance of attribution in preventing and deterring cyber activity this is a significant omission.\n\nAs shown by the lack of clarity in resolving the problems of attribution, domestic laws are not sufficient to negotiate the challenges arising from trans-border issues such as those relating to national security and human rights, the public's right of access to information, the individual's right to privacy, the corporation's right to remain competitive, the right to criminal process, and extraterritorial jurisdiction. International cooperation and international laws are also needed—both to allocate authority among political entities, and to define and protect core substantive values in the physical and virtual worlds (Bederman and Keitner, 2016). Powerful actors such as the United States, Russia, and the United Kingdom have not gone far enough in addressing the problems of attribution.\n\nScholars contend that a treaty which bans the use of cyber-attacks or limits their use is not realistic because there is currently no way to ensure compliance. More effective may be the establishment of norms as proposed by NATO, the OECD, and other transnational organizations to prevent the possibility of a cyber war through universal acceptance of attribution norms or standards. States must demonstrate that they are willing to take\n\n106",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 5,
            "markdown": "Virginia Greiman\n\nthe necessary steps to protect the security and prevent the misuse of the Internet in their respective countries” (Hathaway, 2017). This requires a calling out of wrongful acts conducted by other states, through a harmonized attribution process, something that victimized states have been reluctant to do (Hathaway, 2017, p. 5).\n\nSeveral non-state-driven norms-making initiatives have sought to fill the void, including Microsoft’s (2016) cyber norms proposals and the Tallinn Manual project. Scholars have contended that this emerging body of non-binding norms presents states with a critical window of opportunity to reclaim a central law-making position, similar to historical precedents including the development of legal regimes for Antarctica and nuclear safety (Mačák, 2017). The global dialogue on cybersecurity norms is evolving from a conceptual discussion about nation-states’ rights and responsibilities, toward an articulation of norms of state and industry behavior. These proposals vary in their prescriptions and subject areas.\n\nLegal scholars have also noted the need for accountability at the international level when one country is wrongfully attacked by another (Kuntz, 2013). For example, the United States’ Cyber Economic Espionage Accountability Act expresses the sense of Congress that cyber economic espionage should be a priority issue in all economic and diplomatic discussions with the People’s Republic of China, with the Russian Federation and other countries determined to encourage, tolerate, or conduct such cyber economic espionage (USDOJ, 2014). Scholars recognize that States must develop accountable attribution mechanisms for international law to have practical value in the cyber sphere (Banks, 2019).\n\nResearchers have proposed a due diligence framework or minimal standards for attribution of cyber-attacks (Chircop, 2018). A due diligence failure occurs when a state has knowledge of a cyber operation being carried out from within its territory, contrary to the rights of another, and fails to take reasonable measures to prevent it (Tallinn, Rule 6 at 42). Though due diligence is not clearly defined in the law it was reflected by the International Court of Justice (ICJ) in its Corfu Channel Judgment: “It is every State’s obligation not to allow knowingly its territory to be used for acts contrary to the rights of other states (Corfu, 1949) and has been set forth as an obligation of States in the pronouncements of the International Law Association (ILA, 2014). With the rise of cyber-attacks globally and no end in sight, international cyber security law is at a critical juncture. The failure of states to engage in the development and applications of international law has left a power vacuum allowing for the emergence of non-state norm-making initiatives (Mačák, 2017). As suggested here there is an opportunity now to employ the many initiatives and proposals for the development of standards and norms and to engage the international community in attribution norm and standards building practices.\n\n## 6. Conclusion\n\nThis paper has attempted to identify the scope and nature of the attribution problem and the key challenges in attribution from a legal perspective. By analyzing recent cyber events and the means and methods used to address the wrongful acts of nation states one can reasonably conclude that the lack of a legal framework has contributed to rather than reduced the likelihood of future cyber-attacks. Wrongful acts that go unpunished will continue to occur. The reasons are alarming including the lack of standards and an evidentiary process for attributing wrongful conduct that would meet the consensus of the international community. There is opportunity now to find meaningful standards that would provide safeguards from liability for good faith efforts to prevent wrongdoing and future violations of international law. Future research must explore possible solutions for enhancing not only the laws of attribution, but the policies that inform these laws to meet modern realities. This requires multilateral cooperation and an international agreement on the rules and norms that govern cyber attribution both at the national security and economic level to better meet the needs of our evolving cyber landscape.\n\n## References\n\nBanks, W. (2019) “The Bumpy Road to a Meaningful International Law of Cyber Attribution.” American Journal of International Law Unbound, vol. 113, pp 191-196. doi:10.1017/aju.2019.32.\nBederman, D.J. and Keitner, C. (2016) International Law Frameworks: Concepts and Insights, 4th Ed., Foundation Press.\nCarlin, J. P. (2016) “Detect, Disrupt, Deter: A Whole-of-Government Approach to National Security Cyber Threats”, 7 Harv. Nat’l Sec. J. 391, 409.\nChircop, L. (2018) “A Due Diligence Standard of Attribution in Cyberspace”. International and Comparative Law Quarterly, vol. 67, no. 3, pp 643-668. doi:10.1017/S0020589318000015.\nCyber Infrastructure Security Agency. December 14, 2020. “CISA Issues Emergency Directive to Mitigate the Compromise of Solarwinds Orion Network Management Products”. CISA, Washington, D.C.\n\n107",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 6,
            "markdown": "Virginia Greiman\n\nClarke, D.D. and Landau, S. (2011) \"Untangling Attribution\" 2 Harv. Nat'l Sec. J. 531, 531.\nCouncil on Foreign Relations (CFR). (2020). Cyber Operations Tracker, CFR, New York.\nCongressional Research Services (CRS). Cyber Intrusion into U.S. Office of Personnel Management: In Brief. By K. Finklea, M. D. Christensen, E. A. Fischer, S. V. Lawrence, C. A. Theohary, Washington: Government Printing Office, July 17, 2015 (Congressional Research Services Report) (7-5700, R44111).\nCorfu Channel (United Kingdom v Albania) (Judgment) [1949] ICJ Rep 4, 22 (Corfu Channel).\nDederer, H-G and Singer, T. (2019) \"Adverse Cyber Operations: Causality, Attribution, Evidence, and Due Diligence\", 95 Int'l L. Stud. 430.\nDunn Cavelty, M., and Egloff, F. J. (2019) \"The politics of cybersecurity: Balancing different roles of the state\", St Antony's International Review, vol. 15, no. 1, pp 37-57.\nEgloff, F.J. (2020) \"Contested public attributions of cyber incidents and the role of academia\", Contemporary Security Policy, vol. 41, no. 1, pp 55-81, DOI: 10.1080/13523260.2019.1677324.\nEichensehr, K. E. (2020) \"The Law and Politics of Cyberattack Attribution\", 67 UCLA L. Rev. 520.\nGreen, J.A. (2009) \"Fluctuating Evidentiary Standards for Self-Defence in the International Court of Justice\", 58 International and Comparative Law Quarterly 163, 165.\nGreenberg, A. \"The Untold Story of NotPetya, The Most Devastating Cyberattack in History\". Wired, August 22, 2018.\nHathaway, M. (2017) \"Getting Beyond Norms,\" CIGI Papers No. 127, Centre for International Governance Innovation, Ontario, Canada.\nInternational Court of Justice (ICJ) Ahmadou Sadio Diallo (Guinea v. Dem. Rep. Congo) Merits, Judgment, 2010 I.C. J. Rep. 639 para 54 (Nov 30).\nInternational Law Association (ILA), ILA Study Group on Due Diligence in International Law (First Report, ILA, 7 March 2014).\nInternational Law Commission (ILC), Report of the International Law Commission, Draft Articles of State Responsibility, UN GAOR, 53rd Sess., Supp. No. 10, UN Doc. A/56/10 (2001).\nKuntz, R. L. (2013) \"How Not to Catch A Thief: Why the Economic Espionage Act Fails to Protect American Trade Secrets\", 28 Berkeley Tech. L.J. 901.\nLindsay, J. R. (2015) \"Tipping the scales: the attribution problem and the feasibility of deterrence against cyberattack\". Journal of Cybersecurity, vol. 1, no. 1, pp 53-67. doi:10.1093/cybsec/tyv003.\nLupovici, A. (2016) \"The \"attribution problem and the social construction of \"violence: Taking cyber deterrence literature a step forward\". International Studies Perspectives, vol 17, 322-342. doi:10.1111/insp.12082.\nMačák, K. (2017) \"From Cyber Norms to Cyber Rules: Re-engaging States as Law-makers\". Leiden Journal of International Law, Vol. 30, No. 4, pp 877 - 899.\nMcGee, M. K. (2017) A New In-Depth Analysis of Anthem Breach: Insurance Commissioners Conclude Nation-State Involved, Reach Settlement with Insurer. HealthInfoSec, January 10.\nMicrosoft (2016) \"From articulation to implementation: Enabling progress on cybersecurity norms,\" White Paper, Microsoft, Redmond, Washington.\nNye, J. S. (2017) \"Deterrence and dissuasion in cyberspace\". International Security, vol. 41 no. 3, pp 44-71. doi:10.1162/ISEC_a_00266.\nReichel, P. L. (2018) Comparative Criminal Justice Systems: A Topical Approach, 7th Edition, Pearson.\nRid, T., and Buchanan, B. (2015) \"Attributing Cyber Attacks\". Journal of Strategic Studies, vol. 38, no. 1-2, pp 4-37.\nRoscini, M. (2015) \"Evidentiary Issues in International Disputes Related to State Responsibility for Cyber Operations\", 50 Texas International Law Journal, 233, 239-40.\nRomanosky, S. and Boudreaux, B. (2020) \"Private-Sector Attribution of Cyber Incidents: Benefits and Risks to the U.S. Government,\" International Journal of Intelligence and CounterIntelligence, pp. 1-31.\nSmith, B. (2020) \"A moment of reckoning: the need for a strong and global cybersecurity response.\" Microsoft on the Issues: The Official Microsoft Blog. https://blogs.microsoft.com/on-the-issues/2020/12/17/cyberattacks-cybersecurity-solarwinds-fireeye/.\nTallinn Manual 2.0 on the International Law Applicable to Cyber Operations (Michael N. Schmitt 2nd ed., 2017). Prepared by the International Group of Experts at the Invitation of the NATO Cooperative Cyber Defence Centre of Excellence (CCD COE), Cambridge University Press.\nTran, D. (2018) \"The Law of Attribution: Rules for Attributing the Source of a Cyber-Attack,\" 20 Yale J. L. and Tech. 376, 397.\nU.S. Department of Defense (DoD). (2016) Law of War Manual. Office of the General Counsel, Washington, D.C.\nUnited States Cyber Economic Espionage Accountability Act Summary: H.R.2281 - 113th Congress (2013-2014).\nU.S. Department of Justice (February 10, 2020). \"Chinese Military Personnel Charged with Computer Fraud, Economic Espionage and Wire Fraud for Hacking into Credit Reporting Agency Equifax,\" DOJ, Office of Public Affairs, Washington, D.C.\nUnited States Department of Justice (2014) \"U.S. Charges Five Chinese Military Hackers for Cyber Espionage Against U.S. Corporation and a Labor Organization for Commercial Advantages,\" U.S. Department of Justice, Office of Public Affairs, Washington, D.C.\n\n108",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 7,
            "markdown": "Reproduced with permission of copyright owner. Further reproduction prohibited without permission.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 8,
          "doc_size_bytes": 478132
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "The Politics and Practice of Cyber Attribution: A Global Legal Perspective\nVirginia Greiman\nBoston University, USA\nggreiman@bu.edu\nDOI: 10.34190/IWS.21.116\nAbstract: The conundrum of attribution has long been an issue in cyberspace where actors can secretly go about their business without fear of retaliation or retribution. Identifying the responsible actors for cyber- attacks is a monumental challenge though politics usually determines whether attributions are made public. When and how to accuse governments of a cyber-crime, cyber espionage or even an act of cyber war is a critical issue in reducing cyber conflicts and encouraging cyber cooperation. There is no international legal obligation to reveal the grounds on which attribution is based prior to taking appropriate action. States are likewise not obligated to provide evidence of attribution when responding to another state's cyber intrusions. Recognizing that customary international law has not developed a set of understandings or recognized state practice on what level of attribution is acceptable or necessary for establishing state responsibility for cyber actions this paper intends to address that gap. National governments, scholars, private industry, and think tanks have recently offered proposals and standards for the handling of attribution of state sponsored cyber-attacks. The focus of this article is to explore these proposals and standards from an international perspective through the analysis of national practice and international norms and regulations to determine how the international community might develop a system of law on attribution that would meet universal acceptance.\nKeywords: cyber attribution, cyber law standards, law and regulation of cyber attribution\n# 1. Introduction\nFollowing a cyber-attack, States have to deal with the challenge of attribution defined as \"identifying the agent responsible for the action\" (Clark and Landau, 2011). Cyber attribution is the process by which evidence of a malicious cyber activity is collected, analyzed, and identified with the attacker (Rid and Buchanan, 2015). This is not an easy task due to technological challenges and the ability to hide behind the anonymity of other actors and agents (Tallin 2.0, 2017). Though identifying the machines has become much easier for sophisticated cyber states, identifying the persons, organization, or states that are legally responsible for the cyberattack remains the ultimate challenge (Carlin, 2016). Significant technological strides in attributing cyber events in the last decade have made the task \"more nuanced, more common, and more political than has typically been acknowledged\" (Rid and Buchanan, 2015). The political aspect includes assessing what is at stake in making the attribution judgment, starting with the damage incurred, whether physical, financial, or reputational (Rid and Buchanan, p. 7). As such, attribution is often expressed in degrees of certainty, and it requires input from a range of actors and sources, including technical forensics, human intelligence, signals intelligence, history, and diplomatic relations (Banks, 2019).\nNo international laws or treaties expressly regulate the use of cyber-attacks. While scholars point to the potential application of the law of armed conflict, such law has notably not been invoked thus far to respond to cyber-attacks (Eichensehr, 2020). The problems derive from technical means of deception and anonymity, but they are also due to the vagaries of the process of fixing responsibility for cyberattacks within the international community and the malleability and open-endedness of the few attribution rules that currently exist in international law (Banks, 2019)\nThe problems of attribution are illustrated by a recent cyber-attack causing massive damage on a global scale. On December 13, 2020, the United States Cybersecurity and Infrastructure Security Agency (CISA) issued its fifth-ever emergency directive, which mandated government users disconnect from its monitoring service, SolarWinds Orion due to the determination that an \"outside nation state\" had found a back door into some updated versions of the software (CISA, 2020). Widely believed to be Russian backed hackers it was described by Microsoft's President, Brad Smith as Washington's worst cyberespionage failure on record impacting private companies and governments across the globe calling for more collaborative leadership by the government and the tech sector in the United States (Smith, 2020). Though no formal attribution has been issued to date, the attack continues to raise serious concerns on the regulation of cyber-attacks and cyber attribution.\n102\nVirginia Greiman\nThe challenges of attribution are also evident whenever there is a failure to charge the perpetrators of a serious cyber event until years after the attack. On January 29, 2015, it was discovered that Anthem, Inc, one of the nation's leading health insurers, was the victim of a massive cyberattack. The hackers began accessing the information in early December 2014 and, during a nearly 7-week window, perpetrators were able to gain access to nearly 80 million records (McGee, 2017). In 2017, seven state insurance commissioners, issued a report on their investigation into the cyberattack against Anthem and concluded that a nation-state was behind the attack. But they stopped short of naming the nation involved (McGee, 2017). It was not until 2019 that U.S. DOJ charged a Chinese hacker for the 2015 Anthem breach.\nCyber attribution is a topic covered quite extensively in the literature however, the legal requirements of attribution are clearly lacking due to the failure of a universal consensus on the laws, regulations and standards that are applicable when attributing a cyber-attack to a state-sponsored entity. As shown in figure 1, this paper explores the relationship between the law of attribution, the evidence required to prove attribution, and the responses that nation states have chosen when faced with decisions that require careful evaluation of the interests faced by the victim nation including economic, social, political, and national security interests. The research comprises a review and comparative analysis of the international law governing attribution, the applicable rules of evidence, and the analysis of recent literature including government and private sector studies that analyze state responses to cyber-attacks.\nFigure 1: The attribution laws, evidence and responses\n# 2. The law and challenges of attribution\nLegal challenges for attribution can be brought under international law based on two types of acts: (1) responsibility of states for Internationally wrongful acts; and (2) an unlawful cyber intrusion (Tallinn 2.0, 2017). The law of attribution for cyber intrusions aims to identify and place responsibility for internationally wrongful acts (Banks, 2019). The customary law of state responsibility for violations of international law, and with it the law of attribution, is drawn primarily from the long-term work of the International Law Commission (ILC) and its Draft Articles on Responsibility of States for Internationally Wrongful Acts (ILC, 2001). Although not a treaty, the ILC rules were commended to the member states by the UN General Assembly in 2001 and have become the authoritative guidepost for public international cyber law. The Rules have been cited repeatedly by courts, tribunals, and other bodies. Drawing from the ILC rules, the threshold point in the cyber context is that \"a State bears international responsibility for a cyber-related act that is attributable to the State and that constitutes a breach of an international legal obligation\" (Tallinn at 84). In essence, according to the Tallinn Manual 2.0, rule 15, states are responsible for the wrongful cyber-related acts of their own officials, agents, contractors, nonstate actors, and other states, to the extent they actually control the operations.\nRule 20 of the Tallinn Manual 2.0 provides that if a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Though punitive countermeasures are forbidden (Tallinn at 124), states must give prior notice to the offending state, and their purpose must include compliance with international law (Tallinn at 120). Importantly, there is no prohibition against injured states turning to a private firm, including foreign companies, to conduct cyber countermeasures on their behalf against responsible stares though the company's operations would generally be attributable to the injured States (Tallinn, rule 17).\nVirginia Greiman\nThe second part of any legal analysis of attribution requires an understanding of the right of a victim state to take countermeasures against a state sponsored attack (Banks, 2019). If a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Countermeasures are responses that otherwise would violate international law, designed to prevent a responsible state from continuing its unlawful cyber intervention\" (Tallinn at 111).\n# 3. Options after attributing an attack\nAssuming a State's technical and legal analysis is capable of attributing an attack, what are the options available to a victim nation after an attack? Cyber-attacks in the United States and around the globe have demonstrated various responses by nation states. The most common form of response is through economic punishment or denial of benefits offered by international treaties or conventions. In cases where the evidence is clear as to the attacker it might justify retaliation through counter measures. In the case of a cyber war the response may be a declaration of war against the nation state. According to the Council on Foreign Relations Cyber Operations Tracker, since 2005, thirty-four countries are suspected of sponsoring cyber operations. China, Russia, Iran, and North Korea sponsored 77 percent of all suspected operations. In 2019, there were a total of seventy-six operations, most being acts of espionage (CFR, 2020). Recent attacks shown in table 1 highlight this reality. In a recent study of private sector attribution of cyber incidents, sponsored by the Office of the Secretary of Defense and the RAND National Defense Research Institute, the most commonly stated motive for U.S. government attribution was to promote deterrence in cyberspace. Participants also noted that public attribution may help build international consensus on what constitutes irresponsible or inappropriate behavior in cyberspace (Romanosky and Boudreaux, 2020).\nImportantly, the United States has not taken a standardized approach to attribution—either in the timing of attribution, the mode, the type, or the extent of evidence supporting the attribution, the confidence level, or whether attribution is followed by other punitive measures (Romanosky and Boudreaux, 2020). For example, the 2017 attribution of WannaCry and the 2018 attribution of NotPetya involved coordinated statements with international partners; however, in the Equifax cyber-attack, it was the private company that worked with the UK and Canadian regulators to determine appropriate next steps. Leveraging the capabilities of the private sector is a significant strategy that has been used by the United States and other countries.\nRussia, meanwhile, hardly seems to have been chastened by the US government's sanctions for NotPetya, which arrived a full eight months after the worm hit and whose punishments were muddled with other messages chastising Russia for everything from 2016 election disinformation to hacker probes of the US power grid (Greenberg, 2018). \"The lack of a proper response has been almost an invitation to escalate more,\" says Thomas Rid, a political science professor at Johns Hopkins' School of Advanced International Studies (Greenberg, 2018). Escalation was the fear in the case of the 2014 attack on the Office of Personnel Management (OPM). As noted by the Congressional Research Services investigation, \"criminal charges appear to be unlikely.\" \"As a matter of policy, the United States has sought to distinguish between cyber intrusions to collect data for national security purposes — to which the United States deems counterintelligence to be an appropriate response — and cyber intrusions to steal data for commercial purposes, to which the United States deems a criminal justice response to be appropriate\" (CRS, 2015).\nThe United States has used its improved capabilities to make a number of public attributions in recent years. Public attributions by the U.S. government take one of four forms: (1) criminal indictments; (2) economic sanctions; (3) technical alerts; and (4) official statements or press releases. If a public attribution is not made it does not mean that attribution has not taken place. For example, attribution can take place through various forms of retaliation including unattributed attacks. Table 1 highlights some recent cyber-attacks and the type of threat, impact on the victims, and how the victim state chose to attribute the attack. It is important to note that to date no cyber threat or attack has been treated as an act of war despite the seriousness and the extent of the damage. As we will see in the next section the decision to treat an attack as a criminal act depends largely on the ability to prove the case in a court of a law based on widely disparate legal systems around the world.\nTable 1: Major cyber events, impact and attribution\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|  2020 Solar Wind Hack | Espionage-based assault | Broad attack on confidential information of U.S. Government | Alleged Russian Hacker Group. No formal attribution to date  |\nVirginia Greiman\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|   |  | including Homeland Security and the Pentagon and the tech tools used by companies to protect them. |   |\n|  2017 NotPetya | Conspiracy, Ransomware and Espionage | Homeland Security estimated the total damages to more than $10 billion involving damage to businesses and governments in Ukraine, Georgia, France, and other European Countries. | On October 20, 2020, the U.S. DOJ indicted six members of the Russian military  |\n|  2017 Equifax Data Breach | Aggressive Act of Espionage | Equifax databases were attacked impacting 143 million people | In February 2020, the U.S. charged 4 members of the Chinese military  |\n|  2014 U.S. OPM Data Breach | Aggressive Act of Espionage | Data Breach of 21.5 million current and former U.S. government employees | No public attribution due to national security concerns (CRS, 2015)  |\n|  2014 Sony Attacks | Critical Infrastructure Cyber-Attack and Economic Crime | US $171M damage, attacked 77 million accounts, described as worse computer data breach in U.S. history | Following the FBI's attribution of the Sony Pictures hack to North Korea on Dec. 19, 2014 The U.S. imposed sanctions against 10 individuals and three entities associated with the country's Pyongyang-based government  |\n|  2010 Stuxnet Attack | Criminal Act – Economic Crime | Infected an estimated 100,000 computers and set-back Iran's Nuclear Program | No formal attribution  |\n# 4. The evidence: Attribution through criminal indictments\nInvariably, one of the first responses after a cyber-attack is: Who did it and how do we know? In legal terminology the legal process for charging someone with a wrongful act is known as burden of proof. In the attribution world this concept is little discussed in the context of a cyber-attack. The law of attribution conjures up numerous questions on the procedural side as even if the substantive law is clear the procedural rules may be ridden with twists and turns that make it difficult to prove your case. In international disputes the ICJ has held that “[a]s a general rule it is for the party which alleges a fact in support of its claims to prove the existence of that fact” (ICJ, 2010).\nAs highlighted in Delbert Tran's (2018) overview of the law of attribution, before developing rules for attribution it is important to note the distinctions in adversarial v. inquisitorial legal systems which govern most of the legal world. The features of adversarial and inquisitorial systems include common characteristics such as burdens of proof and persuasion, state responsibility doctrines, and rules governing evidentiary production. Though the features are similar they can be administered in different ways. The adversarial system assumes that the best way to get to the truth of a matter is through a competitive process to determine the facts and application of the law accurately. The inquisitorial system associated with civil law legal systems, is characterized by extensive pre-trial investigation and interrogations with the objective to avoid bringing an innocent person to trial. The inquisitorial process can be described as an official inquiry to ascertain the truth, whereas the adversarial system uses a competitive process between prosecution and defence to determine the facts. (Reichel, 2018). For example, in the United States, the burden of production is a minimal burden to produce at least enough evidence for the trier of fact to consider a disputed claim. After litigants have met the burden of production, they have the burden of persuasion: that enough evidence has been presented to persuade the trier of fact that their side is correct.\nTo be committed of a crime under U.S. law does not require absolute certainty but rather demands only that there be no reasonable doubt. The lowest standard is \"prima facie evidence,\" which requires merely indicative or plausible proof. An intermediate standard is \"preponderance of probability,\" under which the existence of the fact to be proved must be more likely than not, or, in other words, that it is reasonably probable (Green, 2009). Whereas common law jurisdictions apply all three standards of proof depending on the situation, civil law jurisdiction tend to limit the standard of proof to a single general rule: the judge must be \"convinced\" that a disputed fact is true (Dederer and Singer, 2019).\nVirginia Greiman\nThe burden of proof may be different, however, in instances where the response is a countermeasure against the State of origin of the adverse cyber operation. The victim State may have to prove only that the State of origin breached its duty to prevent significant transboundary harm by not taking reasonable measures to prevent imminent, or stop ongoing adverse cyber operations carried from within its territory (Roscini, 2015).\nThe first public attribution by the U.S. Department of Justice came in the form of an indictment in 2014, when a grand jury in the Western District of Pennsylvania indicted five members of China's PLA Unit 61398, for hacking and conspiring to hack companies, including Westinghouse and U.S. Steel, in order to steal intellectual property (USDOJ, 2014). The fifty-six-page indictment alleges violations of the Computer Fraud and Abuse Act, including conspiracy, unauthorized access to computers, and computer damage. The indictment also includes charges of economic espionage and trade secret theft. Other indictments have followed. For example, in 2017, a federal grand jury indicted two Russian Federal Security Service (FSB) officers for directing a hack that compromised 500 million Yahoo accounts. And in early 2020, a federal grand jury indicted four members of China's PLA for the 2017 hack of consumer credit reporting agency Equifax--a breach that compromised the personal information of 145 million U.S. victims (USDOJ, 2020).\nThe problem, then, is not in identifying the source of an attack. The challenge is in convincing other states that a source has correctly been identified. A state that wishes to employ countermeasures needs to convince other states of the accuracy of its attribution in order to establish the legitimacy of its attack. This issue may arise for two main reasons: (1) attribution may be based on data collected through state espionage or intelligence-gathering efforts that states may wish to keep secret; and (2) when states have plausible factual bases for attributing an attack, they may not want to disclose such evidence, since cyber attackers could learn from those mistakes and avoid leaving the same fingerprints in the future (Tran, 2019)\nAs the most advanced cyber states recognize the risks of cyber escalation, those states have good reason to become more transparent about attribution in service of the mutual restraint that could be gained by sharing attribution information. But to date, state concerns about revealing intelligence sources and methods counsel against transparency. (Banks, 2019)\n## 5. The response: Public cyber attribution: A political tool or a consensus of states\nCyber attribution has been widely discussed in the literature, yet there is still no international consensus on what rules of attribution may be needed to meet the needs and concerns of the international community (Clark and Landau, 2010; Dunn Cavelty, 2008; Lindsay, 2015; Lupovici, 2016; Nye, 2017; Rid and Buchanan, 2015). Recent decisions on attribution by governments and private industry have shown the desire to share these findings publicly even if the findings are, or will be, contested (Egloff, 2020). Two areas of concern in public attribution are (1) the mechanisms that lead to attribution; and (2) what happens after attribution. Governments have a strong incentive to use public attribution as a political tool, to understand better how the sharing of information may provide an impetus for governments, private sector participants, international organizations, and academics to come forward to contribute to the attribution dialogue. In 2016 the Department of Defense Law of War Manual was updated. Although it does discuss cyber operations, the Manual does not include standards of attribution, rules of targeting, or the requirement to review cyber weapons (DoD, 2016). Considering the importance of attribution in preventing and deterring cyber activity this is a significant omission.\nAs shown by the lack of clarity in resolving the problems of attribution, domestic laws are not sufficient to negotiate the challenges arising from trans-border issues such as those relating to national security and human rights, the public's right of access to information, the individual's right to privacy, the corporation's right to remain competitive, the right to criminal process, and extraterritorial jurisdiction. International cooperation and international laws are also needed—both to allocate authority among political entities, and to define and protect core substantive values in the physical and virtual worlds (Bederman and Keitner, 2016). Powerful actors such as the United States, Russia, and the United Kingdom have not gone far enough in addressing the problems of attribution.\nScholars contend that a treaty which bans the use of cyber-attacks or limits their use is not realistic because there is currently no way to ensure compliance. More effective may be the establishment of norms as proposed by NATO, the OECD, and other transnational organizations to prevent the possibility of a cyber war through universal acceptance of attribution norms or standards. States must demonstrate that they are willing to take\n106\nVirginia Greiman\nthe necessary steps to protect the security and prevent the misuse of the Internet in their respective countries” (Hathaway, 2017). This requires a calling out of wrongful acts conducted by other states, through a harmonized attribution process, something that victimized states have been reluctant to do (Hathaway, 2017, p. 5).\nSeveral non-state-driven norms-making initiatives have sought to fill the void, including Microsoft’s (2016) cyber norms proposals and the Tallinn Manual project. Scholars have contended that this emerging body of non-binding norms presents states with a critical window of opportunity to reclaim a central law-making position, similar to historical precedents including the development of legal regimes for Antarctica and nuclear safety (Mačák, 2017). The global dialogue on cybersecurity norms is evolving from a conceptual discussion about nation-states’ rights and responsibilities, toward an articulation of norms of state and industry behavior. These proposals vary in their prescriptions and subject areas.\nLegal scholars have also noted the need for accountability at the international level when one country is wrongfully attacked by another (Kuntz, 2013). For example, the United States’ Cyber Economic Espionage Accountability Act expresses the sense of Congress that cyber economic espionage should be a priority issue in all economic and diplomatic discussions with the People’s Republic of China, with the Russian Federation and other countries determined to encourage, tolerate, or conduct such cyber economic espionage (USDOJ, 2014). Scholars recognize that States must develop accountable attribution mechanisms for international law to have practical value in the cyber sphere (Banks, 2019).\nResearchers have proposed a due diligence framework or minimal standards for attribution of cyber-attacks (Chircop, 2018). A due diligence failure occurs when a state has knowledge of a cyber operation being carried out from within its territory, contrary to the rights of another, and fails to take reasonable measures to prevent it (Tallinn, Rule 6 at 42). Though due diligence is not clearly defined in the law it was reflected by the International Court of Justice (ICJ) in its Corfu Channel Judgment: “It is every State’s obligation not to allow knowingly its territory to be used for acts contrary to the rights of other states (Corfu, 1949) and has been set forth as an obligation of States in the pronouncements of the International Law Association (ILA, 2014). With the rise of cyber-attacks globally and no end in sight, international cyber security law is at a critical juncture. The failure of states to engage in the development and applications of international law has left a power vacuum allowing for the emergence of non-state norm-making initiatives (Mačák, 2017). As suggested here there is an opportunity now to employ the many initiatives and proposals for the development of standards and norms and to engage the international community in attribution norm and standards building practices.\n## 6. Conclusion\nThis paper has attempted to identify the scope and nature of the attribution problem and the key challenges in attribution from a legal perspective. By analyzing recent cyber events and the means and methods used to address the wrongful acts of nation states one can reasonably conclude that the lack of a legal framework has contributed to rather than reduced the likelihood of future cyber-attacks. Wrongful acts that go unpunished will continue to occur. The reasons are alarming including the lack of standards and an evidentiary process for attributing wrongful conduct that would meet the consensus of the international community. There is opportunity now to find meaningful standards that would provide safeguards from liability for good faith efforts to prevent wrongdoing and future violations of international law. Future research must explore possible solutions for enhancing not only the laws of attribution, but the policies that inform these laws to meet modern realities. This requires multilateral cooperation and an international agreement on the rules and norms that govern cyber attribution both at the national security and economic level to better meet the needs of our evolving cyber landscape.",
  "references": [
    "## References\nBanks, W. (2019) “The Bumpy Road to a Meaningful International Law of Cyber Attribution.” American Journal of International Law Unbound, vol. 113, pp 191-196. doi:10.1017/aju.2019.32.\nBederman, D.J. and Keitner, C. (2016) International Law Frameworks: Concepts and Insights, 4th Ed., Foundation Press.\nCarlin, J. P. (2016) “Detect, Disrupt, Deter: A Whole-of-Government Approach to National Security Cyber Threats”, 7 Harv. Nat’l Sec. J. 391, 409.\nChircop, L. (2018) “A Due Diligence Standard of Attribution in Cyberspace”. International and Comparative Law Quarterly, vol. 67, no. 3, pp 643-668. doi:10.1017/S0020589318000015.\nCyber Infrastructure Security Agency. December 14, 2020. “CISA Issues Emergency Directive to Mitigate the Compromise of Solarwinds Orion Network Management Products”. CISA, Washington, D.C.\n107\nVirginia Greiman\nClarke, D.D. and Landau, S. (2011) \"Untangling Attribution\" 2 Harv. Nat'l Sec. J. 531, 531.\nCouncil on Foreign Relations (CFR). (2020). Cyber Operations Tracker, CFR, New York.\nCongressional Research Services (CRS). Cyber Intrusion into U.S. Office of Personnel Management: In Brief. By K. Finklea, M. D. Christensen, E. A. Fischer, S. V. Lawrence, C. A. Theohary, Washington: Government Printing Office, July 17, 2015 (Congressional Research Services Report) (7-5700, R44111).\nCorfu Channel (United Kingdom v Albania) (Judgment) [1949] ICJ Rep 4, 22 (Corfu Channel).\nDederer, H-G and Singer, T. (2019) \"Adverse Cyber Operations: Causality, Attribution, Evidence, and Due Diligence\", 95 Int'l L. Stud. 430.\nDunn Cavelty, M., and Egloff, F. J. (2019) \"The politics of cybersecurity: Balancing different roles of the state\", St Antony's International Review, vol. 15, no. 1, pp 37-57.\nEgloff, F.J. (2020) \"Contested public attributions of cyber incidents and the role of academia\", Contemporary Security Policy, vol. 41, no. 1, pp 55-81, DOI: 10.1080/13523260.2019.1677324.\nEichensehr, K. E. (2020) \"The Law and Politics of Cyberattack Attribution\", 67 UCLA L. Rev. 520.\nGreen, J.A. (2009) \"Fluctuating Evidentiary Standards for Self-Defence in the International Court of Justice\", 58 International and Comparative Law Quarterly 163, 165.\nGreenberg, A. \"The Untold Story of NotPetya, The Most Devastating Cyberattack in History\". Wired, August 22, 2018.\nHathaway, M. (2017) \"Getting Beyond Norms,\" CIGI Papers No. 127, Centre for International Governance Innovation, Ontario, Canada.\nInternational Court of Justice (ICJ) Ahmadou Sadio Diallo (Guinea v. Dem. Rep. Congo) Merits, Judgment, 2010 I.C. J. Rep. 639 para 54 (Nov 30).\nInternational Law Association (ILA), ILA Study Group on Due Diligence in International Law (First Report, ILA, 7 March 2014).\nInternational Law Commission (ILC), Report of the International Law Commission, Draft Articles of State Responsibility, UN GAOR, 53rd Sess., Supp. No. 10, UN Doc. A/56/10 (2001).\nKuntz, R. L. (2013) \"How Not to Catch A Thief: Why the Economic Espionage Act Fails to Protect American Trade Secrets\", 28 Berkeley Tech. L.J. 901.\nLindsay, J. R. (2015) \"Tipping the scales: the attribution problem and the feasibility of deterrence against cyberattack\". Journal of Cybersecurity, vol. 1, no. 1, pp 53-67. doi:10.1093/cybsec/tyv003.\nLupovici, A. (2016) \"The \"attribution problem and the social construction of \"violence: Taking cyber deterrence literature a step forward\". International Studies Perspectives, vol 17, 322-342. doi:10.1111/insp.12082.\nMačák, K. (2017) \"From Cyber Norms to Cyber Rules: Re-engaging States as Law-makers\". Leiden Journal of International Law, Vol. 30, No. 4, pp 877 - 899.\nMcGee, M. K. (2017) A New In-Depth Analysis of Anthem Breach: Insurance Commissioners Conclude Nation-State Involved, Reach Settlement with Insurer. HealthInfoSec, January 10.\nMicrosoft (2016) \"From articulation to implementation: Enabling progress on cybersecurity norms,\" White Paper, Microsoft, Redmond, Washington.\nNye, J. S. (2017) \"Deterrence and dissuasion in cyberspace\". International Security, vol. 41 no. 3, pp 44-71. doi:10.1162/ISEC_a_00266.\nReichel, P. L. (2018) Comparative Criminal Justice Systems: A Topical Approach, 7th Edition, Pearson.\nRid, T., and Buchanan, B. (2015) \"Attributing Cyber Attacks\". Journal of Strategic Studies, vol. 38, no. 1-2, pp 4-37.\nRoscini, M. (2015) \"Evidentiary Issues in International Disputes Related to State Responsibility for Cyber Operations\", 50 Texas International Law Journal, 233, 239-40.\nRomanosky, S. and Boudreaux, B. (2020) \"Private-Sector Attribution of Cyber Incidents: Benefits and Risks to the U.S. Government,\" International Journal of Intelligence and CounterIntelligence, pp. 1-31.\nSmith, B. (2020) \"A moment of reckoning: the need for a strong and global cybersecurity response.\" Microsoft on the Issues: The Official Microsoft Blog. https://blogs.microsoft.com/on-the-issues/2020/12/17/cyberattacks-cybersecurity-solarwinds-fireeye/.\nTallinn Manual 2.0 on the International Law Applicable to Cyber Operations (Michael N. Schmitt 2nd ed., 2017). Prepared by the International Group of Experts at the Invitation of the NATO Cooperative Cyber Defence Centre of Excellence (CCD COE), Cambridge University Press.\nTran, D. (2018) \"The Law of Attribution: Rules for Attributing the Source of a Cyber-Attack,\" 20 Yale J. L. and Tech. 376, 397.\nU.S. Department of Defense (DoD). (2016) Law of War Manual. Office of the General Counsel, Washington, D.C.\nUnited States Cyber Economic Espionage Accountability Act Summary: H.R.2281 - 113th Congress (2013-2014).\nU.S. Department of Justice (February 10, 2020). \"Chinese Military Personnel Charged with Computer Fraud, Economic Espionage and Wire Fraud for Hacking into Credit Reporting Agency Equifax,\" DOJ, Office of Public Affairs, Washington, D.C.\nUnited States Department of Justice (2014) \"U.S. Charges Five Chinese Military Hackers for Cyber Espionage Against U.S. Corporation and a Labor Organization for Commercial Advantages,\" U.S. Department of Justice, Office of Public Affairs, Washington, D.C.\n108\nReproduced with permission of copyright owner. Further reproduction prohibited without permission."
  ],
  "flat_text": "The Politics and Practice of Cyber Attribution: A Global Legal Perspective Virginia Greiman Boston University, USA ggreiman@bu.edu DOI: 10.34190/IWS.21.116 Abstract: The conundrum of attribution has long been an issue in cyberspace where actors can secretly go about their business without fear of retaliation or retribution. Identifying the responsible actors for cyber- attacks is a monumental challenge though politics usually determines whether attributions are made public. When and how to accuse governments of a cyber-crime, cyber espionage or even an act of cyber war is a critical issue in reducing cyber conflicts and encouraging cyber cooperation. There is no international legal obligation to reveal the grounds on which attribution is based prior to taking appropriate action. States are likewise not obligated to provide evidence of attribution when responding to another state's cyber intrusions. Recognizing that customary international law has not developed a set of understandings or recognized state practice on what level of attribution is acceptable or necessary for establishing state responsibility for cyber actions this paper intends to address that gap. National governments, scholars, private industry, and think tanks have recently offered proposals and standards for the handling of attribution of state sponsored cyber-attacks. The focus of this article is to explore these proposals and standards from an international perspective through the analysis of national practice and international norms and regulations to determine how the international community might develop a system of law on attribution that would meet universal acceptance.\nKeywords: cyber attribution, cyber law standards, law and regulation of cyber attribution # 1. Introduction Following a cyber-attack, States have to deal with the challenge of attribution defined as\"identifying the agent responsible for the action\". Cyber attribution is the process by which evidence of a malicious cyber activity is collected, analyzed, and identified with the attacker. This is not an easy task due to technological challenges and the ability to hide behind the anonymity of other actors and agents (Tallin 2.0, 2017). Though identifying the machines has become much easier for sophisticated cyber states, identifying the persons, organization, or states that are legally responsible for the cyberattack remains the ultimate challenge. Significant technological strides in attributing cyber events in the last decade have made the task\"more nuanced, more common, and more political than has typically been acknowledged\". The political aspect includes assessing what is at stake in making the attribution judgment, starting with the damage incurred, whether physical, financial, or reputational (Rid and Buchanan, p. 7). As such, attribution is often expressed in degrees of certainty, and it requires input from a range of actors and sources, including technical forensics, human intelligence, signals intelligence, history, and diplomatic relations.\nNo international laws or treaties expressly regulate the use of cyber-attacks. While scholars point to the potential application of the law of armed conflict, such law has notably not been invoked thus far to respond to cyber-attacks. The problems derive from technical means of deception and anonymity, but they are also due to the vagaries of the process of fixing responsibility for cyberattacks within the international community and the malleability and open-endedness of the few attribution rules that currently exist in international law The problems of attribution are illustrated by a recent cyber-attack causing massive damage on a global scale. On December 13, 2020, the United States Cybersecurity and Infrastructure Security Agency (CISA) issued its fifth-ever emergency directive, which mandated government users disconnect from its monitoring service, SolarWinds Orion due to the determination that an\"outside nation state\"had found a back door into some updated versions of the software. Widely believed to be Russian backed hackers it was described by Microsoft's President, Brad Smith as Washington's worst cyberespionage failure on record impacting private companies and governments across the globe calling for more collaborative leadership by the government and the tech sector in the United States. Though no formal attribution has been issued to date, the attack continues to raise serious concerns on the regulation of cyber-attacks and cyber attribution.\n\nThe challenges of attribution are also evident whenever there is a failure to charge the perpetrators of a serious cyber event until years after the attack. On January 29, 2015, it was discovered that Anthem, Inc, one of the nation's leading health insurers, was the victim of a massive cyberattack. The hackers began accessing the information in early December 2014 and, during a nearly 7-week window, perpetrators were able to gain access to nearly 80 million records . In 2017, seven state insurance commissioners, issued a report on their investigation into the cyberattack against Anthem and concluded that a nation-state was behind the attack. But they stopped short of naming the nation involved . It was not until 2019 that U.S. DOJ charged a Chinese hacker for the 2015 Anthem breach.\nCyber attribution is a topic covered quite extensively in the literature however, the legal requirements of attribution are clearly lacking due to the failure of a universal consensus on the laws, regulations and standards that are applicable when attributing a cyber-attack to a state-sponsored entity. As shown in figure 1, this paper explores the relationship between the law of attribution, the evidence required to prove attribution, and the responses that nation states have chosen when faced with decisions that require careful evaluation of the interests faced by the victim nation including economic, social, political, and national security interests. The research comprises a review and comparative analysis of the international law governing attribution, the applicable rules of evidence, and the analysis of recent literature including government and private sector studies that analyze state responses to cyber-attacks.\nFigure 1: The attribution laws, evidence and responses\n# 2. The law and challenges of attribution\nLegal challenges for attribution can be brought under international law based on two types of acts: (1) responsibility of states for Internationally wrongful acts; and (2) an unlawful cyber intrusion (Tallinn 2.0, 2017). The law of attribution for cyber intrusions aims to identify and place responsibility for internationally wrongful acts . The customary law of state responsibility for violations of international law, and with it the law of attribution, is drawn primarily from the long-term work of the International Law Commission (ILC) and its Draft Articles on Responsibility of States for Internationally Wrongful Acts . Although not a treaty, the ILC rules were commended to the member states by the UN General Assembly in 2001 and have become the authoritative guidepost for public international cyber law. The Rules have been cited repeatedly by courts, tribunals, and other bodies. Drawing from the ILC rules, the threshold point in the cyber context is that \"a State bears international responsibility for a cyber-related act that is attributable to the State and that constitutes a breach of an international legal obligation\" (Tallinn at 84). In essence, according to the Tallinn Manual 2.0, rule 15, states are responsible for the wrongful cyber-related acts of their own officials, agents, contractors, nonstate actors, and other states, to the extent they actually control the operations.\nRule 20 of the Tallinn Manual 2.0 provides that if a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Though punitive countermeasures are forbidden (Tallinn at 124), states must give prior notice to the offending state, and their purpose must include compliance with international law (Tallinn at 120). Importantly, there is no prohibition against injured states turning to a private firm, including foreign companies, to conduct cyber countermeasures on their behalf against responsible stares though the company's operations would generally be attributable to the injured States (Tallinn, rule 17).\nVirginia Greiman\nThe second part of any legal analysis of attribution requires an understanding of the right of a victim state to take countermeasures against a state sponsored attack . If a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Countermeasures are responses that otherwise would violate international law, designed to prevent a responsible state from continuing its unlawful cyber intervention\" (Tallinn at 111).\n# 3. Options after attributing an attack\nAssuming a State's technical and legal analysis is capable of attributing an attack, what are the options available to a victim nation after an attack? Cyber-attacks in the United States and around the globe have demonstrated various responses by nation states. The most common form of response is through economic punishment or denial of benefits offered by international treaties or conventions. In cases where the evidence is clear as to the attacker it might justify retaliation through counter measures. In the case of a cyber war the response may be a declaration of war against the nation state. According to the Council on Foreign Relations Cyber Operations Tracker, since 2005, thirty-four countries are suspected of sponsoring cyber operations. China, Russia, Iran, and North Korea sponsored 77 percent of all suspected operations. In 2019, there were a total of seventy-six operations, most being acts of espionage . Recent attacks shown in table 1 highlight this reality. In a recent study of private sector attribution of cyber incidents, sponsored by the Office of the Secretary of Defense and the RAND National Defense Research Institute, the most commonly stated motive for U.S. government attribution was to promote deterrence in cyberspace. Participants also noted that public attribution may help build international consensus on what constitutes irresponsible or inappropriate behavior in cyberspace .\nImportantly, the United States has not taken a standardized approach to attribution—either in the timing of attribution, the mode, the type, or the extent of evidence supporting the attribution, the confidence level, or whether attribution is followed by other punitive measures . For example, the 2017 attribution of WannaCry and the 2018 attribution of NotPetya involved coordinated statements with international partners; however, in the Equifax cyber-attack, it was the private company that worked with the UK and Canadian regulators to determine appropriate next steps. Leveraging the capabilities of the private sector is a significant strategy that has been used by the United States and other countries.\nRussia, meanwhile, hardly seems to have been chastened by the US government's sanctions for NotPetya, which arrived a full eight months after the worm hit and whose punishments were muddled with other messages chastising Russia for everything from 2016 election disinformation to hacker probes of the US power grid . \"The lack of a proper response has been almost an invitation to escalate more,\" says Thomas Rid, a political science professor at Johns Hopkins' School of Advanced International Studies . Escalation was the fear in the case of the 2014 attack on the Office of Personnel Management (OPM). As noted by the Congressional Research Services investigation, \"criminal charges appear to be unlikely.\" \"As a matter of policy, the United States has sought to distinguish between cyber intrusions to collect data for national security purposes — to which the United States deems counterintelligence to be an appropriate response — and cyber intrusions to steal data for commercial purposes, to which the United States deems a criminal justice response to be appropriate\" .\nThe United States has used its improved capabilities to make a number of public attributions in recent years. Public attributions by the U.S. government take one of four forms: (1) criminal indictments; (2) economic sanctions; (3) technical alerts; and (4) official statements or press releases. If a public attribution is not made it does not mean that attribution has not taken place. For example, attribution can take place through various forms of retaliation including unattributed attacks. Table 1 highlights some recent cyber-attacks and the type of threat, impact on the victims, and how the victim state chose to attribute the attack. It is important to note that to date no cyber threat or attack has been treated as an act of war despite the seriousness and the extent of the damage. As we will see in the next section the decision to treat an attack as a criminal act depends largely on the ability to prove the case in a court of a law based on widely disparate legal systems around the world.\nTable 1: Major cyber events, impact and attribution\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|  2020 Solar Wind Hack | Espionage-based assault | Broad attack on confidential information of U.S. Government | Alleged Russian Hacker Group. No formal attribution to date  |\nVirginia Greiman\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|   |  | including Homeland Security and the Pentagon and the tech tools used by companies to protect them. |   |\n|  2017 NotPetya | Conspiracy, Ransomware and Espionage | Homeland Security estimated the total damages to more than $10 billion involving damage to businesses and governments in Ukraine, Georgia, France, and other European Countries. | On October 20, 2020, the U.S. DOJ indicted six members of the Russian military  |\n|  2017 Equifax Data Breach | Aggressive Act of Espionage | Equifax databases were attacked impacting 143 million people | In February 2020, the U.S. charged 4 members of the Chinese military  |\n|  2014 U.S. OPM Data Breach | Aggressive Act of Espionage | Data Breach of 21.5 million current and former U.S. government employees | No public attribution due to national security concerns   |\n|  2014 Sony Attacks | Critical Infrastructure Cyber-Attack and Economic Crime | US $171M damage, attacked 77 million accounts, described as worse computer data breach in U.S. history | Following the FBI's attribution of the Sony Pictures hack to North Korea on Dec. 19, 2014 The U.S. imposed sanctions against 10 individuals and three entities associated with the country's Pyongyang-based government  |\n|  2010 Stuxnet Attack | Criminal Act – Economic Crime | Infected an estimated 100,000 computers and set-back Iran's Nuclear Program | No formal attribution  |\n# 4. The evidence: Attribution through criminal indictments\nInvariably, one of the first responses after a cyber-attack is: Who did it and how do we know? In legal terminology the legal process for charging someone with a wrongful act is known as burden of proof. In the attribution world this concept is little discussed in the context of a cyber-attack. The law of attribution conjures up numerous questions on the procedural side as even if the substantive law is clear the procedural rules may be ridden with twists and turns that make it difficult to prove your case. In international disputes the ICJ has held that “[a]s a general rule it is for the party which alleges a fact in support of its claims to prove the existence of that fact” .\nAs highlighted in Delbert Tran's (2018) overview of the law of attribution, before developing rules for attribution it is important to note the distinctions in adversarial v. inquisitorial legal systems which govern most of the legal world. The features of adversarial and inquisitorial systems include common characteristics such as burdens of proof and persuasion, state responsibility doctrines, and rules governing evidentiary production. Though the features are similar they can be administered in different ways. The adversarial system assumes that the best way to get to the truth of a matter is through a competitive process to determine the facts and application of the law accurately. The inquisitorial system associated with civil law legal systems, is characterized by extensive pre-trial investigation and interrogations with the objective to avoid bringing an innocent person to trial. The inquisitorial process can be described as an official inquiry to ascertain the truth, whereas the adversarial system uses a competitive process between prosecution and defence to determine the facts. . For example, in the United States, the burden of production is a minimal burden to produce at least enough evidence for the trier of fact to consider a disputed claim. After litigants have met the burden of production, they have the burden of persuasion: that enough evidence has been presented to persuade the trier of fact that their side is correct.\nTo be committed of a crime under U.S. law does not require absolute certainty but rather demands only that there be no reasonable doubt. The lowest standard is \"prima facie evidence,\" which requires merely indicative or plausible proof. An intermediate standard is \"preponderance of probability,\" under which the existence of the fact to be proved must be more likely than not, or, in other words, that it is reasonably probable . Whereas common law jurisdictions apply all three standards of proof depending on the situation, civil law jurisdiction tend to limit the standard of proof to a single general rule: the judge must be \"convinced\" that a disputed fact is true .\nVirginia Greiman\nThe burden of proof may be different, however, in instances where the response is a countermeasure against the State of origin of the adverse cyber operation. The victim State may have to prove only that the State of origin breached its duty to prevent significant transboundary harm by not taking reasonable measures to prevent imminent, or stop ongoing adverse cyber operations carried from within its territory .\nThe first public attribution by the U.S. Department of Justice came in the form of an indictment in 2014, when a grand jury in the Western District of Pennsylvania indicted five members of China's PLA Unit 61398, for hacking and conspiring to hack companies, including Westinghouse and U.S. Steel, in order to steal intellectual property . The fifty-six-page indictment alleges violations of the Computer Fraud and Abuse Act, including conspiracy, unauthorized access to computers, and computer damage. The indictment also includes charges of economic espionage and trade secret theft. Other indictments have followed. For example, in 2017, a federal grand jury indicted two Russian Federal Security Service (FSB) officers for directing a hack that compromised 500 million Yahoo accounts. And in early 2020, a federal grand jury indicted four members of China's PLA for the 2017 hack of consumer credit reporting agency Equifax--a breach that compromised the personal information of 145 million U.S. victims .\nThe problem, then, is not in identifying the source of an attack. The challenge is in convincing other states that a source has correctly been identified. A state that wishes to employ countermeasures needs to convince other states of the accuracy of its attribution in order to establish the legitimacy of its attack. This issue may arise for two main reasons: (1) attribution may be based on data collected through state espionage or intelligence-gathering efforts that states may wish to keep secret; and (2) when states have plausible factual bases for attributing an attack, they may not want to disclose such evidence, since cyber attackers could learn from those mistakes and avoid leaving the same fingerprints in the future As the most advanced cyber states recognize the risks of cyber escalation, those states have good reason to become more transparent about attribution in service of the mutual restraint that could be gained by sharing attribution information. But to date, state concerns about revealing intelligence sources and methods counsel against transparency. ## 5. The response: Public cyber attribution: A political tool or a consensus of states\nCyber attribution has been widely discussed in the literature, yet there is still no international consensus on what rules of attribution may be needed to meet the needs and concerns of the international community . Recent decisions on attribution by governments and private industry have shown the desire to share these findings publicly even if the findings are, or will be, contested . Two areas of concern in public attribution are (1) the mechanisms that lead to attribution; and (2) what happens after attribution. Governments have a strong incentive to use public attribution as a political tool, to understand better how the sharing of information may provide an impetus for governments, private sector participants, international organizations, and academics to come forward to contribute to the attribution dialogue. In 2016 the Department of Defense Law of War Manual was updated. Although it does discuss cyber operations, the Manual does not include standards of attribution, rules of targeting, or the requirement to review cyber weapons . Considering the importance of attribution in preventing and deterring cyber activity this is a significant omission.\nAs shown by the lack of clarity in resolving the problems of attribution, domestic laws are not sufficient to negotiate the challenges arising from trans-border issues such as those relating to national security and human rights, the public's right of access to information, the individual's right to privacy, the corporation's right to remain competitive, the right to criminal process, and extraterritorial jurisdiction. International cooperation and international laws are also needed—both to allocate authority among political entities, and to define and protect core substantive values in the physical and virtual worlds . Powerful actors such as the United States, Russia, and the United Kingdom have not gone far enough in addressing the problems of attribution.\nScholars contend that a treaty which bans the use of cyber-attacks or limits their use is not realistic because there is currently no way to ensure compliance. More effective may be the establishment of norms as proposed by NATO, the OECD, and other transnational organizations to prevent the possibility of a cyber war through universal acceptance of attribution norms or standards. States must demonstrate that they are willing to take\n\nthe necessary steps to protect the security and prevent the misuse of the Internet in their respective countries”. This requires a calling out of wrongful acts conducted by other states, through a harmonized attribution process, something that victimized states have been reluctant to do.\nSeveral non-state-driven norms-making initiatives have sought to fill the void, including Microsoft’s (2016) cyber norms proposals and the Tallinn Manual project. Scholars have contended that this emerging body of non-binding norms presents states with a critical window of opportunity to reclaim a central law-making position, similar to historical precedents including the development of legal regimes for Antarctica and nuclear safety (Mačák, 2017). The global dialogue on cybersecurity norms is evolving from a conceptual discussion about nation-states’ rights and responsibilities, toward an articulation of norms of state and industry behavior. These proposals vary in their prescriptions and subject areas.\nLegal scholars have also noted the need for accountability at the international level when one country is wrongfully attacked by another. For example, the United States’ Cyber Economic Espionage Accountability Act expresses the sense of Congress that cyber economic espionage should be a priority issue in all economic and diplomatic discussions with the People’s Republic of China, with the Russian Federation and other countries determined to encourage, tolerate, or conduct such cyber economic espionage. Scholars recognize that States must develop accountable attribution mechanisms for international law to have practical value in the cyber sphere.\nResearchers have proposed a due diligence framework or minimal standards for attribution of cyber-attacks. A due diligence failure occurs when a state has knowledge of a cyber operation being carried out from within its territory, contrary to the rights of another, and fails to take reasonable measures to prevent it (Tallinn, Rule 6 at 42). Though due diligence is not clearly defined in the law it was reflected by the International Court of Justice (ICJ) in its Corfu Channel Judgment: “It is every State’s obligation not to allow knowingly its territory to be used for acts contrary to the rights of other states and has been set forth as an obligation of States in the pronouncements of the International Law Association. With the rise of cyber-attacks globally and no end in sight, international cyber security law is at a critical juncture. The failure of states to engage in the development and applications of international law has left a power vacuum allowing for the emergence of non-state norm-making initiatives (Mačák, 2017). As suggested here there is an opportunity now to employ the many initiatives and proposals for the development of standards and norms and to engage the international community in attribution norm and standards building practices.\n## 6. Conclusion This paper has attempted to identify the scope and nature of the attribution problem and the key challenges in attribution from a legal perspective. By analyzing recent cyber events and the means and methods used to address the wrongful acts of nation states one can reasonably conclude that the lack of a legal framework has contributed to rather than reduced the likelihood of future cyber-attacks. Wrongful acts that go unpunished will continue to occur. The reasons are alarming including the lack of standards and an evidentiary process for attributing wrongful conduct that would meet the consensus of the international community. There is opportunity now to find meaningful standards that would provide safeguards from liability for good faith efforts to prevent wrongdoing and future violations of international law. Future research must explore possible solutions for enhancing not only the laws of attribution, but the policies that inform these laws to meet modern realities. This requires multilateral cooperation and an international agreement on the rules and norms that govern cyber attribution both at the national security and economic level to better meet the needs of our evolving cyber landscape.",
  "citations": {
    "style": "author_year",
    "flat_text": "The Politics and Practice of Cyber Attribution: A Global Legal Perspective Virginia Greiman Boston University, USA ggreiman@bu.edu DOI: 10.34190/IWS.21.116 Abstract: The conundrum of attribution has long been an issue in cyberspace where actors can secretly go about their business without fear of retaliation or retribution. Identifying the responsible actors for cyber- attacks is a monumental challenge though politics usually determines whether attributions are made public. When and how to accuse governments of a cyber-crime, cyber espionage or even an act of cyber war is a critical issue in reducing cyber conflicts and encouraging cyber cooperation. There is no international legal obligation to reveal the grounds on which attribution is based prior to taking appropriate action. States are likewise not obligated to provide evidence of attribution when responding to another state's cyber intrusions. Recognizing that customary international law has not developed a set of understandings or recognized state practice on what level of attribution is acceptable or necessary for establishing state responsibility for cyber actions this paper intends to address that gap. National governments, scholars, private industry, and think tanks have recently offered proposals and standards for the handling of attribution of state sponsored cyber-attacks. The focus of this article is to explore these proposals and standards from an international perspective through the analysis of national practice and international norms and regulations to determine how the international community might develop a system of law on attribution that would meet universal acceptance.\nKeywords: cyber attribution, cyber law standards, law and regulation of cyber attribution # 1. Introduction Following a cyber-attack, States have to deal with the challenge of attribution defined as\"identifying the agent responsible for the action\". Cyber attribution is the process by which evidence of a malicious cyber activity is collected, analyzed, and identified with the attacker. This is not an easy task due to technological challenges and the ability to hide behind the anonymity of other actors and agents (Tallin 2.0, 2017). Though identifying the machines has become much easier for sophisticated cyber states, identifying the persons, organization, or states that are legally responsible for the cyberattack remains the ultimate challenge. Significant technological strides in attributing cyber events in the last decade have made the task\"more nuanced, more common, and more political than has typically been acknowledged\". The political aspect includes assessing what is at stake in making the attribution judgment, starting with the damage incurred, whether physical, financial, or reputational (Rid and Buchanan, p. 7). As such, attribution is often expressed in degrees of certainty, and it requires input from a range of actors and sources, including technical forensics, human intelligence, signals intelligence, history, and diplomatic relations.\nNo international laws or treaties expressly regulate the use of cyber-attacks. While scholars point to the potential application of the law of armed conflict, such law has notably not been invoked thus far to respond to cyber-attacks. The problems derive from technical means of deception and anonymity, but they are also due to the vagaries of the process of fixing responsibility for cyberattacks within the international community and the malleability and open-endedness of the few attribution rules that currently exist in international law The problems of attribution are illustrated by a recent cyber-attack causing massive damage on a global scale. On December 13, 2020, the United States Cybersecurity and Infrastructure Security Agency (CISA) issued its fifth-ever emergency directive, which mandated government users disconnect from its monitoring service, SolarWinds Orion due to the determination that an\"outside nation state\"had found a back door into some updated versions of the software. Widely believed to be Russian backed hackers it was described by Microsoft's President, Brad Smith as Washington's worst cyberespionage failure on record impacting private companies and governments across the globe calling for more collaborative leadership by the government and the tech sector in the United States. Though no formal attribution has been issued to date, the attack continues to raise serious concerns on the regulation of cyber-attacks and cyber attribution.\n\nThe challenges of attribution are also evident whenever there is a failure to charge the perpetrators of a serious cyber event until years after the attack. On January 29, 2015, it was discovered that Anthem, Inc, one of the nation's leading health insurers, was the victim of a massive cyberattack. The hackers began accessing the information in early December 2014 and, during a nearly 7-week window, perpetrators were able to gain access to nearly 80 million records . In 2017, seven state insurance commissioners, issued a report on their investigation into the cyberattack against Anthem and concluded that a nation-state was behind the attack. But they stopped short of naming the nation involved . It was not until 2019 that U.S. DOJ charged a Chinese hacker for the 2015 Anthem breach.\nCyber attribution is a topic covered quite extensively in the literature however, the legal requirements of attribution are clearly lacking due to the failure of a universal consensus on the laws, regulations and standards that are applicable when attributing a cyber-attack to a state-sponsored entity. As shown in figure 1, this paper explores the relationship between the law of attribution, the evidence required to prove attribution, and the responses that nation states have chosen when faced with decisions that require careful evaluation of the interests faced by the victim nation including economic, social, political, and national security interests. The research comprises a review and comparative analysis of the international law governing attribution, the applicable rules of evidence, and the analysis of recent literature including government and private sector studies that analyze state responses to cyber-attacks.\nFigure 1: The attribution laws, evidence and responses\n# 2. The law and challenges of attribution\nLegal challenges for attribution can be brought under international law based on two types of acts: (1) responsibility of states for Internationally wrongful acts; and (2) an unlawful cyber intrusion (Tallinn 2.0, 2017). The law of attribution for cyber intrusions aims to identify and place responsibility for internationally wrongful acts . The customary law of state responsibility for violations of international law, and with it the law of attribution, is drawn primarily from the long-term work of the International Law Commission (ILC) and its Draft Articles on Responsibility of States for Internationally Wrongful Acts . Although not a treaty, the ILC rules were commended to the member states by the UN General Assembly in 2001 and have become the authoritative guidepost for public international cyber law. The Rules have been cited repeatedly by courts, tribunals, and other bodies. Drawing from the ILC rules, the threshold point in the cyber context is that \"a State bears international responsibility for a cyber-related act that is attributable to the State and that constitutes a breach of an international legal obligation\" (Tallinn at 84). In essence, according to the Tallinn Manual 2.0, rule 15, states are responsible for the wrongful cyber-related acts of their own officials, agents, contractors, nonstate actors, and other states, to the extent they actually control the operations.\nRule 20 of the Tallinn Manual 2.0 provides that if a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Though punitive countermeasures are forbidden (Tallinn at 124), states must give prior notice to the offending state, and their purpose must include compliance with international law (Tallinn at 120). Importantly, there is no prohibition against injured states turning to a private firm, including foreign companies, to conduct cyber countermeasures on their behalf against responsible stares though the company's operations would generally be attributable to the injured States (Tallinn, rule 17).\nVirginia Greiman\nThe second part of any legal analysis of attribution requires an understanding of the right of a victim state to take countermeasures against a state sponsored attack . If a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Countermeasures are responses that otherwise would violate international law, designed to prevent a responsible state from continuing its unlawful cyber intervention\" (Tallinn at 111).\n# 3. Options after attributing an attack\nAssuming a State's technical and legal analysis is capable of attributing an attack, what are the options available to a victim nation after an attack? Cyber-attacks in the United States and around the globe have demonstrated various responses by nation states. The most common form of response is through economic punishment or denial of benefits offered by international treaties or conventions. In cases where the evidence is clear as to the attacker it might justify retaliation through counter measures. In the case of a cyber war the response may be a declaration of war against the nation state. According to the Council on Foreign Relations Cyber Operations Tracker, since 2005, thirty-four countries are suspected of sponsoring cyber operations. China, Russia, Iran, and North Korea sponsored 77 percent of all suspected operations. In 2019, there were a total of seventy-six operations, most being acts of espionage . Recent attacks shown in table 1 highlight this reality. In a recent study of private sector attribution of cyber incidents, sponsored by the Office of the Secretary of Defense and the RAND National Defense Research Institute, the most commonly stated motive for U.S. government attribution was to promote deterrence in cyberspace. Participants also noted that public attribution may help build international consensus on what constitutes irresponsible or inappropriate behavior in cyberspace .\nImportantly, the United States has not taken a standardized approach to attribution—either in the timing of attribution, the mode, the type, or the extent of evidence supporting the attribution, the confidence level, or whether attribution is followed by other punitive measures . For example, the 2017 attribution of WannaCry and the 2018 attribution of NotPetya involved coordinated statements with international partners; however, in the Equifax cyber-attack, it was the private company that worked with the UK and Canadian regulators to determine appropriate next steps. Leveraging the capabilities of the private sector is a significant strategy that has been used by the United States and other countries.\nRussia, meanwhile, hardly seems to have been chastened by the US government's sanctions for NotPetya, which arrived a full eight months after the worm hit and whose punishments were muddled with other messages chastising Russia for everything from 2016 election disinformation to hacker probes of the US power grid . \"The lack of a proper response has been almost an invitation to escalate more,\" says Thomas Rid, a political science professor at Johns Hopkins' School of Advanced International Studies . Escalation was the fear in the case of the 2014 attack on the Office of Personnel Management (OPM). As noted by the Congressional Research Services investigation, \"criminal charges appear to be unlikely.\" \"As a matter of policy, the United States has sought to distinguish between cyber intrusions to collect data for national security purposes — to which the United States deems counterintelligence to be an appropriate response — and cyber intrusions to steal data for commercial purposes, to which the United States deems a criminal justice response to be appropriate\" .\nThe United States has used its improved capabilities to make a number of public attributions in recent years. Public attributions by the U.S. government take one of four forms: (1) criminal indictments; (2) economic sanctions; (3) technical alerts; and (4) official statements or press releases. If a public attribution is not made it does not mean that attribution has not taken place. For example, attribution can take place through various forms of retaliation including unattributed attacks. Table 1 highlights some recent cyber-attacks and the type of threat, impact on the victims, and how the victim state chose to attribute the attack. It is important to note that to date no cyber threat or attack has been treated as an act of war despite the seriousness and the extent of the damage. As we will see in the next section the decision to treat an attack as a criminal act depends largely on the ability to prove the case in a court of a law based on widely disparate legal systems around the world.\nTable 1: Major cyber events, impact and attribution\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|  2020 Solar Wind Hack | Espionage-based assault | Broad attack on confidential information of U.S. Government | Alleged Russian Hacker Group. No formal attribution to date  |\nVirginia Greiman\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|   |  | including Homeland Security and the Pentagon and the tech tools used by companies to protect them. |   |\n|  2017 NotPetya | Conspiracy, Ransomware and Espionage | Homeland Security estimated the total damages to more than $10 billion involving damage to businesses and governments in Ukraine, Georgia, France, and other European Countries. | On October 20, 2020, the U.S. DOJ indicted six members of the Russian military  |\n|  2017 Equifax Data Breach | Aggressive Act of Espionage | Equifax databases were attacked impacting 143 million people | In February 2020, the U.S. charged 4 members of the Chinese military  |\n|  2014 U.S. OPM Data Breach | Aggressive Act of Espionage | Data Breach of 21.5 million current and former U.S. government employees | No public attribution due to national security concerns   |\n|  2014 Sony Attacks | Critical Infrastructure Cyber-Attack and Economic Crime | US $171M damage, attacked 77 million accounts, described as worse computer data breach in U.S. history | Following the FBI's attribution of the Sony Pictures hack to North Korea on Dec. 19, 2014 The U.S. imposed sanctions against 10 individuals and three entities associated with the country's Pyongyang-based government  |\n|  2010 Stuxnet Attack | Criminal Act – Economic Crime | Infected an estimated 100,000 computers and set-back Iran's Nuclear Program | No formal attribution  |\n# 4. The evidence: Attribution through criminal indictments\nInvariably, one of the first responses after a cyber-attack is: Who did it and how do we know? In legal terminology the legal process for charging someone with a wrongful act is known as burden of proof. In the attribution world this concept is little discussed in the context of a cyber-attack. The law of attribution conjures up numerous questions on the procedural side as even if the substantive law is clear the procedural rules may be ridden with twists and turns that make it difficult to prove your case. In international disputes the ICJ has held that “[a]s a general rule it is for the party which alleges a fact in support of its claims to prove the existence of that fact” .\nAs highlighted in Delbert Tran's (2018) overview of the law of attribution, before developing rules for attribution it is important to note the distinctions in adversarial v. inquisitorial legal systems which govern most of the legal world. The features of adversarial and inquisitorial systems include common characteristics such as burdens of proof and persuasion, state responsibility doctrines, and rules governing evidentiary production. Though the features are similar they can be administered in different ways. The adversarial system assumes that the best way to get to the truth of a matter is through a competitive process to determine the facts and application of the law accurately. The inquisitorial system associated with civil law legal systems, is characterized by extensive pre-trial investigation and interrogations with the objective to avoid bringing an innocent person to trial. The inquisitorial process can be described as an official inquiry to ascertain the truth, whereas the adversarial system uses a competitive process between prosecution and defence to determine the facts. . For example, in the United States, the burden of production is a minimal burden to produce at least enough evidence for the trier of fact to consider a disputed claim. After litigants have met the burden of production, they have the burden of persuasion: that enough evidence has been presented to persuade the trier of fact that their side is correct.\nTo be committed of a crime under U.S. law does not require absolute certainty but rather demands only that there be no reasonable doubt. The lowest standard is \"prima facie evidence,\" which requires merely indicative or plausible proof. An intermediate standard is \"preponderance of probability,\" under which the existence of the fact to be proved must be more likely than not, or, in other words, that it is reasonably probable . Whereas common law jurisdictions apply all three standards of proof depending on the situation, civil law jurisdiction tend to limit the standard of proof to a single general rule: the judge must be \"convinced\" that a disputed fact is true .\nVirginia Greiman\nThe burden of proof may be different, however, in instances where the response is a countermeasure against the State of origin of the adverse cyber operation. The victim State may have to prove only that the State of origin breached its duty to prevent significant transboundary harm by not taking reasonable measures to prevent imminent, or stop ongoing adverse cyber operations carried from within its territory .\nThe first public attribution by the U.S. Department of Justice came in the form of an indictment in 2014, when a grand jury in the Western District of Pennsylvania indicted five members of China's PLA Unit 61398, for hacking and conspiring to hack companies, including Westinghouse and U.S. Steel, in order to steal intellectual property . The fifty-six-page indictment alleges violations of the Computer Fraud and Abuse Act, including conspiracy, unauthorized access to computers, and computer damage. The indictment also includes charges of economic espionage and trade secret theft. Other indictments have followed. For example, in 2017, a federal grand jury indicted two Russian Federal Security Service (FSB) officers for directing a hack that compromised 500 million Yahoo accounts. And in early 2020, a federal grand jury indicted four members of China's PLA for the 2017 hack of consumer credit reporting agency Equifax--a breach that compromised the personal information of 145 million U.S. victims .\nThe problem, then, is not in identifying the source of an attack. The challenge is in convincing other states that a source has correctly been identified. A state that wishes to employ countermeasures needs to convince other states of the accuracy of its attribution in order to establish the legitimacy of its attack. This issue may arise for two main reasons: (1) attribution may be based on data collected through state espionage or intelligence-gathering efforts that states may wish to keep secret; and (2) when states have plausible factual bases for attributing an attack, they may not want to disclose such evidence, since cyber attackers could learn from those mistakes and avoid leaving the same fingerprints in the future As the most advanced cyber states recognize the risks of cyber escalation, those states have good reason to become more transparent about attribution in service of the mutual restraint that could be gained by sharing attribution information. But to date, state concerns about revealing intelligence sources and methods counsel against transparency. ## 5. The response: Public cyber attribution: A political tool or a consensus of states\nCyber attribution has been widely discussed in the literature, yet there is still no international consensus on what rules of attribution may be needed to meet the needs and concerns of the international community . Recent decisions on attribution by governments and private industry have shown the desire to share these findings publicly even if the findings are, or will be, contested . Two areas of concern in public attribution are (1) the mechanisms that lead to attribution; and (2) what happens after attribution. Governments have a strong incentive to use public attribution as a political tool, to understand better how the sharing of information may provide an impetus for governments, private sector participants, international organizations, and academics to come forward to contribute to the attribution dialogue. In 2016 the Department of Defense Law of War Manual was updated. Although it does discuss cyber operations, the Manual does not include standards of attribution, rules of targeting, or the requirement to review cyber weapons . Considering the importance of attribution in preventing and deterring cyber activity this is a significant omission.\nAs shown by the lack of clarity in resolving the problems of attribution, domestic laws are not sufficient to negotiate the challenges arising from trans-border issues such as those relating to national security and human rights, the public's right of access to information, the individual's right to privacy, the corporation's right to remain competitive, the right to criminal process, and extraterritorial jurisdiction. International cooperation and international laws are also needed—both to allocate authority among political entities, and to define and protect core substantive values in the physical and virtual worlds . Powerful actors such as the United States, Russia, and the United Kingdom have not gone far enough in addressing the problems of attribution.\nScholars contend that a treaty which bans the use of cyber-attacks or limits their use is not realistic because there is currently no way to ensure compliance. More effective may be the establishment of norms as proposed by NATO, the OECD, and other transnational organizations to prevent the possibility of a cyber war through universal acceptance of attribution norms or standards. States must demonstrate that they are willing to take\n\nthe necessary steps to protect the security and prevent the misuse of the Internet in their respective countries”. This requires a calling out of wrongful acts conducted by other states, through a harmonized attribution process, something that victimized states have been reluctant to do.\nSeveral non-state-driven norms-making initiatives have sought to fill the void, including Microsoft’s (2016) cyber norms proposals and the Tallinn Manual project. Scholars have contended that this emerging body of non-binding norms presents states with a critical window of opportunity to reclaim a central law-making position, similar to historical precedents including the development of legal regimes for Antarctica and nuclear safety (Mačák, 2017). The global dialogue on cybersecurity norms is evolving from a conceptual discussion about nation-states’ rights and responsibilities, toward an articulation of norms of state and industry behavior. These proposals vary in their prescriptions and subject areas.\nLegal scholars have also noted the need for accountability at the international level when one country is wrongfully attacked by another. For example, the United States’ Cyber Economic Espionage Accountability Act expresses the sense of Congress that cyber economic espionage should be a priority issue in all economic and diplomatic discussions with the People’s Republic of China, with the Russian Federation and other countries determined to encourage, tolerate, or conduct such cyber economic espionage. Scholars recognize that States must develop accountable attribution mechanisms for international law to have practical value in the cyber sphere.\nResearchers have proposed a due diligence framework or minimal standards for attribution of cyber-attacks. A due diligence failure occurs when a state has knowledge of a cyber operation being carried out from within its territory, contrary to the rights of another, and fails to take reasonable measures to prevent it (Tallinn, Rule 6 at 42). Though due diligence is not clearly defined in the law it was reflected by the International Court of Justice (ICJ) in its Corfu Channel Judgment: “It is every State’s obligation not to allow knowingly its territory to be used for acts contrary to the rights of other states and has been set forth as an obligation of States in the pronouncements of the International Law Association. With the rise of cyber-attacks globally and no end in sight, international cyber security law is at a critical juncture. The failure of states to engage in the development and applications of international law has left a power vacuum allowing for the emergence of non-state norm-making initiatives (Mačák, 2017). As suggested here there is an opportunity now to employ the many initiatives and proposals for the development of standards and norms and to engage the international community in attribution norm and standards building practices.\n## 6. Conclusion This paper has attempted to identify the scope and nature of the attribution problem and the key challenges in attribution from a legal perspective. By analyzing recent cyber events and the means and methods used to address the wrongful acts of nation states one can reasonably conclude that the lack of a legal framework has contributed to rather than reduced the likelihood of future cyber-attacks. Wrongful acts that go unpunished will continue to occur. The reasons are alarming including the lack of standards and an evidentiary process for attributing wrongful conduct that would meet the consensus of the international community. There is opportunity now to find meaningful standards that would provide safeguards from liability for good faith efforts to prevent wrongdoing and future violations of international law. Future research must explore possible solutions for enhancing not only the laws of attribution, but the policies that inform these laws to meet modern realities. This requires multilateral cooperation and an international agreement on the rules and norms that govern cyber attribution both at the national security and economic level to better meet the needs of our evolving cyber landscape.",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "The Politics and Practice of Cyber Attribution: A Global Legal Perspective\nVirginia Greiman\nBoston University, USA\nggreiman@bu.edu\nDOI: 10.34190/IWS.21.116\nAbstract: The conundrum of attribution has long been an issue in cyberspace where actors can secretly go about their business without fear of retaliation or retribution. Identifying the responsible actors for cyber- attacks is a monumental challenge though politics usually determines whether attributions are made public. When and how to accuse governments of a cyber-crime, cyber espionage or even an act of cyber war is a critical issue in reducing cyber conflicts and encouraging cyber cooperation. There is no international legal obligation to reveal the grounds on which attribution is based prior to taking appropriate action. States are likewise not obligated to provide evidence of attribution when responding to another state's cyber intrusions. Recognizing that customary international law has not developed a set of understandings or recognized state practice on what level of attribution is acceptable or necessary for establishing state responsibility for cyber actions this paper intends to address that gap. National governments, scholars, private industry, and think tanks have recently offered proposals and standards for the handling of attribution of state sponsored cyber-attacks. The focus of this article is to explore these proposals and standards from an international perspective through the analysis of national practice and international norms and regulations to determine how the international community might develop a system of law on attribution that would meet universal acceptance.\nKeywords: cyber attribution, cyber law standards, law and regulation of cyber attribution\n# 1. Introduction\nFollowing a cyber-attack, States have to deal with the challenge of attribution defined as \"identifying the agent responsible for the action\" (Clark and Landau, 2011). Cyber attribution is the process by which evidence of a malicious cyber activity is collected, analyzed, and identified with the attacker (Rid and Buchanan, 2015). This is not an easy task due to technological challenges and the ability to hide behind the anonymity of other actors and agents (Tallin 2.0, 2017). Though identifying the machines has become much easier for sophisticated cyber states, identifying the persons, organization, or states that are legally responsible for the cyberattack remains the ultimate challenge (Carlin, 2016). Significant technological strides in attributing cyber events in the last decade have made the task \"more nuanced, more common, and more political than has typically been acknowledged\" (Rid and Buchanan, 2015). The political aspect includes assessing what is at stake in making the attribution judgment, starting with the damage incurred, whether physical, financial, or reputational (Rid and Buchanan, p. 7). As such, attribution is often expressed in degrees of certainty, and it requires input from a range of actors and sources, including technical forensics, human intelligence, signals intelligence, history, and diplomatic relations (Banks, 2019).\nNo international laws or treaties expressly regulate the use of cyber-attacks. While scholars point to the potential application of the law of armed conflict, such law has notably not been invoked thus far to respond to cyber-attacks (Eichensehr, 2020). The problems derive from technical means of deception and anonymity, but they are also due to the vagaries of the process of fixing responsibility for cyberattacks within the international community and the malleability and open-endedness of the few attribution rules that currently exist in international law (Banks, 2019)\nThe problems of attribution are illustrated by a recent cyber-attack causing massive damage on a global scale. On December 13, 2020, the United States Cybersecurity and Infrastructure Security Agency (CISA) issued its fifth-ever emergency directive, which mandated government users disconnect from its monitoring service, SolarWinds Orion due to the determination that an \"outside nation state\" had found a back door into some updated versions of the software (CISA, 2020). Widely believed to be Russian backed hackers it was described by Microsoft's President, Brad Smith as Washington's worst cyberespionage failure on record impacting private companies and governments across the globe calling for more collaborative leadership by the government and the tech sector in the United States (Smith, 2020). Though no formal attribution has been issued to date, the attack continues to raise serious concerns on the regulation of cyber-attacks and cyber attribution.\n102\nVirginia Greiman\nThe challenges of attribution are also evident whenever there is a failure to charge the perpetrators of a serious cyber event until years after the attack. On January 29, 2015, it was discovered that Anthem, Inc, one of the nation's leading health insurers, was the victim of a massive cyberattack. The hackers began accessing the information in early December 2014 and, during a nearly 7-week window, perpetrators were able to gain access to nearly 80 million records (McGee, 2017). In 2017, seven state insurance commissioners, issued a report on their investigation into the cyberattack against Anthem and concluded that a nation-state was behind the attack. But they stopped short of naming the nation involved (McGee, 2017). It was not until 2019 that U.S. DOJ charged a Chinese hacker for the 2015 Anthem breach.\nCyber attribution is a topic covered quite extensively in the literature however, the legal requirements of attribution are clearly lacking due to the failure of a universal consensus on the laws, regulations and standards that are applicable when attributing a cyber-attack to a state-sponsored entity. As shown in figure 1, this paper explores the relationship between the law of attribution, the evidence required to prove attribution, and the responses that nation states have chosen when faced with decisions that require careful evaluation of the interests faced by the victim nation including economic, social, political, and national security interests. The research comprises a review and comparative analysis of the international law governing attribution, the applicable rules of evidence, and the analysis of recent literature including government and private sector studies that analyze state responses to cyber-attacks.\nFigure 1: The attribution laws, evidence and responses\n# 2. The law and challenges of attribution\nLegal challenges for attribution can be brought under international law based on two types of acts: (1) responsibility of states for Internationally wrongful acts; and (2) an unlawful cyber intrusion (Tallinn 2.0, 2017). The law of attribution for cyber intrusions aims to identify and place responsibility for internationally wrongful acts (Banks, 2019). The customary law of state responsibility for violations of international law, and with it the law of attribution, is drawn primarily from the long-term work of the International Law Commission (ILC) and its Draft Articles on Responsibility of States for Internationally Wrongful Acts (ILC, 2001). Although not a treaty, the ILC rules were commended to the member states by the UN General Assembly in 2001 and have become the authoritative guidepost for public international cyber law. The Rules have been cited repeatedly by courts, tribunals, and other bodies. Drawing from the ILC rules, the threshold point in the cyber context is that \"a State bears international responsibility for a cyber-related act that is attributable to the State and that constitutes a breach of an international legal obligation\" (Tallinn at 84). In essence, according to the Tallinn Manual 2.0, rule 15, states are responsible for the wrongful cyber-related acts of their own officials, agents, contractors, nonstate actors, and other states, to the extent they actually control the operations.\nRule 20 of the Tallinn Manual 2.0 provides that if a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Though punitive countermeasures are forbidden (Tallinn at 124), states must give prior notice to the offending state, and their purpose must include compliance with international law (Tallinn at 120). Importantly, there is no prohibition against injured states turning to a private firm, including foreign companies, to conduct cyber countermeasures on their behalf against responsible stares though the company's operations would generally be attributable to the injured States (Tallinn, rule 17).\nVirginia Greiman\nThe second part of any legal analysis of attribution requires an understanding of the right of a victim state to take countermeasures against a state sponsored attack (Banks, 2019). If a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Countermeasures are responses that otherwise would violate international law, designed to prevent a responsible state from continuing its unlawful cyber intervention\" (Tallinn at 111).\n# 3. Options after attributing an attack\nAssuming a State's technical and legal analysis is capable of attributing an attack, what are the options available to a victim nation after an attack? Cyber-attacks in the United States and around the globe have demonstrated various responses by nation states. The most common form of response is through economic punishment or denial of benefits offered by international treaties or conventions. In cases where the evidence is clear as to the attacker it might justify retaliation through counter measures. In the case of a cyber war the response may be a declaration of war against the nation state. According to the Council on Foreign Relations Cyber Operations Tracker, since 2005, thirty-four countries are suspected of sponsoring cyber operations. China, Russia, Iran, and North Korea sponsored 77 percent of all suspected operations. In 2019, there were a total of seventy-six operations, most being acts of espionage (CFR, 2020). Recent attacks shown in table 1 highlight this reality. In a recent study of private sector attribution of cyber incidents, sponsored by the Office of the Secretary of Defense and the RAND National Defense Research Institute, the most commonly stated motive for U.S. government attribution was to promote deterrence in cyberspace. Participants also noted that public attribution may help build international consensus on what constitutes irresponsible or inappropriate behavior in cyberspace (Romanosky and Boudreaux, 2020).\nImportantly, the United States has not taken a standardized approach to attribution—either in the timing of attribution, the mode, the type, or the extent of evidence supporting the attribution, the confidence level, or whether attribution is followed by other punitive measures (Romanosky and Boudreaux, 2020). For example, the 2017 attribution of WannaCry and the 2018 attribution of NotPetya involved coordinated statements with international partners; however, in the Equifax cyber-attack, it was the private company that worked with the UK and Canadian regulators to determine appropriate next steps. Leveraging the capabilities of the private sector is a significant strategy that has been used by the United States and other countries.\nRussia, meanwhile, hardly seems to have been chastened by the US government's sanctions for NotPetya, which arrived a full eight months after the worm hit and whose punishments were muddled with other messages chastising Russia for everything from 2016 election disinformation to hacker probes of the US power grid (Greenberg, 2018). \"The lack of a proper response has been almost an invitation to escalate more,\" says Thomas Rid, a political science professor at Johns Hopkins' School of Advanced International Studies (Greenberg, 2018). Escalation was the fear in the case of the 2014 attack on the Office of Personnel Management (OPM). As noted by the Congressional Research Services investigation, \"criminal charges appear to be unlikely.\" \"As a matter of policy, the United States has sought to distinguish between cyber intrusions to collect data for national security purposes — to which the United States deems counterintelligence to be an appropriate response — and cyber intrusions to steal data for commercial purposes, to which the United States deems a criminal justice response to be appropriate\" (CRS, 2015).\nThe United States has used its improved capabilities to make a number of public attributions in recent years. Public attributions by the U.S. government take one of four forms: (1) criminal indictments; (2) economic sanctions; (3) technical alerts; and (4) official statements or press releases. If a public attribution is not made it does not mean that attribution has not taken place. For example, attribution can take place through various forms of retaliation including unattributed attacks. Table 1 highlights some recent cyber-attacks and the type of threat, impact on the victims, and how the victim state chose to attribute the attack. It is important to note that to date no cyber threat or attack has been treated as an act of war despite the seriousness and the extent of the damage. As we will see in the next section the decision to treat an attack as a criminal act depends largely on the ability to prove the case in a court of a law based on widely disparate legal systems around the world.\nTable 1: Major cyber events, impact and attribution\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|  2020 Solar Wind Hack | Espionage-based assault | Broad attack on confidential information of U.S. Government | Alleged Russian Hacker Group. No formal attribution to date  |\nVirginia Greiman\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|   |  | including Homeland Security and the Pentagon and the tech tools used by companies to protect them. |   |\n|  2017 NotPetya | Conspiracy, Ransomware and Espionage | Homeland Security estimated the total damages to more than $10 billion involving damage to businesses and governments in Ukraine, Georgia, France, and other European Countries. | On October 20, 2020, the U.S. DOJ indicted six members of the Russian military  |\n|  2017 Equifax Data Breach | Aggressive Act of Espionage | Equifax databases were attacked impacting 143 million people | In February 2020, the U.S. charged 4 members of the Chinese military  |\n|  2014 U.S. OPM Data Breach | Aggressive Act of Espionage | Data Breach of 21.5 million current and former U.S. government employees | No public attribution due to national security concerns (CRS, 2015)  |\n|  2014 Sony Attacks | Critical Infrastructure Cyber-Attack and Economic Crime | US $171M damage, attacked 77 million accounts, described as worse computer data breach in U.S. history | Following the FBI's attribution of the Sony Pictures hack to North Korea on Dec. 19, 2014 The U.S. imposed sanctions against 10 individuals and three entities associated with the country's Pyongyang-based government  |\n|  2010 Stuxnet Attack | Criminal Act – Economic Crime | Infected an estimated 100,000 computers and set-back Iran's Nuclear Program | No formal attribution  |\n# 4. The evidence: Attribution through criminal indictments\nInvariably, one of the first responses after a cyber-attack is: Who did it and how do we know? In legal terminology the legal process for charging someone with a wrongful act is known as burden of proof. In the attribution world this concept is little discussed in the context of a cyber-attack. The law of attribution conjures up numerous questions on the procedural side as even if the substantive law is clear the procedural rules may be ridden with twists and turns that make it difficult to prove your case. In international disputes the ICJ has held that “[a]s a general rule it is for the party which alleges a fact in support of its claims to prove the existence of that fact” (ICJ, 2010).\nAs highlighted in Delbert Tran's (2018) overview of the law of attribution, before developing rules for attribution it is important to note the distinctions in adversarial v. inquisitorial legal systems which govern most of the legal world. The features of adversarial and inquisitorial systems include common characteristics such as burdens of proof and persuasion, state responsibility doctrines, and rules governing evidentiary production. Though the features are similar they can be administered in different ways. The adversarial system assumes that the best way to get to the truth of a matter is through a competitive process to determine the facts and application of the law accurately. The inquisitorial system associated with civil law legal systems, is characterized by extensive pre-trial investigation and interrogations with the objective to avoid bringing an innocent person to trial. The inquisitorial process can be described as an official inquiry to ascertain the truth, whereas the adversarial system uses a competitive process between prosecution and defence to determine the facts. (Reichel, 2018). For example, in the United States, the burden of production is a minimal burden to produce at least enough evidence for the trier of fact to consider a disputed claim. After litigants have met the burden of production, they have the burden of persuasion: that enough evidence has been presented to persuade the trier of fact that their side is correct.\nTo be committed of a crime under U.S. law does not require absolute certainty but rather demands only that there be no reasonable doubt. The lowest standard is \"prima facie evidence,\" which requires merely indicative or plausible proof. An intermediate standard is \"preponderance of probability,\" under which the existence of the fact to be proved must be more likely than not, or, in other words, that it is reasonably probable (Green, 2009). Whereas common law jurisdictions apply all three standards of proof depending on the situation, civil law jurisdiction tend to limit the standard of proof to a single general rule: the judge must be \"convinced\" that a disputed fact is true (Dederer and Singer, 2019).\nVirginia Greiman\nThe burden of proof may be different, however, in instances where the response is a countermeasure against the State of origin of the adverse cyber operation. The victim State may have to prove only that the State of origin breached its duty to prevent significant transboundary harm by not taking reasonable measures to prevent imminent, or stop ongoing adverse cyber operations carried from within its territory (Roscini, 2015).\nThe first public attribution by the U.S. Department of Justice came in the form of an indictment in 2014, when a grand jury in the Western District of Pennsylvania indicted five members of China's PLA Unit 61398, for hacking and conspiring to hack companies, including Westinghouse and U.S. Steel, in order to steal intellectual property (USDOJ, 2014). The fifty-six-page indictment alleges violations of the Computer Fraud and Abuse Act, including conspiracy, unauthorized access to computers, and computer damage. The indictment also includes charges of economic espionage and trade secret theft. Other indictments have followed. For example, in 2017, a federal grand jury indicted two Russian Federal Security Service (FSB) officers for directing a hack that compromised 500 million Yahoo accounts. And in early 2020, a federal grand jury indicted four members of China's PLA for the 2017 hack of consumer credit reporting agency Equifax--a breach that compromised the personal information of 145 million U.S. victims (USDOJ, 2020).\nThe problem, then, is not in identifying the source of an attack. The challenge is in convincing other states that a source has correctly been identified. A state that wishes to employ countermeasures needs to convince other states of the accuracy of its attribution in order to establish the legitimacy of its attack. This issue may arise for two main reasons: (1) attribution may be based on data collected through state espionage or intelligence-gathering efforts that states may wish to keep secret; and (2) when states have plausible factual bases for attributing an attack, they may not want to disclose such evidence, since cyber attackers could learn from those mistakes and avoid leaving the same fingerprints in the future (Tran, 2019)\nAs the most advanced cyber states recognize the risks of cyber escalation, those states have good reason to become more transparent about attribution in service of the mutual restraint that could be gained by sharing attribution information. But to date, state concerns about revealing intelligence sources and methods counsel against transparency. (Banks, 2019)\n## 5. The response: Public cyber attribution: A political tool or a consensus of states\nCyber attribution has been widely discussed in the literature, yet there is still no international consensus on what rules of attribution may be needed to meet the needs and concerns of the international community (Clark and Landau, 2010; Dunn Cavelty, 2008; Lindsay, 2015; Lupovici, 2016; Nye, 2017; Rid and Buchanan, 2015). Recent decisions on attribution by governments and private industry have shown the desire to share these findings publicly even if the findings are, or will be, contested (Egloff, 2020). Two areas of concern in public attribution are (1) the mechanisms that lead to attribution; and (2) what happens after attribution. Governments have a strong incentive to use public attribution as a political tool, to understand better how the sharing of information may provide an impetus for governments, private sector participants, international organizations, and academics to come forward to contribute to the attribution dialogue. In 2016 the Department of Defense Law of War Manual was updated. Although it does discuss cyber operations, the Manual does not include standards of attribution, rules of targeting, or the requirement to review cyber weapons (DoD, 2016). Considering the importance of attribution in preventing and deterring cyber activity this is a significant omission.\nAs shown by the lack of clarity in resolving the problems of attribution, domestic laws are not sufficient to negotiate the challenges arising from trans-border issues such as those relating to national security and human rights, the public's right of access to information, the individual's right to privacy, the corporation's right to remain competitive, the right to criminal process, and extraterritorial jurisdiction. International cooperation and international laws are also needed—both to allocate authority among political entities, and to define and protect core substantive values in the physical and virtual worlds (Bederman and Keitner, 2016). Powerful actors such as the United States, Russia, and the United Kingdom have not gone far enough in addressing the problems of attribution.\nScholars contend that a treaty which bans the use of cyber-attacks or limits their use is not realistic because there is currently no way to ensure compliance. More effective may be the establishment of norms as proposed by NATO, the OECD, and other transnational organizations to prevent the possibility of a cyber war through universal acceptance of attribution norms or standards. States must demonstrate that they are willing to take\n106\nVirginia Greiman\nthe necessary steps to protect the security and prevent the misuse of the Internet in their respective countries” (Hathaway, 2017). This requires a calling out of wrongful acts conducted by other states, through a harmonized attribution process, something that victimized states have been reluctant to do (Hathaway, 2017, p. 5).\nSeveral non-state-driven norms-making initiatives have sought to fill the void, including Microsoft’s (2016) cyber norms proposals and the Tallinn Manual project. Scholars have contended that this emerging body of non-binding norms presents states with a critical window of opportunity to reclaim a central law-making position, similar to historical precedents including the development of legal regimes for Antarctica and nuclear safety (Mačák, 2017). The global dialogue on cybersecurity norms is evolving from a conceptual discussion about nation-states’ rights and responsibilities, toward an articulation of norms of state and industry behavior. These proposals vary in their prescriptions and subject areas.\nLegal scholars have also noted the need for accountability at the international level when one country is wrongfully attacked by another (Kuntz, 2013). For example, the United States’ Cyber Economic Espionage Accountability Act expresses the sense of Congress that cyber economic espionage should be a priority issue in all economic and diplomatic discussions with the People’s Republic of China, with the Russian Federation and other countries determined to encourage, tolerate, or conduct such cyber economic espionage (USDOJ, 2014). Scholars recognize that States must develop accountable attribution mechanisms for international law to have practical value in the cyber sphere (Banks, 2019).\nResearchers have proposed a due diligence framework or minimal standards for attribution of cyber-attacks (Chircop, 2018). A due diligence failure occurs when a state has knowledge of a cyber operation being carried out from within its territory, contrary to the rights of another, and fails to take reasonable measures to prevent it (Tallinn, Rule 6 at 42). Though due diligence is not clearly defined in the law it was reflected by the International Court of Justice (ICJ) in its Corfu Channel Judgment: “It is every State’s obligation not to allow knowingly its territory to be used for acts contrary to the rights of other states (Corfu, 1949) and has been set forth as an obligation of States in the pronouncements of the International Law Association (ILA, 2014). With the rise of cyber-attacks globally and no end in sight, international cyber security law is at a critical juncture. The failure of states to engage in the development and applications of international law has left a power vacuum allowing for the emergence of non-state norm-making initiatives (Mačák, 2017). As suggested here there is an opportunity now to employ the many initiatives and proposals for the development of standards and norms and to engage the international community in attribution norm and standards building practices.\n## 6. Conclusion\nThis paper has attempted to identify the scope and nature of the attribution problem and the key challenges in attribution from a legal perspective. By analyzing recent cyber events and the means and methods used to address the wrongful acts of nation states one can reasonably conclude that the lack of a legal framework has contributed to rather than reduced the likelihood of future cyber-attacks. Wrongful acts that go unpunished will continue to occur. The reasons are alarming including the lack of standards and an evidentiary process for attributing wrongful conduct that would meet the consensus of the international community. There is opportunity now to find meaningful standards that would provide safeguards from liability for good faith efforts to prevent wrongdoing and future violations of international law. Future research must explore possible solutions for enhancing not only the laws of attribution, but the policies that inform these laws to meet modern realities. This requires multilateral cooperation and an international agreement on the rules and norms that govern cyber attribution both at the national security and economic level to better meet the needs of our evolving cyber landscape."
    },
    "numeric": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "The Politics and Practice of Cyber Attribution: A Global Legal Perspective\nVirginia Greiman\nBoston University, USA\nggreiman@bu.edu\nDOI: 10.34190/IWS.21.116\nAbstract: The conundrum of attribution has long been an issue in cyberspace where actors can secretly go about their business without fear of retaliation or retribution. Identifying the responsible actors for cyber- attacks is a monumental challenge though politics usually determines whether attributions are made public. When and how to accuse governments of a cyber-crime, cyber espionage or even an act of cyber war is a critical issue in reducing cyber conflicts and encouraging cyber cooperation. There is no international legal obligation to reveal the grounds on which attribution is based prior to taking appropriate action. States are likewise not obligated to provide evidence of attribution when responding to another state's cyber intrusions. Recognizing that customary international law has not developed a set of understandings or recognized state practice on what level of attribution is acceptable or necessary for establishing state responsibility for cyber actions this paper intends to address that gap. National governments, scholars, private industry, and think tanks have recently offered proposals and standards for the handling of attribution of state sponsored cyber-attacks. The focus of this article is to explore these proposals and standards from an international perspective through the analysis of national practice and international norms and regulations to determine how the international community might develop a system of law on attribution that would meet universal acceptance.\nKeywords: cyber attribution, cyber law standards, law and regulation of cyber attribution\n# 1. Introduction\nFollowing a cyber-attack, States have to deal with the challenge of attribution defined as \"identifying the agent responsible for the action\" (Clark and Landau, 2011). Cyber attribution is the process by which evidence of a malicious cyber activity is collected, analyzed, and identified with the attacker (Rid and Buchanan, 2015). This is not an easy task due to technological challenges and the ability to hide behind the anonymity of other actors and agents (Tallin 2.0, 2017). Though identifying the machines has become much easier for sophisticated cyber states, identifying the persons, organization, or states that are legally responsible for the cyberattack remains the ultimate challenge (Carlin, 2016). Significant technological strides in attributing cyber events in the last decade have made the task \"more nuanced, more common, and more political than has typically been acknowledged\" (Rid and Buchanan, 2015). The political aspect includes assessing what is at stake in making the attribution judgment, starting with the damage incurred, whether physical, financial, or reputational (Rid and Buchanan, p. 7). As such, attribution is often expressed in degrees of certainty, and it requires input from a range of actors and sources, including technical forensics, human intelligence, signals intelligence, history, and diplomatic relations (Banks, 2019).\nNo international laws or treaties expressly regulate the use of cyber-attacks. While scholars point to the potential application of the law of armed conflict, such law has notably not been invoked thus far to respond to cyber-attacks (Eichensehr, 2020). The problems derive from technical means of deception and anonymity, but they are also due to the vagaries of the process of fixing responsibility for cyberattacks within the international community and the malleability and open-endedness of the few attribution rules that currently exist in international law (Banks, 2019)\nThe problems of attribution are illustrated by a recent cyber-attack causing massive damage on a global scale. On December 13, 2020, the United States Cybersecurity and Infrastructure Security Agency (CISA) issued its fifth-ever emergency directive, which mandated government users disconnect from its monitoring service, SolarWinds Orion due to the determination that an \"outside nation state\" had found a back door into some updated versions of the software (CISA, 2020). Widely believed to be Russian backed hackers it was described by Microsoft's President, Brad Smith as Washington's worst cyberespionage failure on record impacting private companies and governments across the globe calling for more collaborative leadership by the government and the tech sector in the United States (Smith, 2020). Though no formal attribution has been issued to date, the attack continues to raise serious concerns on the regulation of cyber-attacks and cyber attribution.\n102\nVirginia Greiman\nThe challenges of attribution are also evident whenever there is a failure to charge the perpetrators of a serious cyber event until years after the attack. On January 29, 2015, it was discovered that Anthem, Inc, one of the nation's leading health insurers, was the victim of a massive cyberattack. The hackers began accessing the information in early December 2014 and, during a nearly 7-week window, perpetrators were able to gain access to nearly 80 million records (McGee, 2017). In 2017, seven state insurance commissioners, issued a report on their investigation into the cyberattack against Anthem and concluded that a nation-state was behind the attack. But they stopped short of naming the nation involved (McGee, 2017). It was not until 2019 that U.S. DOJ charged a Chinese hacker for the 2015 Anthem breach.\nCyber attribution is a topic covered quite extensively in the literature however, the legal requirements of attribution are clearly lacking due to the failure of a universal consensus on the laws, regulations and standards that are applicable when attributing a cyber-attack to a state-sponsored entity. As shown in figure 1, this paper explores the relationship between the law of attribution, the evidence required to prove attribution, and the responses that nation states have chosen when faced with decisions that require careful evaluation of the interests faced by the victim nation including economic, social, political, and national security interests. The research comprises a review and comparative analysis of the international law governing attribution, the applicable rules of evidence, and the analysis of recent literature including government and private sector studies that analyze state responses to cyber-attacks.\nFigure 1: The attribution laws, evidence and responses\n# 2. The law and challenges of attribution\nLegal challenges for attribution can be brought under international law based on two types of acts: (1) responsibility of states for Internationally wrongful acts; and (2) an unlawful cyber intrusion (Tallinn 2.0, 2017). The law of attribution for cyber intrusions aims to identify and place responsibility for internationally wrongful acts (Banks, 2019). The customary law of state responsibility for violations of international law, and with it the law of attribution, is drawn primarily from the long-term work of the International Law Commission (ILC) and its Draft Articles on Responsibility of States for Internationally Wrongful Acts (ILC, 2001). Although not a treaty, the ILC rules were commended to the member states by the UN General Assembly in 2001 and have become the authoritative guidepost for public international cyber law. The Rules have been cited repeatedly by courts, tribunals, and other bodies. Drawing from the ILC rules, the threshold point in the cyber context is that \"a State bears international responsibility for a cyber-related act that is attributable to the State and that constitutes a breach of an international legal obligation\" (Tallinn at 84). In essence, according to the Tallinn Manual 2.0, rule 15, states are responsible for the wrongful cyber-related acts of their own officials, agents, contractors, nonstate actors, and other states, to the extent they actually control the operations.\nRule 20 of the Tallinn Manual 2.0 provides that if a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Though punitive countermeasures are forbidden (Tallinn at 124), states must give prior notice to the offending state, and their purpose must include compliance with international law (Tallinn at 120). Importantly, there is no prohibition against injured states turning to a private firm, including foreign companies, to conduct cyber countermeasures on their behalf against responsible stares though the company's operations would generally be attributable to the injured States (Tallinn, rule 17).\nVirginia Greiman\nThe second part of any legal analysis of attribution requires an understanding of the right of a victim state to take countermeasures against a state sponsored attack (Banks, 2019). If a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Countermeasures are responses that otherwise would violate international law, designed to prevent a responsible state from continuing its unlawful cyber intervention\" (Tallinn at 111).\n# 3. Options after attributing an attack\nAssuming a State's technical and legal analysis is capable of attributing an attack, what are the options available to a victim nation after an attack? Cyber-attacks in the United States and around the globe have demonstrated various responses by nation states. The most common form of response is through economic punishment or denial of benefits offered by international treaties or conventions. In cases where the evidence is clear as to the attacker it might justify retaliation through counter measures. In the case of a cyber war the response may be a declaration of war against the nation state. According to the Council on Foreign Relations Cyber Operations Tracker, since 2005, thirty-four countries are suspected of sponsoring cyber operations. China, Russia, Iran, and North Korea sponsored 77 percent of all suspected operations. In 2019, there were a total of seventy-six operations, most being acts of espionage (CFR, 2020). Recent attacks shown in table 1 highlight this reality. In a recent study of private sector attribution of cyber incidents, sponsored by the Office of the Secretary of Defense and the RAND National Defense Research Institute, the most commonly stated motive for U.S. government attribution was to promote deterrence in cyberspace. Participants also noted that public attribution may help build international consensus on what constitutes irresponsible or inappropriate behavior in cyberspace (Romanosky and Boudreaux, 2020).\nImportantly, the United States has not taken a standardized approach to attribution—either in the timing of attribution, the mode, the type, or the extent of evidence supporting the attribution, the confidence level, or whether attribution is followed by other punitive measures (Romanosky and Boudreaux, 2020). For example, the 2017 attribution of WannaCry and the 2018 attribution of NotPetya involved coordinated statements with international partners; however, in the Equifax cyber-attack, it was the private company that worked with the UK and Canadian regulators to determine appropriate next steps. Leveraging the capabilities of the private sector is a significant strategy that has been used by the United States and other countries.\nRussia, meanwhile, hardly seems to have been chastened by the US government's sanctions for NotPetya, which arrived a full eight months after the worm hit and whose punishments were muddled with other messages chastising Russia for everything from 2016 election disinformation to hacker probes of the US power grid (Greenberg, 2018). \"The lack of a proper response has been almost an invitation to escalate more,\" says Thomas Rid, a political science professor at Johns Hopkins' School of Advanced International Studies (Greenberg, 2018). Escalation was the fear in the case of the 2014 attack on the Office of Personnel Management (OPM). As noted by the Congressional Research Services investigation, \"criminal charges appear to be unlikely.\" \"As a matter of policy, the United States has sought to distinguish between cyber intrusions to collect data for national security purposes — to which the United States deems counterintelligence to be an appropriate response — and cyber intrusions to steal data for commercial purposes, to which the United States deems a criminal justice response to be appropriate\" (CRS, 2015).\nThe United States has used its improved capabilities to make a number of public attributions in recent years. Public attributions by the U.S. government take one of four forms: (1) criminal indictments; (2) economic sanctions; (3) technical alerts; and (4) official statements or press releases. If a public attribution is not made it does not mean that attribution has not taken place. For example, attribution can take place through various forms of retaliation including unattributed attacks. Table 1 highlights some recent cyber-attacks and the type of threat, impact on the victims, and how the victim state chose to attribute the attack. It is important to note that to date no cyber threat or attack has been treated as an act of war despite the seriousness and the extent of the damage. As we will see in the next section the decision to treat an attack as a criminal act depends largely on the ability to prove the case in a court of a law based on widely disparate legal systems around the world.\nTable 1: Major cyber events, impact and attribution\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|  2020 Solar Wind Hack | Espionage-based assault | Broad attack on confidential information of U.S. Government | Alleged Russian Hacker Group. No formal attribution to date  |\nVirginia Greiman\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|   |  | including Homeland Security and the Pentagon and the tech tools used by companies to protect them. |   |\n|  2017 NotPetya | Conspiracy, Ransomware and Espionage | Homeland Security estimated the total damages to more than $10 billion involving damage to businesses and governments in Ukraine, Georgia, France, and other European Countries. | On October 20, 2020, the U.S. DOJ indicted six members of the Russian military  |\n|  2017 Equifax Data Breach | Aggressive Act of Espionage | Equifax databases were attacked impacting 143 million people | In February 2020, the U.S. charged 4 members of the Chinese military  |\n|  2014 U.S. OPM Data Breach | Aggressive Act of Espionage | Data Breach of 21.5 million current and former U.S. government employees | No public attribution due to national security concerns (CRS, 2015)  |\n|  2014 Sony Attacks | Critical Infrastructure Cyber-Attack and Economic Crime | US $171M damage, attacked 77 million accounts, described as worse computer data breach in U.S. history | Following the FBI's attribution of the Sony Pictures hack to North Korea on Dec. 19, 2014 The U.S. imposed sanctions against 10 individuals and three entities associated with the country's Pyongyang-based government  |\n|  2010 Stuxnet Attack | Criminal Act – Economic Crime | Infected an estimated 100,000 computers and set-back Iran's Nuclear Program | No formal attribution  |\n# 4. The evidence: Attribution through criminal indictments\nInvariably, one of the first responses after a cyber-attack is: Who did it and how do we know? In legal terminology the legal process for charging someone with a wrongful act is known as burden of proof. In the attribution world this concept is little discussed in the context of a cyber-attack. The law of attribution conjures up numerous questions on the procedural side as even if the substantive law is clear the procedural rules may be ridden with twists and turns that make it difficult to prove your case. In international disputes the ICJ has held that “[a]s a general rule it is for the party which alleges a fact in support of its claims to prove the existence of that fact” (ICJ, 2010).\nAs highlighted in Delbert Tran's (2018) overview of the law of attribution, before developing rules for attribution it is important to note the distinctions in adversarial v. inquisitorial legal systems which govern most of the legal world. The features of adversarial and inquisitorial systems include common characteristics such as burdens of proof and persuasion, state responsibility doctrines, and rules governing evidentiary production. Though the features are similar they can be administered in different ways. The adversarial system assumes that the best way to get to the truth of a matter is through a competitive process to determine the facts and application of the law accurately. The inquisitorial system associated with civil law legal systems, is characterized by extensive pre-trial investigation and interrogations with the objective to avoid bringing an innocent person to trial. The inquisitorial process can be described as an official inquiry to ascertain the truth, whereas the adversarial system uses a competitive process between prosecution and defence to determine the facts. (Reichel, 2018). For example, in the United States, the burden of production is a minimal burden to produce at least enough evidence for the trier of fact to consider a disputed claim. After litigants have met the burden of production, they have the burden of persuasion: that enough evidence has been presented to persuade the trier of fact that their side is correct.\nTo be committed of a crime under U.S. law does not require absolute certainty but rather demands only that there be no reasonable doubt. The lowest standard is \"prima facie evidence,\" which requires merely indicative or plausible proof. An intermediate standard is \"preponderance of probability,\" under which the existence of the fact to be proved must be more likely than not, or, in other words, that it is reasonably probable (Green, 2009). Whereas common law jurisdictions apply all three standards of proof depending on the situation, civil law jurisdiction tend to limit the standard of proof to a single general rule: the judge must be \"convinced\" that a disputed fact is true (Dederer and Singer, 2019).\nVirginia Greiman\nThe burden of proof may be different, however, in instances where the response is a countermeasure against the State of origin of the adverse cyber operation. The victim State may have to prove only that the State of origin breached its duty to prevent significant transboundary harm by not taking reasonable measures to prevent imminent, or stop ongoing adverse cyber operations carried from within its territory (Roscini, 2015).\nThe first public attribution by the U.S. Department of Justice came in the form of an indictment in 2014, when a grand jury in the Western District of Pennsylvania indicted five members of China's PLA Unit 61398, for hacking and conspiring to hack companies, including Westinghouse and U.S. Steel, in order to steal intellectual property (USDOJ, 2014). The fifty-six-page indictment alleges violations of the Computer Fraud and Abuse Act, including conspiracy, unauthorized access to computers, and computer damage. The indictment also includes charges of economic espionage and trade secret theft. Other indictments have followed. For example, in 2017, a federal grand jury indicted two Russian Federal Security Service (FSB) officers for directing a hack that compromised 500 million Yahoo accounts. And in early 2020, a federal grand jury indicted four members of China's PLA for the 2017 hack of consumer credit reporting agency Equifax--a breach that compromised the personal information of 145 million U.S. victims (USDOJ, 2020).\nThe problem, then, is not in identifying the source of an attack. The challenge is in convincing other states that a source has correctly been identified. A state that wishes to employ countermeasures needs to convince other states of the accuracy of its attribution in order to establish the legitimacy of its attack. This issue may arise for two main reasons: (1) attribution may be based on data collected through state espionage or intelligence-gathering efforts that states may wish to keep secret; and (2) when states have plausible factual bases for attributing an attack, they may not want to disclose such evidence, since cyber attackers could learn from those mistakes and avoid leaving the same fingerprints in the future (Tran, 2019)\nAs the most advanced cyber states recognize the risks of cyber escalation, those states have good reason to become more transparent about attribution in service of the mutual restraint that could be gained by sharing attribution information. But to date, state concerns about revealing intelligence sources and methods counsel against transparency. (Banks, 2019)\n## 5. The response: Public cyber attribution: A political tool or a consensus of states\nCyber attribution has been widely discussed in the literature, yet there is still no international consensus on what rules of attribution may be needed to meet the needs and concerns of the international community (Clark and Landau, 2010; Dunn Cavelty, 2008; Lindsay, 2015; Lupovici, 2016; Nye, 2017; Rid and Buchanan, 2015). Recent decisions on attribution by governments and private industry have shown the desire to share these findings publicly even if the findings are, or will be, contested (Egloff, 2020). Two areas of concern in public attribution are (1) the mechanisms that lead to attribution; and (2) what happens after attribution. Governments have a strong incentive to use public attribution as a political tool, to understand better how the sharing of information may provide an impetus for governments, private sector participants, international organizations, and academics to come forward to contribute to the attribution dialogue. In 2016 the Department of Defense Law of War Manual was updated. Although it does discuss cyber operations, the Manual does not include standards of attribution, rules of targeting, or the requirement to review cyber weapons (DoD, 2016). Considering the importance of attribution in preventing and deterring cyber activity this is a significant omission.\nAs shown by the lack of clarity in resolving the problems of attribution, domestic laws are not sufficient to negotiate the challenges arising from trans-border issues such as those relating to national security and human rights, the public's right of access to information, the individual's right to privacy, the corporation's right to remain competitive, the right to criminal process, and extraterritorial jurisdiction. International cooperation and international laws are also needed—both to allocate authority among political entities, and to define and protect core substantive values in the physical and virtual worlds (Bederman and Keitner, 2016). Powerful actors such as the United States, Russia, and the United Kingdom have not gone far enough in addressing the problems of attribution.\nScholars contend that a treaty which bans the use of cyber-attacks or limits their use is not realistic because there is currently no way to ensure compliance. More effective may be the establishment of norms as proposed by NATO, the OECD, and other transnational organizations to prevent the possibility of a cyber war through universal acceptance of attribution norms or standards. States must demonstrate that they are willing to take\n106\nVirginia Greiman\nthe necessary steps to protect the security and prevent the misuse of the Internet in their respective countries” (Hathaway, 2017). This requires a calling out of wrongful acts conducted by other states, through a harmonized attribution process, something that victimized states have been reluctant to do (Hathaway, 2017, p. 5).\nSeveral non-state-driven norms-making initiatives have sought to fill the void, including Microsoft’s (2016) cyber norms proposals and the Tallinn Manual project. Scholars have contended that this emerging body of non-binding norms presents states with a critical window of opportunity to reclaim a central law-making position, similar to historical precedents including the development of legal regimes for Antarctica and nuclear safety (Mačák, 2017). The global dialogue on cybersecurity norms is evolving from a conceptual discussion about nation-states’ rights and responsibilities, toward an articulation of norms of state and industry behavior. These proposals vary in their prescriptions and subject areas.\nLegal scholars have also noted the need for accountability at the international level when one country is wrongfully attacked by another (Kuntz, 2013). For example, the United States’ Cyber Economic Espionage Accountability Act expresses the sense of Congress that cyber economic espionage should be a priority issue in all economic and diplomatic discussions with the People’s Republic of China, with the Russian Federation and other countries determined to encourage, tolerate, or conduct such cyber economic espionage (USDOJ, 2014). Scholars recognize that States must develop accountable attribution mechanisms for international law to have practical value in the cyber sphere (Banks, 2019).\nResearchers have proposed a due diligence framework or minimal standards for attribution of cyber-attacks (Chircop, 2018). A due diligence failure occurs when a state has knowledge of a cyber operation being carried out from within its territory, contrary to the rights of another, and fails to take reasonable measures to prevent it (Tallinn, Rule 6 at 42). Though due diligence is not clearly defined in the law it was reflected by the International Court of Justice (ICJ) in its Corfu Channel Judgment: “It is every State’s obligation not to allow knowingly its territory to be used for acts contrary to the rights of other states (Corfu, 1949) and has been set forth as an obligation of States in the pronouncements of the International Law Association (ILA, 2014). With the rise of cyber-attacks globally and no end in sight, international cyber security law is at a critical juncture. The failure of states to engage in the development and applications of international law has left a power vacuum allowing for the emergence of non-state norm-making initiatives (Mačák, 2017). As suggested here there is an opportunity now to employ the many initiatives and proposals for the development of standards and norms and to engage the international community in attribution norm and standards building practices.\n## 6. Conclusion\nThis paper has attempted to identify the scope and nature of the attribution problem and the key challenges in attribution from a legal perspective. By analyzing recent cyber events and the means and methods used to address the wrongful acts of nation states one can reasonably conclude that the lack of a legal framework has contributed to rather than reduced the likelihood of future cyber-attacks. Wrongful acts that go unpunished will continue to occur. The reasons are alarming including the lack of standards and an evidentiary process for attributing wrongful conduct that would meet the consensus of the international community. There is opportunity now to find meaningful standards that would provide safeguards from liability for good faith efforts to prevent wrongdoing and future violations of international law. Future research must explore possible solutions for enhancing not only the laws of attribution, but the policies that inform these laws to meet modern realities. This requires multilateral cooperation and an international agreement on the rules and norms that govern cyber attribution both at the national security and economic level to better meet the needs of our evolving cyber landscape."
    },
    "author_year": {
      "total": {
        "intext_total": 41,
        "success_occurrences": 37,
        "success_unique": 27,
        "bib_unique_total": 53,
        "occurrence_match_rate": 0.9024390243902439,
        "bib_coverage_rate": 0.5094339622641509,
        "success_percentage": 90.24,
        "style": "author_year"
      },
      "results": [
        {
          "index": "clark|2011",
          "intext_citation": "(Clark and Landau, 2011)",
          "preceding_text": "Following a cyber-attack, States have to deal with the challenge of attribution defined as \"identifying the agent responsible for the action\"",
          "footnote": "Clarke, D.D. and Landau, S. (2011) \"Untangling Attribution\" 2 Harv. Nat'l Sec. J. 531, 531."
        },
        {
          "index": "rid|2015",
          "intext_citation": "(Rid and Buchanan, 2015)",
          "preceding_text": "Cyber attribution is the process by which evidence of a malicious cyber activity is collected, analyzed, and identified with the attacker",
          "footnote": "Rid, T., and Buchanan, B. (2015) \"Attributing Cyber Attacks\". Journal of Strategic Studies, vol. 38, no. 1-2, pp 4-37."
        },
        {
          "index": "carlin|2016",
          "intext_citation": "(Carlin, 2016)",
          "preceding_text": "other actors and agents (Tallin 2.0, 2017). Though identifying the machines has become much easier for sophisticated cyber states, identifying the persons, organization, or states that are legally responsible for the cyberattack remains the ultimate challenge",
          "footnote": "Carlin, J. P. (2016) “Detect, Disrupt, Deter: A Whole-of-Government Approach to National Security Cyber Threats”, 7 Harv. Nat’l Sec. J. 391, 409."
        },
        {
          "index": "rid|2015",
          "intext_citation": "(Rid and Buchanan, 2015)",
          "preceding_text": "Significant technological strides in attributing cyber events in the last decade have made the task \"more nuanced, more common, and more political than has typically been acknowledged\"",
          "footnote": "Rid, T., and Buchanan, B. (2015) \"Attributing Cyber Attacks\". Journal of Strategic Studies, vol. 38, no. 1-2, pp 4-37."
        },
        {
          "index": "banks|2019",
          "intext_citation": "(Banks, 2019)",
          "preceding_text": "nal (Rid and Buchanan, p. 7). As such, attribution is often expressed in degrees of certainty, and it requires input from a range of actors and sources, including technical forensics, human intelligence, signals intelligence, history, and diplomatic relations",
          "footnote": "Banks, W. (2019) “The Bumpy Road to a Meaningful International Law of Cyber Attribution.” American Journal of International Law Unbound, vol. 113, pp 191-196. doi:10.1017/aju.2019.32."
        },
        {
          "index": "eichensehr|2020",
          "intext_citation": "(Eichensehr, 2020)",
          "preceding_text": "While scholars point to the potential application of the law of armed conflict, such law has notably not been invoked thus far to respond to cyber-attacks",
          "footnote": "Eichensehr, K. E. (2020) \"The Law and Politics of Cyberattack Attribution\", 67 UCLA L. Rev. 520."
        },
        {
          "index": "banks|2019",
          "intext_citation": "(Banks, 2019)",
          "preceding_text": "ion and anonymity, but they are also due to the vagaries of the process of fixing responsibility for cyberattacks within the international community and the malleability and open-endedness of the few attribution rules that currently exist in international law",
          "footnote": "Banks, W. (2019) “The Bumpy Road to a Meaningful International Law of Cyber Attribution.” American Journal of International Law Unbound, vol. 113, pp 191-196. doi:10.1017/aju.2019.32."
        },
        {
          "index": "cisa|2020",
          "intext_citation": "(CISA, 2020)",
          "preceding_text": "(CISA) issued its fifth-ever emergency directive, which mandated government users disconnect from its monitoring service, SolarWinds Orion due to the determination that an \"outside nation state\" had found a back door into some updated versions of the software",
          "footnote": "Cyber Infrastructure Security Agency. December 14, 2020. “CISA Issues Emergency Directive to Mitigate the Compromise of Solarwinds Orion Network Management Products”. CISA, Washington, D.C."
        },
        {
          "index": "smith|2020",
          "intext_citation": "(Smith, 2020)",
          "preceding_text": "ribed by Microsoft's President, Brad Smith as Washington's worst cyberespionage failure on record impacting private companies and governments across the globe calling for more collaborative leadership by the government and the tech sector in the United States",
          "footnote": "Smith, B. (2020) \"A moment of reckoning: the need for a strong and global cybersecurity response.\" Microsoft on the Issues: The Official Microsoft Blog. https://blogs.microsoft.com/on-the-issues/2020/12/17/cyberattacks-cybersecurity-solarwinds-fireeye/."
        },
        {
          "index": "mcgee|2017",
          "intext_citation": "(McGee, 2017)",
          "preceding_text": "The hackers began accessing the information in early December 2014 and, during a nearly 7-week window, perpetrators were able to gain access to nearly 80 million records",
          "footnote": "McGee, M. K. (2017) A New In-Depth Analysis of Anthem Breach: Insurance Commissioners Conclude Nation-State Involved, Reach Settlement with Insurer. HealthInfoSec, January 10."
        },
        {
          "index": "mcgee|2017",
          "intext_citation": "(McGee, 2017)",
          "preceding_text": "But they stopped short of naming the nation involved",
          "footnote": "McGee, M. K. (2017) A New In-Depth Analysis of Anthem Breach: Insurance Commissioners Conclude Nation-State Involved, Reach Settlement with Insurer. HealthInfoSec, January 10."
        },
        {
          "index": "banks|2019",
          "intext_citation": "(Banks, 2019)",
          "preceding_text": "The law of attribution for cyber intrusions aims to identify and place responsibility for internationally wrongful acts",
          "footnote": "Banks, W. (2019) “The Bumpy Road to a Meaningful International Law of Cyber Attribution.” American Journal of International Law Unbound, vol. 113, pp 191-196. doi:10.1017/aju.2019.32."
        },
        {
          "index": "ilc|2001",
          "intext_citation": "(ILC, 2001)",
          "preceding_text": "e responsibility for violations of international law, and with it the law of attribution, is drawn primarily from the long-term work of the International Law Commission (ILC) and its Draft Articles on Responsibility of States for Internationally Wrongful Acts",
          "footnote": "International Law Commission (ILC), Report of the International Law Commission, Draft Articles of State Responsibility, UN GAOR, 53rd Sess., Supp. No. 10, UN Doc. A/56/10 (2001)."
        },
        {
          "index": "banks|2019",
          "intext_citation": "(Banks, 2019)",
          "preceding_text": "The second part of any legal analysis of attribution requires an understanding of the right of a victim state to take countermeasures against a state sponsored attack",
          "footnote": "Banks, W. (2019) “The Bumpy Road to a Meaningful International Law of Cyber Attribution.” American Journal of International Law Unbound, vol. 113, pp 191-196. doi:10.1017/aju.2019.32."
        },
        {
          "index": "cfr|2020",
          "intext_citation": "(CFR, 2020)",
          "preceding_text": "China, Russia, Iran, and North Korea sponsored 77 percent of all suspected operations. In 2019, there were a total of seventy-six operations, most being acts of espionage",
          "footnote": "Council on Foreign Relations (CFR). (2020). Cyber Operations Tracker, CFR, New York."
        },
        {
          "index": "romanosky|2020",
          "intext_citation": "(Romanosky and Boudreaux, 2020)",
          "preceding_text": "Participants also noted that public attribution may help build international consensus on what constitutes irresponsible or inappropriate behavior in cyberspace",
          "footnote": "Romanosky, S. and Boudreaux, B. (2020) \"Private-Sector Attribution of Cyber Incidents: Benefits and Risks to the U.S. Government,\" International Journal of Intelligence and CounterIntelligence, pp. 1-31."
        },
        {
          "index": "romanosky|2020",
          "intext_citation": "(Romanosky and Boudreaux, 2020)",
          "preceding_text": "ited States has not taken a standardized approach to attribution—either in the timing of attribution, the mode, the type, or the extent of evidence supporting the attribution, the confidence level, or whether attribution is followed by other punitive measures",
          "footnote": "Romanosky, S. and Boudreaux, B. (2020) \"Private-Sector Attribution of Cyber Incidents: Benefits and Risks to the U.S. Government,\" International Journal of Intelligence and CounterIntelligence, pp. 1-31."
        },
        {
          "index": "greenberg|2018",
          "intext_citation": "(Greenberg, 2018)",
          "preceding_text": "by the US government's sanctions for NotPetya, which arrived a full eight months after the worm hit and whose punishments were muddled with other messages chastising Russia for everything from 2016 election disinformation to hacker probes of the US power grid",
          "footnote": "Greenberg, A. \"The Untold Story of NotPetya, The Most Devastating Cyberattack in History\". Wired, August 22, 2018."
        },
        {
          "index": "greenberg|2018",
          "intext_citation": "(Greenberg, 2018)",
          "preceding_text": "\"The lack of a proper response has been almost an invitation to escalate more,\" says Thomas Rid, a political science professor at Johns Hopkins' School of Advanced International Studies",
          "footnote": "Greenberg, A. \"The Untold Story of NotPetya, The Most Devastating Cyberattack in History\". Wired, August 22, 2018."
        },
        {
          "index": "crs|2015",
          "intext_citation": "(CRS, 2015)",
          "preceding_text": "a for national security purposes — to which the United States deems counterintelligence to be an appropriate response — and cyber intrusions to steal data for commercial purposes, to which the United States deems a criminal justice response to be appropriate\"",
          "footnote": "Congressional Research Services (CRS). Cyber Intrusion into U.S. Office of Personnel Management: In Brief. By K. Finklea, M. D. Christensen, E. A. Fischer, S. V. Lawrence, C. A. Theohary, Washington: Government Printing Office, July 17, 2015 (Congressional Research Services Report) (7-5700, R44111)."
        },
        {
          "index": "crs|2015",
          "intext_citation": "(CRS, 2015)",
          "preceding_text": "OPM Data Breach | Aggressive Act of Espionage | Data Breach of 21.5 million current and former U.S. government employees | No public attribution due to national security concerns",
          "footnote": "Congressional Research Services (CRS). Cyber Intrusion into U.S. Office of Personnel Management: In Brief. By K. Finklea, M. D. Christensen, E. A. Fischer, S. V. Lawrence, C. A. Theohary, Washington: Government Printing Office, July 17, 2015 (Congressional Research Services Report) (7-5700, R44111)."
        },
        {
          "index": "icj|2010",
          "intext_citation": "(ICJ, 2010)",
          "preceding_text": "In international disputes the ICJ has held that “[a]s a general rule it is for the party which alleges a fact in support of its claims to prove the existence of that fact”",
          "footnote": "International Court of Justice (ICJ) Ahmadou Sadio Diallo (Guinea v. Dem. Rep. Congo) Merits, Judgment, 2010 I.C. J. Rep. 639 para 54 (Nov 30)."
        },
        {
          "index": "reichel|2018",
          "intext_citation": "(Reichel, 2018)",
          "preceding_text": "",
          "footnote": "Reichel, P. L. (2018) Comparative Criminal Justice Systems: A Topical Approach, 7th Edition, Pearson."
        },
        {
          "index": "green|2009",
          "intext_citation": "(Green, 2009)",
          "preceding_text": "An intermediate standard is \"preponderance of probability,\" under which the existence of the fact to be proved must be more likely than not, or, in other words, that it is reasonably probable",
          "footnote": "Green, J.A. (2009) \"Fluctuating Evidentiary Standards for Self-Defence in the International Court of Justice\", 58 International and Comparative Law Quarterly 163, 165."
        },
        {
          "index": "dederer|2019",
          "intext_citation": "(Dederer and Singer, 2019)",
          "preceding_text": "able (Green, 2009). Whereas common law jurisdictions apply all three standards of proof depending on the situation, civil law jurisdiction tend to limit the standard of proof to a single general rule: the judge must be \"convinced\" that a disputed fact is true",
          "footnote": "Dederer, H-G and Singer, T. (2019) \"Adverse Cyber Operations: Causality, Attribution, Evidence, and Due Diligence\", 95 Int'l L. Stud. 430."
        },
        {
          "index": "roscini|2015",
          "intext_citation": "(Roscini, 2015)",
          "preceding_text": "ion. The victim State may have to prove only that the State of origin breached its duty to prevent significant transboundary harm by not taking reasonable measures to prevent imminent, or stop ongoing adverse cyber operations carried from within its territory",
          "footnote": "Roscini, M. (2015) \"Evidentiary Issues in International Disputes Related to State Responsibility for Cyber Operations\", 50 Texas International Law Journal, 233, 239-40."
        },
        {
          "index": "usdoj|2014",
          "intext_citation": "(USDOJ, 2014)",
          "preceding_text": "Steel, in order to steal intellectual property",
          "footnote": null
        },
        {
          "index": "usdoj|2020",
          "intext_citation": "(USDOJ, 2020)",
          "preceding_text": "victims",
          "footnote": null
        },
        {
          "index": "tran|2019",
          "intext_citation": "(Tran, 2019)",
          "preceding_text": "tates may wish to keep secret; and (2) when states have plausible factual bases for attributing an attack, they may not want to disclose such evidence, since cyber attackers could learn from those mistakes and avoid leaving the same fingerprints in the future",
          "footnote": null
        },
        {
          "index": "banks|2019",
          "intext_citation": "(Banks, 2019)",
          "preceding_text": "But to date, state concerns about revealing intelligence sources and methods counsel against transparency.",
          "footnote": "Banks, W. (2019) “The Bumpy Road to a Meaningful International Law of Cyber Attribution.” American Journal of International Law Unbound, vol. 113, pp 191-196. doi:10.1017/aju.2019.32."
        },
        {
          "index": "lindsay|2015",
          "intext_citation": "(Clark and Landau, 2010; Dunn Cavelty, 2008; Lindsay, 2015; Lupovici, 2016; Nye, 2017; Rid and Buchanan, 2015)",
          "preceding_text": "Cyber attribution has been widely discussed in the literature, yet there is still no international consensus on what rules of attribution may be needed to meet the needs and concerns of the international community",
          "footnote": "Lindsay, J. R. (2015) \"Tipping the scales: the attribution problem and the feasibility of deterrence against cyberattack\". Journal of Cybersecurity, vol. 1, no. 1, pp 53-67. doi:10.1093/cybsec/tyv003."
        },
        {
          "index": "egloff|2020",
          "intext_citation": "(Egloff, 2020)",
          "preceding_text": "Recent decisions on attribution by governments and private industry have shown the desire to share these findings publicly even if the findings are, or will be, contested",
          "footnote": "Egloff, F.J. (2020) \"Contested public attributions of cyber incidents and the role of academia\", Contemporary Security Policy, vol. 41, no. 1, pp 55-81, DOI: 10.1080/13523260.2019.1677324."
        },
        {
          "index": "dod|2016",
          "intext_citation": "(DoD, 2016)",
          "preceding_text": "Although it does discuss cyber operations, the Manual does not include standards of attribution, rules of targeting, or the requirement to review cyber weapons",
          "footnote": "U.S. Department of Defense (DoD). (2016) Law of War Manual. Office of the General Counsel, Washington, D.C."
        },
        {
          "index": "bederman|2016",
          "intext_citation": "(Bederman and Keitner, 2016)",
          "preceding_text": "to criminal process, and extraterritorial jurisdiction. International cooperation and international laws are also needed—both to allocate authority among political entities, and to define and protect core substantive values in the physical and virtual worlds",
          "footnote": "Bederman, D.J. and Keitner, C. (2016) International Law Frameworks: Concepts and Insights, 4th Ed., Foundation Press."
        },
        {
          "index": "hathaway|2017",
          "intext_citation": "(Hathaway, 2017)",
          "preceding_text": "the necessary steps to protect the security and prevent the misuse of the Internet in their respective countries”",
          "footnote": "Hathaway, M. (2017) \"Getting Beyond Norms,\" CIGI Papers No. 127, Centre for International Governance Innovation, Ontario, Canada."
        },
        {
          "index": "kuntz|2013",
          "intext_citation": "(Kuntz, 2013)",
          "preceding_text": "Legal scholars have also noted the need for accountability at the international level when one country is wrongfully attacked by another",
          "footnote": "Kuntz, R. L. (2013) \"How Not to Catch A Thief: Why the Economic Espionage Act Fails to Protect American Trade Secrets\", 28 Berkeley Tech. L.J. 901."
        },
        {
          "index": "usdoj|2014",
          "intext_citation": "(USDOJ, 2014)",
          "preceding_text": "hat cyber economic espionage should be a priority issue in all economic and diplomatic discussions with the People’s Republic of China, with the Russian Federation and other countries determined to encourage, tolerate, or conduct such cyber economic espionage",
          "footnote": null
        },
        {
          "index": "banks|2019",
          "intext_citation": "(Banks, 2019)",
          "preceding_text": "Scholars recognize that States must develop accountable attribution mechanisms for international law to have practical value in the cyber sphere",
          "footnote": "Banks, W. (2019) “The Bumpy Road to a Meaningful International Law of Cyber Attribution.” American Journal of International Law Unbound, vol. 113, pp 191-196. doi:10.1017/aju.2019.32."
        },
        {
          "index": "chircop|2018",
          "intext_citation": "(Chircop, 2018)",
          "preceding_text": "Researchers have proposed a due diligence framework or minimal standards for attribution of cyber-attacks",
          "footnote": "Chircop, L. (2018) “A Due Diligence Standard of Attribution in Cyberspace”. International and Comparative Law Quarterly, vol. 67, no. 3, pp 643-668. doi:10.1017/S0020589318000015."
        },
        {
          "index": "corfu|1949",
          "intext_citation": "(Corfu, 1949)",
          "preceding_text": "gence is not clearly defined in the law it was reflected by the International Court of Justice (ICJ) in its Corfu Channel Judgment: “It is every State’s obligation not to allow knowingly its territory to be used for acts contrary to the rights of other states",
          "footnote": "Corfu Channel (United Kingdom v Albania) (Judgment) [1949] ICJ Rep 4, 22 (Corfu Channel)."
        },
        {
          "index": "ila|2014",
          "intext_citation": "(ILA, 2014)",
          "preceding_text": "udgment: “It is every State’s obligation not to allow knowingly its territory to be used for acts contrary to the rights of other states (Corfu, 1949) and has been set forth as an obligation of States in the pronouncements of the International Law Association",
          "footnote": "International Law Association (ILA), ILA Study Group on Due Diligence in International Law (First Report, ILA, 7 March 2014)."
        }
      ],
      "flat_text": "The Politics and Practice of Cyber Attribution: A Global Legal Perspective Virginia Greiman Boston University, USA ggreiman@bu.edu DOI: 10.34190/IWS.21.116 Abstract: The conundrum of attribution has long been an issue in cyberspace where actors can secretly go about their business without fear of retaliation or retribution. Identifying the responsible actors for cyber- attacks is a monumental challenge though politics usually determines whether attributions are made public. When and how to accuse governments of a cyber-crime, cyber espionage or even an act of cyber war is a critical issue in reducing cyber conflicts and encouraging cyber cooperation. There is no international legal obligation to reveal the grounds on which attribution is based prior to taking appropriate action. States are likewise not obligated to provide evidence of attribution when responding to another state's cyber intrusions. Recognizing that customary international law has not developed a set of understandings or recognized state practice on what level of attribution is acceptable or necessary for establishing state responsibility for cyber actions this paper intends to address that gap. National governments, scholars, private industry, and think tanks have recently offered proposals and standards for the handling of attribution of state sponsored cyber-attacks. The focus of this article is to explore these proposals and standards from an international perspective through the analysis of national practice and international norms and regulations to determine how the international community might develop a system of law on attribution that would meet universal acceptance.\nKeywords: cyber attribution, cyber law standards, law and regulation of cyber attribution # 1. Introduction Following a cyber-attack, States have to deal with the challenge of attribution defined as\"identifying the agent responsible for the action\". Cyber attribution is the process by which evidence of a malicious cyber activity is collected, analyzed, and identified with the attacker. This is not an easy task due to technological challenges and the ability to hide behind the anonymity of other actors and agents (Tallin 2.0, 2017). Though identifying the machines has become much easier for sophisticated cyber states, identifying the persons, organization, or states that are legally responsible for the cyberattack remains the ultimate challenge. Significant technological strides in attributing cyber events in the last decade have made the task\"more nuanced, more common, and more political than has typically been acknowledged\". The political aspect includes assessing what is at stake in making the attribution judgment, starting with the damage incurred, whether physical, financial, or reputational (Rid and Buchanan, p. 7). As such, attribution is often expressed in degrees of certainty, and it requires input from a range of actors and sources, including technical forensics, human intelligence, signals intelligence, history, and diplomatic relations.\nNo international laws or treaties expressly regulate the use of cyber-attacks. While scholars point to the potential application of the law of armed conflict, such law has notably not been invoked thus far to respond to cyber-attacks. The problems derive from technical means of deception and anonymity, but they are also due to the vagaries of the process of fixing responsibility for cyberattacks within the international community and the malleability and open-endedness of the few attribution rules that currently exist in international law The problems of attribution are illustrated by a recent cyber-attack causing massive damage on a global scale. On December 13, 2020, the United States Cybersecurity and Infrastructure Security Agency (CISA) issued its fifth-ever emergency directive, which mandated government users disconnect from its monitoring service, SolarWinds Orion due to the determination that an\"outside nation state\"had found a back door into some updated versions of the software. Widely believed to be Russian backed hackers it was described by Microsoft's President, Brad Smith as Washington's worst cyberespionage failure on record impacting private companies and governments across the globe calling for more collaborative leadership by the government and the tech sector in the United States. Though no formal attribution has been issued to date, the attack continues to raise serious concerns on the regulation of cyber-attacks and cyber attribution.\n\nThe challenges of attribution are also evident whenever there is a failure to charge the perpetrators of a serious cyber event until years after the attack. On January 29, 2015, it was discovered that Anthem, Inc, one of the nation's leading health insurers, was the victim of a massive cyberattack. The hackers began accessing the information in early December 2014 and, during a nearly 7-week window, perpetrators were able to gain access to nearly 80 million records . In 2017, seven state insurance commissioners, issued a report on their investigation into the cyberattack against Anthem and concluded that a nation-state was behind the attack. But they stopped short of naming the nation involved . It was not until 2019 that U.S. DOJ charged a Chinese hacker for the 2015 Anthem breach.\nCyber attribution is a topic covered quite extensively in the literature however, the legal requirements of attribution are clearly lacking due to the failure of a universal consensus on the laws, regulations and standards that are applicable when attributing a cyber-attack to a state-sponsored entity. As shown in figure 1, this paper explores the relationship between the law of attribution, the evidence required to prove attribution, and the responses that nation states have chosen when faced with decisions that require careful evaluation of the interests faced by the victim nation including economic, social, political, and national security interests. The research comprises a review and comparative analysis of the international law governing attribution, the applicable rules of evidence, and the analysis of recent literature including government and private sector studies that analyze state responses to cyber-attacks.\nFigure 1: The attribution laws, evidence and responses\n# 2. The law and challenges of attribution\nLegal challenges for attribution can be brought under international law based on two types of acts: (1) responsibility of states for Internationally wrongful acts; and (2) an unlawful cyber intrusion (Tallinn 2.0, 2017). The law of attribution for cyber intrusions aims to identify and place responsibility for internationally wrongful acts . The customary law of state responsibility for violations of international law, and with it the law of attribution, is drawn primarily from the long-term work of the International Law Commission (ILC) and its Draft Articles on Responsibility of States for Internationally Wrongful Acts . Although not a treaty, the ILC rules were commended to the member states by the UN General Assembly in 2001 and have become the authoritative guidepost for public international cyber law. The Rules have been cited repeatedly by courts, tribunals, and other bodies. Drawing from the ILC rules, the threshold point in the cyber context is that \"a State bears international responsibility for a cyber-related act that is attributable to the State and that constitutes a breach of an international legal obligation\" (Tallinn at 84). In essence, according to the Tallinn Manual 2.0, rule 15, states are responsible for the wrongful cyber-related acts of their own officials, agents, contractors, nonstate actors, and other states, to the extent they actually control the operations.\nRule 20 of the Tallinn Manual 2.0 provides that if a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Though punitive countermeasures are forbidden (Tallinn at 124), states must give prior notice to the offending state, and their purpose must include compliance with international law (Tallinn at 120). Importantly, there is no prohibition against injured states turning to a private firm, including foreign companies, to conduct cyber countermeasures on their behalf against responsible stares though the company's operations would generally be attributable to the injured States (Tallinn, rule 17).\nVirginia Greiman\nThe second part of any legal analysis of attribution requires an understanding of the right of a victim state to take countermeasures against a state sponsored attack . If a state is victimized by an internationally wrongful act below the use of force threshold, the \"State may be entitled to take countermeasures, whether cyber in nature or not\" (Tallinn at 111). Countermeasures are responses that otherwise would violate international law, designed to prevent a responsible state from continuing its unlawful cyber intervention\" (Tallinn at 111).\n# 3. Options after attributing an attack\nAssuming a State's technical and legal analysis is capable of attributing an attack, what are the options available to a victim nation after an attack? Cyber-attacks in the United States and around the globe have demonstrated various responses by nation states. The most common form of response is through economic punishment or denial of benefits offered by international treaties or conventions. In cases where the evidence is clear as to the attacker it might justify retaliation through counter measures. In the case of a cyber war the response may be a declaration of war against the nation state. According to the Council on Foreign Relations Cyber Operations Tracker, since 2005, thirty-four countries are suspected of sponsoring cyber operations. China, Russia, Iran, and North Korea sponsored 77 percent of all suspected operations. In 2019, there were a total of seventy-six operations, most being acts of espionage . Recent attacks shown in table 1 highlight this reality. In a recent study of private sector attribution of cyber incidents, sponsored by the Office of the Secretary of Defense and the RAND National Defense Research Institute, the most commonly stated motive for U.S. government attribution was to promote deterrence in cyberspace. Participants also noted that public attribution may help build international consensus on what constitutes irresponsible or inappropriate behavior in cyberspace .\nImportantly, the United States has not taken a standardized approach to attribution—either in the timing of attribution, the mode, the type, or the extent of evidence supporting the attribution, the confidence level, or whether attribution is followed by other punitive measures . For example, the 2017 attribution of WannaCry and the 2018 attribution of NotPetya involved coordinated statements with international partners; however, in the Equifax cyber-attack, it was the private company that worked with the UK and Canadian regulators to determine appropriate next steps. Leveraging the capabilities of the private sector is a significant strategy that has been used by the United States and other countries.\nRussia, meanwhile, hardly seems to have been chastened by the US government's sanctions for NotPetya, which arrived a full eight months after the worm hit and whose punishments were muddled with other messages chastising Russia for everything from 2016 election disinformation to hacker probes of the US power grid . \"The lack of a proper response has been almost an invitation to escalate more,\" says Thomas Rid, a political science professor at Johns Hopkins' School of Advanced International Studies . Escalation was the fear in the case of the 2014 attack on the Office of Personnel Management (OPM). As noted by the Congressional Research Services investigation, \"criminal charges appear to be unlikely.\" \"As a matter of policy, the United States has sought to distinguish between cyber intrusions to collect data for national security purposes — to which the United States deems counterintelligence to be an appropriate response — and cyber intrusions to steal data for commercial purposes, to which the United States deems a criminal justice response to be appropriate\" .\nThe United States has used its improved capabilities to make a number of public attributions in recent years. Public attributions by the U.S. government take one of four forms: (1) criminal indictments; (2) economic sanctions; (3) technical alerts; and (4) official statements or press releases. If a public attribution is not made it does not mean that attribution has not taken place. For example, attribution can take place through various forms of retaliation including unattributed attacks. Table 1 highlights some recent cyber-attacks and the type of threat, impact on the victims, and how the victim state chose to attribute the attack. It is important to note that to date no cyber threat or attack has been treated as an act of war despite the seriousness and the extent of the damage. As we will see in the next section the decision to treat an attack as a criminal act depends largely on the ability to prove the case in a court of a law based on widely disparate legal systems around the world.\nTable 1: Major cyber events, impact and attribution\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|  2020 Solar Wind Hack | Espionage-based assault | Broad attack on confidential information of U.S. Government | Alleged Russian Hacker Group. No formal attribution to date  |\nVirginia Greiman\n|  Event | Type of Threat | Impact | Attribution  |\n| --- | --- | --- | --- |\n|   |  | including Homeland Security and the Pentagon and the tech tools used by companies to protect them. |   |\n|  2017 NotPetya | Conspiracy, Ransomware and Espionage | Homeland Security estimated the total damages to more than $10 billion involving damage to businesses and governments in Ukraine, Georgia, France, and other European Countries. | On October 20, 2020, the U.S. DOJ indicted six members of the Russian military  |\n|  2017 Equifax Data Breach | Aggressive Act of Espionage | Equifax databases were attacked impacting 143 million people | In February 2020, the U.S. charged 4 members of the Chinese military  |\n|  2014 U.S. OPM Data Breach | Aggressive Act of Espionage | Data Breach of 21.5 million current and former U.S. government employees | No public attribution due to national security concerns   |\n|  2014 Sony Attacks | Critical Infrastructure Cyber-Attack and Economic Crime | US $171M damage, attacked 77 million accounts, described as worse computer data breach in U.S. history | Following the FBI's attribution of the Sony Pictures hack to North Korea on Dec. 19, 2014 The U.S. imposed sanctions against 10 individuals and three entities associated with the country's Pyongyang-based government  |\n|  2010 Stuxnet Attack | Criminal Act – Economic Crime | Infected an estimated 100,000 computers and set-back Iran's Nuclear Program | No formal attribution  |\n# 4. The evidence: Attribution through criminal indictments\nInvariably, one of the first responses after a cyber-attack is: Who did it and how do we know? In legal terminology the legal process for charging someone with a wrongful act is known as burden of proof. In the attribution world this concept is little discussed in the context of a cyber-attack. The law of attribution conjures up numerous questions on the procedural side as even if the substantive law is clear the procedural rules may be ridden with twists and turns that make it difficult to prove your case. In international disputes the ICJ has held that “[a]s a general rule it is for the party which alleges a fact in support of its claims to prove the existence of that fact” .\nAs highlighted in Delbert Tran's (2018) overview of the law of attribution, before developing rules for attribution it is important to note the distinctions in adversarial v. inquisitorial legal systems which govern most of the legal world. The features of adversarial and inquisitorial systems include common characteristics such as burdens of proof and persuasion, state responsibility doctrines, and rules governing evidentiary production. Though the features are similar they can be administered in different ways. The adversarial system assumes that the best way to get to the truth of a matter is through a competitive process to determine the facts and application of the law accurately. The inquisitorial system associated with civil law legal systems, is characterized by extensive pre-trial investigation and interrogations with the objective to avoid bringing an innocent person to trial. The inquisitorial process can be described as an official inquiry to ascertain the truth, whereas the adversarial system uses a competitive process between prosecution and defence to determine the facts. . For example, in the United States, the burden of production is a minimal burden to produce at least enough evidence for the trier of fact to consider a disputed claim. After litigants have met the burden of production, they have the burden of persuasion: that enough evidence has been presented to persuade the trier of fact that their side is correct.\nTo be committed of a crime under U.S. law does not require absolute certainty but rather demands only that there be no reasonable doubt. The lowest standard is \"prima facie evidence,\" which requires merely indicative or plausible proof. An intermediate standard is \"preponderance of probability,\" under which the existence of the fact to be proved must be more likely than not, or, in other words, that it is reasonably probable . Whereas common law jurisdictions apply all three standards of proof depending on the situation, civil law jurisdiction tend to limit the standard of proof to a single general rule: the judge must be \"convinced\" that a disputed fact is true .\nVirginia Greiman\nThe burden of proof may be different, however, in instances where the response is a countermeasure against the State of origin of the adverse cyber operation. The victim State may have to prove only that the State of origin breached its duty to prevent significant transboundary harm by not taking reasonable measures to prevent imminent, or stop ongoing adverse cyber operations carried from within its territory .\nThe first public attribution by the U.S. Department of Justice came in the form of an indictment in 2014, when a grand jury in the Western District of Pennsylvania indicted five members of China's PLA Unit 61398, for hacking and conspiring to hack companies, including Westinghouse and U.S. Steel, in order to steal intellectual property . The fifty-six-page indictment alleges violations of the Computer Fraud and Abuse Act, including conspiracy, unauthorized access to computers, and computer damage. The indictment also includes charges of economic espionage and trade secret theft. Other indictments have followed. For example, in 2017, a federal grand jury indicted two Russian Federal Security Service (FSB) officers for directing a hack that compromised 500 million Yahoo accounts. And in early 2020, a federal grand jury indicted four members of China's PLA for the 2017 hack of consumer credit reporting agency Equifax--a breach that compromised the personal information of 145 million U.S. victims .\nThe problem, then, is not in identifying the source of an attack. The challenge is in convincing other states that a source has correctly been identified. A state that wishes to employ countermeasures needs to convince other states of the accuracy of its attribution in order to establish the legitimacy of its attack. This issue may arise for two main reasons: (1) attribution may be based on data collected through state espionage or intelligence-gathering efforts that states may wish to keep secret; and (2) when states have plausible factual bases for attributing an attack, they may not want to disclose such evidence, since cyber attackers could learn from those mistakes and avoid leaving the same fingerprints in the future As the most advanced cyber states recognize the risks of cyber escalation, those states have good reason to become more transparent about attribution in service of the mutual restraint that could be gained by sharing attribution information. But to date, state concerns about revealing intelligence sources and methods counsel against transparency. ## 5. The response: Public cyber attribution: A political tool or a consensus of states\nCyber attribution has been widely discussed in the literature, yet there is still no international consensus on what rules of attribution may be needed to meet the needs and concerns of the international community . Recent decisions on attribution by governments and private industry have shown the desire to share these findings publicly even if the findings are, or will be, contested . Two areas of concern in public attribution are (1) the mechanisms that lead to attribution; and (2) what happens after attribution. Governments have a strong incentive to use public attribution as a political tool, to understand better how the sharing of information may provide an impetus for governments, private sector participants, international organizations, and academics to come forward to contribute to the attribution dialogue. In 2016 the Department of Defense Law of War Manual was updated. Although it does discuss cyber operations, the Manual does not include standards of attribution, rules of targeting, or the requirement to review cyber weapons . Considering the importance of attribution in preventing and deterring cyber activity this is a significant omission.\nAs shown by the lack of clarity in resolving the problems of attribution, domestic laws are not sufficient to negotiate the challenges arising from trans-border issues such as those relating to national security and human rights, the public's right of access to information, the individual's right to privacy, the corporation's right to remain competitive, the right to criminal process, and extraterritorial jurisdiction. International cooperation and international laws are also needed—both to allocate authority among political entities, and to define and protect core substantive values in the physical and virtual worlds . Powerful actors such as the United States, Russia, and the United Kingdom have not gone far enough in addressing the problems of attribution.\nScholars contend that a treaty which bans the use of cyber-attacks or limits their use is not realistic because there is currently no way to ensure compliance. More effective may be the establishment of norms as proposed by NATO, the OECD, and other transnational organizations to prevent the possibility of a cyber war through universal acceptance of attribution norms or standards. States must demonstrate that they are willing to take\n\nthe necessary steps to protect the security and prevent the misuse of the Internet in their respective countries”. This requires a calling out of wrongful acts conducted by other states, through a harmonized attribution process, something that victimized states have been reluctant to do.\nSeveral non-state-driven norms-making initiatives have sought to fill the void, including Microsoft’s (2016) cyber norms proposals and the Tallinn Manual project. Scholars have contended that this emerging body of non-binding norms presents states with a critical window of opportunity to reclaim a central law-making position, similar to historical precedents including the development of legal regimes for Antarctica and nuclear safety (Mačák, 2017). The global dialogue on cybersecurity norms is evolving from a conceptual discussion about nation-states’ rights and responsibilities, toward an articulation of norms of state and industry behavior. These proposals vary in their prescriptions and subject areas.\nLegal scholars have also noted the need for accountability at the international level when one country is wrongfully attacked by another. For example, the United States’ Cyber Economic Espionage Accountability Act expresses the sense of Congress that cyber economic espionage should be a priority issue in all economic and diplomatic discussions with the People’s Republic of China, with the Russian Federation and other countries determined to encourage, tolerate, or conduct such cyber economic espionage. Scholars recognize that States must develop accountable attribution mechanisms for international law to have practical value in the cyber sphere.\nResearchers have proposed a due diligence framework or minimal standards for attribution of cyber-attacks. A due diligence failure occurs when a state has knowledge of a cyber operation being carried out from within its territory, contrary to the rights of another, and fails to take reasonable measures to prevent it (Tallinn, Rule 6 at 42). Though due diligence is not clearly defined in the law it was reflected by the International Court of Justice (ICJ) in its Corfu Channel Judgment: “It is every State’s obligation not to allow knowingly its territory to be used for acts contrary to the rights of other states and has been set forth as an obligation of States in the pronouncements of the International Law Association. With the rise of cyber-attacks globally and no end in sight, international cyber security law is at a critical juncture. The failure of states to engage in the development and applications of international law has left a power vacuum allowing for the emergence of non-state norm-making initiatives (Mačák, 2017). As suggested here there is an opportunity now to employ the many initiatives and proposals for the development of standards and norms and to engage the international community in attribution norm and standards building practices.\n## 6. Conclusion This paper has attempted to identify the scope and nature of the attribution problem and the key challenges in attribution from a legal perspective. By analyzing recent cyber events and the means and methods used to address the wrongful acts of nation states one can reasonably conclude that the lack of a legal framework has contributed to rather than reduced the likelihood of future cyber-attacks. Wrongful acts that go unpunished will continue to occur. The reasons are alarming including the lack of standards and an evidentiary process for attributing wrongful conduct that would meet the consensus of the international community. There is opportunity now to find meaningful standards that would provide safeguards from liability for good faith efforts to prevent wrongdoing and future violations of international law. Future research must explore possible solutions for enhancing not only the laws of attribution, but the policies that inform these laws to meet modern realities. This requires multilateral cooperation and an international agreement on the rules and norms that govern cyber attribution both at the national security and economic level to better meet the needs of our evolving cyber landscape."
    }
  },
  "citation_summary": {
    "style": "author_year",
    "dominant_bucket": "author_year",
    "dominant": {
      "intext_total": 41.0,
      "success_occurrences": 37.0,
      "success_unique": 27.0,
      "bib_unique_total": 53.0,
      "occurrence_match_rate": 0.9024390243902439,
      "bib_coverage_rate": 0.5094339622641509,
      "success_percentage": 90.24,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "author_year"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "numeric": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 41.0,
        "success_occurrences": 37.0,
        "success_unique": 27.0,
        "bib_unique_total": 53.0,
        "occurrence_match_rate": 0.9024390243902439,
        "bib_coverage_rate": 0.5094339622641509,
        "success_percentage": 90.24,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "2. The law and challenges of attribution",
    "subtitle": "# 3. Options after attributing an attack",
    "document_type": "unknown",
    "venue": "",
    "publication_year": null,
    "authors": [
      "Virginia Greiman"
    ],
    "affiliations": [
      "Boston University, USA"
    ],
    "emails": [
      "ggreiman@bu.edu"
    ],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "The conundrum of attribution has long been an issue in cyberspace where actors can secretly go about their business without fear of retaliation or retribution. Identifying the responsible actors for cyber- attacks is a monumental challenge though politics usually determines whether attributions are made public. When and how to accuse governments of a cyber-crime, cyber espionage or even an act of cyber war is a critical issue in reducing cyber conflicts and encouraging cyber cooperation. There is no international legal obligation to reveal the grounds on which attribution is based prior to taking appropriate action. States are likewise not obligated to provide evidence of attribution when responding to another state's cyber intrusions. Recognizing that customary international law has not developed a set of understandings or recognized state practice on what level of attribution is acceptable or necessary for establishing state responsibility for cyber actions this paper intends to address that gap. National governments, scholars, private industry, and think tanks have recently offered proposals and standards for the handling of attribution of state sponsored cyber-attacks. The focus of this article is to explore these proposals and standards from an international perspective through the analysis of national practice and international norms and regulations to determine how the international community might develop a system of law on attribution that would meet universal acceptance.",
    "keywords": [
      "cyber attribution",
      "cyber law standards",
      "law and regulation of cyber attribution"
    ],
    "publication_dates": {},
    "identifiers": {
      "doi": [
        "10.34190/IWS.21.116",
        "10.1017/aju.2019.32",
        "10.1017/S0020589318000015",
        "10.1080/13523260.2019.1677324",
        "10.1093/cybsec/tyv003",
        "10.1111/insp.12082",
        "10.1162/ISEC_a_00266"
      ],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": []
    },
    "references_block_count": 1,
    "references_entries_estimated": 22,
    "heading_count": 7,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 41,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 0.975609756097561,
      "footnote_coverage": 0.9024390243902439,
      "unique_index_count": 30
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "author_year",
      "recommended_style": "author_year",
      "aligned": true,
      "signals": {
        "superscript_hits": 0,
        "superscript_definition_lines": 0,
        "numeric_bracket_hits": 0,
        "numeric_endnote_lines": 0,
        "author_year_hits": 33
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 53.0,
      "dominant_bib_coverage_rate": 0.5094339622641509,
      "dominant_link_target": "bibliography",
      "dominant_unresolved_flag": "unresolved_reference_links"
    },
    "heading_validation": {
      "heading_count": 7,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": true,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": true,
        "emails": true,
        "orcids": false,
        "abstract": true,
        "keywords": true,
        "venue": false,
        "persistent_identifier": true,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 1,
        "affiliations": 1,
        "emails": 1,
        "orcids": 0,
        "keywords": 3,
        "doi": 7,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 0
      },
      "coverage": {
        "core_coverage": 1.0,
        "email_author_link_rate": 1.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [],
        "toc_dot_lines": 0
      },
      "flags": []
    },
    "flags": [
      "missing_preceding_text",
      "unresolved_reference_links"
    ]
  },
  "updated_at_utc": "2026-02-14T08:28:35.063325+00:00"
}