{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\I8FCUR9B\\YC8AZ2N5.pdf",
  "custom_id": "280",
  "response": {
    "id": "batch-b6235e9e-281-41d58f81-1813-48db-b08f-e1799f8091f0",
    "custom_id": "280",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "HEINONLINE\n\nDATE DOWNLOADED: Thu Jul 3 11:42:33 2025\nSOURCE: Content Downloaded from HeinOnline\n\n## Citations:\n\nPlease note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n\n## Bluebook 21st ed.\n\nKhatuna Burkadze, A Shift in the Historical Understanding of Armed Attack and Its Applicability to Cyberspace, 44 FLETCHER F. WORLD AFF. 33 (Winter 2020).\n\n## ALWD 7th ed.\n\nKhatuna Burkadze, A Shift in the Historical Understanding of Armed Attack and Its Applicability to Cyberspace, 44 Fletcher F. World Aff. 33 (2020).\n\n## APA 7th ed.\n\nBurkadze, Khatuna. (2020). shift in the historical understanding of armed attack and its applicability to cyberspace. Fletcher Forum of World Affairs, 44(1), 33-48.\n\n## Chicago 17th ed.\n\nKhatuna Burkadze, \"A Shift in the Historical Understanding of Armed Attack and Its Applicability to Cyberspace,\" Fletcher Forum of World Affairs 44, no. 1 (Winter 2020): 33-48\n\n## McGill Guide 10th ed.\n\nKhatuna Burkadze, \"A Shift in the Historical Understanding of Armed Attack and Its Applicability to Cyberspace\" (2020) 44:1 Fletcher F World Aff 33.\n\n## AGLC 4th ed.\n\nKhatuna Burkadze, 'A Shift in the Historical Understanding of Armed Attack and Its Applicability to Cyberspace' (2020) 44(1) Fletcher Forum of World Affairs 33\n\n## MLA 9th ed.\n\nBurkadze, Khatuna. \"A Shift in the Historical Understanding of Armed Attack and Its Applicability to Cyberspace\" Fletcher Forum of World Affairs, vol. 44, no. 1, Winter 2020, pp. 33-48. HeinOnline.\n\n## OSCOLA 4th ed.\n\nKhatuna Burkadze, 'A Shift in the Historical Understanding of Armed Attack and Its Applicability to Cyberspace' (2020) 44 Fletcher F World Aff 33 x\n\nPlease note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n\nCite this document\n\nPinCite this document\n\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1667,
              "width": 1112
            }
          },
          {
            "index": 1,
            "markdown": "33\n\n# A Shift in the Historical Understanding of Armed Attack and Its Applicability to Cyberspace\n\nKhatuna Burkadze\n\n## ABSTRACT\n\nIn the digital era, information and communication technologies have changed the concept of an armed attack. However, there are many uncertainties regarding the applicability of existing international law to cyberspace. Existing international legal regulations do not address cyber warfare and cyber operations, as the UN Charter was adopted in 1945 when the creation of cyberspace was far in the future rather than a current consideration. Because of the gap between law and policy, the following questions should be pondered: (1) Can a cyber attack be considered as an armed attack—the gravest form of use of force under the international law? (2) If yes, how could the UN Charter be reinterpreted to clarify under which circumstances the inherent right of self-defense could be invoked against cyber attacks?\n\nKhatuna Burkadze is a graduate of The Fletcher School of Law and Diplomacy, Tufts University. Dr. Burkadze has been a Fulbright scholar at the MIT Center for International Studies as well as a visiting professor at Columbia University, Bard College, and The Fletcher School of Law and Diplomacy. She has successfully completed programs on negotiations and security studies at Harvard University and George C. Marshall European Center for Security Studies. Dr. Burkadze is an alumna of the U.S. Department of State's Program on American Foreign Policy as well as the author of dozens of articles and book chapters. Currently, she delivers lectures at the Caucasus International University and is employed by the Office of the Prime Minister of Georgia.\n\nVOL. 44: I WINTER 2020",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1989,
              "width": 1315
            }
          },
          {
            "index": 2,
            "markdown": "THE FLETCHER FORUM OF WORLD AFFAIRS\n\n# INTRODUCTION\n\nCyberspace now represents a new and important operational domain for warfare, which is a challenge for both national and international security. Cyberspace is of particular concern, as according to the 2017 National Security Strategy of the United States of America, it offers state and non-state actors the ability to wage campaigns against the political, economic, and security interests of opponents without ever physically crossing borders. Cyber attacks offer adversaries low-cost and deniable opportunities to damage or disrupt critical infrastructure, economies, networks, and to disable the devices that people use each day to communicate and conduct business.¹\n\nJoel Trachtman posits that the rise of cyberspace presents challenges to international law and global governance. First, information is much more mobile than it was prior to the rise of cyberspace, crossing national boundaries without interruption. Second, the rise of cyberspace enables a novel type of terrorism and warfare. These phenomena challenge the ability of the state to provide the services that it has traditionally provided. Often, this will make it more valuable for states to cooperate with one another and to use international law to do so.²\n\nThe unwillingness of states, as well as non-state actors, to have their behavior in cyberspace regulated by specific, treaty-based rules reinforces this reality; these actors instead tend to take advantage of a lack of effective international regulation of their activities.³\n\nStates and international organizations must recognize that cyberspace has become a parallel universe in which the criminal, terrorist, or unlawful combatant can operate with a high degree of impunity. Adding to this challenge, privacy services, provided in the form of user anonymity and data encryption, make it difficult for law enforcement, intelligence organizations, and militaries to attribute actions in cyberspace (whether lawful or not) to specific individuals or state actors.⁴\n\nCyber-based challenges are evolving and arise from a wide array of unintentional and intentional sources. Unintentional threats can be caused by software upgrades or defective equipment that inadvertently disrupts systems. Intentional threats include both targeted and untargeted attacks from a variety of sources, including hackers, disgruntled employees, and foreign nations engaged in espionage and information warfare. These threat sources vary in terms of the capabilities of the actors, their willingness to act, and their motives, which can include monetary gain or political advantage.⁵\n\nVOL. 44: I WINTER 2020",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1990,
              "width": 1315
            }
          },
          {
            "index": 3,
            "markdown": "In view of the current realities, it is necessary to explore basic characteristics of cyber attacks and understand this notion of a new kind of warfare. Due to the sophisticated nature of cyber attacks and the rapid technological changes seen today, state actors need to find responsive and responsible international legal solutions for ensuring their security.\n\n## Cyber Attacks and Cyber Warfare as a New Form of an Armed Attack\n\n### Definition of Cyber Attacks and Cyber Warfare\n\nThere is no widely accepted definition of cyber attack or cyber warfare. For example, the U.S. Department of Defense uses the phrase “computer network attacks,” and defines it as “actions taken by using computer networks to disrupt, deny, degrade, or destroy information resident in computers and computer networks, or the computers and networks themselves.”6\n\nInstead of “computer network attack,” the U.S. Army's Cyber Operations and Cyber Terrorism Handbook uses the term “cyber attack,” defining it as the “premeditated use of disruptive activities, or the threat thereof, against computers and/or networks, with the intention to cause harm or to further social, ideological, religious, political or similar objectives to intimidate any person in furtherance of such objectives.” Such harm could be inflicted on the computer network, as well as to physical facilities and persons. Cyber attacks involve “an aggressive act on the part of one adversary—whether an individual, a competing organization, or a rival government—against another in an ongoing struggle for hegemony in the marketplace or the political arena.” These differ from cyber crimes, which are governed by national criminal statutes and include acts such as identity theft and internet fraud.7\n\nAfter establishing the Cyber Command of the United States, the Joint Chiefs of Staff published a lexicon in 2011 for military use in cyber operations. According to the document, a “cyber attack” is a hostile act using computer or related networks or systems and intended to disrupt and/or destroy an adversary's critical cyber systems, assets, or functions. A cyber attack may use intermediate delivery vehicles such as peripheral devices, electronic transmitters, embedded code, or human operators. The activation or effect of a cyber attack may be widely separated temporally and geographically from the delivery.8 A key feature of this definition is that it limits “cyber attacks” to hostile acts that are intended to harm critical",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1982,
              "width": 1316
            }
          },
          {
            "index": 4,
            "markdown": "THE FLETCHER FORUM OF WORLD AFFAIRS\n\ncyber systems—thus restricting the definition based on the objective of the attack.⁹\n\nThe Tallinn Manual provides interpretation of the existing international legal framework with regard to cyber issues. As stated in the Tallinn Manual, “a cyber attack is a cyber operation, whether offensive or defensive, that is reasonably expected to cause injury or death to persons or damage or destruction to objects.”¹⁰\n\nThus, cyber warfare and cyber attacks can be used to describe defending and attacking information and computer network activities in cyberspace. However, cyber attacks are not easy for states to combat because the process of determining the origin and nature of the attack and assessing the damage incurred is difficult.¹¹ Antonia Chayes asserted that factual uncertainty about the origins and nature of a cyber attack almost guarantees legal uncertainty under both international and domestic law.¹²\n\nIn addition to these clarifications, the ultimate goal of warfare—victory—will not change in the future. The tactics of achieving this victory, however, are radically different in cyberspace. If there is a war between major world powers, the first victim of the conflict could be the Internet itself. There will be two broad categories of cyber attacks during a major war: one on military forces, in which the attacks would be conducted as part of a broader effort to disable the adversary’s weaponry and to disrupt military command-and-control systems; and the other on civilian infrastructure, in which the targets may include an adversary’s financial sector, industry, and national morale in order to diminish the adversary’s ability and will to wage war for extended periods.¹³\n\nIn addition to traditional war, cyber attacks are becoming a means to achieve political ends. A typical example is Internet stoppage in which perpetrators simultaneously log onto a site, connect to a server, send an e-mail, or make postings to forums in order to limit or even deny access to the site by other users. The Internet site or server is overwhelmed by access requests, causing an interruption or complete stoppage.¹⁴\n\nIn view of the above, it is important to note that communication technologies, used for offensive or defensive cyber attacks, are equally accessible to state and non-state actors in cyberspace. A computer can be both a target of attack or an instrument for carrying out a new form of war.\n\n## Key Characteristics of Cyber Attacks\n\nThe growing number of known vulnerabilities increases the potential number of attacks. By exploiting software vulnerabilities, hackers who\n\nVOL. 44: I WINTER 2020",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1990,
              "width": 1314
            }
          },
          {
            "index": 5,
            "markdown": "A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\n\nspread malicious code can cause significant damage, ranging from defacing web sites to taking control of entire systems and thereby being able to read, modify, or delete sensitive information; disrupt operations; launch attacks against other organizations' systems; or altogether destroy them.[15]\n\nDistributed Denial of Service (DDoS) attacks have been the most prevalent form of cyber attack in recent years. In these attacks, coordinated botnets—collections of thousands of “zombie” computers hijacked by insidious viruses—overwhelm servers by systematically visiting designated websites.[16]\n\nIn 2007, Estonia became a target of a DDoS attack. The relocation of a Soviet-era war memorial unleashed a series of large and sustained DDoS attacks flooding networks or websites with attack traffic, rendering them inaccessible.[17]\n\nThese attacks caused more than just confusion for the nation's population. At the time of these attacks, Estonia had essentially instituted an \"e-government\" where many aspects of the government were carried out online. In addition to bringing down many of Estonia's critical government and commercial websites, the cyber attacks also caused the emergency phone number used for calling ambulance and fire services to be unavailable for more than one hour. As a result, widespread social unrest and rioting left 150 people injured.[18] Additionally, botnet managers had used malware to infect unsuspecting computers.[19] Antonia Chayes asserted that the effects of the attack on Estonia did not appear to be proportional to their cause, which indicates how easily petty disputes can lead to serious consequences in the cyber age.[20]\n\nIn 2008, Georgia became the target of similar attacks, though in this case they were carried out alongside conventional military actions. These cyber attacks mainly hindered the Georgian government's ability to communicate with both its citizens and other nations prior to and during the physical invasion by Russia, so as to weaken their ability to respond. Official Georgian websites, including those for the President's office, the Ministry of Foreign Affairs, and the Ministry of Defense were disabled. Even after the cease-fire between the nations was reached, major Georgian servers remained inoperable. The Russian-Georgian cyber conflict illustrates the havoc that can spread on the digital battlefield and re-energizes the debate over whether the laws of war could apply to this new kind of warfare.[21]\n\nThe cyber attack against Georgia reveals the potential for a much larger threat. Had the hackers aimed their attacks at another state in tension with Georgia, they could have instigated the opening of another front in\n\nVOL.44:I WINTER 2020",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1988,
              "width": 1314
            }
          },
          {
            "index": 6,
            "markdown": "THE FLETCHER FORUM OF WORLD AFFAIRS\n\nRussia's war on Georgia. Such covert action would be perfidious, yet the law of armed conflict falls short of explicitly prohibiting such conduct.[22]\n\nBased on the analysis of the key characteristics of cyber attacks, the following issues should be outlined: (1) While traditional military weapons such as tanks and missiles tend to be monopolized by the state, cyberweapons can be created and used by anyone; (2) Cyberweapons are much more versatile than traditional military weapons—while traditional military weapons are used mainly to destroy, cyberweapons can be used for gathering information as well as destruction;[23] (3) The targeted states have difficulty in defining who a cyber attacker is—states can support or employ third-party hacker groups to weaken opponents; (4) The results of cyber attacks are unpredictable—cyberweapons can cause similar or greater damage than traditional kinetic weapons.\n\nGiven these issues, cyber attacks present a litmus test for a nation's commitment to international law. The problem of attribution in cyberspace means that cyber attackers have the capability to coerce a state without the subsequent responsibility or punishment under international law. Therefore, the cyber attacker may experience great temptation to violate principles and obligations of international law to achieve the attacker's ends. Some experts have advocated for less online anonymity and more government control over the cyberspace infrastructure to combat this, and other solutions exist that create fewer domestic liberty concerns.[24]\n\nCyber attacks provide a low-cost, remote, instantaneous, and powerful means of coercion or destruction, often without accountability. These attributes guarantee that state and non-state actors will continue to develop and unleash cyber attacks in the foreseeable future.[25]\n\nTherefore, challenges coming from cyber attacks create new space for states and other actors to rethink the ambiguities of international norms, which were historically adopted to define rules related to traditional military operations. Current international legal framework for the use of force and armed attack must be analyzed to clarify the legality of cyber operations in the digital era, as no direct international legal regulations currently exist for understanding the concept of cyber operations.\n\n## INTERNATIONAL LEGAL REGULATION OF THE USE OF FORCE\n\n## Definition of the Use of Force in the Digital Era\n\nIn order to maintain international peace and security, the internal legal system of states gradually moved away from monopolizing the use of\n\nVOL. 44: I WINTER 2020",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1991,
              "width": 1313
            }
          },
          {
            "index": 7,
            "markdown": "A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\n\nforce and now permits it only in the exceptional cases defined under international law. Contemporary international law regarding the use of force is based on the UN Charter. The authors of the Charter wished to ban all uses of force, but also provided for some exceptions to this ban, which are regulated by the Charter.\n\nOne of the reasons that the UN was created was to modernize international law in the twentieth century. Leaders decided to “establish conditions under which justice and respect for the obligations arising from treaties and other sources of international law can be maintained, and to save succeeding generations from the scourge of war, which twice in our lifetime has brought untold sorrow to mankind.”²⁶ Therefore, modern legal regulation of force and conflict began with the UN Charter. Article 2 (4) mandates that “all Members shall refrain in their international relations from the threat or use of force against the territorial integrity or political independence of any state, or in any other manner inconsistent with the purposes of the United Nations.”²⁷\n\nDue to the establishment of new operational domains and the use of cyber technological advances for weakening states’ critical infrastructure, the following questions should be asked: “Does Article 2 (4) of the UN Charter apply in cyberspace?” and “Do cyber attacks violate the general prohibition on the use of force?” Answering these questions will require a legal interpretation of Article 2 (4) of the UN Charter.\n\nWhile Article 2 (4) of the UN Charter mentions the threat or use of force, it does not mention war. The term “war” refers to a narrow and technical legal situation, which begins with a declaration of war and ends with a peace treaty. War was generally prohibited before the Second World War, but states found a way to avoid such prohibition. For example, Japan refused to declare war on China and instead called its military operations in Manchuria (1932-1941) “an incident” to avoid violating the prohibition of waging war. In light of such experiences, the term “use of force” was preferred because it covers all forms of hostilities, both technical wars and incidents falling short of an officially declared war, which range from minor border clashes to extensive military operations. Therefore, the prohibition of the use of force is not dependent on how the involved states prefer to define their military conflict.²⁸\n\nLegal precedent upholds that the term “use of force” should be broadly defined. In its argument on a case concerning Nicaragua, the International Court of Justice (ICJ) rejected a narrow interpretation of “use of force” that limits the term to the employment of either kinetic force or non-kinetic operations generating comparable effects. The Court held that\n\nVOL. 44: I WINTER 2020",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1989,
              "width": 1313
            }
          },
          {
            "index": 8,
            "markdown": "THE FLETCHER FORUM OF WORLD AFFAIRS\n\na state's arming and training of guerrilla forces that would then be engaged in hostilities against another state qualified as a use of force, a position that has since become widely accepted. This logic leads to the conclusion that non-destructive cyber operations could be considered a use of force. For example, providing malware to a rebel group and training its members to employ that malware in a destructive manner would seemingly qualify.²⁹\n\nHowever, every unfriendly act does not cross the use of force threshold. In the case of Nicaragua, the Court held that financing guerrillas, while an unlawful \"intervention,\" did not rise to that level. Additionally, the drafters of the UN Charter rejected a proposal to further define economic coercion as a use of force. In this regard, the Group of International Experts, who authored the Tallinn Manual on the international law applicable to cyber warfare, unanimously agreed that any cyber operation causing greater than *de minimis* damage or injury suffices.³⁰\n\nOver time, both the reaction of states to cyber operations as well as how they characterize their own cyber operations will inform the process of interpretive maturation. The use of force threshold, wherever it may presently lie, will almost certainly drop in lock step with the increasing dependency of states on cyberspace. Although it is difficult to predict whether any bright-line test will materialize, or whether states will simply characterize \"use of force\" more liberally, a number of options for clarifying the threshold exist.³¹ In assessing whether an event constitutes a use of force in or through cyberspace, it is important to evaluate several factors: the context of the event, the actor perpetrating the action (recognizing challenging issues of attribution in cyberspace), the target and location, and the effects and intent. Commonly cited examples of cyber activity that could constitute a use of force include: (1) Operations that trigger a nuclear plant meltdown; (2) Operations that open a dam above a populated area, causing destruction; or (3) Operations that disable air traffic control, resulting in airplane crashes. These seem to be based on the logic that if the physical consequences of a cyber attack inflict comparable physical damage to dropping a bomb or firing a missile, that cyber attack should be considered a use of force.³²\n\nIt should be noted that an exact definition of the use of force is not given in the UN Charter. This means that if a cyber operation rises to the level of an act of violence, it represents a violation of the general prohibition of the use of force. However, exceptional circumstances to the general prohibition of the use of force are defined through the UN Charter. Thus, the legality of the use of force, including the use of cyberweapon, depends on the legal grounds which permit the use of force as an exceptional\n\nVOL. 44: I WINTER 2020",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1991,
              "width": 1313
            }
          },
          {
            "index": 9,
            "markdown": "measure. These grounds will be clarified in accordance with the current international legal framework in the next sub-section.\n\nLegal Basis of the Use of Force in Accordance with the United Nations Charter\n\nDespite the fact that the UN Charter was adopted in 1945 when the idea of cyberspace was still far in the future, cyberspace actors should still understand how international law can govern cyber attacks and cyber warfare.\n\nIn 2013, the Group of Governmental Experts of the United Nations published its third report on confidence building measures which, inter alia, promoted the further study of norms and the pursuit of consensus, and implied that the UN Charter applies to digital space.33 Moreover, in the Tallinn Manual 1.0 and Tallinn Manual 2.0, the International Experts analyze how existing international law applies to cyber warfare and cyber operations.\n\nTherefore, if a cyber attack reaches a threshold that threatens security and peace, the UN Security Council has the authority to make an appropriate decision. Particularly, the first exception to the general prohibition of the use of force falls under Article 39 of the UN Charter. Article 39 empowers the Security Council to “determine the existence of any threat to the peace, breach of the peace, or act of aggression, and to make recommendations, or decide what measures shall be taken to maintain or restore international peace and security.”34\n\nIn light of the above, if the UN Security Council considers the aforementioned measures inadequate for maintaining or restoring international peace and security, it may take actions defined by Article 42 of the UN Charter. Particularly, Article 42 indicates that enforcement measures may be taken by air, sea, or land forces of members of the United Nations.35 Simultaneously, the International Group of Experts agreed that any action undertaken based on this rule may be implemented by, or against, cyber capabilities.36\n\nThe UN Security Council resolutions are legally binding on the members of the United Nations, and they are obliged to follow these resolutions. According to Article 48 of the UN Charter, the action required to carry out the decisions of the Security Council for the maintenance of international peace and security shall be taken by all the Members of the United Nations or by some of them, as the Security Council may determine. Such decisions shall be carried out by the Members of the United Nations directly and through their action in the appropriate international agencies of which they are members.37",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1989,
              "width": 1314
            }
          },
          {
            "index": 10,
            "markdown": "THE FLETCHER FORUM OF WORLD AFFAIRS\n\nIt should be noted that the UN Security Council faces obstacles in making decisions for maintaining or restoring international peace. It is a political body, and its decisions are based on political views rather than purely legal ones. No important decision can be made if one of the permanent members (the Russian Federation, the United Kingdom, France, China, and the United States of America) of the Security Council disagrees with it. Particularly, a veto power of the permanent member can hamper or block the process and make the Security Council incapable of acting on maintaining peace and security. This is a historical weakness of the collective security system.\n\nThe second exception to the general prohibition of the use of force is defined by Article 51 of the UN Charter, which states: \"Nothing in the present Charter shall impair the inherent right of individual or collective self-defense if an armed attack occurs against a Member of the United Nations, until the Security Council has taken measures necessary to maintain international peace and security.\"³⁸\n\nTaking into consideration the above, the use of cyber force is illegal and contradicts international law if there are no appropriate legal grounds for the use of force defined by the existing international legal framework or these actions are not sanctioned by the UN Security Council in accordance with Chapter 7 of the UN Charter.\n\n## REINTERPRETATION OF AN ARMED ATTACK\n\nThis chapter clarifies factors that can be used to define the effects of cyber attacks. Particularly, it aims to explore the level at which a cyber attack reaches that of an armed attack, and under which circumstances states can have the right to use individual or collective defense against a cyber attack as an armed attack.\n\nThe legal grounds for the right of individual and collective defense is an armed attack. This raises the need to precisely define the term \"armed attack.\" In its conclusion concerning the case of Nicaragua, the ICJ stated: \"an armed attack must be understood as including not merely action by regular armed forces across an international border, but also the sending by or on behalf of a State of armed bands, groups, irregulars or mercenaries, which carry out acts of armed force against another State of such gravity as to amount to (inter alia) an actual armed attack conducted by regular forces, or its substantial involvement therein.\" This description, contained in Article 3, paragraph (g), of the Definition of Aggression annexed to General Assembly Resolution 3314 (XXIX), may be taken to reflect\n\nVOL. 44: I WINTER 2020",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1992,
              "width": 1313
            }
          },
          {
            "index": 11,
            "markdown": "A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\n\ncustomary international law. The Court sees no reason to deny that, in customary law, the prohibition of armed attacks may apply to the sending by a State of armed bands to the territory of another State, if such an operation, because of its scale and effects, would have been classified as an armed attack rather than as a mere frontier incident had it been carried out by regular armed forces.³⁹\n\nTo determine if a cyber attack has risen to the level of an armed attack, three competing views have emerged: (1) the instrument-based approach, (2) the target-based approach, and (3) the effects-based approach. The instrument-based approach focuses on the tools used in an attack, arguing that, to be an armed attack, the initiator must use traditional military weapons. The target-based approach focuses on what the attack is aimed at, thus meriting self-defense when the target is “a sufficiently important computer system.” The effects-based approach focuses on the overall impact of the attack, thus meriting self-defense when the attack is of sufficient gravity.⁴⁰\n\nThe self-defense component of Article 51 of the UN Charter was drafted consistent with the instrument-based approach. Michael Schmitt argues that the choice to use an instrument-based approach is not sufficient to address self-defense claims against cyber attacks. Because armed attacks inherently include kinetic military force and cyber attacks often utilize non-kinetic approaches, the instrument-based approach fails to encapsulate cyber attacks that do not look like armed attacks but have the same ultimate effect. Instead, he argues for an effects-based approach which would better address cyber attacks because it allows broader latitude for a state to respond in self-defense, though it is not a current norm in international law.⁴¹\n\nMichael Schmitt argues that a cyber attack’s effects should be measured against six factors: (1) severity: the type and scale of the harm; (2) immediacy: how quickly the harm materializes after the attack; (3) directness: the length of the causal chain between the attack and the harm; (4) invasiveness: the degree to which the attack penetrates the victim state’s territory; (5) measurability: the degree to which the harm can be quantified; and (6) presumptive legitimacy: the weight given to the fact that, in the field of cyber activities as a whole, cyber attacks constituting an armed attack are the exception rather than the rule.⁴²\n\nIn this regard, according to the Tallinn Manual 1.0, no international cyber incidents have been unambiguously and publicly characterized by the international community as reaching the threshold of an armed attack. Not even the 2007 cyber operations against Estonia, which were colloquially referred to as “cyber war,” were publicly described as such. The International Group of Experts agreed with this assessment on the basis\n\nVOL. 44: I WINTER 2020",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1989,
              "width": 1315
            }
          },
          {
            "index": 12,
            "markdown": "THE FLETCHER FORUM OF WORLD AFFAIRS\n\nthat the scale and effects threshold of these cyber operations was not sufficiently met to deem it an armed attack.⁴³\n\nBased on the analysis of notions of the \"use of force\" and \"armed attack,\" it is important to note that all armed attacks are uses of force, and therefore all cyber operations that reach the threshold of armed attack will be considered uses of force. This distinction is important given the fact that an action that amounts to a use of force is a violation of Article 2(4) of the UN Charter, while an action reaching the threshold of armed attack could trigger an armed response from the victim state under Article 51 of the UN Charter.⁴⁴\n\nPrevious discussion has centered around state actors, but due to the nature of this new kind of war, the following question should be raised: \"Could an armed attack carried out by a non-state actor from abroad serve as legal grounds for the right of defense?\" The attacks of September 11, 2001 triggered discussions to determine whether the \"armed attack\" referred to in Article 51 of the UN Charter could include terrorist attacks, as the text itself does not clarify that an armed attack should be executed by a state.\n\nNevertheless, the ICJ has ruled that self-defense is limited to instances of states being attacked by other states. The Court circumscribed the applicability of the international legal order to certain actors, leaving others unregulated despite their actual participation in activities that affect world order. The majority of scholars accept that a strict insistence on state imputability is no longer tenable. The Court's restrictive approach is increasingly out of touch with the reality of non-state actors seen today.⁴⁵\n\nThe reaction of the international community to 9/11 illustrated that the concept of an armed attack is not limited to just state actors. In the aftermath of the terrorist attacks carried out against the United States, the UN Security Council recognized the American right to self-defense, and immediately codified it in appropriate resolutions.⁴⁶ This meant that such acts serve as grounds for enacting Article 51 of the UN Charter. NATO also weighed in and agreed that the terrorist attacks were directed from abroad against the United States and therefore were covered by Article 5 of the North Atlantic Treaty. This marked the only time in history that NATO made the decision to use the mechanism of collective defense.\n\nIn the context of cyber attacks, Professor Michael Schmitt posits that future cyber operations will challenge the ICJ's narrow interpretation of acceptable actors of armed attacks. He purports that non-state actors will soon turn to cyber operations to attack states, because cyberspace is a fertile environment for non-state actors who wish to do so, and because it is much easier for non-state actors to acquire the tools, such as destructive\n\nVOL. 44: I WINTER 2020",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1990,
              "width": 1314
            }
          },
          {
            "index": 13,
            "markdown": "A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\n\nmalware, that could impact vulnerable cyber systems than it is to acquire the kinetic means to conduct a traditional attack.⁴⁷\n\nGiven rapid technological advances, cyberweapons are now available to both state and non-state actors. States can indirectly carry out cyber attacks against other states through the use of hackers. In such cases, it is necessary to take into consideration the following aspects: (1) Cyber attacks can be conducted by a non-state actor under the support of a state; (2) Cyber attacks can be directed from the sponsor country against the other state; (3) Cyber attacks can reach the sufficient gravity of armed attack. Therefore, if a cyber attack carried out by a non-state actor meets these requirements, it could serve as a basis for individual or collective defense.\n\n# CONCLUSION\n\nTechnological advances have significantly changed not only the nature of battles, but the interpretation of the concept of armed attack itself. Current international legal regulations, including the UN Charter, apply to cyber attacks for the following reasons: (1) cyber attacks can reach a threshold that threatens a state's national security; and (2) the impact of cyber attacks can be as harmful to states as conventional attacks.\n\nIn view of the above, it is important to clarify key parameters of cyber attacks and cyber warfare, based on the reinterpretation of Article 51 of the UN Charter. First, an armed attack represents legal grounds for the use of an individual or collective defense mechanism. Second, because of the destructive nature of cyber attacks, interpretation of Article 51 of the UN Charter has been expanded to include cyber attacks as armed attacks. The International Group of Experts agreed that \"scale and effects\" are qualitative and quantitative factors that would apply when determining if a cyber operation qualifies as the gravest form of use of force (armed attack).⁴⁸ According to Tallinn Manual 1.0., cyber attacks rise to the level of an armed attack if they cause injury or death to persons or damage or destruction to objects.⁴⁹ Third, due to the reinterpretation of armed attacks, the notion of cyber attack should not be limited by the state actor as the sole possible perpetrator. The legal language of Article 51 of the UN Charter does not impose limitations on the execution of an armed attack by a state or a non-state actor. Given technological advances, it is highly possible that terrorist organizations will be able to create offensive cyber tools.\n\nBased on customary international norms, in cases of exercising the right of defense, states would consider the following elements: (1) Scope: is the incident widespread across a geographic area or industrial sectors? The\n\nVOL. 44: I WINTER 2020",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1988,
              "width": 1316
            }
          },
          {
            "index": 14,
            "markdown": "THE FLETCHER FORUM OF WORLD AFFAIRS\n\nwider the attack, the more likely a state action will be; (2) Duration: is the incident a single event or does it last over time as part of a longer campaign? A state is more likely to act for extended incidents; (3) Intensity/Scale: has the incident caused death or substantial property destruction? If not, a state is unlikely to declare individual or collective defense; (4) External Actor: is the incident directed from a foreign or domestic adversary? A state is unlikely to act against a purely domestic foe.⁵⁰ States will have to consider these criteria if they use the right of defense against cyber attacks.\n\nIn light of the foregoing considerations, regardless of the lack of exact international legal regulation of cyber attacks and cyber warfare, reinterpretation of current international norms will reduce ambiguity and allow states to better mitigate cyber risks in the future. f\n\n# ENDNOTES\n\n1. Donald J. Trump, *The National Security Strategy of the United States of America*, (Washington D.C., 2017).\n2. Joel P. Trachtman, *The Future of International Law: Global Government* (Cambridge University Press, 2013), 85.\n3. Andreas Zimmermann, “International Law and Cyber Space”, *ESIL Reflections* 3 (1) (2014): 2.\n4. Bret Michael and Thomas Wingfield, “International Legal Reform Could Make States Liable for Cyber Abuse,” *per Concordiam* 2 (2) (2011), <https: 10=\"\" 2018=\"\" ccdcoe.org=\"\" pc_v2n2_en.pdf=\"\" uploads=\"\"> (Accessed October 7, 2019).\n5. U.S. Government Accountability Office, *Cyber Security – Threats Impacting the Nation*, GAO-12-666T, (Washington D.C., 2012), 3.\n6. Arie J. Schaap, “Cyber Warfare Operations: Development and Use Under International Law,” *Air Force Law Review* 64 (2009): 126.\n7. Lesley Swanson, “The Era of Cyber Warfare: Applying International Humanitarian Law to the 2008 Russian-Georgian Cyber Conflict,” 32 *Loyola of Los Angeles International and Comparative Law Review* (2010): 307.\n8. James E. Cartwright, *Joint Terminology for Cyberspace Operations*, 2011, 5.\n9. Oona Hathaway, et al. “The Law of Cyber Attack,” *California Law Review* 100 (2012): 824.\n10. Michael N. Schmitt, ed., *Tallinn Manual 1.0 on the International Law Applicable to Cyber Warfare* (Cambridge University Press, 2013), 106.\n11. Congressional Research Service, *Cyber Warfare*, by Stephen Hildreth, RL30735 (2001), 2.\n12. Antonia Chayes, “Rethinking Warfare: The Ambiguity of Cyber Attacks,” *Harvard National Security Journal* 6 (2015): 480.\n13. Kenneth K. Geers, “Heading off Hackers,” *per Concordiam* 2 (2) (2011), <https: 10=\"\" 2018=\"\" ccdcoe.org=\"\" pc_v2n2_en.pdf=\"\" uploads=\"\"> (Accessed October 7, 2019).\n14. Viacheslav Dziundziuk, “Stopping Cyber Terror,” *per Concordiam* 2(2) 2011, <https: 10=\"\" 2018=\"\" ccdcoe.org=\"\" pc_v2n2_en.pdf=\"\" uploads=\"\"> (Accessed October 7, 2019).\n15. U.S. Government Accountability Office, *Cyber Analysis and Warning*, GAO-08-588, (Washington D.C., 2008), 8-9.\n16. Hathaway, 837.\n\nVOL.44:1 WINTER 2020</https:></https:></https:>",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1991,
              "width": 1315
            }
          },
          {
            "index": 15,
            "markdown": "A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\n\n17 Jason Healey, et al., \"NATO's Cyber Capabilities: Yesterday, Today, and Tomorrow,\" *Atlantic Council* (2014): 2.\n18 Swanson, 309-310.\n19 Vytautas Butrimas, \"An Unsettling Trend,\" *per Concordiam* 2 (2) (2011), <https: 10=\"\" 2018=\"\" cdc0e.org=\"\" pc_v2n2_en.pdf=\"\" uploads=\"\" uploads?=\"\"> (Accessed October 7, 2019).\n20 Chayes, 476.\n21 Swanson, 304.\n22 Michael Gervais, \"Cyber Attacks and the Laws of War,\" *Berkeley Journal of International Law* 30 (2012), 575.\n23 Grant Hodgson, \"Cyber Attack Treaty Verification,\" *Journal of Law and Policy for the Information Society* 12 (2016), 240.\n24 Gervais, 579.\n25 Ibid., 578.\n26 United Nations, Charter of the United Nations <http: documents=\"\" charter=\"\" intro.shtml=\"\" wwwupdate.un.org=\"\"> (Accessed October 10, 2019).\n27 Matthew C. Waxman, \"Cyber Attacks as Force under UN Charter Article 2(4),\" *International Law Studies Series, US Naval War College* 87 (2011): 44.\n28 René Värk, “The Use of Force in the Modern World: Recent Developments and Legal Regulation of the Use of Force,” *Baltic Defense Review* 2 (2003): 29-30.\n29 Michael N. Schmitt, \"The Law of Cyber Warfare: Quo Vadis?,\" *Stanford Law &amp; Policy Review* 25 (2014): 279-280.\n30 Ibid., 280-281.\n31 Ibid.\n32 Chayes, 507.\n33 \"Back to Square One? Back to Square One? The Fifth UN GGE Fails to Submit a Conclusive Report at the UN General Assembly,\" *CCDOE*, <https: back-to-square-one-the-fifth-un-gge-fails-to-submit-a-conclusive-report-at-the-un-general-assembly=\"\" ccdcoe.org=\"\" incyder-articles=\"\"></https:> (Accessed October 1, 2019).\n34 Hathaway, 843-844.\n35 Charter of the United Nations.\n36 Schmitt, *Tallinn Manual*, 71.\n37 Charter of the United Nations.\n38 Ibid.\n39 Nicaragua v. the United States of America, *International Court of Justice (ICJ)*, 1986, 93.\n40 Stephen Moore, \"Cyber Attacks and the Beginnings of an International Cyber Treaty,\" 39 *The North Carolina Journal of International Law and Commercial Regulation*, 2013: 247.\n41 Ibid., 247-248.\n42 Hathaway, 847.\n43 Schmitt, *Tallinn Manual*, 57-58.\n44 Dan-Iulian Voitasec, \"Applying International Humanitarian Law to Cyber Attacks,\" *Lex ET Scientia International Journal* 22 (2015): 126.\n45 Gary D. Solis, \"Cyber Warfare,\" *Military Law Review* 219 (2014): 19-21.\n46 UN Security Council Resolution N1368, September 12, 2001; UN Security Council Resolution N1373, September 28, 2001.\n47 Schmitt, 287.\n48 Voitasec, 126.\n49 Schmitt, *Tallinn Manual*, 106.\n50 Healey et al., 7.\n\nVOL. 44:1 WINTER 2020</http:></https:>",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1983,
              "width": 1316
            }
          },
          {
            "index": 16,
            "markdown": "48 THE FLETCHER FORUM OF WORLD AFFAIRS\n\nVOL. 44: I WINTER 2020",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1990,
              "width": 1314
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 17,
          "doc_size_bytes": 932168
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "HEINONLINE\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\n33\n# A Shift in the Historical Understanding of Armed Attack and Its Applicability to Cyberspace\nKhatuna Burkadze\n## ABSTRACT\nIn the digital era, information and communication technologies have changed the concept of an armed attack. However, there are many uncertainties regarding the applicability of existing international law to cyberspace. Existing international legal regulations do not address cyber warfare and cyber operations, as the UN Charter was adopted in 1945 when the creation of cyberspace was far in the future rather than a current consideration. Because of the gap between law and policy, the following questions should be pondered: (1) Can a cyber attack be considered as an armed attack—the gravest form of use of force under the international law? (2) If yes, how could the UN Charter be reinterpreted to clarify under which circumstances the inherent right of self-defense could be invoked against cyber attacks?\nKhatuna Burkadze is a graduate of The Fletcher School of Law and Diplomacy, Tufts University. Dr. Burkadze has been a Fulbright scholar at the MIT Center for International Studies as well as a visiting professor at Columbia University, Bard College, and The Fletcher School of Law and Diplomacy. She has successfully completed programs on negotiations and security studies at Harvard University and George C. Marshall European Center for Security Studies. Dr. Burkadze is an alumna of the U.S. Department of State's Program on American Foreign Policy as well as the author of dozens of articles and book chapters. Currently, she delivers lectures at the Caucasus International University and is employed by the Office of the Prime Minister of Georgia.\nVOL. 44: I WINTER 2020\nTHE FLETCHER FORUM OF WORLD AFFAIRS\n# INTRODUCTION\nCyberspace now represents a new and important operational domain for warfare, which is a challenge for both national and international security. Cyberspace is of particular concern, as according to the 2017 National Security Strategy of the United States of America, it offers state and non-state actors the ability to wage campaigns against the political, economic, and security interests of opponents without ever physically crossing borders. Cyber attacks offer adversaries low-cost and deniable opportunities to damage or disrupt critical infrastructure, economies, networks, and to disable the devices that people use each day to communicate and conduct business.¹\nJoel Trachtman posits that the rise of cyberspace presents challenges to international law and global governance. First, information is much more mobile than it was prior to the rise of cyberspace, crossing national boundaries without interruption. Second, the rise of cyberspace enables a novel type of terrorism and warfare. These phenomena challenge the ability of the state to provide the services that it has traditionally provided. Often, this will make it more valuable for states to cooperate with one another and to use international law to do so.²\nThe unwillingness of states, as well as non-state actors, to have their behavior in cyberspace regulated by specific, treaty-based rules reinforces this reality; these actors instead tend to take advantage of a lack of effective international regulation of their activities.³\nStates and international organizations must recognize that cyberspace has become a parallel universe in which the criminal, terrorist, or unlawful combatant can operate with a high degree of impunity. Adding to this challenge, privacy services, provided in the form of user anonymity and data encryption, make it difficult for law enforcement, intelligence organizations, and militaries to attribute actions in cyberspace (whether lawful or not) to specific individuals or state actors.⁴\nCyber-based challenges are evolving and arise from a wide array of unintentional and intentional sources. Unintentional threats can be caused by software upgrades or defective equipment that inadvertently disrupts systems. Intentional threats include both targeted and untargeted attacks from a variety of sources, including hackers, disgruntled employees, and foreign nations engaged in espionage and information warfare. These threat sources vary in terms of the capabilities of the actors, their willingness to act, and their motives, which can include monetary gain or political advantage.⁵\nVOL. 44: I WINTER 2020\nIn view of the current realities, it is necessary to explore basic characteristics of cyber attacks and understand this notion of a new kind of warfare. Due to the sophisticated nature of cyber attacks and the rapid technological changes seen today, state actors need to find responsive and responsible international legal solutions for ensuring their security.\n## Cyber Attacks and Cyber Warfare as a New Form of an Armed Attack\n### Definition of Cyber Attacks and Cyber Warfare\nThere is no widely accepted definition of cyber attack or cyber warfare. For example, the U.S. Department of Defense uses the phrase “computer network attacks,” and defines it as “actions taken by using computer networks to disrupt, deny, degrade, or destroy information resident in computers and computer networks, or the computers and networks themselves.”6\nInstead of “computer network attack,” the U.S. Army's Cyber Operations and Cyber Terrorism Handbook uses the term “cyber attack,” defining it as the “premeditated use of disruptive activities, or the threat thereof, against computers and/or networks, with the intention to cause harm or to further social, ideological, religious, political or similar objectives to intimidate any person in furtherance of such objectives.” Such harm could be inflicted on the computer network, as well as to physical facilities and persons. Cyber attacks involve “an aggressive act on the part of one adversary—whether an individual, a competing organization, or a rival government—against another in an ongoing struggle for hegemony in the marketplace or the political arena.” These differ from cyber crimes, which are governed by national criminal statutes and include acts such as identity theft and internet fraud.7\nAfter establishing the Cyber Command of the United States, the Joint Chiefs of Staff published a lexicon in 2011 for military use in cyber operations. According to the document, a “cyber attack” is a hostile act using computer or related networks or systems and intended to disrupt and/or destroy an adversary's critical cyber systems, assets, or functions. A cyber attack may use intermediate delivery vehicles such as peripheral devices, electronic transmitters, embedded code, or human operators. The activation or effect of a cyber attack may be widely separated temporally and geographically from the delivery.8 A key feature of this definition is that it limits “cyber attacks” to hostile acts that are intended to harm critical\nTHE FLETCHER FORUM OF WORLD AFFAIRS\ncyber systems—thus restricting the definition based on the objective of the attack.⁹\nThe Tallinn Manual provides interpretation of the existing international legal framework with regard to cyber issues. As stated in the Tallinn Manual, “a cyber attack is a cyber operation, whether offensive or defensive, that is reasonably expected to cause injury or death to persons or damage or destruction to objects.”¹⁰\nThus, cyber warfare and cyber attacks can be used to describe defending and attacking information and computer network activities in cyberspace. However, cyber attacks are not easy for states to combat because the process of determining the origin and nature of the attack and assessing the damage incurred is difficult.¹¹ Antonia Chayes asserted that factual uncertainty about the origins and nature of a cyber attack almost guarantees legal uncertainty under both international and domestic law.¹²\nIn addition to these clarifications, the ultimate goal of warfare—victory—will not change in the future. The tactics of achieving this victory, however, are radically different in cyberspace. If there is a war between major world powers, the first victim of the conflict could be the Internet itself. There will be two broad categories of cyber attacks during a major war: one on military forces, in which the attacks would be conducted as part of a broader effort to disable the adversary’s weaponry and to disrupt military command-and-control systems; and the other on civilian infrastructure, in which the targets may include an adversary’s financial sector, industry, and national morale in order to diminish the adversary’s ability and will to wage war for extended periods.¹³\nIn addition to traditional war, cyber attacks are becoming a means to achieve political ends. A typical example is Internet stoppage in which perpetrators simultaneously log onto a site, connect to a server, send an e-mail, or make postings to forums in order to limit or even deny access to the site by other users. The Internet site or server is overwhelmed by access requests, causing an interruption or complete stoppage.¹⁴\nIn view of the above, it is important to note that communication technologies, used for offensive or defensive cyber attacks, are equally accessible to state and non-state actors in cyberspace. A computer can be both a target of attack or an instrument for carrying out a new form of war.\n## Key Characteristics of Cyber Attacks\nThe growing number of known vulnerabilities increases the potential number of attacks. By exploiting software vulnerabilities, hackers who\nVOL. 44: I WINTER 2020\nA SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\nspread malicious code can cause significant damage, ranging from defacing web sites to taking control of entire systems and thereby being able to read, modify, or delete sensitive information; disrupt operations; launch attacks against other organizations' systems; or altogether destroy them.[15]\nDistributed Denial of Service (DDoS) attacks have been the most prevalent form of cyber attack in recent years. In these attacks, coordinated botnets—collections of thousands of “zombie” computers hijacked by insidious viruses—overwhelm servers by systematically visiting designated websites.[16]\nIn 2007, Estonia became a target of a DDoS attack. The relocation of a Soviet-era war memorial unleashed a series of large and sustained DDoS attacks flooding networks or websites with attack traffic, rendering them inaccessible.[17]\nThese attacks caused more than just confusion for the nation's population. At the time of these attacks, Estonia had essentially instituted an \"e-government\" where many aspects of the government were carried out online. In addition to bringing down many of Estonia's critical government and commercial websites, the cyber attacks also caused the emergency phone number used for calling ambulance and fire services to be unavailable for more than one hour. As a result, widespread social unrest and rioting left 150 people injured.[18] Additionally, botnet managers had used malware to infect unsuspecting computers.[19] Antonia Chayes asserted that the effects of the attack on Estonia did not appear to be proportional to their cause, which indicates how easily petty disputes can lead to serious consequences in the cyber age.[20]\nIn 2008, Georgia became the target of similar attacks, though in this case they were carried out alongside conventional military actions. These cyber attacks mainly hindered the Georgian government's ability to communicate with both its citizens and other nations prior to and during the physical invasion by Russia, so as to weaken their ability to respond. Official Georgian websites, including those for the President's office, the Ministry of Foreign Affairs, and the Ministry of Defense were disabled. Even after the cease-fire between the nations was reached, major Georgian servers remained inoperable. The Russian-Georgian cyber conflict illustrates the havoc that can spread on the digital battlefield and re-energizes the debate over whether the laws of war could apply to this new kind of warfare.[21]\nThe cyber attack against Georgia reveals the potential for a much larger threat. Had the hackers aimed their attacks at another state in tension with Georgia, they could have instigated the opening of another front in\nVOL.44:I WINTER 2020\nTHE FLETCHER FORUM OF WORLD AFFAIRS\nRussia's war on Georgia. Such covert action would be perfidious, yet the law of armed conflict falls short of explicitly prohibiting such conduct.[22]\nBased on the analysis of the key characteristics of cyber attacks, the following issues should be outlined: (1) While traditional military weapons such as tanks and missiles tend to be monopolized by the state, cyberweapons can be created and used by anyone; (2) Cyberweapons are much more versatile than traditional military weapons—while traditional military weapons are used mainly to destroy, cyberweapons can be used for gathering information as well as destruction;[23] (3) The targeted states have difficulty in defining who a cyber attacker is—states can support or employ third-party hacker groups to weaken opponents; (4) The results of cyber attacks are unpredictable—cyberweapons can cause similar or greater damage than traditional kinetic weapons.\nGiven these issues, cyber attacks present a litmus test for a nation's commitment to international law. The problem of attribution in cyberspace means that cyber attackers have the capability to coerce a state without the subsequent responsibility or punishment under international law. Therefore, the cyber attacker may experience great temptation to violate principles and obligations of international law to achieve the attacker's ends. Some experts have advocated for less online anonymity and more government control over the cyberspace infrastructure to combat this, and other solutions exist that create fewer domestic liberty concerns.[24]\nCyber attacks provide a low-cost, remote, instantaneous, and powerful means of coercion or destruction, often without accountability. These attributes guarantee that state and non-state actors will continue to develop and unleash cyber attacks in the foreseeable future.[25]\nTherefore, challenges coming from cyber attacks create new space for states and other actors to rethink the ambiguities of international norms, which were historically adopted to define rules related to traditional military operations. Current international legal framework for the use of force and armed attack must be analyzed to clarify the legality of cyber operations in the digital era, as no direct international legal regulations currently exist for understanding the concept of cyber operations.\n## INTERNATIONAL LEGAL REGULATION OF THE USE OF FORCE\n## Definition of the Use of Force in the Digital Era\nIn order to maintain international peace and security, the internal legal system of states gradually moved away from monopolizing the use of\nVOL. 44: I WINTER 2020\nA SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\nforce and now permits it only in the exceptional cases defined under international law. Contemporary international law regarding the use of force is based on the UN Charter. The authors of the Charter wished to ban all uses of force, but also provided for some exceptions to this ban, which are regulated by the Charter.\nOne of the reasons that the UN was created was to modernize international law in the twentieth century. Leaders decided to “establish conditions under which justice and respect for the obligations arising from treaties and other sources of international law can be maintained, and to save succeeding generations from the scourge of war, which twice in our lifetime has brought untold sorrow to mankind.”²⁶ Therefore, modern legal regulation of force and conflict began with the UN Charter. Article 2 (4) mandates that “all Members shall refrain in their international relations from the threat or use of force against the territorial integrity or political independence of any state, or in any other manner inconsistent with the purposes of the United Nations.”²⁷\nDue to the establishment of new operational domains and the use of cyber technological advances for weakening states’ critical infrastructure, the following questions should be asked: “Does Article 2 (4) of the UN Charter apply in cyberspace?” and “Do cyber attacks violate the general prohibition on the use of force?” Answering these questions will require a legal interpretation of Article 2 (4) of the UN Charter.\nWhile Article 2 (4) of the UN Charter mentions the threat or use of force, it does not mention war. The term “war” refers to a narrow and technical legal situation, which begins with a declaration of war and ends with a peace treaty. War was generally prohibited before the Second World War, but states found a way to avoid such prohibition. For example, Japan refused to declare war on China and instead called its military operations in Manchuria (1932-1941) “an incident” to avoid violating the prohibition of waging war. In light of such experiences, the term “use of force” was preferred because it covers all forms of hostilities, both technical wars and incidents falling short of an officially declared war, which range from minor border clashes to extensive military operations. Therefore, the prohibition of the use of force is not dependent on how the involved states prefer to define their military conflict.²⁸\nLegal precedent upholds that the term “use of force” should be broadly defined. In its argument on a case concerning Nicaragua, the International Court of Justice (ICJ) rejected a narrow interpretation of “use of force” that limits the term to the employment of either kinetic force or non-kinetic operations generating comparable effects. The Court held that\nVOL. 44: I WINTER 2020\nTHE FLETCHER FORUM OF WORLD AFFAIRS\na state's arming and training of guerrilla forces that would then be engaged in hostilities against another state qualified as a use of force, a position that has since become widely accepted. This logic leads to the conclusion that non-destructive cyber operations could be considered a use of force. For example, providing malware to a rebel group and training its members to employ that malware in a destructive manner would seemingly qualify.²⁹\nHowever, every unfriendly act does not cross the use of force threshold. In the case of Nicaragua, the Court held that financing guerrillas, while an unlawful \"intervention,\" did not rise to that level. Additionally, the drafters of the UN Charter rejected a proposal to further define economic coercion as a use of force. In this regard, the Group of International Experts, who authored the Tallinn Manual on the international law applicable to cyber warfare, unanimously agreed that any cyber operation causing greater than *de minimis* damage or injury suffices.³⁰\nOver time, both the reaction of states to cyber operations as well as how they characterize their own cyber operations will inform the process of interpretive maturation. The use of force threshold, wherever it may presently lie, will almost certainly drop in lock step with the increasing dependency of states on cyberspace. Although it is difficult to predict whether any bright-line test will materialize, or whether states will simply characterize \"use of force\" more liberally, a number of options for clarifying the threshold exist.³¹ In assessing whether an event constitutes a use of force in or through cyberspace, it is important to evaluate several factors: the context of the event, the actor perpetrating the action (recognizing challenging issues of attribution in cyberspace), the target and location, and the effects and intent. Commonly cited examples of cyber activity that could constitute a use of force include: (1) Operations that trigger a nuclear plant meltdown; (2) Operations that open a dam above a populated area, causing destruction; or (3) Operations that disable air traffic control, resulting in airplane crashes. These seem to be based on the logic that if the physical consequences of a cyber attack inflict comparable physical damage to dropping a bomb or firing a missile, that cyber attack should be considered a use of force.³²\nIt should be noted that an exact definition of the use of force is not given in the UN Charter. This means that if a cyber operation rises to the level of an act of violence, it represents a violation of the general prohibition of the use of force. However, exceptional circumstances to the general prohibition of the use of force are defined through the UN Charter. Thus, the legality of the use of force, including the use of cyberweapon, depends on the legal grounds which permit the use of force as an exceptional\nVOL. 44: I WINTER 2020\nmeasure. These grounds will be clarified in accordance with the current international legal framework in the next sub-section.\nLegal Basis of the Use of Force in Accordance with the United Nations Charter\nDespite the fact that the UN Charter was adopted in 1945 when the idea of cyberspace was still far in the future, cyberspace actors should still understand how international law can govern cyber attacks and cyber warfare.\nIn 2013, the Group of Governmental Experts of the United Nations published its third report on confidence building measures which, inter alia, promoted the further study of norms and the pursuit of consensus, and implied that the UN Charter applies to digital space.33 Moreover, in the Tallinn Manual 1.0 and Tallinn Manual 2.0, the International Experts analyze how existing international law applies to cyber warfare and cyber operations.\nTherefore, if a cyber attack reaches a threshold that threatens security and peace, the UN Security Council has the authority to make an appropriate decision. Particularly, the first exception to the general prohibition of the use of force falls under Article 39 of the UN Charter. Article 39 empowers the Security Council to “determine the existence of any threat to the peace, breach of the peace, or act of aggression, and to make recommendations, or decide what measures shall be taken to maintain or restore international peace and security.”34\nIn light of the above, if the UN Security Council considers the aforementioned measures inadequate for maintaining or restoring international peace and security, it may take actions defined by Article 42 of the UN Charter. Particularly, Article 42 indicates that enforcement measures may be taken by air, sea, or land forces of members of the United Nations.35 Simultaneously, the International Group of Experts agreed that any action undertaken based on this rule may be implemented by, or against, cyber capabilities.36\nThe UN Security Council resolutions are legally binding on the members of the United Nations, and they are obliged to follow these resolutions. According to Article 48 of the UN Charter, the action required to carry out the decisions of the Security Council for the maintenance of international peace and security shall be taken by all the Members of the United Nations or by some of them, as the Security Council may determine. Such decisions shall be carried out by the Members of the United Nations directly and through their action in the appropriate international agencies of which they are members.37\nTHE FLETCHER FORUM OF WORLD AFFAIRS\nIt should be noted that the UN Security Council faces obstacles in making decisions for maintaining or restoring international peace. It is a political body, and its decisions are based on political views rather than purely legal ones. No important decision can be made if one of the permanent members (the Russian Federation, the United Kingdom, France, China, and the United States of America) of the Security Council disagrees with it. Particularly, a veto power of the permanent member can hamper or block the process and make the Security Council incapable of acting on maintaining peace and security. This is a historical weakness of the collective security system.\nThe second exception to the general prohibition of the use of force is defined by Article 51 of the UN Charter, which states: \"Nothing in the present Charter shall impair the inherent right of individual or collective self-defense if an armed attack occurs against a Member of the United Nations, until the Security Council has taken measures necessary to maintain international peace and security.\"³⁸\nTaking into consideration the above, the use of cyber force is illegal and contradicts international law if there are no appropriate legal grounds for the use of force defined by the existing international legal framework or these actions are not sanctioned by the UN Security Council in accordance with Chapter 7 of the UN Charter.\n## REINTERPRETATION OF AN ARMED ATTACK\nThis chapter clarifies factors that can be used to define the effects of cyber attacks. Particularly, it aims to explore the level at which a cyber attack reaches that of an armed attack, and under which circumstances states can have the right to use individual or collective defense against a cyber attack as an armed attack.\nThe legal grounds for the right of individual and collective defense is an armed attack. This raises the need to precisely define the term \"armed attack.\" In its conclusion concerning the case of Nicaragua, the ICJ stated: \"an armed attack must be understood as including not merely action by regular armed forces across an international border, but also the sending by or on behalf of a State of armed bands, groups, irregulars or mercenaries, which carry out acts of armed force against another State of such gravity as to amount to (inter alia) an actual armed attack conducted by regular forces, or its substantial involvement therein.\" This description, contained in Article 3, paragraph (g), of the Definition of Aggression annexed to General Assembly Resolution 3314 (XXIX), may be taken to reflect\nVOL. 44: I WINTER 2020\nA SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\ncustomary international law. The Court sees no reason to deny that, in customary law, the prohibition of armed attacks may apply to the sending by a State of armed bands to the territory of another State, if such an operation, because of its scale and effects, would have been classified as an armed attack rather than as a mere frontier incident had it been carried out by regular armed forces.³⁹\nTo determine if a cyber attack has risen to the level of an armed attack, three competing views have emerged: (1) the instrument-based approach, (2) the target-based approach, and (3) the effects-based approach. The instrument-based approach focuses on the tools used in an attack, arguing that, to be an armed attack, the initiator must use traditional military weapons. The target-based approach focuses on what the attack is aimed at, thus meriting self-defense when the target is “a sufficiently important computer system.” The effects-based approach focuses on the overall impact of the attack, thus meriting self-defense when the attack is of sufficient gravity.⁴⁰\nThe self-defense component of Article 51 of the UN Charter was drafted consistent with the instrument-based approach. Michael Schmitt argues that the choice to use an instrument-based approach is not sufficient to address self-defense claims against cyber attacks. Because armed attacks inherently include kinetic military force and cyber attacks often utilize non-kinetic approaches, the instrument-based approach fails to encapsulate cyber attacks that do not look like armed attacks but have the same ultimate effect. Instead, he argues for an effects-based approach which would better address cyber attacks because it allows broader latitude for a state to respond in self-defense, though it is not a current norm in international law.⁴¹\nMichael Schmitt argues that a cyber attack’s effects should be measured against six factors: (1) severity: the type and scale of the harm; (2) immediacy: how quickly the harm materializes after the attack; (3) directness: the length of the causal chain between the attack and the harm; (4) invasiveness: the degree to which the attack penetrates the victim state’s territory; (5) measurability: the degree to which the harm can be quantified; and (6) presumptive legitimacy: the weight given to the fact that, in the field of cyber activities as a whole, cyber attacks constituting an armed attack are the exception rather than the rule.⁴²\nIn this regard, according to the Tallinn Manual 1.0, no international cyber incidents have been unambiguously and publicly characterized by the international community as reaching the threshold of an armed attack. Not even the 2007 cyber operations against Estonia, which were colloquially referred to as “cyber war,” were publicly described as such. The International Group of Experts agreed with this assessment on the basis\nVOL. 44: I WINTER 2020\nTHE FLETCHER FORUM OF WORLD AFFAIRS\nthat the scale and effects threshold of these cyber operations was not sufficiently met to deem it an armed attack.⁴³\nBased on the analysis of notions of the \"use of force\" and \"armed attack,\" it is important to note that all armed attacks are uses of force, and therefore all cyber operations that reach the threshold of armed attack will be considered uses of force. This distinction is important given the fact that an action that amounts to a use of force is a violation of Article 2(4) of the UN Charter, while an action reaching the threshold of armed attack could trigger an armed response from the victim state under Article 51 of the UN Charter.⁴⁴\nPrevious discussion has centered around state actors, but due to the nature of this new kind of war, the following question should be raised: \"Could an armed attack carried out by a non-state actor from abroad serve as legal grounds for the right of defense?\" The attacks of September 11, 2001 triggered discussions to determine whether the \"armed attack\" referred to in Article 51 of the UN Charter could include terrorist attacks, as the text itself does not clarify that an armed attack should be executed by a state.\nNevertheless, the ICJ has ruled that self-defense is limited to instances of states being attacked by other states. The Court circumscribed the applicability of the international legal order to certain actors, leaving others unregulated despite their actual participation in activities that affect world order. The majority of scholars accept that a strict insistence on state imputability is no longer tenable. The Court's restrictive approach is increasingly out of touch with the reality of non-state actors seen today.⁴⁵\nThe reaction of the international community to 9/11 illustrated that the concept of an armed attack is not limited to just state actors. In the aftermath of the terrorist attacks carried out against the United States, the UN Security Council recognized the American right to self-defense, and immediately codified it in appropriate resolutions.⁴⁶ This meant that such acts serve as grounds for enacting Article 51 of the UN Charter. NATO also weighed in and agreed that the terrorist attacks were directed from abroad against the United States and therefore were covered by Article 5 of the North Atlantic Treaty. This marked the only time in history that NATO made the decision to use the mechanism of collective defense.\nIn the context of cyber attacks, Professor Michael Schmitt posits that future cyber operations will challenge the ICJ's narrow interpretation of acceptable actors of armed attacks. He purports that non-state actors will soon turn to cyber operations to attack states, because cyberspace is a fertile environment for non-state actors who wish to do so, and because it is much easier for non-state actors to acquire the tools, such as destructive\nVOL. 44: I WINTER 2020\nA SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\nmalware, that could impact vulnerable cyber systems than it is to acquire the kinetic means to conduct a traditional attack.⁴⁷\nGiven rapid technological advances, cyberweapons are now available to both state and non-state actors. States can indirectly carry out cyber attacks against other states through the use of hackers. In such cases, it is necessary to take into consideration the following aspects: (1) Cyber attacks can be conducted by a non-state actor under the support of a state; (2) Cyber attacks can be directed from the sponsor country against the other state; (3) Cyber attacks can reach the sufficient gravity of armed attack. Therefore, if a cyber attack carried out by a non-state actor meets these requirements, it could serve as a basis for individual or collective defense.\n# CONCLUSION\nTechnological advances have significantly changed not only the nature of battles, but the interpretation of the concept of armed attack itself. Current international legal regulations, including the UN Charter, apply to cyber attacks for the following reasons: (1) cyber attacks can reach a threshold that threatens a state's national security; and (2) the impact of cyber attacks can be as harmful to states as conventional attacks.\nIn view of the above, it is important to clarify key parameters of cyber attacks and cyber warfare, based on the reinterpretation of Article 51 of the UN Charter. First, an armed attack represents legal grounds for the use of an individual or collective defense mechanism. Second, because of the destructive nature of cyber attacks, interpretation of Article 51 of the UN Charter has been expanded to include cyber attacks as armed attacks. The International Group of Experts agreed that \"scale and effects\" are qualitative and quantitative factors that would apply when determining if a cyber operation qualifies as the gravest form of use of force (armed attack).⁴⁸ According to Tallinn Manual 1.0., cyber attacks rise to the level of an armed attack if they cause injury or death to persons or damage or destruction to objects.⁴⁹ Third, due to the reinterpretation of armed attacks, the notion of cyber attack should not be limited by the state actor as the sole possible perpetrator. The legal language of Article 51 of the UN Charter does not impose limitations on the execution of an armed attack by a state or a non-state actor. Given technological advances, it is highly possible that terrorist organizations will be able to create offensive cyber tools.\nBased on customary international norms, in cases of exercising the right of defense, states would consider the following elements: (1) Scope: is the incident widespread across a geographic area or industrial sectors? The\nVOL. 44: I WINTER 2020\nTHE FLETCHER FORUM OF WORLD AFFAIRS\nwider the attack, the more likely a state action will be; (2) Duration: is the incident a single event or does it last over time as part of a longer campaign? A state is more likely to act for extended incidents; (3) Intensity/Scale: has the incident caused death or substantial property destruction? If not, a state is unlikely to declare individual or collective defense; (4) External Actor: is the incident directed from a foreign or domestic adversary? A state is unlikely to act against a purely domestic foe.⁵⁰ States will have to consider these criteria if they use the right of defense against cyber attacks.\nIn light of the foregoing considerations, regardless of the lack of exact international legal regulation of cyber attacks and cyber warfare, reinterpretation of current international norms will reduce ambiguity and allow states to better mitigate cyber risks in the future. f",
  "references": [
    "# ENDNOTES\n1. Donald J. Trump, *The National Security Strategy of the United States of America*, (Washington D.C., 2017).\n2. Joel P. Trachtman, *The Future of International Law: Global Government* (Cambridge University Press, 2013), 85.\n3. Andreas Zimmermann, “International Law and Cyber Space”, *ESIL Reflections* 3 (1) (2014): 2.\n4. Bret Michael and Thomas Wingfield, “International Legal Reform Could Make States Liable for Cyber Abuse,” *per Concordiam* 2 (2) (2011), <https: 10=\"\" 2018=\"\" ccdcoe.org=\"\" pc_v2n2_en.pdf=\"\" uploads=\"\"> (Accessed October 7, 2019).\n5. U.S. Government Accountability Office, *Cyber Security – Threats Impacting the Nation*, GAO-12-666T, (Washington D.C., 2012), 3.\n6. Arie J. Schaap, “Cyber Warfare Operations: Development and Use Under International Law,” *Air Force Law Review* 64 (2009): 126.\n7. Lesley Swanson, “The Era of Cyber Warfare: Applying International Humanitarian Law to the 2008 Russian-Georgian Cyber Conflict,” 32 *Loyola of Los Angeles International and Comparative Law Review* (2010): 307.\n8. James E. Cartwright, *Joint Terminology for Cyberspace Operations*, 2011, 5.\n9. Oona Hathaway, et al. “The Law of Cyber Attack,” *California Law Review* 100 (2012): 824.\n10. Michael N. Schmitt, ed., *Tallinn Manual 1.0 on the International Law Applicable to Cyber Warfare* (Cambridge University Press, 2013), 106.\n11. Congressional Research Service, *Cyber Warfare*, by Stephen Hildreth, RL30735 (2001), 2.\n12. Antonia Chayes, “Rethinking Warfare: The Ambiguity of Cyber Attacks,” *Harvard National Security Journal* 6 (2015): 480.\n13. Kenneth K. Geers, “Heading off Hackers,” *per Concordiam* 2 (2) (2011), <https: 10=\"\" 2018=\"\" ccdcoe.org=\"\" pc_v2n2_en.pdf=\"\" uploads=\"\"> (Accessed October 7, 2019).\n14. Viacheslav Dziundziuk, “Stopping Cyber Terror,” *per Concordiam* 2(2) 2011, <https: 10=\"\" 2018=\"\" ccdcoe.org=\"\" pc_v2n2_en.pdf=\"\" uploads=\"\"> (Accessed October 7, 2019).\n15. U.S. Government Accountability Office, *Cyber Analysis and Warning*, GAO-08-588, (Washington D.C., 2008), 8-9.\n16. Hathaway, 837.\nVOL.44:1 WINTER 2020</https:></https:></https:>\nA SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\n17 Jason Healey, et al., \"NATO's Cyber Capabilities: Yesterday, Today, and Tomorrow,\" *Atlantic Council* (2014): 2.\n18 Swanson, 309-310.\n19 Vytautas Butrimas, \"An Unsettling Trend,\" *per Concordiam* 2 (2) (2011), <https: 10=\"\" 2018=\"\" cdc0e.org=\"\" pc_v2n2_en.pdf=\"\" uploads=\"\" uploads?=\"\"> (Accessed October 7, 2019).\n20 Chayes, 476.\n21 Swanson, 304.\n22 Michael Gervais, \"Cyber Attacks and the Laws of War,\" *Berkeley Journal of International Law* 30 (2012), 575.\n23 Grant Hodgson, \"Cyber Attack Treaty Verification,\" *Journal of Law and Policy for the Information Society* 12 (2016), 240.\n24 Gervais, 579.\n25 Ibid., 578.\n26 United Nations, Charter of the United Nations <http: documents=\"\" charter=\"\" intro.shtml=\"\" wwwupdate.un.org=\"\"> (Accessed October 10, 2019).\n27 Matthew C. Waxman, \"Cyber Attacks as Force under UN Charter Article 2(4),\" *International Law Studies Series, US Naval War College* 87 (2011): 44.\n28 René Värk, “The Use of Force in the Modern World: Recent Developments and Legal Regulation of the Use of Force,” *Baltic Defense Review* 2 (2003): 29-30.\n29 Michael N. Schmitt, \"The Law of Cyber Warfare: Quo Vadis?,\" *Stanford Law &amp; Policy Review* 25 (2014): 279-280.\n30 Ibid., 280-281.\n31 Ibid.\n32 Chayes, 507.\n33 \"Back to Square One? Back to Square One? The Fifth UN GGE Fails to Submit a Conclusive Report at the UN General Assembly,\" *CCDOE*, <https: back-to-square-one-the-fifth-un-gge-fails-to-submit-a-conclusive-report-at-the-un-general-assembly=\"\" ccdcoe.org=\"\" incyder-articles=\"\"></https:> (Accessed October 1, 2019).\n34 Hathaway, 843-844.\n35 Charter of the United Nations.\n36 Schmitt, *Tallinn Manual*, 71.\n37 Charter of the United Nations.\n38 Ibid.\n39 Nicaragua v. the United States of America, *International Court of Justice (ICJ)*, 1986, 93.\n40 Stephen Moore, \"Cyber Attacks and the Beginnings of an International Cyber Treaty,\" 39 *The North Carolina Journal of International Law and Commercial Regulation*, 2013: 247.\n41 Ibid., 247-248.\n42 Hathaway, 847.\n43 Schmitt, *Tallinn Manual*, 57-58.\n44 Dan-Iulian Voitasec, \"Applying International Humanitarian Law to Cyber Attacks,\" *Lex ET Scientia International Journal* 22 (2015): 126.\n45 Gary D. Solis, \"Cyber Warfare,\" *Military Law Review* 219 (2014): 19-21.\n46 UN Security Council Resolution N1368, September 12, 2001; UN Security Council Resolution N1373, September 28, 2001.\n47 Schmitt, 287.\n48 Voitasec, 126.\n49 Schmitt, *Tallinn Manual*, 106.\n50 Healey et al., 7.\nVOL. 44:1 WINTER 2020</http:></https:>\n48 THE FLETCHER FORUM OF WORLD AFFAIRS\nVOL. 44: I WINTER 2020"
  ],
  "flat_text": "HEINONLINE -- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License -- The search text of this PDF is generated from uncorrected OCR text.\n\nKhatuna Burkadze ## ABSTRACT In the digital era, information and communication technologies have changed the concept of an armed attack. However, there are many uncertainties regarding the applicability of existing international law to cyberspace. Existing international legal regulations do not address cyber warfare and cyber operations, as the UN Charter was adopted in 1945 when the creation of cyberspace was far in the future rather than a current consideration. Because of the gap between law and policy, the following questions should be pondered: (1) Can a cyber attack be considered as an armed attack—the gravest form of use of force under the international law? (2) If yes, how could the UN Charter be reinterpreted to clarify under which circumstances the inherent right of self-defense could be invoked against cyber attacks?\nKhatuna Burkadze is a graduate of The Fletcher School of Law and Diplomacy, Tufts University. Dr. Burkadze has been a Fulbright scholar at the MIT Center for International Studies as well as a visiting professor at Columbia University, Bard College, and The Fletcher School of Law and Diplomacy. She has successfully completed programs on negotiations and security studies at Harvard University and George C. Marshall European Center for Security Studies. Dr. Burkadze is an alumna of the U.S. Department of State's Program on American Foreign Policy as well as the author of dozens of articles and book chapters. Currently, she delivers lectures at the Caucasus International University and is employed by the Office of the Prime Minister of Georgia.\nVOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS # INTRODUCTION Cyberspace now represents a new and important operational domain for warfare, which is a challenge for both national and international security. Cyberspace is of particular concern, as according to the 2017 National Security Strategy of the United States of America, it offers state and non-state actors the ability to wage campaigns against the political, economic, and security interests of opponents without ever physically crossing borders. Cyber attacks offer adversaries low-cost and deniable opportunities to damage or disrupt critical infrastructure, economies, networks, and to disable the devices that people use each day to communicate and conduct business.¹ Joel Trachtman posits that the rise of cyberspace presents challenges to international law and global governance. First, information is much more mobile than it was prior to the rise of cyberspace, crossing national boundaries without interruption. Second, the rise of cyberspace enables a novel type of terrorism and warfare. These phenomena challenge the ability of the state to provide the services that it has traditionally provided. Often, this will make it more valuable for states to cooperate with one another and to use international law to do so.² The unwillingness of states, as well as non-state actors, to have their behavior in cyberspace regulated by specific, treaty-based rules reinforces this reality; these actors instead tend to take advantage of a lack of effective international regulation of their activities.³ States and international organizations must recognize that cyberspace has become a parallel universe in which the criminal, terrorist, or unlawful combatant can operate with a high degree of impunity. Adding to this challenge, privacy services, provided in the form of user anonymity and data encryption, make it difficult for law enforcement, intelligence organizations, and militaries to attribute actions in cyberspace (whether lawful or not) to specific individuals or state actors.⁴ Cyber-based challenges are evolving and arise from a wide array of unintentional and intentional sources. Unintentional threats can be caused by software upgrades or defective equipment that inadvertently disrupts systems. Intentional threats include both targeted and untargeted attacks from a variety of sources, including hackers, disgruntled employees, and foreign nations engaged in espionage and information warfare. These threat sources vary in terms of the capabilities of the actors, their willingness to act, and their motives, which can include monetary gain or political advantage.⁵ VOL. 44: I WINTER 2020 In view of the current realities, it is necessary to explore basic characteristics of cyber attacks and understand this notion of a new kind of warfare. Due to the sophisticated nature of cyber attacks and the rapid technological changes seen today, state actors need to find responsive and responsible international legal solutions for ensuring their security.\n## Cyber Attacks and Cyber Warfare as a New Form of an Armed Attack ### Definition of Cyber Attacks and Cyber Warfare There is no widely accepted definition of cyber attack or cyber warfare. For example, the U.S. Department of Defense uses the phrase “computer network attacks,” and defines it as “actions taken by using computer networks to disrupt, deny, degrade, or destroy information resident in computers and computer networks, or the computers and networks themselves.”6 Instead of “computer network attack,” the U.S. Army's Cyber Operations and Cyber Terrorism Handbook uses the term “cyber attack,” defining it as the “premeditated use of disruptive activities, or the threat thereof, against computers and/or networks, with the intention to cause harm or to further social, ideological, religious, political or similar objectives to intimidate any person in furtherance of such objectives.” Such harm could be inflicted on the computer network, as well as to physical facilities and persons. Cyber attacks involve “an aggressive act on the part of one adversary—whether an individual, a competing organization, or a rival government—against another in an ongoing struggle for hegemony in the marketplace or the political arena.” These differ from cyber crimes, which are governed by national criminal statutes and include acts such as identity theft and internet fraud.7 After establishing the Cyber Command of the United States, the Joint Chiefs of Staff published a lexicon in 2011 for military use in cyber operations. According to the document, a “cyber attack” is a hostile act using computer or related networks or systems and intended to disrupt and/or destroy an adversary's critical cyber systems, assets, or functions. A cyber attack may use intermediate delivery vehicles such as peripheral devices, electronic transmitters, embedded code, or human operators. The activation or effect of a cyber attack may be widely separated temporally and geographically from the delivery.8 A key feature of this definition is that it limits “cyber attacks” to hostile acts that are intended to harm critical THE FLETCHER FORUM OF WORLD AFFAIRS cyber systems—thus restricting the definition based on the objective of the attack.⁹ The Tallinn Manual provides interpretation of the existing international legal framework with regard to cyber issues. As stated in the Tallinn Manual, “a cyber attack is a cyber operation, whether offensive or defensive, that is reasonably expected to cause injury or death to persons or damage or destruction to objects.”¹⁰ Thus, cyber warfare and cyber attacks can be used to describe defending and attacking information and computer network activities in cyberspace. However, cyber attacks are not easy for states to combat because the process of determining the origin and nature of the attack and assessing the damage incurred is difficult.¹¹ Antonia Chayes asserted that factual uncertainty about the origins and nature of a cyber attack almost guarantees legal uncertainty under both international and domestic law.¹² In addition to these clarifications, the ultimate goal of warfare—victory—will not change in the future. The tactics of achieving this victory, however, are radically different in cyberspace. If there is a war between major world powers, the first victim of the conflict could be the Internet itself. There will be two broad categories of cyber attacks during a major war: one on military forces, in which the attacks would be conducted as part of a broader effort to disable the adversary’s weaponry and to disrupt military command-and-control systems; and the other on civilian infrastructure, in which the targets may include an adversary’s financial sector, industry, and national morale in order to diminish the adversary’s ability and will to wage war for extended periods.¹³ In addition to traditional war, cyber attacks are becoming a means to achieve political ends. A typical example is Internet stoppage in which perpetrators simultaneously log onto a site, connect to a server, send an e-mail, or make postings to forums in order to limit or even deny access to the site by other users. The Internet site or server is overwhelmed by access requests, causing an interruption or complete stoppage.¹⁴ In view of the above, it is important to note that communication technologies, used for offensive or defensive cyber attacks, are equally accessible to state and non-state actors in cyberspace. A computer can be both a target of attack or an instrument for carrying out a new form of war.\n## Key Characteristics of Cyber Attacks The growing number of known vulnerabilities increases the potential number of attacks. By exploiting software vulnerabilities, hackers who VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE spread malicious code can cause significant damage, ranging from defacing web sites to taking control of entire systems and thereby being able to read, modify, or delete sensitive information; disrupt operations; launch attacks against other organizations' systems; or altogether destroy them.[15] Distributed Denial of Service (DDoS) attacks have been the most prevalent form of cyber attack in recent years. In these attacks, coordinated botnets—collections of thousands of “zombie” computers hijacked by insidious viruses—overwhelm servers by systematically visiting designated websites.[16] In 2007, Estonia became a target of a DDoS attack. The relocation of a Soviet-era war memorial unleashed a series of large and sustained DDoS attacks flooding networks or websites with attack traffic, rendering them inaccessible.[17] These attacks caused more than just confusion for the nation's population. At the time of these attacks, Estonia had essentially instituted an\"e-government\"where many aspects of the government were carried out online. In addition to bringing down many of Estonia's critical government and commercial websites, the cyber attacks also caused the emergency phone number used for calling ambulance and fire services to be unavailable for more than one hour. As a result, widespread social unrest and rioting left 150 people injured.[18] Additionally, botnet managers had used malware to infect unsuspecting computers.[19] Antonia Chayes asserted that the effects of the attack on Estonia did not appear to be proportional to their cause, which indicates how easily petty disputes can lead to serious consequences in the cyber age.[20] In 2008, Georgia became the target of similar attacks, though in this case they were carried out alongside conventional military actions. These cyber attacks mainly hindered the Georgian government's ability to communicate with both its citizens and other nations prior to and during the physical invasion by Russia, so as to weaken their ability to respond. Official Georgian websites, including those for the President's office, the Ministry of Foreign Affairs, and the Ministry of Defense were disabled. Even after the cease-fire between the nations was reached, major Georgian servers remained inoperable. The Russian-Georgian cyber conflict illustrates the havoc that can spread on the digital battlefield and re-energizes the debate over whether the laws of war could apply to this new kind of warfare.[21] The cyber attack against Georgia reveals the potential for a much larger threat. Had the hackers aimed their attacks at another state in tension with Georgia, they could have instigated the opening of another front in VOL.44:I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS Russia's war on Georgia. Such covert action would be perfidious, yet the law of armed conflict falls short of explicitly prohibiting such conduct.[22] Based on the analysis of the key characteristics of cyber attacks, the following issues should be outlined: (1) While traditional military weapons such as tanks and missiles tend to be monopolized by the state, cyberweapons can be created and used by anyone; (2) Cyberweapons are much more versatile than traditional military weapons—while traditional military weapons are used mainly to destroy, cyberweapons can be used for gathering information as well as destruction;[23] (3) The targeted states have difficulty in defining who a cyber attacker is—states can support or employ third-party hacker groups to weaken opponents; (4) The results of cyber attacks are unpredictable—cyberweapons can cause similar or greater damage than traditional kinetic weapons.\nGiven these issues, cyber attacks present a litmus test for a nation's commitment to international law. The problem of attribution in cyberspace means that cyber attackers have the capability to coerce a state without the subsequent responsibility or punishment under international law. Therefore, the cyber attacker may experience great temptation to violate principles and obligations of international law to achieve the attacker's ends. Some experts have advocated for less online anonymity and more government control over the cyberspace infrastructure to combat this, and other solutions exist that create fewer domestic liberty concerns.[24] Cyber attacks provide a low-cost, remote, instantaneous, and powerful means of coercion or destruction, often without accountability. These attributes guarantee that state and non-state actors will continue to develop and unleash cyber attacks in the foreseeable future.[25] Therefore, challenges coming from cyber attacks create new space for states and other actors to rethink the ambiguities of international norms, which were historically adopted to define rules related to traditional military operations. Current international legal framework for the use of force and armed attack must be analyzed to clarify the legality of cyber operations in the digital era, as no direct international legal regulations currently exist for understanding the concept of cyber operations.\n## INTERNATIONAL LEGAL REGULATION OF THE USE OF FORCE ## Definition of the Use of Force in the Digital Era In order to maintain international peace and security, the internal legal system of states gradually moved away from monopolizing the use of VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE force and now permits it only in the exceptional cases defined under international law. Contemporary international law regarding the use of force is based on the UN Charter. The authors of the Charter wished to ban all uses of force, but also provided for some exceptions to this ban, which are regulated by the Charter.\nOne of the reasons that the UN was created was to modernize international law in the twentieth century. Leaders decided to “establish conditions under which justice and respect for the obligations arising from treaties and other sources of international law can be maintained, and to save succeeding generations from the scourge of war, which twice in our lifetime has brought untold sorrow to mankind.”²⁶ Therefore, modern legal regulation of force and conflict began with the UN Charter. Article 2 (4) mandates that “all Members shall refrain in their international relations from the threat or use of force against the territorial integrity or political independence of any state, or in any other manner inconsistent with the purposes of the United Nations.”²⁷ Due to the establishment of new operational domains and the use of cyber technological advances for weakening states’ critical infrastructure, the following questions should be asked: “Does Article 2 (4) of the UN Charter apply in cyberspace?” and “Do cyber attacks violate the general prohibition on the use of force?” Answering these questions will require a legal interpretation of Article 2 (4) of the UN Charter.\nWhile Article 2 (4) of the UN Charter mentions the threat or use of force, it does not mention war. The term “war” refers to a narrow and technical legal situation, which begins with a declaration of war and ends with a peace treaty. War was generally prohibited before the Second World War, but states found a way to avoid such prohibition. For example, Japan refused to declare war on China and instead called its military operations in Manchuria (1932-1941) “an incident” to avoid violating the prohibition of waging war. In light of such experiences, the term “use of force” was preferred because it covers all forms of hostilities, both technical wars and incidents falling short of an officially declared war, which range from minor border clashes to extensive military operations. Therefore, the prohibition of the use of force is not dependent on how the involved states prefer to define their military conflict.²⁸ Legal precedent upholds that the term “use of force” should be broadly defined. In its argument on a case concerning Nicaragua, the International Court of Justice (ICJ) rejected a narrow interpretation of “use of force” that limits the term to the employment of either kinetic force or non-kinetic operations generating comparable effects. The Court held that VOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS a state's arming and training of guerrilla forces that would then be engaged in hostilities against another state qualified as a use of force, a position that has since become widely accepted. This logic leads to the conclusion that non-destructive cyber operations could be considered a use of force. For example, providing malware to a rebel group and training its members to employ that malware in a destructive manner would seemingly qualify.²⁹ However, every unfriendly act does not cross the use of force threshold. In the case of Nicaragua, the Court held that financing guerrillas, while an unlawful\"intervention,\"did not rise to that level. Additionally, the drafters of the UN Charter rejected a proposal to further define economic coercion as a use of force. In this regard, the Group of International Experts, who authored the Tallinn Manual on the international law applicable to cyber warfare, unanimously agreed that any cyber operation causing greater than *de minimis* damage or injury suffices.³⁰ Over time, both the reaction of states to cyber operations as well as how they characterize their own cyber operations will inform the process of interpretive maturation. The use of force threshold, wherever it may presently lie, will almost certainly drop in lock step with the increasing dependency of states on cyberspace. Although it is difficult to predict whether any bright-line test will materialize, or whether states will simply characterize\"use of force\"more liberally, a number of options for clarifying the threshold exist.³¹ In assessing whether an event constitutes a use of force in or through cyberspace, it is important to evaluate several factors: the context of the event, the actor perpetrating the action (recognizing challenging issues of attribution in cyberspace), the target and location, and the effects and intent. Commonly cited examples of cyber activity that could constitute a use of force include: (1) Operations that trigger a nuclear plant meltdown; (2) Operations that open a dam above a populated area, causing destruction; or (3) Operations that disable air traffic control, resulting in airplane crashes. These seem to be based on the logic that if the physical consequences of a cyber attack inflict comparable physical damage to dropping a bomb or firing a missile, that cyber attack should be considered a use of force.³² It should be noted that an exact definition of the use of force is not given in the UN Charter. This means that if a cyber operation rises to the level of an act of violence, it represents a violation of the general prohibition of the use of force. However, exceptional circumstances to the general prohibition of the use of force are defined through the UN Charter. Thus, the legality of the use of force, including the use of cyberweapon, depends on the legal grounds which permit the use of force as an exceptional VOL. 44: I WINTER 2020 measure. These grounds will be clarified in accordance with the current international legal framework in the next sub-section.\nLegal Basis of the Use of Force in Accordance with the United Nations Charter Despite the fact that the UN Charter was adopted in 1945 when the idea of cyberspace was still far in the future, cyberspace actors should still understand how international law can govern cyber attacks and cyber warfare.\nIn 2013, the Group of Governmental Experts of the United Nations published its third report on confidence building measures which, inter alia, promoted the further study of norms and the pursuit of consensus, and implied that the UN Charter applies to digital space.33 Moreover, in the Tallinn Manual 1.0 and Tallinn Manual 2.0, the International Experts analyze how existing international law applies to cyber warfare and cyber operations.\nTherefore, if a cyber attack reaches a threshold that threatens security and peace, the UN Security Council has the authority to make an appropriate decision. Particularly, the first exception to the general prohibition of the use of force falls under Article 39 of the UN Charter. Article 39 empowers the Security Council to “determine the existence of any threat to the peace, breach of the peace, or act of aggression, and to make recommendations, or decide what measures shall be taken to maintain or restore international peace and security.”34 In light of the above, if the UN Security Council considers the aforementioned measures inadequate for maintaining or restoring international peace and security, it may take actions defined by Article 42 of the UN Charter. Particularly, Article 42 indicates that enforcement measures may be taken by air, sea, or land forces of members of the United Nations.35 Simultaneously, the International Group of Experts agreed that any action undertaken based on this rule may be implemented by, or against, cyber capabilities.36 The UN Security Council resolutions are legally binding on the members of the United Nations, and they are obliged to follow these resolutions. According to Article 48 of the UN Charter, the action required to carry out the decisions of the Security Council for the maintenance of international peace and security shall be taken by all the Members of the United Nations or by some of them, as the Security Council may determine. Such decisions shall be carried out by the Members of the United Nations directly and through their action in the appropriate international agencies of which they are members.37 THE FLETCHER FORUM OF WORLD AFFAIRS It should be noted that the UN Security Council faces obstacles in making decisions for maintaining or restoring international peace. It is a political body, and its decisions are based on political views rather than purely legal ones. No important decision can be made if one of the permanent members (the Russian Federation, the United Kingdom, France, China, and the United States of America) of the Security Council disagrees with it. Particularly, a veto power of the permanent member can hamper or block the process and make the Security Council incapable of acting on maintaining peace and security. This is a historical weakness of the collective security system.\nThe second exception to the general prohibition of the use of force is defined by Article 51 of the UN Charter, which states:\"Nothing in the present Charter shall impair the inherent right of individual or collective self-defense if an armed attack occurs against a Member of the United Nations, until the Security Council has taken measures necessary to maintain international peace and security.\"³⁸ Taking into consideration the above, the use of cyber force is illegal and contradicts international law if there are no appropriate legal grounds for the use of force defined by the existing international legal framework or these actions are not sanctioned by the UN Security Council in accordance with Chapter 7 of the UN Charter.\n## REINTERPRETATION OF AN ARMED ATTACK This chapter clarifies factors that can be used to define the effects of cyber attacks. Particularly, it aims to explore the level at which a cyber attack reaches that of an armed attack, and under which circumstances states can have the right to use individual or collective defense against a cyber attack as an armed attack.\nThe legal grounds for the right of individual and collective defense is an armed attack. This raises the need to precisely define the term\"armed attack.\"In its conclusion concerning the case of Nicaragua, the ICJ stated:\"an armed attack must be understood as including not merely action by regular armed forces across an international border, but also the sending by or on behalf of a State of armed bands, groups, irregulars or mercenaries, which carry out acts of armed force against another State of such gravity as to amount to (inter alia) an actual armed attack conducted by regular forces, or its substantial involvement therein.\"This description, contained in Article 3, paragraph (g), of the Definition of Aggression annexed to General Assembly Resolution 3314 (XXIX), may be taken to reflect VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE customary international law. The Court sees no reason to deny that, in customary law, the prohibition of armed attacks may apply to the sending by a State of armed bands to the territory of another State, if such an operation, because of its scale and effects, would have been classified as an armed attack rather than as a mere frontier incident had it been carried out by regular armed forces.³⁹ To determine if a cyber attack has risen to the level of an armed attack, three competing views have emerged: (1) the instrument-based approach, (2) the target-based approach, and (3) the effects-based approach. The instrument-based approach focuses on the tools used in an attack, arguing that, to be an armed attack, the initiator must use traditional military weapons. The target-based approach focuses on what the attack is aimed at, thus meriting self-defense when the target is “a sufficiently important computer system.” The effects-based approach focuses on the overall impact of the attack, thus meriting self-defense when the attack is of sufficient gravity.⁴⁰ The self-defense component of Article 51 of the UN Charter was drafted consistent with the instrument-based approach. Michael Schmitt argues that the choice to use an instrument-based approach is not sufficient to address self-defense claims against cyber attacks. Because armed attacks inherently include kinetic military force and cyber attacks often utilize non-kinetic approaches, the instrument-based approach fails to encapsulate cyber attacks that do not look like armed attacks but have the same ultimate effect. Instead, he argues for an effects-based approach which would better address cyber attacks because it allows broader latitude for a state to respond in self-defense, though it is not a current norm in international law.⁴¹ Michael Schmitt argues that a cyber attack’s effects should be measured against six factors: (1) severity: the type and scale of the harm; (2) immediacy: how quickly the harm materializes after the attack; (3) directness: the length of the causal chain between the attack and the harm; (4) invasiveness: the degree to which the attack penetrates the victim state’s territory; (5) measurability: the degree to which the harm can be quantified; and (6) presumptive legitimacy: the weight given to the fact that, in the field of cyber activities as a whole, cyber attacks constituting an armed attack are the exception rather than the rule.⁴² In this regard, according to the Tallinn Manual 1.0, no international cyber incidents have been unambiguously and publicly characterized by the international community as reaching the threshold of an armed attack. Not even the 2007 cyber operations against Estonia, which were colloquially referred to as “cyber war,” were publicly described as such. The International Group of Experts agreed with this assessment on the basis VOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS that the scale and effects threshold of these cyber operations was not sufficiently met to deem it an armed attack.⁴³ Based on the analysis of notions of the\"use of force\"and\"armed attack,\"it is important to note that all armed attacks are uses of force, and therefore all cyber operations that reach the threshold of armed attack will be considered uses of force. This distinction is important given the fact that an action that amounts to a use of force is a violation of Article 2(4) of the UN Charter, while an action reaching the threshold of armed attack could trigger an armed response from the victim state under Article 51 of the UN Charter.⁴⁴ Previous discussion has centered around state actors, but due to the nature of this new kind of war, the following question should be raised:\"Could an armed attack carried out by a non-state actor from abroad serve as legal grounds for the right of defense?\"The attacks of September 11, 2001 triggered discussions to determine whether the\"armed attack\"referred to in Article 51 of the UN Charter could include terrorist attacks, as the text itself does not clarify that an armed attack should be executed by a state.\nNevertheless, the ICJ has ruled that self-defense is limited to instances of states being attacked by other states. The Court circumscribed the applicability of the international legal order to certain actors, leaving others unregulated despite their actual participation in activities that affect world order. The majority of scholars accept that a strict insistence on state imputability is no longer tenable. The Court's restrictive approach is increasingly out of touch with the reality of non-state actors seen today.⁴⁵ The reaction of the international community to 9/11 illustrated that the concept of an armed attack is not limited to just state actors. In the aftermath of the terrorist attacks carried out against the United States, the UN Security Council recognized the American right to self-defense, and immediately codified it in appropriate resolutions.⁴⁶ This meant that such acts serve as grounds for enacting Article 51 of the UN Charter. NATO also weighed in and agreed that the terrorist attacks were directed from abroad against the United States and therefore were covered by Article 5 of the North Atlantic Treaty. This marked the only time in history that NATO made the decision to use the mechanism of collective defense.\nIn the context of cyber attacks, Professor Michael Schmitt posits that future cyber operations will challenge the ICJ's narrow interpretation of acceptable actors of armed attacks. He purports that non-state actors will soon turn to cyber operations to attack states, because cyberspace is a fertile environment for non-state actors who wish to do so, and because it is much easier for non-state actors to acquire the tools, such as destructive VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE malware, that could impact vulnerable cyber systems than it is to acquire the kinetic means to conduct a traditional attack.⁴⁷ Given rapid technological advances, cyberweapons are now available to both state and non-state actors. States can indirectly carry out cyber attacks against other states through the use of hackers. In such cases, it is necessary to take into consideration the following aspects: (1) Cyber attacks can be conducted by a non-state actor under the support of a state; (2) Cyber attacks can be directed from the sponsor country against the other state; (3) Cyber attacks can reach the sufficient gravity of armed attack. Therefore, if a cyber attack carried out by a non-state actor meets these requirements, it could serve as a basis for individual or collective defense.\n# CONCLUSION Technological advances have significantly changed not only the nature of battles, but the interpretation of the concept of armed attack itself. Current international legal regulations, including the UN Charter, apply to cyber attacks for the following reasons: (1) cyber attacks can reach a threshold that threatens a state's national security; and (2) the impact of cyber attacks can be as harmful to states as conventional attacks.\nIn view of the above, it is important to clarify key parameters of cyber attacks and cyber warfare, based on the reinterpretation of Article 51 of the UN Charter. First, an armed attack represents legal grounds for the use of an individual or collective defense mechanism. Second, because of the destructive nature of cyber attacks, interpretation of Article 51 of the UN Charter has been expanded to include cyber attacks as armed attacks. The International Group of Experts agreed that\"scale and effects\"are qualitative and quantitative factors that would apply when determining if a cyber operation qualifies as the gravest form of use of force (armed attack).⁴⁸ According to Tallinn Manual 1.0., cyber attacks rise to the level of an armed attack if they cause injury or death to persons or damage or destruction to objects.⁴⁹ Third, due to the reinterpretation of armed attacks, the notion of cyber attack should not be limited by the state actor as the sole possible perpetrator. The legal language of Article 51 of the UN Charter does not impose limitations on the execution of an armed attack by a state or a non-state actor. Given technological advances, it is highly possible that terrorist organizations will be able to create offensive cyber tools.\nBased on customary international norms, in cases of exercising the right of defense, states would consider the following elements: (1) Scope: is the incident widespread across a geographic area or industrial sectors? The VOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS wider the attack, the more likely a state action will be; (2) Duration: is the incident a single event or does it last over time as part of a longer campaign? A state is more likely to act for extended incidents; (3) Intensity/Scale: has the incident caused death or substantial property destruction? If not, a state is unlikely to declare individual or collective defense; (4) External Actor: is the incident directed from a foreign or domestic adversary? A state is unlikely to act against a purely domestic foe.⁵⁰ States will have to consider these criteria if they use the right of defense against cyber attacks.\nIn light of the foregoing considerations, regardless of the lack of exact international legal regulation of cyber attacks and cyber warfare, reinterpretation of current international norms will reduce ambiguity and allow states to better mitigate cyber risks in the future. f",
  "citations": {
    "style": "hybrid",
    "flat_text": "HEINONLINE -- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License -- The search text of this PDF is generated from uncorrected OCR text.\n\nKhatuna Burkadze ## ABSTRACT In the digital era, information and communication technologies have changed the concept of an armed attack. However, there are many uncertainties regarding the applicability of existing international law to cyberspace. Existing international legal regulations do not address cyber warfare and cyber operations, as the UN Charter was adopted in 1945 when the creation of cyberspace was far in the future rather than a current consideration. Because of the gap between law and policy, the following questions should be pondered: (1) Can a cyber attack be considered as an armed attack—the gravest form of use of force under the international law? (2) If yes, how could the UN Charter be reinterpreted to clarify under which circumstances the inherent right of self-defense could be invoked against cyber attacks?\nKhatuna Burkadze is a graduate of The Fletcher School of Law and Diplomacy, Tufts University. Dr. Burkadze has been a Fulbright scholar at the MIT Center for International Studies as well as a visiting professor at Columbia University, Bard College, and The Fletcher School of Law and Diplomacy. She has successfully completed programs on negotiations and security studies at Harvard University and George C. Marshall European Center for Security Studies. Dr. Burkadze is an alumna of the U.S. Department of State's Program on American Foreign Policy as well as the author of dozens of articles and book chapters. Currently, she delivers lectures at the Caucasus International University and is employed by the Office of the Prime Minister of Georgia.\nVOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS # INTRODUCTION Cyberspace now represents a new and important operational domain for warfare, which is a challenge for both national and international security. Cyberspace is of particular concern, as according to the 2017 National Security Strategy of the United States of America, it offers state and non-state actors the ability to wage campaigns against the political, economic, and security interests of opponents without ever physically crossing borders. Cyber attacks offer adversaries low-cost and deniable opportunities to damage or disrupt critical infrastructure, economies, networks, and to disable the devices that people use each day to communicate and conduct business.¹ Joel Trachtman posits that the rise of cyberspace presents challenges to international law and global governance. First, information is much more mobile than it was prior to the rise of cyberspace, crossing national boundaries without interruption. Second, the rise of cyberspace enables a novel type of terrorism and warfare. These phenomena challenge the ability of the state to provide the services that it has traditionally provided. Often, this will make it more valuable for states to cooperate with one another and to use international law to do so.² The unwillingness of states, as well as non-state actors, to have their behavior in cyberspace regulated by specific, treaty-based rules reinforces this reality; these actors instead tend to take advantage of a lack of effective international regulation of their activities.³ States and international organizations must recognize that cyberspace has become a parallel universe in which the criminal, terrorist, or unlawful combatant can operate with a high degree of impunity. Adding to this challenge, privacy services, provided in the form of user anonymity and data encryption, make it difficult for law enforcement, intelligence organizations, and militaries to attribute actions in cyberspace (whether lawful or not) to specific individuals or state actors.⁴ Cyber-based challenges are evolving and arise from a wide array of unintentional and intentional sources. Unintentional threats can be caused by software upgrades or defective equipment that inadvertently disrupts systems. Intentional threats include both targeted and untargeted attacks from a variety of sources, including hackers, disgruntled employees, and foreign nations engaged in espionage and information warfare. These threat sources vary in terms of the capabilities of the actors, their willingness to act, and their motives, which can include monetary gain or political advantage.⁵ VOL. 44: I WINTER 2020 In view of the current realities, it is necessary to explore basic characteristics of cyber attacks and understand this notion of a new kind of warfare. Due to the sophisticated nature of cyber attacks and the rapid technological changes seen today, state actors need to find responsive and responsible international legal solutions for ensuring their security.\n## Cyber Attacks and Cyber Warfare as a New Form of an Armed Attack ### Definition of Cyber Attacks and Cyber Warfare There is no widely accepted definition of cyber attack or cyber warfare. For example, the U.S. Department of Defense uses the phrase “computer network attacks,” and defines it as “actions taken by using computer networks to disrupt, deny, degrade, or destroy information resident in computers and computer networks, or the computers and networks themselves.”6 Instead of “computer network attack,” the U.S. Army's Cyber Operations and Cyber Terrorism Handbook uses the term “cyber attack,” defining it as the “premeditated use of disruptive activities, or the threat thereof, against computers and/or networks, with the intention to cause harm or to further social, ideological, religious, political or similar objectives to intimidate any person in furtherance of such objectives.” Such harm could be inflicted on the computer network, as well as to physical facilities and persons. Cyber attacks involve “an aggressive act on the part of one adversary—whether an individual, a competing organization, or a rival government—against another in an ongoing struggle for hegemony in the marketplace or the political arena.” These differ from cyber crimes, which are governed by national criminal statutes and include acts such as identity theft and internet fraud.7 After establishing the Cyber Command of the United States, the Joint Chiefs of Staff published a lexicon in 2011 for military use in cyber operations. According to the document, a “cyber attack” is a hostile act using computer or related networks or systems and intended to disrupt and/or destroy an adversary's critical cyber systems, assets, or functions. A cyber attack may use intermediate delivery vehicles such as peripheral devices, electronic transmitters, embedded code, or human operators. The activation or effect of a cyber attack may be widely separated temporally and geographically from the delivery.8 A key feature of this definition is that it limits “cyber attacks” to hostile acts that are intended to harm critical THE FLETCHER FORUM OF WORLD AFFAIRS cyber systems—thus restricting the definition based on the objective of the attack.⁹ The Tallinn Manual provides interpretation of the existing international legal framework with regard to cyber issues. As stated in the Tallinn Manual, “a cyber attack is a cyber operation, whether offensive or defensive, that is reasonably expected to cause injury or death to persons or damage or destruction to objects.”¹⁰ Thus, cyber warfare and cyber attacks can be used to describe defending and attacking information and computer network activities in cyberspace. However, cyber attacks are not easy for states to combat because the process of determining the origin and nature of the attack and assessing the damage incurred is difficult.¹¹ Antonia Chayes asserted that factual uncertainty about the origins and nature of a cyber attack almost guarantees legal uncertainty under both international and domestic law.¹² In addition to these clarifications, the ultimate goal of warfare—victory—will not change in the future. The tactics of achieving this victory, however, are radically different in cyberspace. If there is a war between major world powers, the first victim of the conflict could be the Internet itself. There will be two broad categories of cyber attacks during a major war: one on military forces, in which the attacks would be conducted as part of a broader effort to disable the adversary’s weaponry and to disrupt military command-and-control systems; and the other on civilian infrastructure, in which the targets may include an adversary’s financial sector, industry, and national morale in order to diminish the adversary’s ability and will to wage war for extended periods.¹³ In addition to traditional war, cyber attacks are becoming a means to achieve political ends. A typical example is Internet stoppage in which perpetrators simultaneously log onto a site, connect to a server, send an e-mail, or make postings to forums in order to limit or even deny access to the site by other users. The Internet site or server is overwhelmed by access requests, causing an interruption or complete stoppage.¹⁴ In view of the above, it is important to note that communication technologies, used for offensive or defensive cyber attacks, are equally accessible to state and non-state actors in cyberspace. A computer can be both a target of attack or an instrument for carrying out a new form of war.\n## Key Characteristics of Cyber Attacks The growing number of known vulnerabilities increases the potential number of attacks. By exploiting software vulnerabilities, hackers who VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE spread malicious code can cause significant damage, ranging from defacing web sites to taking control of entire systems and thereby being able to read, modify, or delete sensitive information; disrupt operations; launch attacks against other organizations' systems; or altogether destroy them.[15] Distributed Denial of Service (DDoS) attacks have been the most prevalent form of cyber attack in recent years. In these attacks, coordinated botnets—collections of thousands of “zombie” computers hijacked by insidious viruses—overwhelm servers by systematically visiting designated websites.[16] In 2007, Estonia became a target of a DDoS attack. The relocation of a Soviet-era war memorial unleashed a series of large and sustained DDoS attacks flooding networks or websites with attack traffic, rendering them inaccessible.[17] These attacks caused more than just confusion for the nation's population. At the time of these attacks, Estonia had essentially instituted an\"e-government\"where many aspects of the government were carried out online. In addition to bringing down many of Estonia's critical government and commercial websites, the cyber attacks also caused the emergency phone number used for calling ambulance and fire services to be unavailable for more than one hour. As a result, widespread social unrest and rioting left 150 people injured.[18] Additionally, botnet managers had used malware to infect unsuspecting computers.[19] Antonia Chayes asserted that the effects of the attack on Estonia did not appear to be proportional to their cause, which indicates how easily petty disputes can lead to serious consequences in the cyber age.[20] In 2008, Georgia became the target of similar attacks, though in this case they were carried out alongside conventional military actions. These cyber attacks mainly hindered the Georgian government's ability to communicate with both its citizens and other nations prior to and during the physical invasion by Russia, so as to weaken their ability to respond. Official Georgian websites, including those for the President's office, the Ministry of Foreign Affairs, and the Ministry of Defense were disabled. Even after the cease-fire between the nations was reached, major Georgian servers remained inoperable. The Russian-Georgian cyber conflict illustrates the havoc that can spread on the digital battlefield and re-energizes the debate over whether the laws of war could apply to this new kind of warfare.[21] The cyber attack against Georgia reveals the potential for a much larger threat. Had the hackers aimed their attacks at another state in tension with Georgia, they could have instigated the opening of another front in VOL.44:I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS Russia's war on Georgia. Such covert action would be perfidious, yet the law of armed conflict falls short of explicitly prohibiting such conduct.[22] Based on the analysis of the key characteristics of cyber attacks, the following issues should be outlined: (1) While traditional military weapons such as tanks and missiles tend to be monopolized by the state, cyberweapons can be created and used by anyone; (2) Cyberweapons are much more versatile than traditional military weapons—while traditional military weapons are used mainly to destroy, cyberweapons can be used for gathering information as well as destruction;[23] (3) The targeted states have difficulty in defining who a cyber attacker is—states can support or employ third-party hacker groups to weaken opponents; (4) The results of cyber attacks are unpredictable—cyberweapons can cause similar or greater damage than traditional kinetic weapons.\nGiven these issues, cyber attacks present a litmus test for a nation's commitment to international law. The problem of attribution in cyberspace means that cyber attackers have the capability to coerce a state without the subsequent responsibility or punishment under international law. Therefore, the cyber attacker may experience great temptation to violate principles and obligations of international law to achieve the attacker's ends. Some experts have advocated for less online anonymity and more government control over the cyberspace infrastructure to combat this, and other solutions exist that create fewer domestic liberty concerns.[24] Cyber attacks provide a low-cost, remote, instantaneous, and powerful means of coercion or destruction, often without accountability. These attributes guarantee that state and non-state actors will continue to develop and unleash cyber attacks in the foreseeable future.[25] Therefore, challenges coming from cyber attacks create new space for states and other actors to rethink the ambiguities of international norms, which were historically adopted to define rules related to traditional military operations. Current international legal framework for the use of force and armed attack must be analyzed to clarify the legality of cyber operations in the digital era, as no direct international legal regulations currently exist for understanding the concept of cyber operations.\n## INTERNATIONAL LEGAL REGULATION OF THE USE OF FORCE ## Definition of the Use of Force in the Digital Era In order to maintain international peace and security, the internal legal system of states gradually moved away from monopolizing the use of VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE force and now permits it only in the exceptional cases defined under international law. Contemporary international law regarding the use of force is based on the UN Charter. The authors of the Charter wished to ban all uses of force, but also provided for some exceptions to this ban, which are regulated by the Charter.\nOne of the reasons that the UN was created was to modernize international law in the twentieth century. Leaders decided to “establish conditions under which justice and respect for the obligations arising from treaties and other sources of international law can be maintained, and to save succeeding generations from the scourge of war, which twice in our lifetime has brought untold sorrow to mankind.”²⁶ Therefore, modern legal regulation of force and conflict began with the UN Charter. Article 2 (4) mandates that “all Members shall refrain in their international relations from the threat or use of force against the territorial integrity or political independence of any state, or in any other manner inconsistent with the purposes of the United Nations.”²⁷ Due to the establishment of new operational domains and the use of cyber technological advances for weakening states’ critical infrastructure, the following questions should be asked: “Does Article 2 (4) of the UN Charter apply in cyberspace?” and “Do cyber attacks violate the general prohibition on the use of force?” Answering these questions will require a legal interpretation of Article 2 (4) of the UN Charter.\nWhile Article 2 (4) of the UN Charter mentions the threat or use of force, it does not mention war. The term “war” refers to a narrow and technical legal situation, which begins with a declaration of war and ends with a peace treaty. War was generally prohibited before the Second World War, but states found a way to avoid such prohibition. For example, Japan refused to declare war on China and instead called its military operations in Manchuria (1932-1941) “an incident” to avoid violating the prohibition of waging war. In light of such experiences, the term “use of force” was preferred because it covers all forms of hostilities, both technical wars and incidents falling short of an officially declared war, which range from minor border clashes to extensive military operations. Therefore, the prohibition of the use of force is not dependent on how the involved states prefer to define their military conflict.²⁸ Legal precedent upholds that the term “use of force” should be broadly defined. In its argument on a case concerning Nicaragua, the International Court of Justice (ICJ) rejected a narrow interpretation of “use of force” that limits the term to the employment of either kinetic force or non-kinetic operations generating comparable effects. The Court held that VOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS a state's arming and training of guerrilla forces that would then be engaged in hostilities against another state qualified as a use of force, a position that has since become widely accepted. This logic leads to the conclusion that non-destructive cyber operations could be considered a use of force. For example, providing malware to a rebel group and training its members to employ that malware in a destructive manner would seemingly qualify.²⁹ However, every unfriendly act does not cross the use of force threshold. In the case of Nicaragua, the Court held that financing guerrillas, while an unlawful\"intervention,\"did not rise to that level. Additionally, the drafters of the UN Charter rejected a proposal to further define economic coercion as a use of force. In this regard, the Group of International Experts, who authored the Tallinn Manual on the international law applicable to cyber warfare, unanimously agreed that any cyber operation causing greater than *de minimis* damage or injury suffices.³⁰ Over time, both the reaction of states to cyber operations as well as how they characterize their own cyber operations will inform the process of interpretive maturation. The use of force threshold, wherever it may presently lie, will almost certainly drop in lock step with the increasing dependency of states on cyberspace. Although it is difficult to predict whether any bright-line test will materialize, or whether states will simply characterize\"use of force\"more liberally, a number of options for clarifying the threshold exist.³¹ In assessing whether an event constitutes a use of force in or through cyberspace, it is important to evaluate several factors: the context of the event, the actor perpetrating the action (recognizing challenging issues of attribution in cyberspace), the target and location, and the effects and intent. Commonly cited examples of cyber activity that could constitute a use of force include: (1) Operations that trigger a nuclear plant meltdown; (2) Operations that open a dam above a populated area, causing destruction; or (3) Operations that disable air traffic control, resulting in airplane crashes. These seem to be based on the logic that if the physical consequences of a cyber attack inflict comparable physical damage to dropping a bomb or firing a missile, that cyber attack should be considered a use of force.³² It should be noted that an exact definition of the use of force is not given in the UN Charter. This means that if a cyber operation rises to the level of an act of violence, it represents a violation of the general prohibition of the use of force. However, exceptional circumstances to the general prohibition of the use of force are defined through the UN Charter. Thus, the legality of the use of force, including the use of cyberweapon, depends on the legal grounds which permit the use of force as an exceptional VOL. 44: I WINTER 2020 measure. These grounds will be clarified in accordance with the current international legal framework in the next sub-section.\nLegal Basis of the Use of Force in Accordance with the United Nations Charter Despite the fact that the UN Charter was adopted in 1945 when the idea of cyberspace was still far in the future, cyberspace actors should still understand how international law can govern cyber attacks and cyber warfare.\nIn 2013, the Group of Governmental Experts of the United Nations published its third report on confidence building measures which, inter alia, promoted the further study of norms and the pursuit of consensus, and implied that the UN Charter applies to digital space.33 Moreover, in the Tallinn Manual 1.0 and Tallinn Manual 2.0, the International Experts analyze how existing international law applies to cyber warfare and cyber operations.\nTherefore, if a cyber attack reaches a threshold that threatens security and peace, the UN Security Council has the authority to make an appropriate decision. Particularly, the first exception to the general prohibition of the use of force falls under Article 39 of the UN Charter. Article 39 empowers the Security Council to “determine the existence of any threat to the peace, breach of the peace, or act of aggression, and to make recommendations, or decide what measures shall be taken to maintain or restore international peace and security.”34 In light of the above, if the UN Security Council considers the aforementioned measures inadequate for maintaining or restoring international peace and security, it may take actions defined by Article 42 of the UN Charter. Particularly, Article 42 indicates that enforcement measures may be taken by air, sea, or land forces of members of the United Nations.35 Simultaneously, the International Group of Experts agreed that any action undertaken based on this rule may be implemented by, or against, cyber capabilities.36 The UN Security Council resolutions are legally binding on the members of the United Nations, and they are obliged to follow these resolutions. According to Article 48 of the UN Charter, the action required to carry out the decisions of the Security Council for the maintenance of international peace and security shall be taken by all the Members of the United Nations or by some of them, as the Security Council may determine. Such decisions shall be carried out by the Members of the United Nations directly and through their action in the appropriate international agencies of which they are members.37 THE FLETCHER FORUM OF WORLD AFFAIRS It should be noted that the UN Security Council faces obstacles in making decisions for maintaining or restoring international peace. It is a political body, and its decisions are based on political views rather than purely legal ones. No important decision can be made if one of the permanent members (the Russian Federation, the United Kingdom, France, China, and the United States of America) of the Security Council disagrees with it. Particularly, a veto power of the permanent member can hamper or block the process and make the Security Council incapable of acting on maintaining peace and security. This is a historical weakness of the collective security system.\nThe second exception to the general prohibition of the use of force is defined by Article 51 of the UN Charter, which states:\"Nothing in the present Charter shall impair the inherent right of individual or collective self-defense if an armed attack occurs against a Member of the United Nations, until the Security Council has taken measures necessary to maintain international peace and security.\"³⁸ Taking into consideration the above, the use of cyber force is illegal and contradicts international law if there are no appropriate legal grounds for the use of force defined by the existing international legal framework or these actions are not sanctioned by the UN Security Council in accordance with Chapter 7 of the UN Charter.\n## REINTERPRETATION OF AN ARMED ATTACK This chapter clarifies factors that can be used to define the effects of cyber attacks. Particularly, it aims to explore the level at which a cyber attack reaches that of an armed attack, and under which circumstances states can have the right to use individual or collective defense against a cyber attack as an armed attack.\nThe legal grounds for the right of individual and collective defense is an armed attack. This raises the need to precisely define the term\"armed attack.\"In its conclusion concerning the case of Nicaragua, the ICJ stated:\"an armed attack must be understood as including not merely action by regular armed forces across an international border, but also the sending by or on behalf of a State of armed bands, groups, irregulars or mercenaries, which carry out acts of armed force against another State of such gravity as to amount to (inter alia) an actual armed attack conducted by regular forces, or its substantial involvement therein.\"This description, contained in Article 3, paragraph (g), of the Definition of Aggression annexed to General Assembly Resolution 3314 (XXIX), may be taken to reflect VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE customary international law. The Court sees no reason to deny that, in customary law, the prohibition of armed attacks may apply to the sending by a State of armed bands to the territory of another State, if such an operation, because of its scale and effects, would have been classified as an armed attack rather than as a mere frontier incident had it been carried out by regular armed forces.³⁹ To determine if a cyber attack has risen to the level of an armed attack, three competing views have emerged: (1) the instrument-based approach, (2) the target-based approach, and (3) the effects-based approach. The instrument-based approach focuses on the tools used in an attack, arguing that, to be an armed attack, the initiator must use traditional military weapons. The target-based approach focuses on what the attack is aimed at, thus meriting self-defense when the target is “a sufficiently important computer system.” The effects-based approach focuses on the overall impact of the attack, thus meriting self-defense when the attack is of sufficient gravity.⁴⁰ The self-defense component of Article 51 of the UN Charter was drafted consistent with the instrument-based approach. Michael Schmitt argues that the choice to use an instrument-based approach is not sufficient to address self-defense claims against cyber attacks. Because armed attacks inherently include kinetic military force and cyber attacks often utilize non-kinetic approaches, the instrument-based approach fails to encapsulate cyber attacks that do not look like armed attacks but have the same ultimate effect. Instead, he argues for an effects-based approach which would better address cyber attacks because it allows broader latitude for a state to respond in self-defense, though it is not a current norm in international law.⁴¹ Michael Schmitt argues that a cyber attack’s effects should be measured against six factors: (1) severity: the type and scale of the harm; (2) immediacy: how quickly the harm materializes after the attack; (3) directness: the length of the causal chain between the attack and the harm; (4) invasiveness: the degree to which the attack penetrates the victim state’s territory; (5) measurability: the degree to which the harm can be quantified; and (6) presumptive legitimacy: the weight given to the fact that, in the field of cyber activities as a whole, cyber attacks constituting an armed attack are the exception rather than the rule.⁴² In this regard, according to the Tallinn Manual 1.0, no international cyber incidents have been unambiguously and publicly characterized by the international community as reaching the threshold of an armed attack. Not even the 2007 cyber operations against Estonia, which were colloquially referred to as “cyber war,” were publicly described as such. The International Group of Experts agreed with this assessment on the basis VOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS that the scale and effects threshold of these cyber operations was not sufficiently met to deem it an armed attack.⁴³ Based on the analysis of notions of the\"use of force\"and\"armed attack,\"it is important to note that all armed attacks are uses of force, and therefore all cyber operations that reach the threshold of armed attack will be considered uses of force. This distinction is important given the fact that an action that amounts to a use of force is a violation of Article 2(4) of the UN Charter, while an action reaching the threshold of armed attack could trigger an armed response from the victim state under Article 51 of the UN Charter.⁴⁴ Previous discussion has centered around state actors, but due to the nature of this new kind of war, the following question should be raised:\"Could an armed attack carried out by a non-state actor from abroad serve as legal grounds for the right of defense?\"The attacks of September 11, 2001 triggered discussions to determine whether the\"armed attack\"referred to in Article 51 of the UN Charter could include terrorist attacks, as the text itself does not clarify that an armed attack should be executed by a state.\nNevertheless, the ICJ has ruled that self-defense is limited to instances of states being attacked by other states. The Court circumscribed the applicability of the international legal order to certain actors, leaving others unregulated despite their actual participation in activities that affect world order. The majority of scholars accept that a strict insistence on state imputability is no longer tenable. The Court's restrictive approach is increasingly out of touch with the reality of non-state actors seen today.⁴⁵ The reaction of the international community to 9/11 illustrated that the concept of an armed attack is not limited to just state actors. In the aftermath of the terrorist attacks carried out against the United States, the UN Security Council recognized the American right to self-defense, and immediately codified it in appropriate resolutions.⁴⁶ This meant that such acts serve as grounds for enacting Article 51 of the UN Charter. NATO also weighed in and agreed that the terrorist attacks were directed from abroad against the United States and therefore were covered by Article 5 of the North Atlantic Treaty. This marked the only time in history that NATO made the decision to use the mechanism of collective defense.\nIn the context of cyber attacks, Professor Michael Schmitt posits that future cyber operations will challenge the ICJ's narrow interpretation of acceptable actors of armed attacks. He purports that non-state actors will soon turn to cyber operations to attack states, because cyberspace is a fertile environment for non-state actors who wish to do so, and because it is much easier for non-state actors to acquire the tools, such as destructive VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE malware, that could impact vulnerable cyber systems than it is to acquire the kinetic means to conduct a traditional attack.⁴⁷ Given rapid technological advances, cyberweapons are now available to both state and non-state actors. States can indirectly carry out cyber attacks against other states through the use of hackers. In such cases, it is necessary to take into consideration the following aspects: (1) Cyber attacks can be conducted by a non-state actor under the support of a state; (2) Cyber attacks can be directed from the sponsor country against the other state; (3) Cyber attacks can reach the sufficient gravity of armed attack. Therefore, if a cyber attack carried out by a non-state actor meets these requirements, it could serve as a basis for individual or collective defense.\n# CONCLUSION Technological advances have significantly changed not only the nature of battles, but the interpretation of the concept of armed attack itself. Current international legal regulations, including the UN Charter, apply to cyber attacks for the following reasons: (1) cyber attacks can reach a threshold that threatens a state's national security; and (2) the impact of cyber attacks can be as harmful to states as conventional attacks.\nIn view of the above, it is important to clarify key parameters of cyber attacks and cyber warfare, based on the reinterpretation of Article 51 of the UN Charter. First, an armed attack represents legal grounds for the use of an individual or collective defense mechanism. Second, because of the destructive nature of cyber attacks, interpretation of Article 51 of the UN Charter has been expanded to include cyber attacks as armed attacks. The International Group of Experts agreed that\"scale and effects\"are qualitative and quantitative factors that would apply when determining if a cyber operation qualifies as the gravest form of use of force (armed attack).⁴⁸ According to Tallinn Manual 1.0., cyber attacks rise to the level of an armed attack if they cause injury or death to persons or damage or destruction to objects.⁴⁹ Third, due to the reinterpretation of armed attacks, the notion of cyber attack should not be limited by the state actor as the sole possible perpetrator. The legal language of Article 51 of the UN Charter does not impose limitations on the execution of an armed attack by a state or a non-state actor. Given technological advances, it is highly possible that terrorist organizations will be able to create offensive cyber tools.\nBased on customary international norms, in cases of exercising the right of defense, states would consider the following elements: (1) Scope: is the incident widespread across a geographic area or industrial sectors? The VOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS wider the attack, the more likely a state action will be; (2) Duration: is the incident a single event or does it last over time as part of a longer campaign? A state is more likely to act for extended incidents; (3) Intensity/Scale: has the incident caused death or substantial property destruction? If not, a state is unlikely to declare individual or collective defense; (4) External Actor: is the incident directed from a foreign or domestic adversary? A state is unlikely to act against a purely domestic foe.⁵⁰ States will have to consider these criteria if they use the right of defense against cyber attacks.\nIn light of the foregoing considerations, regardless of the lack of exact international legal regulation of cyber attacks and cyber warfare, reinterpretation of current international norms will reduce ambiguity and allow states to better mitigate cyber risks in the future. f",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 17,
        "success_occurrences": 17,
        "success_unique": 17,
        "bib_unique_total": 100,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.17,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 27,
        "missing_intext_indices": [
          1,
          2,
          3,
          4,
          5,
          6,
          9,
          10,
          11,
          12,
          13,
          14,
          23,
          26,
          27,
          28,
          29,
          30,
          31,
          32,
          34,
          38,
          39,
          40,
          41,
          42,
          43
        ],
        "highest_intext_index": 44,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 33,
        "uncited_footnote_indices": [
          1,
          2,
          3,
          4,
          5,
          6,
          9,
          10,
          11,
          12,
          13,
          14,
          23,
          26,
          27,
          28,
          29,
          30,
          31,
          32,
          34,
          38,
          39,
          40,
          41,
          42,
          43,
          45,
          46,
          47,
          48,
          49,
          50
        ],
        "style": "hybrid"
      },
      "results": [
        {
          "index": "15",
          "intext_citation": "them.[15]",
          "preceding_text": "malicious code can cause significant damage, ranging from defacing web sites to taking control of entire systems and thereby being able to read, modify, or delete sensitive information; disrupt operations; launch attacks against other organizations' systems; or altogether destroy",
          "footnote": ". U.S. Government Accountability Office, *Cyber Analysis and Warning*, GAO-08-588, (Washington D.C., 2008), 8-9."
        },
        {
          "index": "16",
          "intext_citation": "websites.[16]",
          "preceding_text": "In these attacks, coordinated botnets—collections of thousands of “zombie” computers hijacked by insidious viruses—overwhelm servers by systematically visiting designated",
          "footnote": ". Hathaway, 837."
        },
        {
          "index": "17",
          "intext_citation": "inaccessible.[17]",
          "preceding_text": "The relocation of a Soviet-era war memorial unleashed a series of large and sustained DDoS attacks flooding networks or websites with attack traffic, rendering them",
          "footnote": "Jason Healey, et al., \"NATO's Cyber Capabilities: Yesterday, Today, and Tomorrow,\" *Atlantic Council* (2014): 2."
        },
        {
          "index": "18",
          "intext_citation": "injured.[18]",
          "preceding_text": "As a result, widespread social unrest and rioting left 150 people",
          "footnote": "Swanson, 309-310."
        },
        {
          "index": "19",
          "intext_citation": "computers.[19]",
          "preceding_text": "As a result, widespread social unrest and rioting left 150 people injured.[18] Additionally, botnet managers had used malware to infect unsuspecting",
          "footnote": "Vytautas Butrimas, \"An Unsettling Trend,\" *per Concordiam* 2 (2) (2011), <https: 10=\"\" 2018=\"\" cdc0e.org=\"\" pc_v2n2_en.pdf=\"\" uploads=\"\" uploads?=\"\"> (Accessed October 7, 2019)."
        },
        {
          "index": "20",
          "intext_citation": "age.[20]",
          "preceding_text": "ally, botnet managers had used malware to infect unsuspecting computers.[19] Antonia Chayes asserted that the effects of the attack on Estonia did not appear to be proportional to their cause, which indicates how easily petty disputes can lead to serious consequences in the cyber",
          "footnote": "Chayes, 476."
        },
        {
          "index": "21",
          "intext_citation": "warfare.[21]",
          "preceding_text": "The Russian-Georgian cyber conflict illustrates the havoc that can spread on the digital battlefield and re-energizes the debate over whether the laws of war could apply to this new kind of",
          "footnote": "Swanson, 304."
        },
        {
          "index": "22",
          "intext_citation": "conduct.[22]",
          "preceding_text": "Such covert action would be perfidious, yet the law of armed conflict falls short of explicitly prohibiting such",
          "footnote": "Michael Gervais, \"Cyber Attacks and the Laws of War,\" *Berkeley Journal of International Law* 30 (2012), 575."
        },
        {
          "index": "24",
          "intext_citation": "concerns.[24]",
          "preceding_text": "Some experts have advocated for less online anonymity and more government control over the cyberspace infrastructure to combat this, and other solutions exist that create fewer domestic liberty",
          "footnote": "Gervais, 579."
        },
        {
          "index": "25",
          "intext_citation": "future.[25]",
          "preceding_text": "These attributes guarantee that state and non-state actors will continue to develop and unleash cyber attacks in the foreseeable",
          "footnote": "Ibid., 578."
        },
        {
          "index": "7",
          "intext_citation": "fraud.7",
          "preceding_text": "l, a competing organization, or a rival government—against another in an ongoing struggle for hegemony in the marketplace or the political arena.” These differ from cyber crimes, which are governed by national criminal statutes and include acts such as identity theft and internet",
          "footnote": ". Lesley Swanson, “The Era of Cyber Warfare: Applying International Humanitarian Law to the 2008 Russian-Georgian Cyber Conflict,” 32 *Loyola of Los Angeles International and Comparative Law Review* (2010): 307."
        },
        {
          "index": "8",
          "intext_citation": "delivery.8",
          "preceding_text": "The activation or effect of a cyber attack may be widely separated temporally and geographically from the",
          "footnote": ". James E. Cartwright, *Joint Terminology for Cyberspace Operations*, 2011, 5."
        },
        {
          "index": "44",
          "intext_citation": "VOL.44",
          "preceding_text": "Had the hackers aimed their attacks at another state in tension with Georgia, they could have instigated the opening of another front in",
          "footnote": "Dan-Iulian Voitasec, \"Applying International Humanitarian Law to Cyber Attacks,\" *Lex ET Scientia International Journal* 22 (2015): 126."
        },
        {
          "index": "33",
          "intext_citation": "space.33",
          "preceding_text": "In 2013, the Group of Governmental Experts of the United Nations published its third report on confidence building measures which, inter alia, promoted the further study of norms and the pursuit of consensus, and implied that the UN Charter applies to digital",
          "footnote": "\"Back to Square One? Back to Square One? The Fifth UN GGE Fails to Submit a Conclusive Report at the UN General Assembly,\" *CCDOE*, <https: back-to-square-one-the-fifth-un-gge-fails-to-submit-a-conclusive-report-at-the-un-general-assembly=\"\" ccdcoe.org=\"\" incyder-articles=\"\"></https:> (Accessed October 1, 2019)."
        },
        {
          "index": "35",
          "intext_citation": "Nations.35",
          "preceding_text": "Particularly, Article 42 indicates that enforcement measures may be taken by air, sea, or land forces of members of the United",
          "footnote": "Charter of the United Nations."
        },
        {
          "index": "36",
          "intext_citation": "capabilities.36",
          "preceding_text": "rticularly, Article 42 indicates that enforcement measures may be taken by air, sea, or land forces of members of the United Nations.35 Simultaneously, the International Group of Experts agreed that any action undertaken based on this rule may be implemented by, or against, cyber",
          "footnote": "Schmitt, *Tallinn Manual*, 71."
        },
        {
          "index": "37",
          "intext_citation": "members.37",
          "preceding_text": "Such decisions shall be carried out by the Members of the United Nations directly and through their action in the appropriate international agencies of which they are",
          "footnote": "Charter of the United Nations."
        }
      ],
      "flat_text": "HEINONLINE -- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License -- The search text of this PDF is generated from uncorrected OCR text.\n\nKhatuna Burkadze ## ABSTRACT In the digital era, information and communication technologies have changed the concept of an armed attack. However, there are many uncertainties regarding the applicability of existing international law to cyberspace. Existing international legal regulations do not address cyber warfare and cyber operations, as the UN Charter was adopted in 1945 when the creation of cyberspace was far in the future rather than a current consideration. Because of the gap between law and policy, the following questions should be pondered: (1) Can a cyber attack be considered as an armed attack—the gravest form of use of force under the international law? (2) If yes, how could the UN Charter be reinterpreted to clarify under which circumstances the inherent right of self-defense could be invoked against cyber attacks?\nKhatuna Burkadze is a graduate of The Fletcher School of Law and Diplomacy, Tufts University. Dr. Burkadze has been a Fulbright scholar at the MIT Center for International Studies as well as a visiting professor at Columbia University, Bard College, and The Fletcher School of Law and Diplomacy. She has successfully completed programs on negotiations and security studies at Harvard University and George C. Marshall European Center for Security Studies. Dr. Burkadze is an alumna of the U.S. Department of State's Program on American Foreign Policy as well as the author of dozens of articles and book chapters. Currently, she delivers lectures at the Caucasus International University and is employed by the Office of the Prime Minister of Georgia.\nVOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS # INTRODUCTION Cyberspace now represents a new and important operational domain for warfare, which is a challenge for both national and international security. Cyberspace is of particular concern, as according to the 2017 National Security Strategy of the United States of America, it offers state and non-state actors the ability to wage campaigns against the political, economic, and security interests of opponents without ever physically crossing borders. Cyber attacks offer adversaries low-cost and deniable opportunities to damage or disrupt critical infrastructure, economies, networks, and to disable the devices that people use each day to communicate and conduct business.¹ Joel Trachtman posits that the rise of cyberspace presents challenges to international law and global governance. First, information is much more mobile than it was prior to the rise of cyberspace, crossing national boundaries without interruption. Second, the rise of cyberspace enables a novel type of terrorism and warfare. These phenomena challenge the ability of the state to provide the services that it has traditionally provided. Often, this will make it more valuable for states to cooperate with one another and to use international law to do so.² The unwillingness of states, as well as non-state actors, to have their behavior in cyberspace regulated by specific, treaty-based rules reinforces this reality; these actors instead tend to take advantage of a lack of effective international regulation of their activities.³ States and international organizations must recognize that cyberspace has become a parallel universe in which the criminal, terrorist, or unlawful combatant can operate with a high degree of impunity. Adding to this challenge, privacy services, provided in the form of user anonymity and data encryption, make it difficult for law enforcement, intelligence organizations, and militaries to attribute actions in cyberspace (whether lawful or not) to specific individuals or state actors.⁴ Cyber-based challenges are evolving and arise from a wide array of unintentional and intentional sources. Unintentional threats can be caused by software upgrades or defective equipment that inadvertently disrupts systems. Intentional threats include both targeted and untargeted attacks from a variety of sources, including hackers, disgruntled employees, and foreign nations engaged in espionage and information warfare. These threat sources vary in terms of the capabilities of the actors, their willingness to act, and their motives, which can include monetary gain or political advantage.⁵ VOL. 44: I WINTER 2020 In view of the current realities, it is necessary to explore basic characteristics of cyber attacks and understand this notion of a new kind of warfare. Due to the sophisticated nature of cyber attacks and the rapid technological changes seen today, state actors need to find responsive and responsible international legal solutions for ensuring their security.\n## Cyber Attacks and Cyber Warfare as a New Form of an Armed Attack ### Definition of Cyber Attacks and Cyber Warfare There is no widely accepted definition of cyber attack or cyber warfare. For example, the U.S. Department of Defense uses the phrase “computer network attacks,” and defines it as “actions taken by using computer networks to disrupt, deny, degrade, or destroy information resident in computers and computer networks, or the computers and networks themselves.”6 Instead of “computer network attack,” the U.S. Army's Cyber Operations and Cyber Terrorism Handbook uses the term “cyber attack,” defining it as the “premeditated use of disruptive activities, or the threat thereof, against computers and/or networks, with the intention to cause harm or to further social, ideological, religious, political or similar objectives to intimidate any person in furtherance of such objectives.” Such harm could be inflicted on the computer network, as well as to physical facilities and persons. Cyber attacks involve “an aggressive act on the part of one adversary—whether an individual, a competing organization, or a rival government—against another in an ongoing struggle for hegemony in the marketplace or the political arena.” These differ from cyber crimes, which are governed by national criminal statutes and include acts such as identity theft and internet fraud.7 After establishing the Cyber Command of the United States, the Joint Chiefs of Staff published a lexicon in 2011 for military use in cyber operations. According to the document, a “cyber attack” is a hostile act using computer or related networks or systems and intended to disrupt and/or destroy an adversary's critical cyber systems, assets, or functions. A cyber attack may use intermediate delivery vehicles such as peripheral devices, electronic transmitters, embedded code, or human operators. The activation or effect of a cyber attack may be widely separated temporally and geographically from the delivery.8 A key feature of this definition is that it limits “cyber attacks” to hostile acts that are intended to harm critical THE FLETCHER FORUM OF WORLD AFFAIRS cyber systems—thus restricting the definition based on the objective of the attack.⁹ The Tallinn Manual provides interpretation of the existing international legal framework with regard to cyber issues. As stated in the Tallinn Manual, “a cyber attack is a cyber operation, whether offensive or defensive, that is reasonably expected to cause injury or death to persons or damage or destruction to objects.”¹⁰ Thus, cyber warfare and cyber attacks can be used to describe defending and attacking information and computer network activities in cyberspace. However, cyber attacks are not easy for states to combat because the process of determining the origin and nature of the attack and assessing the damage incurred is difficult.¹¹ Antonia Chayes asserted that factual uncertainty about the origins and nature of a cyber attack almost guarantees legal uncertainty under both international and domestic law.¹² In addition to these clarifications, the ultimate goal of warfare—victory—will not change in the future. The tactics of achieving this victory, however, are radically different in cyberspace. If there is a war between major world powers, the first victim of the conflict could be the Internet itself. There will be two broad categories of cyber attacks during a major war: one on military forces, in which the attacks would be conducted as part of a broader effort to disable the adversary’s weaponry and to disrupt military command-and-control systems; and the other on civilian infrastructure, in which the targets may include an adversary’s financial sector, industry, and national morale in order to diminish the adversary’s ability and will to wage war for extended periods.¹³ In addition to traditional war, cyber attacks are becoming a means to achieve political ends. A typical example is Internet stoppage in which perpetrators simultaneously log onto a site, connect to a server, send an e-mail, or make postings to forums in order to limit or even deny access to the site by other users. The Internet site or server is overwhelmed by access requests, causing an interruption or complete stoppage.¹⁴ In view of the above, it is important to note that communication technologies, used for offensive or defensive cyber attacks, are equally accessible to state and non-state actors in cyberspace. A computer can be both a target of attack or an instrument for carrying out a new form of war.\n## Key Characteristics of Cyber Attacks The growing number of known vulnerabilities increases the potential number of attacks. By exploiting software vulnerabilities, hackers who VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE spread malicious code can cause significant damage, ranging from defacing web sites to taking control of entire systems and thereby being able to read, modify, or delete sensitive information; disrupt operations; launch attacks against other organizations' systems; or altogether destroy them.[15] Distributed Denial of Service (DDoS) attacks have been the most prevalent form of cyber attack in recent years. In these attacks, coordinated botnets—collections of thousands of “zombie” computers hijacked by insidious viruses—overwhelm servers by systematically visiting designated websites.[16] In 2007, Estonia became a target of a DDoS attack. The relocation of a Soviet-era war memorial unleashed a series of large and sustained DDoS attacks flooding networks or websites with attack traffic, rendering them inaccessible.[17] These attacks caused more than just confusion for the nation's population. At the time of these attacks, Estonia had essentially instituted an\"e-government\"where many aspects of the government were carried out online. In addition to bringing down many of Estonia's critical government and commercial websites, the cyber attacks also caused the emergency phone number used for calling ambulance and fire services to be unavailable for more than one hour. As a result, widespread social unrest and rioting left 150 people injured.[18] Additionally, botnet managers had used malware to infect unsuspecting computers.[19] Antonia Chayes asserted that the effects of the attack on Estonia did not appear to be proportional to their cause, which indicates how easily petty disputes can lead to serious consequences in the cyber age.[20] In 2008, Georgia became the target of similar attacks, though in this case they were carried out alongside conventional military actions. These cyber attacks mainly hindered the Georgian government's ability to communicate with both its citizens and other nations prior to and during the physical invasion by Russia, so as to weaken their ability to respond. Official Georgian websites, including those for the President's office, the Ministry of Foreign Affairs, and the Ministry of Defense were disabled. Even after the cease-fire between the nations was reached, major Georgian servers remained inoperable. The Russian-Georgian cyber conflict illustrates the havoc that can spread on the digital battlefield and re-energizes the debate over whether the laws of war could apply to this new kind of warfare.[21] The cyber attack against Georgia reveals the potential for a much larger threat. Had the hackers aimed their attacks at another state in tension with Georgia, they could have instigated the opening of another front in VOL.44:I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS Russia's war on Georgia. Such covert action would be perfidious, yet the law of armed conflict falls short of explicitly prohibiting such conduct.[22] Based on the analysis of the key characteristics of cyber attacks, the following issues should be outlined: (1) While traditional military weapons such as tanks and missiles tend to be monopolized by the state, cyberweapons can be created and used by anyone; (2) Cyberweapons are much more versatile than traditional military weapons—while traditional military weapons are used mainly to destroy, cyberweapons can be used for gathering information as well as destruction;[23] (3) The targeted states have difficulty in defining who a cyber attacker is—states can support or employ third-party hacker groups to weaken opponents; (4) The results of cyber attacks are unpredictable—cyberweapons can cause similar or greater damage than traditional kinetic weapons.\nGiven these issues, cyber attacks present a litmus test for a nation's commitment to international law. The problem of attribution in cyberspace means that cyber attackers have the capability to coerce a state without the subsequent responsibility or punishment under international law. Therefore, the cyber attacker may experience great temptation to violate principles and obligations of international law to achieve the attacker's ends. Some experts have advocated for less online anonymity and more government control over the cyberspace infrastructure to combat this, and other solutions exist that create fewer domestic liberty concerns.[24] Cyber attacks provide a low-cost, remote, instantaneous, and powerful means of coercion or destruction, often without accountability. These attributes guarantee that state and non-state actors will continue to develop and unleash cyber attacks in the foreseeable future.[25] Therefore, challenges coming from cyber attacks create new space for states and other actors to rethink the ambiguities of international norms, which were historically adopted to define rules related to traditional military operations. Current international legal framework for the use of force and armed attack must be analyzed to clarify the legality of cyber operations in the digital era, as no direct international legal regulations currently exist for understanding the concept of cyber operations.\n## INTERNATIONAL LEGAL REGULATION OF THE USE OF FORCE ## Definition of the Use of Force in the Digital Era In order to maintain international peace and security, the internal legal system of states gradually moved away from monopolizing the use of VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE force and now permits it only in the exceptional cases defined under international law. Contemporary international law regarding the use of force is based on the UN Charter. The authors of the Charter wished to ban all uses of force, but also provided for some exceptions to this ban, which are regulated by the Charter.\nOne of the reasons that the UN was created was to modernize international law in the twentieth century. Leaders decided to “establish conditions under which justice and respect for the obligations arising from treaties and other sources of international law can be maintained, and to save succeeding generations from the scourge of war, which twice in our lifetime has brought untold sorrow to mankind.”²⁶ Therefore, modern legal regulation of force and conflict began with the UN Charter. Article 2 (4) mandates that “all Members shall refrain in their international relations from the threat or use of force against the territorial integrity or political independence of any state, or in any other manner inconsistent with the purposes of the United Nations.”²⁷ Due to the establishment of new operational domains and the use of cyber technological advances for weakening states’ critical infrastructure, the following questions should be asked: “Does Article 2 (4) of the UN Charter apply in cyberspace?” and “Do cyber attacks violate the general prohibition on the use of force?” Answering these questions will require a legal interpretation of Article 2 (4) of the UN Charter.\nWhile Article 2 (4) of the UN Charter mentions the threat or use of force, it does not mention war. The term “war” refers to a narrow and technical legal situation, which begins with a declaration of war and ends with a peace treaty. War was generally prohibited before the Second World War, but states found a way to avoid such prohibition. For example, Japan refused to declare war on China and instead called its military operations in Manchuria (1932-1941) “an incident” to avoid violating the prohibition of waging war. In light of such experiences, the term “use of force” was preferred because it covers all forms of hostilities, both technical wars and incidents falling short of an officially declared war, which range from minor border clashes to extensive military operations. Therefore, the prohibition of the use of force is not dependent on how the involved states prefer to define their military conflict.²⁸ Legal precedent upholds that the term “use of force” should be broadly defined. In its argument on a case concerning Nicaragua, the International Court of Justice (ICJ) rejected a narrow interpretation of “use of force” that limits the term to the employment of either kinetic force or non-kinetic operations generating comparable effects. The Court held that VOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS a state's arming and training of guerrilla forces that would then be engaged in hostilities against another state qualified as a use of force, a position that has since become widely accepted. This logic leads to the conclusion that non-destructive cyber operations could be considered a use of force. For example, providing malware to a rebel group and training its members to employ that malware in a destructive manner would seemingly qualify.²⁹ However, every unfriendly act does not cross the use of force threshold. In the case of Nicaragua, the Court held that financing guerrillas, while an unlawful\"intervention,\"did not rise to that level. Additionally, the drafters of the UN Charter rejected a proposal to further define economic coercion as a use of force. In this regard, the Group of International Experts, who authored the Tallinn Manual on the international law applicable to cyber warfare, unanimously agreed that any cyber operation causing greater than *de minimis* damage or injury suffices.³⁰ Over time, both the reaction of states to cyber operations as well as how they characterize their own cyber operations will inform the process of interpretive maturation. The use of force threshold, wherever it may presently lie, will almost certainly drop in lock step with the increasing dependency of states on cyberspace. Although it is difficult to predict whether any bright-line test will materialize, or whether states will simply characterize\"use of force\"more liberally, a number of options for clarifying the threshold exist.³¹ In assessing whether an event constitutes a use of force in or through cyberspace, it is important to evaluate several factors: the context of the event, the actor perpetrating the action (recognizing challenging issues of attribution in cyberspace), the target and location, and the effects and intent. Commonly cited examples of cyber activity that could constitute a use of force include: (1) Operations that trigger a nuclear plant meltdown; (2) Operations that open a dam above a populated area, causing destruction; or (3) Operations that disable air traffic control, resulting in airplane crashes. These seem to be based on the logic that if the physical consequences of a cyber attack inflict comparable physical damage to dropping a bomb or firing a missile, that cyber attack should be considered a use of force.³² It should be noted that an exact definition of the use of force is not given in the UN Charter. This means that if a cyber operation rises to the level of an act of violence, it represents a violation of the general prohibition of the use of force. However, exceptional circumstances to the general prohibition of the use of force are defined through the UN Charter. Thus, the legality of the use of force, including the use of cyberweapon, depends on the legal grounds which permit the use of force as an exceptional VOL. 44: I WINTER 2020 measure. These grounds will be clarified in accordance with the current international legal framework in the next sub-section.\nLegal Basis of the Use of Force in Accordance with the United Nations Charter Despite the fact that the UN Charter was adopted in 1945 when the idea of cyberspace was still far in the future, cyberspace actors should still understand how international law can govern cyber attacks and cyber warfare.\nIn 2013, the Group of Governmental Experts of the United Nations published its third report on confidence building measures which, inter alia, promoted the further study of norms and the pursuit of consensus, and implied that the UN Charter applies to digital space.33 Moreover, in the Tallinn Manual 1.0 and Tallinn Manual 2.0, the International Experts analyze how existing international law applies to cyber warfare and cyber operations.\nTherefore, if a cyber attack reaches a threshold that threatens security and peace, the UN Security Council has the authority to make an appropriate decision. Particularly, the first exception to the general prohibition of the use of force falls under Article 39 of the UN Charter. Article 39 empowers the Security Council to “determine the existence of any threat to the peace, breach of the peace, or act of aggression, and to make recommendations, or decide what measures shall be taken to maintain or restore international peace and security.”34 In light of the above, if the UN Security Council considers the aforementioned measures inadequate for maintaining or restoring international peace and security, it may take actions defined by Article 42 of the UN Charter. Particularly, Article 42 indicates that enforcement measures may be taken by air, sea, or land forces of members of the United Nations.35 Simultaneously, the International Group of Experts agreed that any action undertaken based on this rule may be implemented by, or against, cyber capabilities.36 The UN Security Council resolutions are legally binding on the members of the United Nations, and they are obliged to follow these resolutions. According to Article 48 of the UN Charter, the action required to carry out the decisions of the Security Council for the maintenance of international peace and security shall be taken by all the Members of the United Nations or by some of them, as the Security Council may determine. Such decisions shall be carried out by the Members of the United Nations directly and through their action in the appropriate international agencies of which they are members.37 THE FLETCHER FORUM OF WORLD AFFAIRS It should be noted that the UN Security Council faces obstacles in making decisions for maintaining or restoring international peace. It is a political body, and its decisions are based on political views rather than purely legal ones. No important decision can be made if one of the permanent members (the Russian Federation, the United Kingdom, France, China, and the United States of America) of the Security Council disagrees with it. Particularly, a veto power of the permanent member can hamper or block the process and make the Security Council incapable of acting on maintaining peace and security. This is a historical weakness of the collective security system.\nThe second exception to the general prohibition of the use of force is defined by Article 51 of the UN Charter, which states:\"Nothing in the present Charter shall impair the inherent right of individual or collective self-defense if an armed attack occurs against a Member of the United Nations, until the Security Council has taken measures necessary to maintain international peace and security.\"³⁸ Taking into consideration the above, the use of cyber force is illegal and contradicts international law if there are no appropriate legal grounds for the use of force defined by the existing international legal framework or these actions are not sanctioned by the UN Security Council in accordance with Chapter 7 of the UN Charter.\n## REINTERPRETATION OF AN ARMED ATTACK This chapter clarifies factors that can be used to define the effects of cyber attacks. Particularly, it aims to explore the level at which a cyber attack reaches that of an armed attack, and under which circumstances states can have the right to use individual or collective defense against a cyber attack as an armed attack.\nThe legal grounds for the right of individual and collective defense is an armed attack. This raises the need to precisely define the term\"armed attack.\"In its conclusion concerning the case of Nicaragua, the ICJ stated:\"an armed attack must be understood as including not merely action by regular armed forces across an international border, but also the sending by or on behalf of a State of armed bands, groups, irregulars or mercenaries, which carry out acts of armed force against another State of such gravity as to amount to (inter alia) an actual armed attack conducted by regular forces, or its substantial involvement therein.\"This description, contained in Article 3, paragraph (g), of the Definition of Aggression annexed to General Assembly Resolution 3314 (XXIX), may be taken to reflect VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE customary international law. The Court sees no reason to deny that, in customary law, the prohibition of armed attacks may apply to the sending by a State of armed bands to the territory of another State, if such an operation, because of its scale and effects, would have been classified as an armed attack rather than as a mere frontier incident had it been carried out by regular armed forces.³⁹ To determine if a cyber attack has risen to the level of an armed attack, three competing views have emerged: (1) the instrument-based approach, (2) the target-based approach, and (3) the effects-based approach. The instrument-based approach focuses on the tools used in an attack, arguing that, to be an armed attack, the initiator must use traditional military weapons. The target-based approach focuses on what the attack is aimed at, thus meriting self-defense when the target is “a sufficiently important computer system.” The effects-based approach focuses on the overall impact of the attack, thus meriting self-defense when the attack is of sufficient gravity.⁴⁰ The self-defense component of Article 51 of the UN Charter was drafted consistent with the instrument-based approach. Michael Schmitt argues that the choice to use an instrument-based approach is not sufficient to address self-defense claims against cyber attacks. Because armed attacks inherently include kinetic military force and cyber attacks often utilize non-kinetic approaches, the instrument-based approach fails to encapsulate cyber attacks that do not look like armed attacks but have the same ultimate effect. Instead, he argues for an effects-based approach which would better address cyber attacks because it allows broader latitude for a state to respond in self-defense, though it is not a current norm in international law.⁴¹ Michael Schmitt argues that a cyber attack’s effects should be measured against six factors: (1) severity: the type and scale of the harm; (2) immediacy: how quickly the harm materializes after the attack; (3) directness: the length of the causal chain between the attack and the harm; (4) invasiveness: the degree to which the attack penetrates the victim state’s territory; (5) measurability: the degree to which the harm can be quantified; and (6) presumptive legitimacy: the weight given to the fact that, in the field of cyber activities as a whole, cyber attacks constituting an armed attack are the exception rather than the rule.⁴² In this regard, according to the Tallinn Manual 1.0, no international cyber incidents have been unambiguously and publicly characterized by the international community as reaching the threshold of an armed attack. Not even the 2007 cyber operations against Estonia, which were colloquially referred to as “cyber war,” were publicly described as such. The International Group of Experts agreed with this assessment on the basis VOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS that the scale and effects threshold of these cyber operations was not sufficiently met to deem it an armed attack.⁴³ Based on the analysis of notions of the\"use of force\"and\"armed attack,\"it is important to note that all armed attacks are uses of force, and therefore all cyber operations that reach the threshold of armed attack will be considered uses of force. This distinction is important given the fact that an action that amounts to a use of force is a violation of Article 2(4) of the UN Charter, while an action reaching the threshold of armed attack could trigger an armed response from the victim state under Article 51 of the UN Charter.⁴⁴ Previous discussion has centered around state actors, but due to the nature of this new kind of war, the following question should be raised:\"Could an armed attack carried out by a non-state actor from abroad serve as legal grounds for the right of defense?\"The attacks of September 11, 2001 triggered discussions to determine whether the\"armed attack\"referred to in Article 51 of the UN Charter could include terrorist attacks, as the text itself does not clarify that an armed attack should be executed by a state.\nNevertheless, the ICJ has ruled that self-defense is limited to instances of states being attacked by other states. The Court circumscribed the applicability of the international legal order to certain actors, leaving others unregulated despite their actual participation in activities that affect world order. The majority of scholars accept that a strict insistence on state imputability is no longer tenable. The Court's restrictive approach is increasingly out of touch with the reality of non-state actors seen today.⁴⁵ The reaction of the international community to 9/11 illustrated that the concept of an armed attack is not limited to just state actors. In the aftermath of the terrorist attacks carried out against the United States, the UN Security Council recognized the American right to self-defense, and immediately codified it in appropriate resolutions.⁴⁶ This meant that such acts serve as grounds for enacting Article 51 of the UN Charter. NATO also weighed in and agreed that the terrorist attacks were directed from abroad against the United States and therefore were covered by Article 5 of the North Atlantic Treaty. This marked the only time in history that NATO made the decision to use the mechanism of collective defense.\nIn the context of cyber attacks, Professor Michael Schmitt posits that future cyber operations will challenge the ICJ's narrow interpretation of acceptable actors of armed attacks. He purports that non-state actors will soon turn to cyber operations to attack states, because cyberspace is a fertile environment for non-state actors who wish to do so, and because it is much easier for non-state actors to acquire the tools, such as destructive VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE malware, that could impact vulnerable cyber systems than it is to acquire the kinetic means to conduct a traditional attack.⁴⁷ Given rapid technological advances, cyberweapons are now available to both state and non-state actors. States can indirectly carry out cyber attacks against other states through the use of hackers. In such cases, it is necessary to take into consideration the following aspects: (1) Cyber attacks can be conducted by a non-state actor under the support of a state; (2) Cyber attacks can be directed from the sponsor country against the other state; (3) Cyber attacks can reach the sufficient gravity of armed attack. Therefore, if a cyber attack carried out by a non-state actor meets these requirements, it could serve as a basis for individual or collective defense.\n# CONCLUSION Technological advances have significantly changed not only the nature of battles, but the interpretation of the concept of armed attack itself. Current international legal regulations, including the UN Charter, apply to cyber attacks for the following reasons: (1) cyber attacks can reach a threshold that threatens a state's national security; and (2) the impact of cyber attacks can be as harmful to states as conventional attacks.\nIn view of the above, it is important to clarify key parameters of cyber attacks and cyber warfare, based on the reinterpretation of Article 51 of the UN Charter. First, an armed attack represents legal grounds for the use of an individual or collective defense mechanism. Second, because of the destructive nature of cyber attacks, interpretation of Article 51 of the UN Charter has been expanded to include cyber attacks as armed attacks. The International Group of Experts agreed that\"scale and effects\"are qualitative and quantitative factors that would apply when determining if a cyber operation qualifies as the gravest form of use of force (armed attack).⁴⁸ According to Tallinn Manual 1.0., cyber attacks rise to the level of an armed attack if they cause injury or death to persons or damage or destruction to objects.⁴⁹ Third, due to the reinterpretation of armed attacks, the notion of cyber attack should not be limited by the state actor as the sole possible perpetrator. The legal language of Article 51 of the UN Charter does not impose limitations on the execution of an armed attack by a state or a non-state actor. Given technological advances, it is highly possible that terrorist organizations will be able to create offensive cyber tools.\nBased on customary international norms, in cases of exercising the right of defense, states would consider the following elements: (1) Scope: is the incident widespread across a geographic area or industrial sectors? The VOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS wider the attack, the more likely a state action will be; (2) Duration: is the incident a single event or does it last over time as part of a longer campaign? A state is more likely to act for extended incidents; (3) Intensity/Scale: has the incident caused death or substantial property destruction? If not, a state is unlikely to declare individual or collective defense; (4) External Actor: is the incident directed from a foreign or domestic adversary? A state is unlikely to act against a purely domestic foe.⁵⁰ States will have to consider these criteria if they use the right of defense against cyber attacks.\nIn light of the foregoing considerations, regardless of the lack of exact international legal regulation of cyber attacks and cyber warfare, reinterpretation of current international norms will reduce ambiguity and allow states to better mitigate cyber risks in the future. f"
    },
    "numeric": {
      "total": {
        "intext_total": 2,
        "success_occurrences": 2,
        "success_unique": 2,
        "bib_unique_total": 16,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.125,
        "success_percentage": 100.0,
        "style": "numeric"
      },
      "results": [
        {
          "index": "15",
          "intext_citation": "[15]",
          "preceding_text": "web sites to taking control of entire systems and thereby being able to read, modify, or delete sensitive information; disrupt operations; launch attacks against other organizations' systems; or altogether destroy them.",
          "footnote": "U.S. Government Accountability Office, *Cyber Analysis and Warning*, GAO-08-588, (Washington D.C., 2008), 8-9."
        },
        {
          "index": "16",
          "intext_citation": "[16]",
          "preceding_text": "In these attacks, coordinated botnets—collections of thousands of “zombie” computers hijacked by insidious viruses—overwhelm servers by systematically visiting designated websites.",
          "footnote": "Hathaway, 837. VOL.44:1 WINTER 2020</https:></https:></https:> A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE 17 Jason Healey, et al., \"NATO's Cyber Capabilities: Yesterday, Today, and Tomorrow,\" *Atlantic Council* (2014): 2. 18 Swanson, 309-310. 19 Vytautas Butrimas, \"An Unsettling Trend,\" *per Concordiam* 2 (2) (2011), <https: 10=\"\" 2018=\"\" cdc0e.org=\"\" pc_v2n2_en.pdf=\"\" uploads=\"\" uploads?=\"\"> (Accessed October 7, 2019). 20 Chayes, 476. 21 Swanson, 304. 22 Michael Gervais, \"Cyber Attacks and the Laws of War,\" *Berkeley Journal of International Law* 30 (2012), 575. 23 Grant Hodgson, \"Cyber Attack Treaty Verification,\" *Journal of Law and Policy for the Information Society* 12 (2016), 240. 24 Gervais, 579. 25 Ibid., 578. 26 United Nations, Charter of the United Nations <http: documents=\"\" charter=\"\" intro.shtml=\"\" wwwupdate.un.org=\"\"> (Accessed October 10, 2019). 27 Matthew C. Waxman, \"Cyber Attacks as Force under UN Charter Article 2(4),\" *International Law Studies Series, US Naval War College* 87 (2011): 44. 28 René Värk, “The Use of Force in the Modern World: Recent Developments and Legal Regulation of the Use of Force,” *Baltic Defense Review* 2 (2003): 29-30. 29 Michael N. Schmitt, \"The Law of Cyber Warfare: Quo Vadis?,\" *Stanford Law &amp; Policy Review* 25 (2014): 279-280. 30 Ibid., 280-281. 31 Ibid. 32 Chayes, 507. 33 \"Back to Square One? Back to Square One? The Fifth UN GGE Fails to Submit a Conclusive Report at the UN General Assembly,\" *CCDOE*, <https: back-to-square-one-the-fifth-un-gge-fails-to-submit-a-conclusive-report-at-the-un-general-assembly=\"\" ccdcoe.org=\"\" incyder-articles=\"\"></https:> (Accessed October 1, 2019). 34 Hathaway, 843-844. 35 Charter of the United Nations. 36 Schmitt, *Tallinn Manual*, 71. 37 Charter of the United Nations. 38 Ibid. 39 Nicaragua v. the United States of America, *International Court of Justice (ICJ)*, 1986, 93. 40 Stephen Moore, \"Cyber Attacks and the Beginnings of an International Cyber Treaty,\" 39 *The North Carolina Journal of International Law and Commercial Regulation*, 2013: 247. 41 Ibid., 247-248. 42 Hathaway, 847. 43 Schmitt, *Tallinn Manual*, 57-58. 44 Dan-Iulian Voitasec, \"Applying International Humanitarian Law to Cyber Attacks,\" *Lex ET Scientia International Journal* 22 (2015): 126. 45 Gary D. Solis, \"Cyber Warfare,\" *Military Law Review* 219 (2014): 19-21. 46 UN Security Council Resolution N1368, September 12, 2001; UN Security Council Resolution N1373, September 28, 2001. 47 Schmitt, 287. 48 Voitasec, 126. 49 Schmitt, *Tallinn Manual*, 106. 50 Healey et al., 7. VOL. 44:1 WINTER 2020</http:></https:> 48 THE FLETCHER FORUM OF WORLD AFFAIRS VOL. 44: I WINTER 2020"
        }
      ],
      "flat_text": "HEINONLINE\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\n33\n# A Shift in the Historical Understanding of Armed Attack and Its Applicability to Cyberspace\nKhatuna Burkadze\n## ABSTRACT\nIn the digital era, information and communication technologies have changed the concept of an armed attack. However, there are many uncertainties regarding the applicability of existing international law to cyberspace. Existing international legal regulations do not address cyber warfare and cyber operations, as the UN Charter was adopted in 1945 when the creation of cyberspace was far in the future rather than a current consideration. Because of the gap between law and policy, the following questions should be pondered: (1) Can a cyber attack be considered as an armed attack—the gravest form of use of force under the international law? (2) If yes, how could the UN Charter be reinterpreted to clarify under which circumstances the inherent right of self-defense could be invoked against cyber attacks?\nKhatuna Burkadze is a graduate of The Fletcher School of Law and Diplomacy, Tufts University. Dr. Burkadze has been a Fulbright scholar at the MIT Center for International Studies as well as a visiting professor at Columbia University, Bard College, and The Fletcher School of Law and Diplomacy. She has successfully completed programs on negotiations and security studies at Harvard University and George C. Marshall European Center for Security Studies. Dr. Burkadze is an alumna of the U.S. Department of State's Program on American Foreign Policy as well as the author of dozens of articles and book chapters. Currently, she delivers lectures at the Caucasus International University and is employed by the Office of the Prime Minister of Georgia.\nVOL. 44: I WINTER 2020\nTHE FLETCHER FORUM OF WORLD AFFAIRS\n# INTRODUCTION\nCyberspace now represents a new and important operational domain for warfare, which is a challenge for both national and international security. Cyberspace is of particular concern, as according to the 2017 National Security Strategy of the United States of America, it offers state and non-state actors the ability to wage campaigns against the political, economic, and security interests of opponents without ever physically crossing borders. Cyber attacks offer adversaries low-cost and deniable opportunities to damage or disrupt critical infrastructure, economies, networks, and to disable the devices that people use each day to communicate and conduct business.¹\nJoel Trachtman posits that the rise of cyberspace presents challenges to international law and global governance. First, information is much more mobile than it was prior to the rise of cyberspace, crossing national boundaries without interruption. Second, the rise of cyberspace enables a novel type of terrorism and warfare. These phenomena challenge the ability of the state to provide the services that it has traditionally provided. Often, this will make it more valuable for states to cooperate with one another and to use international law to do so.²\nThe unwillingness of states, as well as non-state actors, to have their behavior in cyberspace regulated by specific, treaty-based rules reinforces this reality; these actors instead tend to take advantage of a lack of effective international regulation of their activities.³\nStates and international organizations must recognize that cyberspace has become a parallel universe in which the criminal, terrorist, or unlawful combatant can operate with a high degree of impunity. Adding to this challenge, privacy services, provided in the form of user anonymity and data encryption, make it difficult for law enforcement, intelligence organizations, and militaries to attribute actions in cyberspace (whether lawful or not) to specific individuals or state actors.⁴\nCyber-based challenges are evolving and arise from a wide array of unintentional and intentional sources. Unintentional threats can be caused by software upgrades or defective equipment that inadvertently disrupts systems. Intentional threats include both targeted and untargeted attacks from a variety of sources, including hackers, disgruntled employees, and foreign nations engaged in espionage and information warfare. These threat sources vary in terms of the capabilities of the actors, their willingness to act, and their motives, which can include monetary gain or political advantage.⁵\nVOL. 44: I WINTER 2020\nIn view of the current realities, it is necessary to explore basic characteristics of cyber attacks and understand this notion of a new kind of warfare. Due to the sophisticated nature of cyber attacks and the rapid technological changes seen today, state actors need to find responsive and responsible international legal solutions for ensuring their security.\n## Cyber Attacks and Cyber Warfare as a New Form of an Armed Attack\n### Definition of Cyber Attacks and Cyber Warfare\nThere is no widely accepted definition of cyber attack or cyber warfare. For example, the U.S. Department of Defense uses the phrase “computer network attacks,” and defines it as “actions taken by using computer networks to disrupt, deny, degrade, or destroy information resident in computers and computer networks, or the computers and networks themselves.”6\nInstead of “computer network attack,” the U.S. Army's Cyber Operations and Cyber Terrorism Handbook uses the term “cyber attack,” defining it as the “premeditated use of disruptive activities, or the threat thereof, against computers and/or networks, with the intention to cause harm or to further social, ideological, religious, political or similar objectives to intimidate any person in furtherance of such objectives.” Such harm could be inflicted on the computer network, as well as to physical facilities and persons. Cyber attacks involve “an aggressive act on the part of one adversary—whether an individual, a competing organization, or a rival government—against another in an ongoing struggle for hegemony in the marketplace or the political arena.” These differ from cyber crimes, which are governed by national criminal statutes and include acts such as identity theft and internet fraud.7\nAfter establishing the Cyber Command of the United States, the Joint Chiefs of Staff published a lexicon in 2011 for military use in cyber operations. According to the document, a “cyber attack” is a hostile act using computer or related networks or systems and intended to disrupt and/or destroy an adversary's critical cyber systems, assets, or functions. A cyber attack may use intermediate delivery vehicles such as peripheral devices, electronic transmitters, embedded code, or human operators. The activation or effect of a cyber attack may be widely separated temporally and geographically from the delivery.8 A key feature of this definition is that it limits “cyber attacks” to hostile acts that are intended to harm critical\nTHE FLETCHER FORUM OF WORLD AFFAIRS\ncyber systems—thus restricting the definition based on the objective of the attack.⁹\nThe Tallinn Manual provides interpretation of the existing international legal framework with regard to cyber issues. As stated in the Tallinn Manual, “a cyber attack is a cyber operation, whether offensive or defensive, that is reasonably expected to cause injury or death to persons or damage or destruction to objects.”¹⁰\nThus, cyber warfare and cyber attacks can be used to describe defending and attacking information and computer network activities in cyberspace. However, cyber attacks are not easy for states to combat because the process of determining the origin and nature of the attack and assessing the damage incurred is difficult.¹¹ Antonia Chayes asserted that factual uncertainty about the origins and nature of a cyber attack almost guarantees legal uncertainty under both international and domestic law.¹²\nIn addition to these clarifications, the ultimate goal of warfare—victory—will not change in the future. The tactics of achieving this victory, however, are radically different in cyberspace. If there is a war between major world powers, the first victim of the conflict could be the Internet itself. There will be two broad categories of cyber attacks during a major war: one on military forces, in which the attacks would be conducted as part of a broader effort to disable the adversary’s weaponry and to disrupt military command-and-control systems; and the other on civilian infrastructure, in which the targets may include an adversary’s financial sector, industry, and national morale in order to diminish the adversary’s ability and will to wage war for extended periods.¹³\nIn addition to traditional war, cyber attacks are becoming a means to achieve political ends. A typical example is Internet stoppage in which perpetrators simultaneously log onto a site, connect to a server, send an e-mail, or make postings to forums in order to limit or even deny access to the site by other users. The Internet site or server is overwhelmed by access requests, causing an interruption or complete stoppage.¹⁴\nIn view of the above, it is important to note that communication technologies, used for offensive or defensive cyber attacks, are equally accessible to state and non-state actors in cyberspace. A computer can be both a target of attack or an instrument for carrying out a new form of war.\n## Key Characteristics of Cyber Attacks\nThe growing number of known vulnerabilities increases the potential number of attacks. By exploiting software vulnerabilities, hackers who\nVOL. 44: I WINTER 2020\nA SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\nspread malicious code can cause significant damage, ranging from defacing web sites to taking control of entire systems and thereby being able to read, modify, or delete sensitive information; disrupt operations; launch attacks against other organizations' systems; or altogether destroy them.\nDistributed Denial of Service (DDoS) attacks have been the most prevalent form of cyber attack in recent years. In these attacks, coordinated botnets—collections of thousands of “zombie” computers hijacked by insidious viruses—overwhelm servers by systematically visiting designated websites.\nIn 2007, Estonia became a target of a DDoS attack. The relocation of a Soviet-era war memorial unleashed a series of large and sustained DDoS attacks flooding networks or websites with attack traffic, rendering them inaccessible.\nThese attacks caused more than just confusion for the nation's population. At the time of these attacks, Estonia had essentially instituted an \"e-government\" where many aspects of the government were carried out online. In addition to bringing down many of Estonia's critical government and commercial websites, the cyber attacks also caused the emergency phone number used for calling ambulance and fire services to be unavailable for more than one hour. As a result, widespread social unrest and rioting left 150 people injured. Additionally, botnet managers had used malware to infect unsuspecting computers. Antonia Chayes asserted that the effects of the attack on Estonia did not appear to be proportional to their cause, which indicates how easily petty disputes can lead to serious consequences in the cyber age.\nIn 2008, Georgia became the target of similar attacks, though in this case they were carried out alongside conventional military actions. These cyber attacks mainly hindered the Georgian government's ability to communicate with both its citizens and other nations prior to and during the physical invasion by Russia, so as to weaken their ability to respond. Official Georgian websites, including those for the President's office, the Ministry of Foreign Affairs, and the Ministry of Defense were disabled. Even after the cease-fire between the nations was reached, major Georgian servers remained inoperable. The Russian-Georgian cyber conflict illustrates the havoc that can spread on the digital battlefield and re-energizes the debate over whether the laws of war could apply to this new kind of warfare.\nThe cyber attack against Georgia reveals the potential for a much larger threat. Had the hackers aimed their attacks at another state in tension with Georgia, they could have instigated the opening of another front in\nVOL.44:I WINTER 2020\nTHE FLETCHER FORUM OF WORLD AFFAIRS\nRussia's war on Georgia. Such covert action would be perfidious, yet the law of armed conflict falls short of explicitly prohibiting such conduct.\nBased on the analysis of the key characteristics of cyber attacks, the following issues should be outlined: (1) While traditional military weapons such as tanks and missiles tend to be monopolized by the state, cyberweapons can be created and used by anyone; (2) Cyberweapons are much more versatile than traditional military weapons—while traditional military weapons are used mainly to destroy, cyberweapons can be used for gathering information as well as destruction; (3) The targeted states have difficulty in defining who a cyber attacker is—states can support or employ third-party hacker groups to weaken opponents; (4) The results of cyber attacks are unpredictable—cyberweapons can cause similar or greater damage than traditional kinetic weapons.\nGiven these issues, cyber attacks present a litmus test for a nation's commitment to international law. The problem of attribution in cyberspace means that cyber attackers have the capability to coerce a state without the subsequent responsibility or punishment under international law. Therefore, the cyber attacker may experience great temptation to violate principles and obligations of international law to achieve the attacker's ends. Some experts have advocated for less online anonymity and more government control over the cyberspace infrastructure to combat this, and other solutions exist that create fewer domestic liberty concerns.\nCyber attacks provide a low-cost, remote, instantaneous, and powerful means of coercion or destruction, often without accountability. These attributes guarantee that state and non-state actors will continue to develop and unleash cyber attacks in the foreseeable future.\nTherefore, challenges coming from cyber attacks create new space for states and other actors to rethink the ambiguities of international norms, which were historically adopted to define rules related to traditional military operations. Current international legal framework for the use of force and armed attack must be analyzed to clarify the legality of cyber operations in the digital era, as no direct international legal regulations currently exist for understanding the concept of cyber operations.\n## INTERNATIONAL LEGAL REGULATION OF THE USE OF FORCE\n## Definition of the Use of Force in the Digital Era\nIn order to maintain international peace and security, the internal legal system of states gradually moved away from monopolizing the use of\nVOL. 44: I WINTER 2020\nA SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\nforce and now permits it only in the exceptional cases defined under international law. Contemporary international law regarding the use of force is based on the UN Charter. The authors of the Charter wished to ban all uses of force, but also provided for some exceptions to this ban, which are regulated by the Charter.\nOne of the reasons that the UN was created was to modernize international law in the twentieth century. Leaders decided to “establish conditions under which justice and respect for the obligations arising from treaties and other sources of international law can be maintained, and to save succeeding generations from the scourge of war, which twice in our lifetime has brought untold sorrow to mankind.”²⁶ Therefore, modern legal regulation of force and conflict began with the UN Charter. Article 2 (4) mandates that “all Members shall refrain in their international relations from the threat or use of force against the territorial integrity or political independence of any state, or in any other manner inconsistent with the purposes of the United Nations.”²⁷\nDue to the establishment of new operational domains and the use of cyber technological advances for weakening states’ critical infrastructure, the following questions should be asked: “Does Article 2 (4) of the UN Charter apply in cyberspace?” and “Do cyber attacks violate the general prohibition on the use of force?” Answering these questions will require a legal interpretation of Article 2 (4) of the UN Charter.\nWhile Article 2 (4) of the UN Charter mentions the threat or use of force, it does not mention war. The term “war” refers to a narrow and technical legal situation, which begins with a declaration of war and ends with a peace treaty. War was generally prohibited before the Second World War, but states found a way to avoid such prohibition. For example, Japan refused to declare war on China and instead called its military operations in Manchuria (1932-1941) “an incident” to avoid violating the prohibition of waging war. In light of such experiences, the term “use of force” was preferred because it covers all forms of hostilities, both technical wars and incidents falling short of an officially declared war, which range from minor border clashes to extensive military operations. Therefore, the prohibition of the use of force is not dependent on how the involved states prefer to define their military conflict.²⁸\nLegal precedent upholds that the term “use of force” should be broadly defined. In its argument on a case concerning Nicaragua, the International Court of Justice (ICJ) rejected a narrow interpretation of “use of force” that limits the term to the employment of either kinetic force or non-kinetic operations generating comparable effects. The Court held that\nVOL. 44: I WINTER 2020\nTHE FLETCHER FORUM OF WORLD AFFAIRS\na state's arming and training of guerrilla forces that would then be engaged in hostilities against another state qualified as a use of force, a position that has since become widely accepted. This logic leads to the conclusion that non-destructive cyber operations could be considered a use of force. For example, providing malware to a rebel group and training its members to employ that malware in a destructive manner would seemingly qualify.²⁹\nHowever, every unfriendly act does not cross the use of force threshold. In the case of Nicaragua, the Court held that financing guerrillas, while an unlawful \"intervention,\" did not rise to that level. Additionally, the drafters of the UN Charter rejected a proposal to further define economic coercion as a use of force. In this regard, the Group of International Experts, who authored the Tallinn Manual on the international law applicable to cyber warfare, unanimously agreed that any cyber operation causing greater than *de minimis* damage or injury suffices.³⁰\nOver time, both the reaction of states to cyber operations as well as how they characterize their own cyber operations will inform the process of interpretive maturation. The use of force threshold, wherever it may presently lie, will almost certainly drop in lock step with the increasing dependency of states on cyberspace. Although it is difficult to predict whether any bright-line test will materialize, or whether states will simply characterize \"use of force\" more liberally, a number of options for clarifying the threshold exist.³¹ In assessing whether an event constitutes a use of force in or through cyberspace, it is important to evaluate several factors: the context of the event, the actor perpetrating the action (recognizing challenging issues of attribution in cyberspace), the target and location, and the effects and intent. Commonly cited examples of cyber activity that could constitute a use of force include: (1) Operations that trigger a nuclear plant meltdown; (2) Operations that open a dam above a populated area, causing destruction; or (3) Operations that disable air traffic control, resulting in airplane crashes. These seem to be based on the logic that if the physical consequences of a cyber attack inflict comparable physical damage to dropping a bomb or firing a missile, that cyber attack should be considered a use of force.³²\nIt should be noted that an exact definition of the use of force is not given in the UN Charter. This means that if a cyber operation rises to the level of an act of violence, it represents a violation of the general prohibition of the use of force. However, exceptional circumstances to the general prohibition of the use of force are defined through the UN Charter. Thus, the legality of the use of force, including the use of cyberweapon, depends on the legal grounds which permit the use of force as an exceptional\nVOL. 44: I WINTER 2020\nmeasure. These grounds will be clarified in accordance with the current international legal framework in the next sub-section.\nLegal Basis of the Use of Force in Accordance with the United Nations Charter\nDespite the fact that the UN Charter was adopted in 1945 when the idea of cyberspace was still far in the future, cyberspace actors should still understand how international law can govern cyber attacks and cyber warfare.\nIn 2013, the Group of Governmental Experts of the United Nations published its third report on confidence building measures which, inter alia, promoted the further study of norms and the pursuit of consensus, and implied that the UN Charter applies to digital space.33 Moreover, in the Tallinn Manual 1.0 and Tallinn Manual 2.0, the International Experts analyze how existing international law applies to cyber warfare and cyber operations.\nTherefore, if a cyber attack reaches a threshold that threatens security and peace, the UN Security Council has the authority to make an appropriate decision. Particularly, the first exception to the general prohibition of the use of force falls under Article 39 of the UN Charter. Article 39 empowers the Security Council to “determine the existence of any threat to the peace, breach of the peace, or act of aggression, and to make recommendations, or decide what measures shall be taken to maintain or restore international peace and security.”34\nIn light of the above, if the UN Security Council considers the aforementioned measures inadequate for maintaining or restoring international peace and security, it may take actions defined by Article 42 of the UN Charter. Particularly, Article 42 indicates that enforcement measures may be taken by air, sea, or land forces of members of the United Nations.35 Simultaneously, the International Group of Experts agreed that any action undertaken based on this rule may be implemented by, or against, cyber capabilities.36\nThe UN Security Council resolutions are legally binding on the members of the United Nations, and they are obliged to follow these resolutions. According to Article 48 of the UN Charter, the action required to carry out the decisions of the Security Council for the maintenance of international peace and security shall be taken by all the Members of the United Nations or by some of them, as the Security Council may determine. Such decisions shall be carried out by the Members of the United Nations directly and through their action in the appropriate international agencies of which they are members.37\nTHE FLETCHER FORUM OF WORLD AFFAIRS\nIt should be noted that the UN Security Council faces obstacles in making decisions for maintaining or restoring international peace. It is a political body, and its decisions are based on political views rather than purely legal ones. No important decision can be made if one of the permanent members (the Russian Federation, the United Kingdom, France, China, and the United States of America) of the Security Council disagrees with it. Particularly, a veto power of the permanent member can hamper or block the process and make the Security Council incapable of acting on maintaining peace and security. This is a historical weakness of the collective security system.\nThe second exception to the general prohibition of the use of force is defined by Article 51 of the UN Charter, which states: \"Nothing in the present Charter shall impair the inherent right of individual or collective self-defense if an armed attack occurs against a Member of the United Nations, until the Security Council has taken measures necessary to maintain international peace and security.\"³⁸\nTaking into consideration the above, the use of cyber force is illegal and contradicts international law if there are no appropriate legal grounds for the use of force defined by the existing international legal framework or these actions are not sanctioned by the UN Security Council in accordance with Chapter 7 of the UN Charter.\n## REINTERPRETATION OF AN ARMED ATTACK\nThis chapter clarifies factors that can be used to define the effects of cyber attacks. Particularly, it aims to explore the level at which a cyber attack reaches that of an armed attack, and under which circumstances states can have the right to use individual or collective defense against a cyber attack as an armed attack.\nThe legal grounds for the right of individual and collective defense is an armed attack. This raises the need to precisely define the term \"armed attack.\" In its conclusion concerning the case of Nicaragua, the ICJ stated: \"an armed attack must be understood as including not merely action by regular armed forces across an international border, but also the sending by or on behalf of a State of armed bands, groups, irregulars or mercenaries, which carry out acts of armed force against another State of such gravity as to amount to (inter alia) an actual armed attack conducted by regular forces, or its substantial involvement therein.\" This description, contained in Article 3, paragraph (g), of the Definition of Aggression annexed to General Assembly Resolution 3314 (XXIX), may be taken to reflect\nVOL. 44: I WINTER 2020\nA SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\ncustomary international law. The Court sees no reason to deny that, in customary law, the prohibition of armed attacks may apply to the sending by a State of armed bands to the territory of another State, if such an operation, because of its scale and effects, would have been classified as an armed attack rather than as a mere frontier incident had it been carried out by regular armed forces.³⁹\nTo determine if a cyber attack has risen to the level of an armed attack, three competing views have emerged: (1) the instrument-based approach, (2) the target-based approach, and (3) the effects-based approach. The instrument-based approach focuses on the tools used in an attack, arguing that, to be an armed attack, the initiator must use traditional military weapons. The target-based approach focuses on what the attack is aimed at, thus meriting self-defense when the target is “a sufficiently important computer system.” The effects-based approach focuses on the overall impact of the attack, thus meriting self-defense when the attack is of sufficient gravity.⁴⁰\nThe self-defense component of Article 51 of the UN Charter was drafted consistent with the instrument-based approach. Michael Schmitt argues that the choice to use an instrument-based approach is not sufficient to address self-defense claims against cyber attacks. Because armed attacks inherently include kinetic military force and cyber attacks often utilize non-kinetic approaches, the instrument-based approach fails to encapsulate cyber attacks that do not look like armed attacks but have the same ultimate effect. Instead, he argues for an effects-based approach which would better address cyber attacks because it allows broader latitude for a state to respond in self-defense, though it is not a current norm in international law.⁴¹\nMichael Schmitt argues that a cyber attack’s effects should be measured against six factors: (1) severity: the type and scale of the harm; (2) immediacy: how quickly the harm materializes after the attack; (3) directness: the length of the causal chain between the attack and the harm; (4) invasiveness: the degree to which the attack penetrates the victim state’s territory; (5) measurability: the degree to which the harm can be quantified; and (6) presumptive legitimacy: the weight given to the fact that, in the field of cyber activities as a whole, cyber attacks constituting an armed attack are the exception rather than the rule.⁴²\nIn this regard, according to the Tallinn Manual 1.0, no international cyber incidents have been unambiguously and publicly characterized by the international community as reaching the threshold of an armed attack. Not even the 2007 cyber operations against Estonia, which were colloquially referred to as “cyber war,” were publicly described as such. The International Group of Experts agreed with this assessment on the basis\nVOL. 44: I WINTER 2020\nTHE FLETCHER FORUM OF WORLD AFFAIRS\nthat the scale and effects threshold of these cyber operations was not sufficiently met to deem it an armed attack.⁴³\nBased on the analysis of notions of the \"use of force\" and \"armed attack,\" it is important to note that all armed attacks are uses of force, and therefore all cyber operations that reach the threshold of armed attack will be considered uses of force. This distinction is important given the fact that an action that amounts to a use of force is a violation of Article 2(4) of the UN Charter, while an action reaching the threshold of armed attack could trigger an armed response from the victim state under Article 51 of the UN Charter.⁴⁴\nPrevious discussion has centered around state actors, but due to the nature of this new kind of war, the following question should be raised: \"Could an armed attack carried out by a non-state actor from abroad serve as legal grounds for the right of defense?\" The attacks of September 11, 2001 triggered discussions to determine whether the \"armed attack\" referred to in Article 51 of the UN Charter could include terrorist attacks, as the text itself does not clarify that an armed attack should be executed by a state.\nNevertheless, the ICJ has ruled that self-defense is limited to instances of states being attacked by other states. The Court circumscribed the applicability of the international legal order to certain actors, leaving others unregulated despite their actual participation in activities that affect world order. The majority of scholars accept that a strict insistence on state imputability is no longer tenable. The Court's restrictive approach is increasingly out of touch with the reality of non-state actors seen today.⁴⁵\nThe reaction of the international community to 9/11 illustrated that the concept of an armed attack is not limited to just state actors. In the aftermath of the terrorist attacks carried out against the United States, the UN Security Council recognized the American right to self-defense, and immediately codified it in appropriate resolutions.⁴⁶ This meant that such acts serve as grounds for enacting Article 51 of the UN Charter. NATO also weighed in and agreed that the terrorist attacks were directed from abroad against the United States and therefore were covered by Article 5 of the North Atlantic Treaty. This marked the only time in history that NATO made the decision to use the mechanism of collective defense.\nIn the context of cyber attacks, Professor Michael Schmitt posits that future cyber operations will challenge the ICJ's narrow interpretation of acceptable actors of armed attacks. He purports that non-state actors will soon turn to cyber operations to attack states, because cyberspace is a fertile environment for non-state actors who wish to do so, and because it is much easier for non-state actors to acquire the tools, such as destructive\nVOL. 44: I WINTER 2020\nA SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE\nmalware, that could impact vulnerable cyber systems than it is to acquire the kinetic means to conduct a traditional attack.⁴⁷\nGiven rapid technological advances, cyberweapons are now available to both state and non-state actors. States can indirectly carry out cyber attacks against other states through the use of hackers. In such cases, it is necessary to take into consideration the following aspects: (1) Cyber attacks can be conducted by a non-state actor under the support of a state; (2) Cyber attacks can be directed from the sponsor country against the other state; (3) Cyber attacks can reach the sufficient gravity of armed attack. Therefore, if a cyber attack carried out by a non-state actor meets these requirements, it could serve as a basis for individual or collective defense.\n# CONCLUSION\nTechnological advances have significantly changed not only the nature of battles, but the interpretation of the concept of armed attack itself. Current international legal regulations, including the UN Charter, apply to cyber attacks for the following reasons: (1) cyber attacks can reach a threshold that threatens a state's national security; and (2) the impact of cyber attacks can be as harmful to states as conventional attacks.\nIn view of the above, it is important to clarify key parameters of cyber attacks and cyber warfare, based on the reinterpretation of Article 51 of the UN Charter. First, an armed attack represents legal grounds for the use of an individual or collective defense mechanism. Second, because of the destructive nature of cyber attacks, interpretation of Article 51 of the UN Charter has been expanded to include cyber attacks as armed attacks. The International Group of Experts agreed that \"scale and effects\" are qualitative and quantitative factors that would apply when determining if a cyber operation qualifies as the gravest form of use of force (armed attack).⁴⁸ According to Tallinn Manual 1.0., cyber attacks rise to the level of an armed attack if they cause injury or death to persons or damage or destruction to objects.⁴⁹ Third, due to the reinterpretation of armed attacks, the notion of cyber attack should not be limited by the state actor as the sole possible perpetrator. The legal language of Article 51 of the UN Charter does not impose limitations on the execution of an armed attack by a state or a non-state actor. Given technological advances, it is highly possible that terrorist organizations will be able to create offensive cyber tools.\nBased on customary international norms, in cases of exercising the right of defense, states would consider the following elements: (1) Scope: is the incident widespread across a geographic area or industrial sectors? The\nVOL. 44: I WINTER 2020\nTHE FLETCHER FORUM OF WORLD AFFAIRS\nwider the attack, the more likely a state action will be; (2) Duration: is the incident a single event or does it last over time as part of a longer campaign? A state is more likely to act for extended incidents; (3) Intensity/Scale: has the incident caused death or substantial property destruction? If not, a state is unlikely to declare individual or collective defense; (4) External Actor: is the incident directed from a foreign or domestic adversary? A state is unlikely to act against a purely domestic foe.⁵⁰ States will have to consider these criteria if they use the right of defense against cyber attacks.\nIn light of the foregoing considerations, regardless of the lack of exact international legal regulation of cyber attacks and cyber warfare, reinterpretation of current international norms will reduce ambiguity and allow states to better mitigate cyber risks in the future. f"
    },
    "author_year": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 76,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "author_year"
      },
      "results": [],
      "flat_text": "HEINONLINE -- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License -- The search text of this PDF is generated from uncorrected OCR text.\n\nKhatuna Burkadze ## ABSTRACT In the digital era, information and communication technologies have changed the concept of an armed attack. However, there are many uncertainties regarding the applicability of existing international law to cyberspace. Existing international legal regulations do not address cyber warfare and cyber operations, as the UN Charter was adopted in 1945 when the creation of cyberspace was far in the future rather than a current consideration. Because of the gap between law and policy, the following questions should be pondered: (1) Can a cyber attack be considered as an armed attack—the gravest form of use of force under the international law? (2) If yes, how could the UN Charter be reinterpreted to clarify under which circumstances the inherent right of self-defense could be invoked against cyber attacks?\nKhatuna Burkadze is a graduate of The Fletcher School of Law and Diplomacy, Tufts University. Dr. Burkadze has been a Fulbright scholar at the MIT Center for International Studies as well as a visiting professor at Columbia University, Bard College, and The Fletcher School of Law and Diplomacy. She has successfully completed programs on negotiations and security studies at Harvard University and George C. Marshall European Center for Security Studies. Dr. Burkadze is an alumna of the U.S. Department of State's Program on American Foreign Policy as well as the author of dozens of articles and book chapters. Currently, she delivers lectures at the Caucasus International University and is employed by the Office of the Prime Minister of Georgia.\nVOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS # INTRODUCTION Cyberspace now represents a new and important operational domain for warfare, which is a challenge for both national and international security. Cyberspace is of particular concern, as according to the 2017 National Security Strategy of the United States of America, it offers state and non-state actors the ability to wage campaigns against the political, economic, and security interests of opponents without ever physically crossing borders. Cyber attacks offer adversaries low-cost and deniable opportunities to damage or disrupt critical infrastructure, economies, networks, and to disable the devices that people use each day to communicate and conduct business.¹ Joel Trachtman posits that the rise of cyberspace presents challenges to international law and global governance. First, information is much more mobile than it was prior to the rise of cyberspace, crossing national boundaries without interruption. Second, the rise of cyberspace enables a novel type of terrorism and warfare. These phenomena challenge the ability of the state to provide the services that it has traditionally provided. Often, this will make it more valuable for states to cooperate with one another and to use international law to do so.² The unwillingness of states, as well as non-state actors, to have their behavior in cyberspace regulated by specific, treaty-based rules reinforces this reality; these actors instead tend to take advantage of a lack of effective international regulation of their activities.³ States and international organizations must recognize that cyberspace has become a parallel universe in which the criminal, terrorist, or unlawful combatant can operate with a high degree of impunity. Adding to this challenge, privacy services, provided in the form of user anonymity and data encryption, make it difficult for law enforcement, intelligence organizations, and militaries to attribute actions in cyberspace (whether lawful or not) to specific individuals or state actors.⁴ Cyber-based challenges are evolving and arise from a wide array of unintentional and intentional sources. Unintentional threats can be caused by software upgrades or defective equipment that inadvertently disrupts systems. Intentional threats include both targeted and untargeted attacks from a variety of sources, including hackers, disgruntled employees, and foreign nations engaged in espionage and information warfare. These threat sources vary in terms of the capabilities of the actors, their willingness to act, and their motives, which can include monetary gain or political advantage.⁵ VOL. 44: I WINTER 2020 In view of the current realities, it is necessary to explore basic characteristics of cyber attacks and understand this notion of a new kind of warfare. Due to the sophisticated nature of cyber attacks and the rapid technological changes seen today, state actors need to find responsive and responsible international legal solutions for ensuring their security.\n## Cyber Attacks and Cyber Warfare as a New Form of an Armed Attack ### Definition of Cyber Attacks and Cyber Warfare There is no widely accepted definition of cyber attack or cyber warfare. For example, the U.S. Department of Defense uses the phrase “computer network attacks,” and defines it as “actions taken by using computer networks to disrupt, deny, degrade, or destroy information resident in computers and computer networks, or the computers and networks themselves.”6 Instead of “computer network attack,” the U.S. Army's Cyber Operations and Cyber Terrorism Handbook uses the term “cyber attack,” defining it as the “premeditated use of disruptive activities, or the threat thereof, against computers and/or networks, with the intention to cause harm or to further social, ideological, religious, political or similar objectives to intimidate any person in furtherance of such objectives.” Such harm could be inflicted on the computer network, as well as to physical facilities and persons. Cyber attacks involve “an aggressive act on the part of one adversary—whether an individual, a competing organization, or a rival government—against another in an ongoing struggle for hegemony in the marketplace or the political arena.” These differ from cyber crimes, which are governed by national criminal statutes and include acts such as identity theft and internet fraud.7 After establishing the Cyber Command of the United States, the Joint Chiefs of Staff published a lexicon in 2011 for military use in cyber operations. According to the document, a “cyber attack” is a hostile act using computer or related networks or systems and intended to disrupt and/or destroy an adversary's critical cyber systems, assets, or functions. A cyber attack may use intermediate delivery vehicles such as peripheral devices, electronic transmitters, embedded code, or human operators. The activation or effect of a cyber attack may be widely separated temporally and geographically from the delivery.8 A key feature of this definition is that it limits “cyber attacks” to hostile acts that are intended to harm critical THE FLETCHER FORUM OF WORLD AFFAIRS cyber systems—thus restricting the definition based on the objective of the attack.⁹ The Tallinn Manual provides interpretation of the existing international legal framework with regard to cyber issues. As stated in the Tallinn Manual, “a cyber attack is a cyber operation, whether offensive or defensive, that is reasonably expected to cause injury or death to persons or damage or destruction to objects.”¹⁰ Thus, cyber warfare and cyber attacks can be used to describe defending and attacking information and computer network activities in cyberspace. However, cyber attacks are not easy for states to combat because the process of determining the origin and nature of the attack and assessing the damage incurred is difficult.¹¹ Antonia Chayes asserted that factual uncertainty about the origins and nature of a cyber attack almost guarantees legal uncertainty under both international and domestic law.¹² In addition to these clarifications, the ultimate goal of warfare—victory—will not change in the future. The tactics of achieving this victory, however, are radically different in cyberspace. If there is a war between major world powers, the first victim of the conflict could be the Internet itself. There will be two broad categories of cyber attacks during a major war: one on military forces, in which the attacks would be conducted as part of a broader effort to disable the adversary’s weaponry and to disrupt military command-and-control systems; and the other on civilian infrastructure, in which the targets may include an adversary’s financial sector, industry, and national morale in order to diminish the adversary’s ability and will to wage war for extended periods.¹³ In addition to traditional war, cyber attacks are becoming a means to achieve political ends. A typical example is Internet stoppage in which perpetrators simultaneously log onto a site, connect to a server, send an e-mail, or make postings to forums in order to limit or even deny access to the site by other users. The Internet site or server is overwhelmed by access requests, causing an interruption or complete stoppage.¹⁴ In view of the above, it is important to note that communication technologies, used for offensive or defensive cyber attacks, are equally accessible to state and non-state actors in cyberspace. A computer can be both a target of attack or an instrument for carrying out a new form of war.\n## Key Characteristics of Cyber Attacks The growing number of known vulnerabilities increases the potential number of attacks. By exploiting software vulnerabilities, hackers who VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE spread malicious code can cause significant damage, ranging from defacing web sites to taking control of entire systems and thereby being able to read, modify, or delete sensitive information; disrupt operations; launch attacks against other organizations' systems; or altogether destroy them.[15] Distributed Denial of Service (DDoS) attacks have been the most prevalent form of cyber attack in recent years. In these attacks, coordinated botnets—collections of thousands of “zombie” computers hijacked by insidious viruses—overwhelm servers by systematically visiting designated websites.[16] In 2007, Estonia became a target of a DDoS attack. The relocation of a Soviet-era war memorial unleashed a series of large and sustained DDoS attacks flooding networks or websites with attack traffic, rendering them inaccessible.[17] These attacks caused more than just confusion for the nation's population. At the time of these attacks, Estonia had essentially instituted an\"e-government\"where many aspects of the government were carried out online. In addition to bringing down many of Estonia's critical government and commercial websites, the cyber attacks also caused the emergency phone number used for calling ambulance and fire services to be unavailable for more than one hour. As a result, widespread social unrest and rioting left 150 people injured.[18] Additionally, botnet managers had used malware to infect unsuspecting computers.[19] Antonia Chayes asserted that the effects of the attack on Estonia did not appear to be proportional to their cause, which indicates how easily petty disputes can lead to serious consequences in the cyber age.[20] In 2008, Georgia became the target of similar attacks, though in this case they were carried out alongside conventional military actions. These cyber attacks mainly hindered the Georgian government's ability to communicate with both its citizens and other nations prior to and during the physical invasion by Russia, so as to weaken their ability to respond. Official Georgian websites, including those for the President's office, the Ministry of Foreign Affairs, and the Ministry of Defense were disabled. Even after the cease-fire between the nations was reached, major Georgian servers remained inoperable. The Russian-Georgian cyber conflict illustrates the havoc that can spread on the digital battlefield and re-energizes the debate over whether the laws of war could apply to this new kind of warfare.[21] The cyber attack against Georgia reveals the potential for a much larger threat. Had the hackers aimed their attacks at another state in tension with Georgia, they could have instigated the opening of another front in VOL.44:I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS Russia's war on Georgia. Such covert action would be perfidious, yet the law of armed conflict falls short of explicitly prohibiting such conduct.[22] Based on the analysis of the key characteristics of cyber attacks, the following issues should be outlined: (1) While traditional military weapons such as tanks and missiles tend to be monopolized by the state, cyberweapons can be created and used by anyone; (2) Cyberweapons are much more versatile than traditional military weapons—while traditional military weapons are used mainly to destroy, cyberweapons can be used for gathering information as well as destruction;[23] (3) The targeted states have difficulty in defining who a cyber attacker is—states can support or employ third-party hacker groups to weaken opponents; (4) The results of cyber attacks are unpredictable—cyberweapons can cause similar or greater damage than traditional kinetic weapons.\nGiven these issues, cyber attacks present a litmus test for a nation's commitment to international law. The problem of attribution in cyberspace means that cyber attackers have the capability to coerce a state without the subsequent responsibility or punishment under international law. Therefore, the cyber attacker may experience great temptation to violate principles and obligations of international law to achieve the attacker's ends. Some experts have advocated for less online anonymity and more government control over the cyberspace infrastructure to combat this, and other solutions exist that create fewer domestic liberty concerns.[24] Cyber attacks provide a low-cost, remote, instantaneous, and powerful means of coercion or destruction, often without accountability. These attributes guarantee that state and non-state actors will continue to develop and unleash cyber attacks in the foreseeable future.[25] Therefore, challenges coming from cyber attacks create new space for states and other actors to rethink the ambiguities of international norms, which were historically adopted to define rules related to traditional military operations. Current international legal framework for the use of force and armed attack must be analyzed to clarify the legality of cyber operations in the digital era, as no direct international legal regulations currently exist for understanding the concept of cyber operations.\n## INTERNATIONAL LEGAL REGULATION OF THE USE OF FORCE ## Definition of the Use of Force in the Digital Era In order to maintain international peace and security, the internal legal system of states gradually moved away from monopolizing the use of VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE force and now permits it only in the exceptional cases defined under international law. Contemporary international law regarding the use of force is based on the UN Charter. The authors of the Charter wished to ban all uses of force, but also provided for some exceptions to this ban, which are regulated by the Charter.\nOne of the reasons that the UN was created was to modernize international law in the twentieth century. Leaders decided to “establish conditions under which justice and respect for the obligations arising from treaties and other sources of international law can be maintained, and to save succeeding generations from the scourge of war, which twice in our lifetime has brought untold sorrow to mankind.”²⁶ Therefore, modern legal regulation of force and conflict began with the UN Charter. Article 2 (4) mandates that “all Members shall refrain in their international relations from the threat or use of force against the territorial integrity or political independence of any state, or in any other manner inconsistent with the purposes of the United Nations.”²⁷ Due to the establishment of new operational domains and the use of cyber technological advances for weakening states’ critical infrastructure, the following questions should be asked: “Does Article 2 (4) of the UN Charter apply in cyberspace?” and “Do cyber attacks violate the general prohibition on the use of force?” Answering these questions will require a legal interpretation of Article 2 (4) of the UN Charter.\nWhile Article 2 (4) of the UN Charter mentions the threat or use of force, it does not mention war. The term “war” refers to a narrow and technical legal situation, which begins with a declaration of war and ends with a peace treaty. War was generally prohibited before the Second World War, but states found a way to avoid such prohibition. For example, Japan refused to declare war on China and instead called its military operations in Manchuria (1932-1941) “an incident” to avoid violating the prohibition of waging war. In light of such experiences, the term “use of force” was preferred because it covers all forms of hostilities, both technical wars and incidents falling short of an officially declared war, which range from minor border clashes to extensive military operations. Therefore, the prohibition of the use of force is not dependent on how the involved states prefer to define their military conflict.²⁸ Legal precedent upholds that the term “use of force” should be broadly defined. In its argument on a case concerning Nicaragua, the International Court of Justice (ICJ) rejected a narrow interpretation of “use of force” that limits the term to the employment of either kinetic force or non-kinetic operations generating comparable effects. The Court held that VOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS a state's arming and training of guerrilla forces that would then be engaged in hostilities against another state qualified as a use of force, a position that has since become widely accepted. This logic leads to the conclusion that non-destructive cyber operations could be considered a use of force. For example, providing malware to a rebel group and training its members to employ that malware in a destructive manner would seemingly qualify.²⁹ However, every unfriendly act does not cross the use of force threshold. In the case of Nicaragua, the Court held that financing guerrillas, while an unlawful\"intervention,\"did not rise to that level. Additionally, the drafters of the UN Charter rejected a proposal to further define economic coercion as a use of force. In this regard, the Group of International Experts, who authored the Tallinn Manual on the international law applicable to cyber warfare, unanimously agreed that any cyber operation causing greater than *de minimis* damage or injury suffices.³⁰ Over time, both the reaction of states to cyber operations as well as how they characterize their own cyber operations will inform the process of interpretive maturation. The use of force threshold, wherever it may presently lie, will almost certainly drop in lock step with the increasing dependency of states on cyberspace. Although it is difficult to predict whether any bright-line test will materialize, or whether states will simply characterize\"use of force\"more liberally, a number of options for clarifying the threshold exist.³¹ In assessing whether an event constitutes a use of force in or through cyberspace, it is important to evaluate several factors: the context of the event, the actor perpetrating the action (recognizing challenging issues of attribution in cyberspace), the target and location, and the effects and intent. Commonly cited examples of cyber activity that could constitute a use of force include: (1) Operations that trigger a nuclear plant meltdown; (2) Operations that open a dam above a populated area, causing destruction; or (3) Operations that disable air traffic control, resulting in airplane crashes. These seem to be based on the logic that if the physical consequences of a cyber attack inflict comparable physical damage to dropping a bomb or firing a missile, that cyber attack should be considered a use of force.³² It should be noted that an exact definition of the use of force is not given in the UN Charter. This means that if a cyber operation rises to the level of an act of violence, it represents a violation of the general prohibition of the use of force. However, exceptional circumstances to the general prohibition of the use of force are defined through the UN Charter. Thus, the legality of the use of force, including the use of cyberweapon, depends on the legal grounds which permit the use of force as an exceptional VOL. 44: I WINTER 2020 measure. These grounds will be clarified in accordance with the current international legal framework in the next sub-section.\nLegal Basis of the Use of Force in Accordance with the United Nations Charter Despite the fact that the UN Charter was adopted in 1945 when the idea of cyberspace was still far in the future, cyberspace actors should still understand how international law can govern cyber attacks and cyber warfare.\nIn 2013, the Group of Governmental Experts of the United Nations published its third report on confidence building measures which, inter alia, promoted the further study of norms and the pursuit of consensus, and implied that the UN Charter applies to digital space.33 Moreover, in the Tallinn Manual 1.0 and Tallinn Manual 2.0, the International Experts analyze how existing international law applies to cyber warfare and cyber operations.\nTherefore, if a cyber attack reaches a threshold that threatens security and peace, the UN Security Council has the authority to make an appropriate decision. Particularly, the first exception to the general prohibition of the use of force falls under Article 39 of the UN Charter. Article 39 empowers the Security Council to “determine the existence of any threat to the peace, breach of the peace, or act of aggression, and to make recommendations, or decide what measures shall be taken to maintain or restore international peace and security.”34 In light of the above, if the UN Security Council considers the aforementioned measures inadequate for maintaining or restoring international peace and security, it may take actions defined by Article 42 of the UN Charter. Particularly, Article 42 indicates that enforcement measures may be taken by air, sea, or land forces of members of the United Nations.35 Simultaneously, the International Group of Experts agreed that any action undertaken based on this rule may be implemented by, or against, cyber capabilities.36 The UN Security Council resolutions are legally binding on the members of the United Nations, and they are obliged to follow these resolutions. According to Article 48 of the UN Charter, the action required to carry out the decisions of the Security Council for the maintenance of international peace and security shall be taken by all the Members of the United Nations or by some of them, as the Security Council may determine. Such decisions shall be carried out by the Members of the United Nations directly and through their action in the appropriate international agencies of which they are members.37 THE FLETCHER FORUM OF WORLD AFFAIRS It should be noted that the UN Security Council faces obstacles in making decisions for maintaining or restoring international peace. It is a political body, and its decisions are based on political views rather than purely legal ones. No important decision can be made if one of the permanent members (the Russian Federation, the United Kingdom, France, China, and the United States of America) of the Security Council disagrees with it. Particularly, a veto power of the permanent member can hamper or block the process and make the Security Council incapable of acting on maintaining peace and security. This is a historical weakness of the collective security system.\nThe second exception to the general prohibition of the use of force is defined by Article 51 of the UN Charter, which states:\"Nothing in the present Charter shall impair the inherent right of individual or collective self-defense if an armed attack occurs against a Member of the United Nations, until the Security Council has taken measures necessary to maintain international peace and security.\"³⁸ Taking into consideration the above, the use of cyber force is illegal and contradicts international law if there are no appropriate legal grounds for the use of force defined by the existing international legal framework or these actions are not sanctioned by the UN Security Council in accordance with Chapter 7 of the UN Charter.\n## REINTERPRETATION OF AN ARMED ATTACK This chapter clarifies factors that can be used to define the effects of cyber attacks. Particularly, it aims to explore the level at which a cyber attack reaches that of an armed attack, and under which circumstances states can have the right to use individual or collective defense against a cyber attack as an armed attack.\nThe legal grounds for the right of individual and collective defense is an armed attack. This raises the need to precisely define the term\"armed attack.\"In its conclusion concerning the case of Nicaragua, the ICJ stated:\"an armed attack must be understood as including not merely action by regular armed forces across an international border, but also the sending by or on behalf of a State of armed bands, groups, irregulars or mercenaries, which carry out acts of armed force against another State of such gravity as to amount to (inter alia) an actual armed attack conducted by regular forces, or its substantial involvement therein.\"This description, contained in Article 3, paragraph (g), of the Definition of Aggression annexed to General Assembly Resolution 3314 (XXIX), may be taken to reflect VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE customary international law. The Court sees no reason to deny that, in customary law, the prohibition of armed attacks may apply to the sending by a State of armed bands to the territory of another State, if such an operation, because of its scale and effects, would have been classified as an armed attack rather than as a mere frontier incident had it been carried out by regular armed forces.³⁹ To determine if a cyber attack has risen to the level of an armed attack, three competing views have emerged: (1) the instrument-based approach, (2) the target-based approach, and (3) the effects-based approach. The instrument-based approach focuses on the tools used in an attack, arguing that, to be an armed attack, the initiator must use traditional military weapons. The target-based approach focuses on what the attack is aimed at, thus meriting self-defense when the target is “a sufficiently important computer system.” The effects-based approach focuses on the overall impact of the attack, thus meriting self-defense when the attack is of sufficient gravity.⁴⁰ The self-defense component of Article 51 of the UN Charter was drafted consistent with the instrument-based approach. Michael Schmitt argues that the choice to use an instrument-based approach is not sufficient to address self-defense claims against cyber attacks. Because armed attacks inherently include kinetic military force and cyber attacks often utilize non-kinetic approaches, the instrument-based approach fails to encapsulate cyber attacks that do not look like armed attacks but have the same ultimate effect. Instead, he argues for an effects-based approach which would better address cyber attacks because it allows broader latitude for a state to respond in self-defense, though it is not a current norm in international law.⁴¹ Michael Schmitt argues that a cyber attack’s effects should be measured against six factors: (1) severity: the type and scale of the harm; (2) immediacy: how quickly the harm materializes after the attack; (3) directness: the length of the causal chain between the attack and the harm; (4) invasiveness: the degree to which the attack penetrates the victim state’s territory; (5) measurability: the degree to which the harm can be quantified; and (6) presumptive legitimacy: the weight given to the fact that, in the field of cyber activities as a whole, cyber attacks constituting an armed attack are the exception rather than the rule.⁴² In this regard, according to the Tallinn Manual 1.0, no international cyber incidents have been unambiguously and publicly characterized by the international community as reaching the threshold of an armed attack. Not even the 2007 cyber operations against Estonia, which were colloquially referred to as “cyber war,” were publicly described as such. The International Group of Experts agreed with this assessment on the basis VOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS that the scale and effects threshold of these cyber operations was not sufficiently met to deem it an armed attack.⁴³ Based on the analysis of notions of the\"use of force\"and\"armed attack,\"it is important to note that all armed attacks are uses of force, and therefore all cyber operations that reach the threshold of armed attack will be considered uses of force. This distinction is important given the fact that an action that amounts to a use of force is a violation of Article 2(4) of the UN Charter, while an action reaching the threshold of armed attack could trigger an armed response from the victim state under Article 51 of the UN Charter.⁴⁴ Previous discussion has centered around state actors, but due to the nature of this new kind of war, the following question should be raised:\"Could an armed attack carried out by a non-state actor from abroad serve as legal grounds for the right of defense?\"The attacks of September 11, 2001 triggered discussions to determine whether the\"armed attack\"referred to in Article 51 of the UN Charter could include terrorist attacks, as the text itself does not clarify that an armed attack should be executed by a state.\nNevertheless, the ICJ has ruled that self-defense is limited to instances of states being attacked by other states. The Court circumscribed the applicability of the international legal order to certain actors, leaving others unregulated despite their actual participation in activities that affect world order. The majority of scholars accept that a strict insistence on state imputability is no longer tenable. The Court's restrictive approach is increasingly out of touch with the reality of non-state actors seen today.⁴⁵ The reaction of the international community to 9/11 illustrated that the concept of an armed attack is not limited to just state actors. In the aftermath of the terrorist attacks carried out against the United States, the UN Security Council recognized the American right to self-defense, and immediately codified it in appropriate resolutions.⁴⁶ This meant that such acts serve as grounds for enacting Article 51 of the UN Charter. NATO also weighed in and agreed that the terrorist attacks were directed from abroad against the United States and therefore were covered by Article 5 of the North Atlantic Treaty. This marked the only time in history that NATO made the decision to use the mechanism of collective defense.\nIn the context of cyber attacks, Professor Michael Schmitt posits that future cyber operations will challenge the ICJ's narrow interpretation of acceptable actors of armed attacks. He purports that non-state actors will soon turn to cyber operations to attack states, because cyberspace is a fertile environment for non-state actors who wish to do so, and because it is much easier for non-state actors to acquire the tools, such as destructive VOL. 44: I WINTER 2020 A SHIFT IN THE HISTORICAL UNDERSTANDING OF ARMED ATTACK AND ITS APPLICABILITY TO CYBERSPACE malware, that could impact vulnerable cyber systems than it is to acquire the kinetic means to conduct a traditional attack.⁴⁷ Given rapid technological advances, cyberweapons are now available to both state and non-state actors. States can indirectly carry out cyber attacks against other states through the use of hackers. In such cases, it is necessary to take into consideration the following aspects: (1) Cyber attacks can be conducted by a non-state actor under the support of a state; (2) Cyber attacks can be directed from the sponsor country against the other state; (3) Cyber attacks can reach the sufficient gravity of armed attack. Therefore, if a cyber attack carried out by a non-state actor meets these requirements, it could serve as a basis for individual or collective defense.\n# CONCLUSION Technological advances have significantly changed not only the nature of battles, but the interpretation of the concept of armed attack itself. Current international legal regulations, including the UN Charter, apply to cyber attacks for the following reasons: (1) cyber attacks can reach a threshold that threatens a state's national security; and (2) the impact of cyber attacks can be as harmful to states as conventional attacks.\nIn view of the above, it is important to clarify key parameters of cyber attacks and cyber warfare, based on the reinterpretation of Article 51 of the UN Charter. First, an armed attack represents legal grounds for the use of an individual or collective defense mechanism. Second, because of the destructive nature of cyber attacks, interpretation of Article 51 of the UN Charter has been expanded to include cyber attacks as armed attacks. The International Group of Experts agreed that\"scale and effects\"are qualitative and quantitative factors that would apply when determining if a cyber operation qualifies as the gravest form of use of force (armed attack).⁴⁸ According to Tallinn Manual 1.0., cyber attacks rise to the level of an armed attack if they cause injury or death to persons or damage or destruction to objects.⁴⁹ Third, due to the reinterpretation of armed attacks, the notion of cyber attack should not be limited by the state actor as the sole possible perpetrator. The legal language of Article 51 of the UN Charter does not impose limitations on the execution of an armed attack by a state or a non-state actor. Given technological advances, it is highly possible that terrorist organizations will be able to create offensive cyber tools.\nBased on customary international norms, in cases of exercising the right of defense, states would consider the following elements: (1) Scope: is the incident widespread across a geographic area or industrial sectors? The VOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS wider the attack, the more likely a state action will be; (2) Duration: is the incident a single event or does it last over time as part of a longer campaign? A state is more likely to act for extended incidents; (3) Intensity/Scale: has the incident caused death or substantial property destruction? If not, a state is unlikely to declare individual or collective defense; (4) External Actor: is the incident directed from a foreign or domestic adversary? A state is unlikely to act against a purely domestic foe.⁵⁰ States will have to consider these criteria if they use the right of defense against cyber attacks.\nIn light of the foregoing considerations, regardless of the lack of exact international legal regulation of cyber attacks and cyber warfare, reinterpretation of current international norms will reduce ambiguity and allow states to better mitigate cyber risks in the future. f"
    }
  },
  "citation_summary": {
    "style": "hybrid",
    "dominant_bucket": "tex",
    "dominant": {
      "intext_total": 17.0,
      "success_occurrences": 17.0,
      "success_unique": 17.0,
      "bib_unique_total": 100.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 0.17,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 27.0,
      "highest_intext_index": 44.0,
      "missing_footnotes_for_seen_total": 0.0,
      "uncited_footnote_total": 33.0,
      "style": "hybrid"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 17.0,
        "success_occurrences": 17.0,
        "success_unique": 17.0,
        "bib_unique_total": 100.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.17,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 27.0,
        "highest_intext_index": 44.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 33.0,
        "style": "hybrid"
      },
      "numeric": {
        "intext_total": 2.0,
        "success_occurrences": 2.0,
        "success_unique": 2.0,
        "bib_unique_total": 16.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.125,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 76.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "A Shift in the Historical Understanding of Armed Attack and Its Applicability to Cyberspace",
    "subtitle": "",
    "document_type": "book_chapter",
    "venue": "",
    "publication_year": null,
    "authors": [
      "Khatuna Burkadze"
    ],
    "affiliations": [],
    "emails": [],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "In the digital era, information and communication technologies have changed the concept of an armed attack. However, there are many uncertainties regarding the applicability of existing international law to cyberspace. Existing international legal regulations do not address cyber warfare and cyber operations, as the UN Charter was adopted in 1945 when the creation of cyberspace was far in the future rather than a current consideration. Because of the gap between law and policy, the following questions should be pondered: (1) Can a cyber attack be considered as an armed attack—the gravest form of use of force under the international law? (2) If yes, how could the UN Charter be reinterpreted to clarify under which circumstances the inherent right of self-defense could be invoked against cyber attacks? Khatuna Burkadze is a graduate of The Fletcher School of Law and Diplomacy, Tufts University. Dr. Burkadze has been a Fulbright scholar at the MIT Center for International Studies as well as a visiting professor at Columbia University, Bard College, and The Fletcher School of Law and Diplomacy. She has successfully completed programs on negotiations and security studies at Harvard University and George C. Marshall European Center for Security Studies. Dr. Burkadze is an alumna of the U.S. Department of State's Program on American Foreign Policy as well as the author of dozens of articles and book chapters. Currently, she delivers lectures at the Caucasus International University and is employed by the Office of the Prime Minister of Georgia. VOL. 44: I WINTER 2020 THE FLETCHER FORUM OF WORLD AFFAIRS",
    "keywords": [],
    "publication_dates": {},
    "identifiers": {
      "doi": [],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "https://heinonline.org/HOL/License"
      ]
    },
    "references_block_count": 1,
    "references_entries_estimated": 51,
    "heading_count": 11,
    "max_heading_level": 3,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "title_looks_like_mid_paragraph_sentence",
        "no_identifier"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 17,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 1.0,
      "footnote_coverage": 1.0,
      "unique_index_count": 17
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "hybrid",
      "recommended_style": "numeric",
      "aligned": true,
      "signals": {
        "superscript_hits": 31,
        "superscript_definition_lines": 0,
        "numeric_bracket_hits": 11,
        "numeric_endnote_lines": 0,
        "author_year_hits": 0
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 100.0,
      "dominant_bib_coverage_rate": 0.17,
      "dominant_link_target": "footnotes",
      "dominant_unresolved_flag": "unresolved_footnote_links"
    },
    "heading_validation": {
      "heading_count": 11,
      "max_heading_level": 3,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": true,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": false,
        "emails": false,
        "orcids": false,
        "abstract": true,
        "keywords": false,
        "venue": false,
        "persistent_identifier": false,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 1,
        "affiliations": 0,
        "emails": 0,
        "orcids": 0,
        "keywords": 0,
        "doi": 0,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 1
      },
      "coverage": {
        "core_coverage": 0.6666666666666666,
        "email_author_link_rate": 0.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "title_looks_like_mid_paragraph_sentence",
          "no_identifier"
        ],
        "toc_dot_lines": 0
      },
      "flags": [
        "meta_missing_persistent_identifier"
      ]
    },
    "flags": [
      "low_bib_coverage",
      "meta_missing_persistent_identifier"
    ]
  },
  "updated_at_utc": "2026-02-14T08:28:42.182482+00:00"
}