{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\2P8WTWEJ\\TTWFXCVM.pdf",
  "custom_id": "10",
  "response": {
    "id": "batch-b6235e9e-11-b61542b2-5880-48e9-b4fc-6cd128cdadb4",
    "custom_id": "10",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "HEINONLINE\n\nDATE DOWNLOADED: Thu Jul 3 08:42:39 2025\nSOURCE: Content Downloaded from HeinOnline\n\n## Citations:\n\nPlease note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n\n## Bluebook 21st ed.\n\nValluri Parthasarthi, Cyberspace and Non-State Actors: The State's International Obligation, 2 INDIAN J.L. &amp; LEGAL RSCH. 1 (June-July 2021).\n\n## ALWD 7th ed.\n\nValluri Parthasarthi, Cyberspace and Non-State Actors: The State's International Obligation, 2 Indian J.L. &amp; Legal Rsch. 1 (2021).\n\n## APA 7th ed.\n\nParthasarthi, Valluri. (2021). Cyberspace and non-state actors: the state's international obligation. Indian Journal of Law and Legal Research, 2(1), 1-12.\n\n## Chicago 17th ed.\n\nValluri Parthasarthi, \"Cyberspace and Non-State Actors: The State's International Obligation,\" Indian Journal of Law and Legal Research 2, no. 1 (June-July 2021): 1-12\n\n## McGill Guide 10th ed.\n\nValluri Parthasarthi, \"Cyberspace and Non-State Actors: The State's International Obligation\" (2021) 2:1 Indian JL &amp; Legal Rsch 1.\n\n## AGLC 4th ed.\n\nValluri Parthasarthi, 'Cyberspace and Non-State Actors: The State's International Obligation' (2021) 2(1) Indian Journal of Law and Legal Research 1\n\n## MLA 9th ed.\n\nParthasarthi, Valluri. \"Cyberspace and Non-State Actors: The State's International Obligation\" Indian Journal of Law and Legal Research, vol. 2, no. 1, June-July 2021, pp. 1-12. HeinOnline.\n\n## OSCOLA 4th ed.\n\nValluri Parthasarthi, 'Cyberspace and Non-State Actors: The State's International Obligation' (2021) 2 Indian JL &amp; Legal Rsch 1 x Please note: citations are provided as a general guideline. Users should consult their preferred citation format's style manual for proper citation formatting.\n\nCite this document\n\nPinCite this document\n\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1667,
              "width": 1112
            }
          },
          {
            "index": 1,
            "markdown": "Indian Journal of Law and Legal Research\n\nVolume II Issue I | ISSN: 2582 8878\n\n# CYBERSPACE AND NON-STATE ACTORS: THE STATE'S INTERNATIONAL OBLIGATION\n\nValluri Parthasarthi, ICFAI University\n\n## Classification of Cyber conflict\n\nOne of the concerns in international humanitarian law is that of the classification of Cyber conflict¹, Classification of conflict is the first step in international humanitarian law as the identification determines legal subjects² which are to be applied to it. It is essential to determine the character of the Cyber conflict, whether international or Non-international in nature. But prior to the inception of Geneva convention, Lassa Oppenheim’s definition of war was well accepted, which stated, “war is a contention between two or more States, through their armed forces, for the purpose of overpowering each other an imposing such conditions of peace as the victor pleases to be”³. The key element in the mentioned definition is that the, conflict must have happened between two States. However the interstate conflict within the State was considered a non-international conflict unless it reaches a certain degree of belligerency. The term ‘belligerency’ and its implications have been discussed in United Kingdom’s ministry’s manual of Law and Armed conflict⁴. After the carnage of the Second World War the international community took a different step in recognizing war in technical and material sense, hence developed into international customary law. Articles 2, 3 which are common for all the four Geneva Conventions there are two certain criteria which can be established to determine the international armed conflict that there is a confrontation between two States and the hostilities shall amount to armed conflict. According to Article 3, the armed conflict is not of an international nature but occurring in the territory of one of the contracting parties. The\n\n¹ International humanitarian law distinguishes two types of armed conflicts, namely, international armed conflicts, opposing two or more States, and non-international armed conflicts, between governmental forces and nongovernmental armed groups, or between such groups only. IHL treaty law also establishes a distinction between non-international armed conflicts in the meaning of common Article 3 of the Geneva Conventions of 1949 and non-international armed conflicts falling within the definition provided in Art. 1 of Additional Protocol II.\n\n² States and non-State actors like individuals, international organizations, multinational companies and international non-government organizations are regulated by, or subjected to, international law. They are called subjects of international law\n\n³ L Oppenheim, International Law: A Treatise II (Longman, Green and Co 1906) 56.\n\n⁴ UK Ministry of Defence, The Manual of the Law of Armed Conflict (2004) paragraph, 15.1.2. on belligerency",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 2,
            "markdown": "Indian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n\nInternational Committee of Red Cross (ICRC) in the year 1949 broadened the scope of international armed conflict by its additional protocol I and II to the Geneva Conventions. The nature of armed conflict and the acts under it which constitute is mentioned under this Article⁵. Geneva conventions and its additional protocols, conflict can be broadly classified into three categories they are:\n\na. International armed conflict between States.\nb. worldwide outfitted clash including national freedom developments⁶.\nc. Non-international armed conflict between a State and armed groups or organized armed groups.\n\nThe first and third are recognized as customary classifications of conflict.\n\n## International Cyber conflict\n\nIt may be noted that for armed conflict there must be armed forces and it shall be international in nature (between States). It has to be further noted that, Cyber attacks are not aggressive and kinetic in nature per se. There are no weapons involved. Therefore at first instance, it can be deduced that Cyber-attacks are not armed in nature, such a deduction shall be dangerous and harmful to the Countries.\n\nAccording to Article 49 (1) of the Additional Protocol- 1 defines attacks. “as act of violence against the adversary either in attack or defence”. Similarly, the International Criminal Tribunal for former Yugoslavia in the case of Tadiac⁷, said “resorting to armed force between States without recognizing any threshold for the duration or intensity of hostilities”. However, Cyber-attacks are not violent in nature but can trigger vehement circumstances. Hence, the classification of a cyber conflict requires nuanced examination.\n\n---\n\n⁵ Protocol Additional to the Geneva Conventions of 12 August 1949, and Relating to the Protection of Victims of Non-International Armed Conflicts (Protocol II)- Article 1 - Material field of application- 1. This Protocol, which develops and supplements Article 3 common to the Geneva Conventions of 12 August 1949 without modifying its existing conditions of application, shall apply to all armed conflicts which are not covered by Article 1 of the Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol I) and which take place in the territory of a High Contracting Party between its armed forces and dissident armed forces or other organized armed groups which, under responsible command, exercise such control over a part of its territory as to enable them to carry out sustained and concerted military operations and to implement this Protocol. 2- This Protocol shall not apply to situations of internal disturbances and tensions, such as riots, isolated and sporadic acts of violence and other acts of a similar nature, as not being armed conflicts.\n\n⁶ Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol 1)- Article 1(4)\n\n⁷ Prosecutor v. Dusko Tadic (Appeal Judgement), IT-94-1-A, International Criminal Tribunal for the former Yugoslavia (ICTY), 15 July 1999.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 3,
            "markdown": "Indian Journal of Law and Legal Research\n\nVolume II Issue I | ISSN: 2582 8878\n\nIt is also pertinent to note that, according to the additional protocols to the Geneva Conventions, any hostility between the nations which results in the intervention of the members of the armed forces, it makes no difference as far as the intensity and duration of the conflict is concerned, as it is considered as an international conflict⁸, Thus, a Cyber-attack will fall under ambit of ‘armed’ under International Humanitarian Law. The ICRC⁹ has taken a position on Cyber-attacks that, anything which disables an object is also an attack when it does not cause physical damage¹⁰; this is a reasonable motion considering the extension for the notion of damage so is concerned. Since the operation is an attack, it is also armed in terms of qualification for armed conflict. That said, a de minimis standard should attach.\n\nIn addition to the attack being ‘armed’ it also has to be ‘international’ in nature. By the term international, it means an act by State or an act attributable by the State in a conflict. By the plain context of the arrangements referred to over, those led by a State's military qualify. In spite of the fact that Cyber-attack is not being specified in any of those arrangements, the author believes it is reasonable to attribute that the digital assaults by some of the law enforcement officers of the State qualify¹¹ this analysis. The ICTY in this regard established in the case of Prosecutor v. Tadiac that, “Private individuals along or within the frame work of armed forces or in connection with the State authorities shall be deemed to be considered as a State organs¹².” Thus, it can be established that any attacks launched by the State, shall be deemed to have been launched by the State organs or by the individuals who were authorized to use the Cyber infrastructure on behalf of the State. A situation might arise, where in a relationship between a State and individual arise in conducting Cyber-attacks might not fall under the ambit of State organ or individuals acting on behalf of the State, the ICTY has declared that “overall control going beyond the mere financing and equipping of such forces and involving also participation in the planning and supervision of military operations”¹³. In order to establish the term “overall control” and “international conflict”, the State must issue specific instructions or directives aimed at committing certain attacks. The obligation of the State not to facilitate or attribute any Cyber- attacks shall be discussed in the later stage of this Article.\n\n⁸ Y Sandoz and others (eds), Commentary on the Additional Protocols of 8 June 1977 to the Geneva Conventions of 12 August 1949 (Martinus Nijhof 1988) (AP Commentary) para 62\n\n⁹ 32nd International Conference: Resolutions and reports- www.icrc.org available at https://www.icrc.org/en/document/outcomes-32nd-international-conference-red-cross-and-red-crescent; last visited on April 27th, 2017.\n\n¹⁰ Supra 9\n\n¹¹ Article 4 - Conduct of organs of a State, International Law Commission Report, A/56/10 August 2001.\n\n¹² Supra 7\n\n¹³ Supra 7",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 4,
            "markdown": "Indian Journal of Law and Legal Research\n\nVolume II Issue I | ISSN: 2582 8878\n\n# Non-International Cyber Conflict\n\nThe concept of Non-International armed conflict has been defined in negative by the common Article 3 in the Geneva conventions. Any violence between State’s armed groups and dissident armed groups within a State can be defined as Non-International armed conflict. The Additional Protocol – II, has also defined Non international armed conflict as a hostility between State’s forces and organized opposing armed forces. Hence, the two ingredients in determining the Non-International armed conflict are (i) participation by an organized armed group and (ii) with a particular level of intensity. According to common Article 3, the groups must be armed and organized for it to be considered as a party in the conflict. The ICTY has defined this element of it in the case of Prosecutor v. Limaj¹⁴, “some degree of organisation by the parties will suffice to establish the existence of an armed conflict. This degree need not be the same as that required for establishing the responsibility of superiors for the acts of their subordinates within the organization, as no determination of individual criminal responsibility is intended under this provision of the Statute”¹⁵. The group shall be organized, the term organized means acting in a cordial manner and capability to engage in violence in mission planning, sharing intelligence and exercising command and control, it is necessary for a group to possess these fundamentals to be considered as a party to the conflict. From the above it is clear that individuals who conduct Cyber-attacks against State cannot meet the organized criteria. Cyber-attacks conducted by a group on online are a bit difficult to classify because the members of the group might not know each other in their operations, however they act in a coordinated manner like setting objectives, identify the weakness in the system, injection of malware and maintain defences, all these activities are performed together in a coordinated manner. One of the other criterion to be met is the group shall be under the responsible command, it is not essential to have a hierarchical order of armed force but if capable of planning and executing operations, then it fall under this definition. In virtual organized group, this criteria can be met because of the nature of the operation carried for which it can be equated to military operations.\n\nIn summation to being organized, the group must also be armed. The meaning of armed in the Non-international armed conflict a be parallel comparison can be made to international armed conflict. As discussed above, it generally assumes the conduct of ‘attacks’. Yet, since Non-international armed conflict is ascertained on the activities of a group, as distinct from a State, the question of attribution of an individual member’s conduct to the group as a whole arises.\n\n¹⁴ Prosecutor V. Fatmir Limaj Haradin Bala Isak Musliu, It-03-66-T (2005)\n\n¹⁵ Paragraph 89, supra 14",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 5,
            "markdown": "Indian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n\nSince it is the group that must be armed, the group itself must have a purpose of carrying out armed activities. If individual members of an organized group carry out Cyber attacks on their own accord, that is, not on behalf of the group, the group does not meet the armed criterion.\n\n## Non State Actors and ungoverned spaces\n\nThe concept of Non-State Actors and its presence in international law has increased steadily in past few decades. The Non-State actors are endowed with infrastructural, economic and institutional power but do not have any corresponding legal duties. The Non-State actors actions in recent times have amounted to gross violation to human rights and have committed violence to the largest degree possible, the impact of Non-State actors on international scenario has been immense hence the United Nations Security Council in the year 2004 passed resolution 1540, which says, “the States are required to refrain from providing any goods, services to or supporting Non State Actors s which develop, obtain, construct or transfer or use chemical weapons¹⁶.” Historically, the international norms have failed to address the imbalance between legal obligation and duties of the Non-State Actors. The concept of Non-State actors can be understood as an entity, which is not actually a State and usually referred to armed, religious or civil groups. The CONTONOU defines Non State actors on a broader scale as, “The actors of cooperation will include: a: State (local, national and regional), b: Non-State: - Private Sector; - Economic and social partners, including trade union organizations; - Civil society in all its forms according to national characteristics¹⁷”. The Non-State actors do not have any affiliation with the official State authorities nor have any financial/legal framework with reference to the States, they are often treated as new subjects of international law. The international law in recent times have undergone significant changes and attempts being made to reduce the gap between Non-State actors and international law paradigm. As said by Nicolas PM, “Nowadays international law reaches beyond nations, many acts such as certain criminal acts, trade, finance, commercial relationships, environmental issues, human rights and more. Now international law directly touches many individuals”¹⁸. With reference to Cyber-attacks,\n\n¹⁶ United Nations Security Council, Resolution 1540 (2004), Non-Proliferation of Weapons of Mass Destruction, 28 April 2004\n¹⁷ Partnership Agreement Between the Members of the AFRICAN, CARIBEAN and PACIFIC Group of States of The One Part, and the European Community and its Member States, of the Other Part, Signed in COTONOU, BENIN ON 23 JUNE 2000. http://www.europarl.europa.eu available at http://www.europarl.europa.eu/intcoop/acp/03_01/pdf/mn3012634_en.pdf, last visited on April 13th, 2017.\n¹⁸ Rajkovic, N. M. (2012) “Global law” and governmentality: Reconceptualizing the ‘rule of law’ as rule ‘through’ law’, European Journal of International Relations, 18(1), 29–52.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 6,
            "markdown": "Indian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n\nISIS (Islamic State) operates from territories such as Syria and Iraq and engages in criminal Cyber activities. Lately, ISIS is adept in using the internet for its own uses and in creating its own Cyber army, groups such as Cyber Caliphate, Islamic State Hacking Division, Islamic Cyber Army and Sons Caliphate army are the various Cyber attacking groups which carried out attacks on numerous networks such as hacking of Tony Blair (former Prime Minister U.K) and attacks on various governmental bodies and military organizations. The attack on destabilizing a French T.V network (tv5monde) and by propagating terror activities and execution videos on national network created panic and distress in international communities, later the France government in its official press release claimed it to be an act of terrorism and further using the official U.S Central command's YouTube account and telecasted terrorist propaganda videos, which was used for its recruitment purposes. All these activities were carried out from a State and using Cyber infrastructure, the liability of the State with regards to Cyber warfare has been a concern in international law.\n\n## State Obligation\n\nIt is an established principle in the international law, that States have inherent responsibility on its part to prevent cross border acts which are prohibited under international law. With reference to current international law, there are particularly four categories of offences which is an Obligation for the States to criminalise, they are offences against confidentiality, integrity and availability of Computer Systems, computer relates offences (Forgery, fraud) and offences related to Copyrights and related rights¹⁹.\n\nAs discussed above the presence of Non-State actors in the international arena have been in ascendance, and the alleged acts committed by Non-State actors had caused considerable damage to the aggrieved countries. The States are obligated to obviate their Cyber framework from being exploited in any manner which is harmful to the international legal framework. The obligation consists of having a legal infrastructure domestically to prevent Cyber attacks and to take stringent measures against the offenders and also having a reasonable knowledge or anticipation the threat which might loom from their Cyber set up. The characteristics such as anonymity, accessibility and trans-borderless activities has privileged the Non-State Actors to operate within the States. In a colloquial sense, the States are not responsible for the acts of the\n\n¹⁹ ETS 185 – Cybercrime (Convention), 23.XI.2001, Additional Protocol to the Convention on Cyber Crime (Council Of Europe) adopted on 23rd November 2001) adopted in the year 2001.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 7,
            "markdown": "Indian Journal of Law and Legal Research\n\nVolume II Issue I | ISSN: 2582 8878\n\nNon-State Actors; mere geographical and territorial link is not enough to hold the State responsible, the State can be held responsible under two circumstances in doing so, the draft Articles on State Responsibility on internationally wrongful Acts has to be considered. The text was adopted in the 53rd Session as submitted to the General Assembly in the year 2001. Article 2 States that, “Elements of an internationally wrongful act of a State\n\nThere is an internationally wrongful act of a State when conduct consisting of an action or omission:\n\n(a) is attributable to the State under international law; and\n\n(b) It Constitutes a breach of an international obligation of the State.”\n\nBy the above Article the State can be held responsible for the actions of the Non-State Actors if it is an internationally wrongful act which can be attributed to the State. The State must have directed, controlled or instructed the unlawful conduct for it be liable. Therefore, State exercised effective control over the unlawful conduct in question. However, the above doctrine cannot be used widely and is unlikely to occur because, as it is difficult to establish factual link between State and Non-State Actor, the offender must be accurately identified. There are many technical intricacies attached to it, the devices connected to the International Protocol (IP) addresses do not reveal the actual device or offender where offense is committed moreover the use of Virtual Private Networks (VPN) and Botnets have made it difficult to determine the device and address to make this doctrine practically applicable.\n\n## The customary international law\n\nCustomary international law refers to international obligations arising from established State practice, as opposed to obligations arising from formal written international treaties. Under customary international law the States are obligated to prevent their territory from being used to cause harm to other countries. This principle was first articulated in the case of Corfu channel²⁰. The brief facts of the case are, two British warships were bombarded by the mines in the Albanian waters, in this instance the State’s responsibility was discussed in maintaining peace and security. The international court of Justice in this case could not establish that the mines were set up by the Albanian Government. The Albanian Government should have known the existence of mines and ought to have warned the ships in the international waters. Thus, it\n\n²⁰ Corfu Channel Case (United Kingdom v. Albania); Assessment of Compensation, 15 XII 49, International Court of Justice (ICJ), 15 December 1949",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 8,
            "markdown": "Indian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n\nis well established that there is inherent obligation of the State to prevent its territory being used by Non-State Actors to cause significant damage to other States. The Tallinn Manual, prepared by the group of experts on invitation of NATO Cooperative Cyber Defence of Excellence, In late 2009, they met a global gathering of legitimate researchers and professionals to draft a manual tending to the issue of how to translate universal law with regards to Cyber operations and Cyber conflicts. In that capacity, it was the principal push to analyse this subject thoroughly and definitively and to convey some level of clearness to the related complex legitimate issues. Rule 5 of the Manual states that, State shall not knowingly allow the Cyber infrastructure located in its territory or under its exclusive governmental control to be used for acts that adversely and unlawfully affect other States²¹. This onus also applies to harmful conduct originating from a State's territory. By referring to the Nicaragua Case²², International Court of Justice held that Nicaragua was under an obligation to prevent its territory being used as a trafficking route for military equipment which was exploited by insurgents in El Salvador. Using the same comparison it can be established that in Cyberspace there exists a customary obligation to prevent Trans boundary activities which will affect the States adversely but also to prevent the Non-State Actors from using the Cyber infrastructure from being exploited.\n\nIn the Bosnian Genocide case the ICJ held that,\n\n“it is clear that the obligation in question is one of conduct and not one of result, in the sense that a State cannot be under an obligation to succeed, whatever the circumstances, in preventing the commission of genocide: the obligation of States parties is rather to employ all means reasonably available to them, so as to prevent genocide as far as possible.”\n\nIn discussing the nature of State’s obligation to prevent a conflict it should be noticed that there is no absolute obligation on State to succeed in quelling the insurgency. There is an obligation of the State to act in due diligence, i.e. For the State to take all necessary actions by reasonable means available to it. Where a State fails to conduct itself reasonably and violates an obligation of conduct the State is liable for the failure to prevent the unlawful conduct and not for the act that produces the resulting harm, which is significant from the perspective of the adequacy of compensation/reparations owed to the victim. Obligations of prevention are usually\n\n²¹ Tallinn Manual on The International Law Applicable to Cyber Warfare, 31-32 (Cambridge University Press 2013).\n²² Nicaragua v United States of America [1986] ICJ Rep 14, para 157",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 9,
            "markdown": "Indian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n\ncommitments of counteractive action are normally interpreted as best endeavours commitments, obliging States to take all sensible or important measures to keep a given occasion from occurring, but without warranting that the occasion won't happen. Professor Pisillo- Mazzeschi in his work on due diligence and the nature of International responsibility of the State has Stated that,\n\n“careful examination of [State] practice reveals that the obligation to prevent has a twofold content; that is, it includes two distinct obligations of the State. The first is that of possessing, on a permanent basis, a legal and administrative apparatus normally able to guarantee respect for the international norm on prevention. The second obligation, instead, is that of using such apparatus with the diligence that the circumstances require²³”.\n\nIt is also important for the State to have a strong legal framework which prohibits and punishes the wrongdoing of Cyber warfare. It is a well-established principle under customary international law that the State is obligated to have legal mechanisms which will not affect the interests of other States adversely. Developing State capability of preventing Cyber-attacks will invariably require enacting legislations and establishment of effective judicial authority to monitor the same. The States shall possess a legal system and sufficient resources to maintain a mechanism to control and monitor the activities. The States with a well developed economy and strong resources with regards to Cyber infrastructure are in a better position to monitor and to have an effective control mechanism in comparison to the States which are not well equipped with technological expertise and resources. However, basic vigilance, employment of law enforcing authorities in the territory of the State which is a basic attributes of a Government are expected from a Statee. International law is not worried with the way in which States choose to meet this specific obligation of theirs, In as much as these laws are sensibly adequate to anticipate antagonistic acts or to rebuff them after they have happened, the State has played out its obligation.\n\n## An Obligation of Conduct\n\nThe Convention on Cybercrime, requires States to adopt measures to establish procedures for the purpose of criminal investigations into, and criminal proceedings for, these offences²⁴. The above provision clearly obligates a State to devise a mechanism to curb the offences of Cyber\n\n²³ Ricardo Pisillo- Mazzeschi, International Obligations to provide for Reparation Claims , A.Randelzhofer and C. Tomuschat, State Responsibility and the Individual, 149-172 (Kluwer Law International) 1999.\n\n²⁴ Convention on Cybercrime Budapest, 23.XI.2001, Article 14(1),",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 10,
            "markdown": "Indian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n\nthreats. If a State is having a requisite legal framework, the obligation is to use the framework to address the threats and to reduce its effect. In the conduct of malicious Cyber threats and trans boundary attacks, the convention on Cyber Crime (Council of Europe) requires State parties to adopt legislative and other measures the offences listed in the Convention are punishable by effective means²⁵. There is an obligation of conduct in International Law the standard in which each State is expected to act in furtherance to achieve the objectives of International law. The standard set for care is the due diligence standard, the obligation of due diligence is applied to International environment law, international human right law etc. This Article aims to characterize the material substance of the commitment of due diligence with specific reference to the standard commitment upon States to utilize their ability to keep their Cyber framework from being utilized by Non-State actors as a stage to perform trans boundary Cyber attacks. One of the primary elements of due diligence is the element of knowledge, it is necessary for the State to have knowledge about the threat for it suppress it and take necessary action. In the Corfu case, it was held that, “it cannot be concluded from the mere fact of the control exercised by a State over its territory and waters that that State necessarily knew, or ought to have known what was happening”²⁶. It is to be observed that, because a threat emerged within a State’s territory it does not imply that the State ought to have known about the imminent threat. Referring the Corfu Case, the ICJ indicated that Albania ought to have known the presence of the mines in its coastal waters, which it had control of it, the fact that Albanian coastal forces demanded the foreign vessels to request for permission before they entered the Strait further shifted the liability on Albania. The court presumed that the States shall know about the facts which are which are widely known or can be known through official government channels. The preposition of “State should have known “, plays an important role in international law as it will not be in harmony if a State could avoid responsibility by claiming it of inadequate knowledge if it could have discovered illegal activity through diligent decision. It is true in international scenario if any activity contrary to international law appears to have taken place within the territory of a State may be called upon to give its explication about it but the States cannot elude such a request by citing its ignorance of such activities which happened within the territory of the State. In the context of having adequate knowledge about the circumstances, the immediate question which arises is, “whether it is reasonable to expect the State would have known about the threat in those circumstances?”, in light of Cyber\n\n²⁵ Article 13, Convention on Cyber Crime, Council Of Europe adopted on 23rd November 2001.\n²⁶ Supra 20",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 11,
            "markdown": "Indian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n\ninfrastructure it is reasonable to assert that the State having adequate technical capacity and Cyber Infrastructure to have known about the circumstances. After establishing the circumstances which ought to have been known by the State it also essential to address the due diligence standard require and how much affirmative action can be expected from the State. In a much broader sense the States are obligated to use their legislative framework and infrastructure to check the threats which are originated within the territory and deterring the future wrong doers. In a famous Pulp Mills decision between Uruguay and Argentina the ICJ rules that, “is an obligation which entails not only the adoption of appropriate rules and measures, but also a certain level of vigilance in their enforcement”²⁷. In fulfilling States obligation the States are required to conduct investigation process and effectively reprimand the individuals. This principle was further laid down in the Janes Case²⁸, Mexican authorities failed in their duty of due diligence to protect from harm an American citizen in Mexico because, the Mexican authorities took no proper steps to apprehend and punish Carbajal [the individual responsible for killing the American national] and that such efforts as were made were lax and inadequate. The Tribunal concluded that “[t]he culprit is liable for having killed or murdered an American national; the Government is liable for not having measured up to its duty of diligently prosecuting and properly punishing the offender”.\n\nHence, as an obligation of conduct, as opposed to come about, deciding how a reasonable State would have responded to a risk is liable to an 'accessible means' examination, which requires recognizable proof of the monetary, specialized and Human Resources of the State. The essence of the matter is that a due diligence commitment must be translated in a way which does not force an outlandish results or impose disproportionate burden on societies. Therefore in order to discharge due diligence obligation to prevent Cyber Attacks or any kind of an act which is contrary to the principle of International law, a State is required only to take those measures that are reasonably available and within its power.\n\n## Conclusion\n\nThis essay has discussed that customary international law imposes an obligation on member States to prevent Cyber Infrastructure present in the territory of the State from being used in a manner which causes injury to other States. The obligation includes, the States to have a legal mechanism within the territory which is capable of controlling Cyber Attacks and secondly,\n\n²⁷ Pulp Mills on the River Uruguay (Argentina v. Uruguay), Judgment, I.C.J. Reports 2010, p. 14.\n²⁸ Laura M. B. Janes Et Al. (U.S.A.) V. United Mexican States, Volume iv P.138.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          },
          {
            "index": 12,
            "markdown": "Indian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n\nwhere a threat emerges and States have knowledge of that threat they must act reasonably and use the resources effectively to suppress the attacks. This duty does not specify the nature of legal mechanism that is required by the States to cogently address Cyber threats emerging from Cyber Space. In a heavily interconnected domain like Cyber Space the Non-State Actors will easily reroute their malicious Cyber Operations through the Cyber Infrastructure of a particular State whose technological capability is comparatively less to minimise the possibility of the State to suppress the attacks. For the above reasons, in a challenging domain like Cyber space it is necessary to have closely knit legal framework to curb the menace of malicious Cyber attacks. Devising of a Treaty to regulate how States address threats emerging from Cyber Space. The benefits of Treaty not only include co-operation among States but also by ameliorating States to adopt certain laws which are considered to suppress Cyber threats. With a specific end goal to make a safe the internet what is required is imminent participation and joint effort between the important partners (counting global associations, States, programming suppliers, digital security organizations and so forth) over issues of digital security and Internet administration. The Global Forum for Cyber Expertise (GFCE) established in the year 2015 with 50 members, aims to trade best practices and mastery on digital limit building. The point is to distinguish effective approaches, practices and thoughts and increase these on a worldwide level. Together with accomplices from NGOs, the tech group and the scholarly community GFCE individuals create handy activities to build Cyber capacity. However, it being a soft law mechanism it is necessary to address the issue with related Cyber-Specific Laws and International Treaty which addresses the same.\n\n12",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2339,
              "width": 1654
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 13,
          "doc_size_bytes": 822329
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "HEINONLINE\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n# CYBERSPACE AND NON-STATE ACTORS: THE STATE'S INTERNATIONAL OBLIGATION\nValluri Parthasarthi, ICFAI University\n## Classification of Cyber conflict\nOne of the concerns in international humanitarian law is that of the classification of Cyber conflict¹, Classification of conflict is the first step in international humanitarian law as the identification determines legal subjects² which are to be applied to it. It is essential to determine the character of the Cyber conflict, whether international or Non-international in nature. But prior to the inception of Geneva convention, Lassa Oppenheim’s definition of war was well accepted, which stated, “war is a contention between two or more States, through their armed forces, for the purpose of overpowering each other an imposing such conditions of peace as the victor pleases to be”³. The key element in the mentioned definition is that the, conflict must have happened between two States. However the interstate conflict within the State was considered a non-international conflict unless it reaches a certain degree of belligerency. The term ‘belligerency’ and its implications have been discussed in United Kingdom’s ministry’s manual of Law and Armed conflict⁴. After the carnage of the Second World War the international community took a different step in recognizing war in technical and material sense, hence developed into international customary law. Articles 2, 3 which are common for all the four Geneva Conventions there are two certain criteria which can be established to determine the international armed conflict that there is a confrontation between two States and the hostilities shall amount to armed conflict. According to Article 3, the armed conflict is not of an international nature but occurring in the territory of one of the contracting parties. The\n¹ International humanitarian law distinguishes two types of armed conflicts, namely, international armed conflicts, opposing two or more States, and non-international armed conflicts, between governmental forces and nongovernmental armed groups, or between such groups only. IHL treaty law also establishes a distinction between non-international armed conflicts in the meaning of common Article 3 of the Geneva Conventions of 1949 and non-international armed conflicts falling within the definition provided in Art. 1 of Additional Protocol II.\n² States and non-State actors like individuals, international organizations, multinational companies and international non-government organizations are regulated by, or subjected to, international law. They are called subjects of international law\n³ L Oppenheim, International Law: A Treatise II (Longman, Green and Co 1906) 56.\n⁴ UK Ministry of Defence, The Manual of the Law of Armed Conflict (2004) paragraph, 15.1.2. on belligerency\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nInternational Committee of Red Cross (ICRC) in the year 1949 broadened the scope of international armed conflict by its additional protocol I and II to the Geneva Conventions. The nature of armed conflict and the acts under it which constitute is mentioned under this Article⁵. Geneva conventions and its additional protocols, conflict can be broadly classified into three categories they are:\na. International armed conflict between States.\nb. worldwide outfitted clash including national freedom developments⁶.\nc. Non-international armed conflict between a State and armed groups or organized armed groups.\nThe first and third are recognized as customary classifications of conflict.\n## International Cyber conflict\nIt may be noted that for armed conflict there must be armed forces and it shall be international in nature (between States). It has to be further noted that, Cyber attacks are not aggressive and kinetic in nature per se. There are no weapons involved. Therefore at first instance, it can be deduced that Cyber-attacks are not armed in nature, such a deduction shall be dangerous and harmful to the Countries.\nAccording to Article 49 (1) of the Additional Protocol- 1 defines attacks. “as act of violence against the adversary either in attack or defence”. Similarly, the International Criminal Tribunal for former Yugoslavia in the case of Tadiac⁷, said “resorting to armed force between States without recognizing any threshold for the duration or intensity of hostilities”. However, Cyber-attacks are not violent in nature but can trigger vehement circumstances. Hence, the classification of a cyber conflict requires nuanced examination.\n---\n⁵ Protocol Additional to the Geneva Conventions of 12 August 1949, and Relating to the Protection of Victims of Non-International Armed Conflicts (Protocol II)- Article 1 - Material field of application- 1. This Protocol, which develops and supplements Article 3 common to the Geneva Conventions of 12 August 1949 without modifying its existing conditions of application, shall apply to all armed conflicts which are not covered by Article 1 of the Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol I) and which take place in the territory of a High Contracting Party between its armed forces and dissident armed forces or other organized armed groups which, under responsible command, exercise such control over a part of its territory as to enable them to carry out sustained and concerted military operations and to implement this Protocol. 2- This Protocol shall not apply to situations of internal disturbances and tensions, such as riots, isolated and sporadic acts of violence and other acts of a similar nature, as not being armed conflicts.\n⁶ Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol 1)- Article 1(4)\n⁷ Prosecutor v. Dusko Tadic (Appeal Judgement), IT-94-1-A, International Criminal Tribunal for the former Yugoslavia (ICTY), 15 July 1999.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nIt is also pertinent to note that, according to the additional protocols to the Geneva Conventions, any hostility between the nations which results in the intervention of the members of the armed forces, it makes no difference as far as the intensity and duration of the conflict is concerned, as it is considered as an international conflict⁸, Thus, a Cyber-attack will fall under ambit of ‘armed’ under International Humanitarian Law. The ICRC⁹ has taken a position on Cyber-attacks that, anything which disables an object is also an attack when it does not cause physical damage¹⁰; this is a reasonable motion considering the extension for the notion of damage so is concerned. Since the operation is an attack, it is also armed in terms of qualification for armed conflict. That said, a de minimis standard should attach.\nIn addition to the attack being ‘armed’ it also has to be ‘international’ in nature. By the term international, it means an act by State or an act attributable by the State in a conflict. By the plain context of the arrangements referred to over, those led by a State's military qualify. In spite of the fact that Cyber-attack is not being specified in any of those arrangements, the author believes it is reasonable to attribute that the digital assaults by some of the law enforcement officers of the State qualify¹¹ this analysis. The ICTY in this regard established in the case of Prosecutor v. Tadiac that, “Private individuals along or within the frame work of armed forces or in connection with the State authorities shall be deemed to be considered as a State organs¹².” Thus, it can be established that any attacks launched by the State, shall be deemed to have been launched by the State organs or by the individuals who were authorized to use the Cyber infrastructure on behalf of the State. A situation might arise, where in a relationship between a State and individual arise in conducting Cyber-attacks might not fall under the ambit of State organ or individuals acting on behalf of the State, the ICTY has declared that “overall control going beyond the mere financing and equipping of such forces and involving also participation in the planning and supervision of military operations”¹³. In order to establish the term “overall control” and “international conflict”, the State must issue specific instructions or directives aimed at committing certain attacks. The obligation of the State not to facilitate or attribute any Cyber- attacks shall be discussed in the later stage of this Article.\n⁸ Y Sandoz and others (eds), Commentary on the Additional Protocols of 8 June 1977 to the Geneva Conventions of 12 August 1949 (Martinus Nijhof 1988) (AP Commentary) para 62\n⁹ 32nd International Conference: Resolutions and reports- www.icrc.org available at https://www.icrc.org/en/document/outcomes-32nd-international-conference-red-cross-and-red-crescent; last visited on April 27th, 2017.\n¹⁰ Supra 9\n¹¹ Article 4 - Conduct of organs of a State, International Law Commission Report, A/56/10 August 2001.\n¹² Supra 7\n¹³ Supra 7\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n# Non-International Cyber Conflict\nThe concept of Non-International armed conflict has been defined in negative by the common Article 3 in the Geneva conventions. Any violence between State’s armed groups and dissident armed groups within a State can be defined as Non-International armed conflict. The Additional Protocol – II, has also defined Non international armed conflict as a hostility between State’s forces and organized opposing armed forces. Hence, the two ingredients in determining the Non-International armed conflict are (i) participation by an organized armed group and (ii) with a particular level of intensity. According to common Article 3, the groups must be armed and organized for it to be considered as a party in the conflict. The ICTY has defined this element of it in the case of Prosecutor v. Limaj¹⁴, “some degree of organisation by the parties will suffice to establish the existence of an armed conflict. This degree need not be the same as that required for establishing the responsibility of superiors for the acts of their subordinates within the organization, as no determination of individual criminal responsibility is intended under this provision of the Statute”¹⁵. The group shall be organized, the term organized means acting in a cordial manner and capability to engage in violence in mission planning, sharing intelligence and exercising command and control, it is necessary for a group to possess these fundamentals to be considered as a party to the conflict. From the above it is clear that individuals who conduct Cyber-attacks against State cannot meet the organized criteria. Cyber-attacks conducted by a group on online are a bit difficult to classify because the members of the group might not know each other in their operations, however they act in a coordinated manner like setting objectives, identify the weakness in the system, injection of malware and maintain defences, all these activities are performed together in a coordinated manner. One of the other criterion to be met is the group shall be under the responsible command, it is not essential to have a hierarchical order of armed force but if capable of planning and executing operations, then it fall under this definition. In virtual organized group, this criteria can be met because of the nature of the operation carried for which it can be equated to military operations.\nIn summation to being organized, the group must also be armed. The meaning of armed in the Non-international armed conflict a be parallel comparison can be made to international armed conflict. As discussed above, it generally assumes the conduct of ‘attacks’. Yet, since Non-international armed conflict is ascertained on the activities of a group, as distinct from a State, the question of attribution of an individual member’s conduct to the group as a whole arises.\n¹⁴ Prosecutor V. Fatmir Limaj Haradin Bala Isak Musliu, It-03-66-T (2005)\n¹⁵ Paragraph 89, supra 14\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nSince it is the group that must be armed, the group itself must have a purpose of carrying out armed activities. If individual members of an organized group carry out Cyber attacks on their own accord, that is, not on behalf of the group, the group does not meet the armed criterion.\n## Non State Actors and ungoverned spaces\nThe concept of Non-State Actors and its presence in international law has increased steadily in past few decades. The Non-State actors are endowed with infrastructural, economic and institutional power but do not have any corresponding legal duties. The Non-State actors actions in recent times have amounted to gross violation to human rights and have committed violence to the largest degree possible, the impact of Non-State actors on international scenario has been immense hence the United Nations Security Council in the year 2004 passed resolution 1540, which says, “the States are required to refrain from providing any goods, services to or supporting Non State Actors s which develop, obtain, construct or transfer or use chemical weapons¹⁶.” Historically, the international norms have failed to address the imbalance between legal obligation and duties of the Non-State Actors. The concept of Non-State actors can be understood as an entity, which is not actually a State and usually referred to armed, religious or civil groups. The CONTONOU defines Non State actors on a broader scale as, “The actors of cooperation will include: a: State (local, national and regional), b: Non-State: - Private Sector; - Economic and social partners, including trade union organizations; - Civil society in all its forms according to national characteristics¹⁷”. The Non-State actors do not have any affiliation with the official State authorities nor have any financial/legal framework with reference to the States, they are often treated as new subjects of international law. The international law in recent times have undergone significant changes and attempts being made to reduce the gap between Non-State actors and international law paradigm. As said by Nicolas PM, “Nowadays international law reaches beyond nations, many acts such as certain criminal acts, trade, finance, commercial relationships, environmental issues, human rights and more. Now international law directly touches many individuals”¹⁸. With reference to Cyber-attacks,\n¹⁶ United Nations Security Council, Resolution 1540 (2004), Non-Proliferation of Weapons of Mass Destruction, 28 April 2004\n¹⁷ Partnership Agreement Between the Members of the AFRICAN, CARIBEAN and PACIFIC Group of States of The One Part, and the European Community and its Member States, of the Other Part, Signed in COTONOU, BENIN ON 23 JUNE 2000. http://www.europarl.europa.eu available at http://www.europarl.europa.eu/intcoop/acp/03_01/pdf/mn3012634_en.pdf, last visited on April 13th, 2017.\n¹⁸ Rajkovic, N. M. (2012) “Global law” and governmentality: Reconceptualizing the ‘rule of law’ as rule ‘through’ law’, European Journal of International Relations, 18(1), 29–52.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nISIS (Islamic State) operates from territories such as Syria and Iraq and engages in criminal Cyber activities. Lately, ISIS is adept in using the internet for its own uses and in creating its own Cyber army, groups such as Cyber Caliphate, Islamic State Hacking Division, Islamic Cyber Army and Sons Caliphate army are the various Cyber attacking groups which carried out attacks on numerous networks such as hacking of Tony Blair (former Prime Minister U.K) and attacks on various governmental bodies and military organizations. The attack on destabilizing a French T.V network (tv5monde) and by propagating terror activities and execution videos on national network created panic and distress in international communities, later the France government in its official press release claimed it to be an act of terrorism and further using the official U.S Central command's YouTube account and telecasted terrorist propaganda videos, which was used for its recruitment purposes. All these activities were carried out from a State and using Cyber infrastructure, the liability of the State with regards to Cyber warfare has been a concern in international law.\n## State Obligation\nIt is an established principle in the international law, that States have inherent responsibility on its part to prevent cross border acts which are prohibited under international law. With reference to current international law, there are particularly four categories of offences which is an Obligation for the States to criminalise, they are offences against confidentiality, integrity and availability of Computer Systems, computer relates offences (Forgery, fraud) and offences related to Copyrights and related rights¹⁹.\nAs discussed above the presence of Non-State actors in the international arena have been in ascendance, and the alleged acts committed by Non-State actors had caused considerable damage to the aggrieved countries. The States are obligated to obviate their Cyber framework from being exploited in any manner which is harmful to the international legal framework. The obligation consists of having a legal infrastructure domestically to prevent Cyber attacks and to take stringent measures against the offenders and also having a reasonable knowledge or anticipation the threat which might loom from their Cyber set up. The characteristics such as anonymity, accessibility and trans-borderless activities has privileged the Non-State Actors to operate within the States. In a colloquial sense, the States are not responsible for the acts of the\n¹⁹ ETS 185 – Cybercrime (Convention), 23.XI.2001, Additional Protocol to the Convention on Cyber Crime (Council Of Europe) adopted on 23rd November 2001) adopted in the year 2001.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nNon-State Actors; mere geographical and territorial link is not enough to hold the State responsible, the State can be held responsible under two circumstances in doing so, the draft Articles on State Responsibility on internationally wrongful Acts has to be considered. The text was adopted in the 53rd Session as submitted to the General Assembly in the year 2001. Article 2 States that, “Elements of an internationally wrongful act of a State\nThere is an internationally wrongful act of a State when conduct consisting of an action or omission:\n(a) is attributable to the State under international law; and\n(b) It Constitutes a breach of an international obligation of the State.”\nBy the above Article the State can be held responsible for the actions of the Non-State Actors if it is an internationally wrongful act which can be attributed to the State. The State must have directed, controlled or instructed the unlawful conduct for it be liable. Therefore, State exercised effective control over the unlawful conduct in question. However, the above doctrine cannot be used widely and is unlikely to occur because, as it is difficult to establish factual link between State and Non-State Actor, the offender must be accurately identified. There are many technical intricacies attached to it, the devices connected to the International Protocol (IP) addresses do not reveal the actual device or offender where offense is committed moreover the use of Virtual Private Networks (VPN) and Botnets have made it difficult to determine the device and address to make this doctrine practically applicable.\n## The customary international law\nCustomary international law refers to international obligations arising from established State practice, as opposed to obligations arising from formal written international treaties. Under customary international law the States are obligated to prevent their territory from being used to cause harm to other countries. This principle was first articulated in the case of Corfu channel²⁰. The brief facts of the case are, two British warships were bombarded by the mines in the Albanian waters, in this instance the State’s responsibility was discussed in maintaining peace and security. The international court of Justice in this case could not establish that the mines were set up by the Albanian Government. The Albanian Government should have known the existence of mines and ought to have warned the ships in the international waters. Thus, it\n²⁰ Corfu Channel Case (United Kingdom v. Albania); Assessment of Compensation, 15 XII 49, International Court of Justice (ICJ), 15 December 1949\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nis well established that there is inherent obligation of the State to prevent its territory being used by Non-State Actors to cause significant damage to other States. The Tallinn Manual, prepared by the group of experts on invitation of NATO Cooperative Cyber Defence of Excellence, In late 2009, they met a global gathering of legitimate researchers and professionals to draft a manual tending to the issue of how to translate universal law with regards to Cyber operations and Cyber conflicts. In that capacity, it was the principal push to analyse this subject thoroughly and definitively and to convey some level of clearness to the related complex legitimate issues. Rule 5 of the Manual states that, State shall not knowingly allow the Cyber infrastructure located in its territory or under its exclusive governmental control to be used for acts that adversely and unlawfully affect other States²¹. This onus also applies to harmful conduct originating from a State's territory. By referring to the Nicaragua Case²², International Court of Justice held that Nicaragua was under an obligation to prevent its territory being used as a trafficking route for military equipment which was exploited by insurgents in El Salvador. Using the same comparison it can be established that in Cyberspace there exists a customary obligation to prevent Trans boundary activities which will affect the States adversely but also to prevent the Non-State Actors from using the Cyber infrastructure from being exploited.\nIn the Bosnian Genocide case the ICJ held that,\n“it is clear that the obligation in question is one of conduct and not one of result, in the sense that a State cannot be under an obligation to succeed, whatever the circumstances, in preventing the commission of genocide: the obligation of States parties is rather to employ all means reasonably available to them, so as to prevent genocide as far as possible.”\nIn discussing the nature of State’s obligation to prevent a conflict it should be noticed that there is no absolute obligation on State to succeed in quelling the insurgency. There is an obligation of the State to act in due diligence, i.e. For the State to take all necessary actions by reasonable means available to it. Where a State fails to conduct itself reasonably and violates an obligation of conduct the State is liable for the failure to prevent the unlawful conduct and not for the act that produces the resulting harm, which is significant from the perspective of the adequacy of compensation/reparations owed to the victim. Obligations of prevention are usually\n²¹ Tallinn Manual on The International Law Applicable to Cyber Warfare, 31-32 (Cambridge University Press 2013).\n²² Nicaragua v United States of America [1986] ICJ Rep 14, para 157\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\ncommitments of counteractive action are normally interpreted as best endeavours commitments, obliging States to take all sensible or important measures to keep a given occasion from occurring, but without warranting that the occasion won't happen. Professor Pisillo- Mazzeschi in his work on due diligence and the nature of International responsibility of the State has Stated that,\n“careful examination of [State] practice reveals that the obligation to prevent has a twofold content; that is, it includes two distinct obligations of the State. The first is that of possessing, on a permanent basis, a legal and administrative apparatus normally able to guarantee respect for the international norm on prevention. The second obligation, instead, is that of using such apparatus with the diligence that the circumstances require²³”.\nIt is also important for the State to have a strong legal framework which prohibits and punishes the wrongdoing of Cyber warfare. It is a well-established principle under customary international law that the State is obligated to have legal mechanisms which will not affect the interests of other States adversely. Developing State capability of preventing Cyber-attacks will invariably require enacting legislations and establishment of effective judicial authority to monitor the same. The States shall possess a legal system and sufficient resources to maintain a mechanism to control and monitor the activities. The States with a well developed economy and strong resources with regards to Cyber infrastructure are in a better position to monitor and to have an effective control mechanism in comparison to the States which are not well equipped with technological expertise and resources. However, basic vigilance, employment of law enforcing authorities in the territory of the State which is a basic attributes of a Government are expected from a Statee. International law is not worried with the way in which States choose to meet this specific obligation of theirs, In as much as these laws are sensibly adequate to anticipate antagonistic acts or to rebuff them after they have happened, the State has played out its obligation.\n## An Obligation of Conduct\nThe Convention on Cybercrime, requires States to adopt measures to establish procedures for the purpose of criminal investigations into, and criminal proceedings for, these offences²⁴. The above provision clearly obligates a State to devise a mechanism to curb the offences of Cyber\n²³ Ricardo Pisillo- Mazzeschi, International Obligations to provide for Reparation Claims , A.Randelzhofer and C. Tomuschat, State Responsibility and the Individual, 149-172 (Kluwer Law International) 1999.\n²⁴ Convention on Cybercrime Budapest, 23.XI.2001, Article 14(1),\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nthreats. If a State is having a requisite legal framework, the obligation is to use the framework to address the threats and to reduce its effect. In the conduct of malicious Cyber threats and trans boundary attacks, the convention on Cyber Crime (Council of Europe) requires State parties to adopt legislative and other measures the offences listed in the Convention are punishable by effective means²⁵. There is an obligation of conduct in International Law the standard in which each State is expected to act in furtherance to achieve the objectives of International law. The standard set for care is the due diligence standard, the obligation of due diligence is applied to International environment law, international human right law etc. This Article aims to characterize the material substance of the commitment of due diligence with specific reference to the standard commitment upon States to utilize their ability to keep their Cyber framework from being utilized by Non-State actors as a stage to perform trans boundary Cyber attacks. One of the primary elements of due diligence is the element of knowledge, it is necessary for the State to have knowledge about the threat for it suppress it and take necessary action. In the Corfu case, it was held that, “it cannot be concluded from the mere fact of the control exercised by a State over its territory and waters that that State necessarily knew, or ought to have known what was happening”²⁶. It is to be observed that, because a threat emerged within a State’s territory it does not imply that the State ought to have known about the imminent threat. Referring the Corfu Case, the ICJ indicated that Albania ought to have known the presence of the mines in its coastal waters, which it had control of it, the fact that Albanian coastal forces demanded the foreign vessels to request for permission before they entered the Strait further shifted the liability on Albania. The court presumed that the States shall know about the facts which are which are widely known or can be known through official government channels. The preposition of “State should have known “, plays an important role in international law as it will not be in harmony if a State could avoid responsibility by claiming it of inadequate knowledge if it could have discovered illegal activity through diligent decision. It is true in international scenario if any activity contrary to international law appears to have taken place within the territory of a State may be called upon to give its explication about it but the States cannot elude such a request by citing its ignorance of such activities which happened within the territory of the State. In the context of having adequate knowledge about the circumstances, the immediate question which arises is, “whether it is reasonable to expect the State would have known about the threat in those circumstances?”, in light of Cyber\n²⁵ Article 13, Convention on Cyber Crime, Council Of Europe adopted on 23rd November 2001.\n²⁶ Supra 20\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\ninfrastructure it is reasonable to assert that the State having adequate technical capacity and Cyber Infrastructure to have known about the circumstances. After establishing the circumstances which ought to have been known by the State it also essential to address the due diligence standard require and how much affirmative action can be expected from the State. In a much broader sense the States are obligated to use their legislative framework and infrastructure to check the threats which are originated within the territory and deterring the future wrong doers. In a famous Pulp Mills decision between Uruguay and Argentina the ICJ rules that, “is an obligation which entails not only the adoption of appropriate rules and measures, but also a certain level of vigilance in their enforcement”²⁷. In fulfilling States obligation the States are required to conduct investigation process and effectively reprimand the individuals. This principle was further laid down in the Janes Case²⁸, Mexican authorities failed in their duty of due diligence to protect from harm an American citizen in Mexico because, the Mexican authorities took no proper steps to apprehend and punish Carbajal [the individual responsible for killing the American national] and that such efforts as were made were lax and inadequate. The Tribunal concluded that “[t]he culprit is liable for having killed or murdered an American national; the Government is liable for not having measured up to its duty of diligently prosecuting and properly punishing the offender”.\nHence, as an obligation of conduct, as opposed to come about, deciding how a reasonable State would have responded to a risk is liable to an 'accessible means' examination, which requires recognizable proof of the monetary, specialized and Human Resources of the State. The essence of the matter is that a due diligence commitment must be translated in a way which does not force an outlandish results or impose disproportionate burden on societies. Therefore in order to discharge due diligence obligation to prevent Cyber Attacks or any kind of an act which is contrary to the principle of International law, a State is required only to take those measures that are reasonably available and within its power.\n## Conclusion\nThis essay has discussed that customary international law imposes an obligation on member States to prevent Cyber Infrastructure present in the territory of the State from being used in a manner which causes injury to other States. The obligation includes, the States to have a legal mechanism within the territory which is capable of controlling Cyber Attacks and secondly,\n²⁷ Pulp Mills on the River Uruguay (Argentina v. Uruguay), Judgment, I.C.J. Reports 2010, p. 14.\n²⁸ Laura M. B. Janes Et Al. (U.S.A.) V. United Mexican States, Volume iv P.138.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nwhere a threat emerges and States have knowledge of that threat they must act reasonably and use the resources effectively to suppress the attacks. This duty does not specify the nature of legal mechanism that is required by the States to cogently address Cyber threats emerging from Cyber Space. In a heavily interconnected domain like Cyber Space the Non-State Actors will easily reroute their malicious Cyber Operations through the Cyber Infrastructure of a particular State whose technological capability is comparatively less to minimise the possibility of the State to suppress the attacks. For the above reasons, in a challenging domain like Cyber space it is necessary to have closely knit legal framework to curb the menace of malicious Cyber attacks. Devising of a Treaty to regulate how States address threats emerging from Cyber Space. The benefits of Treaty not only include co-operation among States but also by ameliorating States to adopt certain laws which are considered to suppress Cyber threats. With a specific end goal to make a safe the internet what is required is imminent participation and joint effort between the important partners (counting global associations, States, programming suppliers, digital security organizations and so forth) over issues of digital security and Internet administration. The Global Forum for Cyber Expertise (GFCE) established in the year 2015 with 50 members, aims to trade best practices and mastery on digital limit building. The point is to distinguish effective approaches, practices and thoughts and increase these on a worldwide level. Together with accomplices from NGOs, the tech group and the scholarly community GFCE individuals create handy activities to build Cyber capacity. However, it being a soft law mechanism it is necessary to address the issue with related Cyber-Specific Laws and International Treaty which addresses the same.\n12",
  "references": [],
  "flat_text": "HEINONLINE\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n# CYBERSPACE AND NON-STATE ACTORS: THE STATE'S INTERNATIONAL OBLIGATION\nValluri Parthasarthi, ICFAI University\n## Classification of Cyber conflict\nOne of the concerns in international humanitarian law is that of the classification of Cyber conflict, Classification of conflict is the first step in international humanitarian law as the identification determines legal subjects which are to be applied to it. It is essential to determine the character of the Cyber conflict, whether international or Non-international in nature. But prior to the inception of Geneva convention, Lassa Oppenheim’s definition of war was well accepted, which stated, “war is a contention between two or more States, through their armed forces, for the purpose of overpowering each other an imposing such conditions of peace as the victor pleases to be”. The key element in the mentioned definition is that the, conflict must have happened between two States. However the interstate conflict within the State was considered a non-international conflict unless it reaches a certain degree of belligerency. The term ‘belligerency’ and its implications have been discussed in United Kingdom’s ministry’s manual of Law and Armed conflict. After the carnage of the Second World War the international community took a different step in recognizing war in technical and material sense, hence developed into international customary law. Articles 2, 3 which are common for all the four Geneva Conventions there are two certain criteria which can be established to determine the international armed conflict that there is a confrontation between two States and the hostilities shall amount to armed conflict. According to Article 3, the armed conflict is not of an international nature but occurring in the territory of one of the contracting parties. The\n International humanitarian law distinguishes two types of armed conflicts, namely, international armed conflicts, opposing two or more States, and non-international armed conflicts, between governmental forces and nongovernmental armed groups, or between such groups only. IHL treaty law also establishes a distinction between non-international armed conflicts in the meaning of common Article 3 of the Geneva Conventions of 1949 and non-international armed conflicts falling within the definition provided in Art. 1 of Additional Protocol II.\n States and non-State actors like individuals, international organizations, multinational companies and international non-government organizations are regulated by, or subjected to, international law. They are called subjects of international law\n L Oppenheim, International Law: A Treatise II (Longman, Green and Co 1906) 56.\n UK Ministry of Defence, The Manual of the Law of Armed Conflict (2004) paragraph, 15.1.2. on belligerency\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nInternational Committee of Red Cross (ICRC) in the year 1949 broadened the scope of international armed conflict by its additional protocol I and II to the Geneva Conventions. The nature of armed conflict and the acts under it which constitute is mentioned under this Article. Geneva conventions and its additional protocols, conflict can be broadly classified into three categories they are:\na. International armed conflict between States.\nb. worldwide outfitted clash including national freedom developments.\nc. Non-international armed conflict between a State and armed groups or organized armed groups.\nThe first and third are recognized as customary classifications of conflict.\n## International Cyber conflict\nIt may be noted that for armed conflict there must be armed forces and it shall be international in nature (between States). It has to be further noted that, Cyber attacks are not aggressive and kinetic in nature per se. There are no weapons involved. Therefore at first instance, it can be deduced that Cyber-attacks are not armed in nature, such a deduction shall be dangerous and harmful to the Countries.\nAccording to Article 49 (1) of the Additional Protocol- 1 defines attacks. “as act of violence against the adversary either in attack or defence”. Similarly, the International Criminal Tribunal for former Yugoslavia in the case of Tadiac, said “resorting to armed force between States without recognizing any threshold for the duration or intensity of hostilities”. However, Cyber-attacks are not violent in nature but can trigger vehement circumstances. Hence, the classification of a cyber conflict requires nuanced examination.\n---\n Protocol Additional to the Geneva Conventions of 12 August 1949, and Relating to the Protection of Victims of Non-International Armed Conflicts (Protocol II)- Article 1 - Material field of application- 1. This Protocol, which develops and supplements Article 3 common to the Geneva Conventions of 12 August 1949 without modifying its existing conditions of application, shall apply to all armed conflicts which are not covered by Article 1 of the Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol I) and which take place in the territory of a High Contracting Party between its armed forces and dissident armed forces or other organized armed groups which, under responsible command, exercise such control over a part of its territory as to enable them to carry out sustained and concerted military operations and to implement this Protocol. 2- This Protocol shall not apply to situations of internal disturbances and tensions, such as riots, isolated and sporadic acts of violence and other acts of a similar nature, as not being armed conflicts.\n Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol 1)- Article 1(4)\n Prosecutor v. Dusko Tadic (Appeal Judgement), IT-94-1-A, International Criminal Tribunal for the former Yugoslavia (ICTY), 15 July 1999.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nIt is also pertinent to note that, according to the additional protocols to the Geneva Conventions, any hostility between the nations which results in the intervention of the members of the armed forces, it makes no difference as far as the intensity and duration of the conflict is concerned, as it is considered as an international conflict, Thus, a Cyber-attack will fall under ambit of ‘armed’ under International Humanitarian Law. The ICRC has taken a position on Cyber-attacks that, anything which disables an object is also an attack when it does not cause physical damage; this is a reasonable motion considering the extension for the notion of damage so is concerned. Since the operation is an attack, it is also armed in terms of qualification for armed conflict. That said, a de minimis standard should attach.\nIn addition to the attack being ‘armed’ it also has to be ‘international’ in nature. By the term international, it means an act by State or an act attributable by the State in a conflict. By the plain context of the arrangements referred to over, those led by a State's military qualify. In spite of the fact that Cyber-attack is not being specified in any of those arrangements, the author believes it is reasonable to attribute that the digital assaults by some of the law enforcement officers of the State qualify this analysis. The ICTY in this regard established in the case of Prosecutor v. Tadiac that, “Private individuals along or within the frame work of armed forces or in connection with the State authorities shall be deemed to be considered as a State organs.” Thus, it can be established that any attacks launched by the State, shall be deemed to have been launched by the State organs or by the individuals who were authorized to use the Cyber infrastructure on behalf of the State. A situation might arise, where in a relationship between a State and individual arise in conducting Cyber-attacks might not fall under the ambit of State organ or individuals acting on behalf of the State, the ICTY has declared that “overall control going beyond the mere financing and equipping of such forces and involving also participation in the planning and supervision of military operations”. In order to establish the term “overall control” and “international conflict”, the State must issue specific instructions or directives aimed at committing certain attacks. The obligation of the State not to facilitate or attribute any Cyber- attacks shall be discussed in the later stage of this Article.\n Y Sandoz and others (eds), Commentary on the Additional Protocols of 8 June 1977 to the Geneva Conventions of 12 August 1949 (Martinus Nijhof 1988) (AP Commentary) para 62\n 32nd International Conference: Resolutions and reports- www.icrc.org available at https://www.icrc.org/en/document/outcomes-32nd-international-conference-red-cross-and-red-crescent; last visited on April 27th, 2017.\n Supra 9\n Article 4 - Conduct of organs of a State, International Law Commission Report, A/56/10 August 2001.\n Supra 7\n Supra 7\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n# Non-International Cyber Conflict\nThe concept of Non-International armed conflict has been defined in negative by the common Article 3 in the Geneva conventions. Any violence between State’s armed groups and dissident armed groups within a State can be defined as Non-International armed conflict. The Additional Protocol – II, has also defined Non international armed conflict as a hostility between State’s forces and organized opposing armed forces. Hence, the two ingredients in determining the Non-International armed conflict are (i) participation by an organized armed group and (ii) with a particular level of intensity. According to common Article 3, the groups must be armed and organized for it to be considered as a party in the conflict. The ICTY has defined this element of it in the case of Prosecutor v. Limaj, “some degree of organisation by the parties will suffice to establish the existence of an armed conflict. This degree need not be the same as that required for establishing the responsibility of superiors for the acts of their subordinates within the organization, as no determination of individual criminal responsibility is intended under this provision of the Statute”. The group shall be organized, the term organized means acting in a cordial manner and capability to engage in violence in mission planning, sharing intelligence and exercising command and control, it is necessary for a group to possess these fundamentals to be considered as a party to the conflict. From the above it is clear that individuals who conduct Cyber-attacks against State cannot meet the organized criteria. Cyber-attacks conducted by a group on online are a bit difficult to classify because the members of the group might not know each other in their operations, however they act in a coordinated manner like setting objectives, identify the weakness in the system, injection of malware and maintain defences, all these activities are performed together in a coordinated manner. One of the other criterion to be met is the group shall be under the responsible command, it is not essential to have a hierarchical order of armed force but if capable of planning and executing operations, then it fall under this definition. In virtual organized group, this criteria can be met because of the nature of the operation carried for which it can be equated to military operations.\nIn summation to being organized, the group must also be armed. The meaning of armed in the Non-international armed conflict a be parallel comparison can be made to international armed conflict. As discussed above, it generally assumes the conduct of ‘attacks’. Yet, since Non-international armed conflict is ascertained on the activities of a group, as distinct from a State, the question of attribution of an individual member’s conduct to the group as a whole arises.\n Prosecutor V. Fatmir Limaj Haradin Bala Isak Musliu, It-03-66-T (2005)\n Paragraph 89, supra 14\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nSince it is the group that must be armed, the group itself must have a purpose of carrying out armed activities. If individual members of an organized group carry out Cyber attacks on their own accord, that is, not on behalf of the group, the group does not meet the armed criterion.\n## Non State Actors and ungoverned spaces\nThe concept of Non-State Actors and its presence in international law has increased steadily in past few decades. The Non-State actors are endowed with infrastructural, economic and institutional power but do not have any corresponding legal duties. The Non-State actors actions in recent times have amounted to gross violation to human rights and have committed violence to the largest degree possible, the impact of Non-State actors on international scenario has been immense hence the United Nations Security Council in the year 2004 passed resolution 1540, which says, “the States are required to refrain from providing any goods, services to or supporting Non State Actors s which develop, obtain, construct or transfer or use chemical weapons.” Historically, the international norms have failed to address the imbalance between legal obligation and duties of the Non-State Actors. The concept of Non-State actors can be understood as an entity, which is not actually a State and usually referred to armed, religious or civil groups. The CONTONOU defines Non State actors on a broader scale as, “The actors of cooperation will include: a: State (local, national and regional), b: Non-State: - Private Sector; - Economic and social partners, including trade union organizations; - Civil society in all its forms according to national characteristics”. The Non-State actors do not have any affiliation with the official State authorities nor have any financial/legal framework with reference to the States, they are often treated as new subjects of international law. The international law in recent times have undergone significant changes and attempts being made to reduce the gap between Non-State actors and international law paradigm. As said by Nicolas PM, “Nowadays international law reaches beyond nations, many acts such as certain criminal acts, trade, finance, commercial relationships, environmental issues, human rights and more. Now international law directly touches many individuals”. With reference to Cyber-attacks,\n United Nations Security Council, Resolution 1540 (2004), Non-Proliferation of Weapons of Mass Destruction, 28 April 2004\n Partnership Agreement Between the Members of the AFRICAN, CARIBEAN and PACIFIC Group of States of The One Part, and the European Community and its Member States, of the Other Part, Signed in COTONOU, BENIN ON 23 JUNE 2000. http://www.europarl.europa.eu available at http://www.europarl.europa.eu/intcoop/acp/03_01/pdf/mn3012634_en.pdf, last visited on April 13th, 2017.\n Rajkovic, N. M. (2012) “Global law” and governmentality: Reconceptualizing the ‘rule of law’ as rule ‘through’ law’, European Journal of International Relations, 18(1), 29–52.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nISIS (Islamic State) operates from territories such as Syria and Iraq and engages in criminal Cyber activities. Lately, ISIS is adept in using the internet for its own uses and in creating its own Cyber army, groups such as Cyber Caliphate, Islamic State Hacking Division, Islamic Cyber Army and Sons Caliphate army are the various Cyber attacking groups which carried out attacks on numerous networks such as hacking of Tony Blair (former Prime Minister U.K) and attacks on various governmental bodies and military organizations. The attack on destabilizing a French T.V network (tv5monde) and by propagating terror activities and execution videos on national network created panic and distress in international communities, later the France government in its official press release claimed it to be an act of terrorism and further using the official U.S Central command's YouTube account and telecasted terrorist propaganda videos, which was used for its recruitment purposes. All these activities were carried out from a State and using Cyber infrastructure, the liability of the State with regards to Cyber warfare has been a concern in international law.\n## State Obligation\nIt is an established principle in the international law, that States have inherent responsibility on its part to prevent cross border acts which are prohibited under international law. With reference to current international law, there are particularly four categories of offences which is an Obligation for the States to criminalise, they are offences against confidentiality, integrity and availability of Computer Systems, computer relates offences (Forgery, fraud) and offences related to Copyrights and related rights.\nAs discussed above the presence of Non-State actors in the international arena have been in ascendance, and the alleged acts committed by Non-State actors had caused considerable damage to the aggrieved countries. The States are obligated to obviate their Cyber framework from being exploited in any manner which is harmful to the international legal framework. The obligation consists of having a legal infrastructure domestically to prevent Cyber attacks and to take stringent measures against the offenders and also having a reasonable knowledge or anticipation the threat which might loom from their Cyber set up. The characteristics such as anonymity, accessibility and trans-borderless activities has privileged the Non-State Actors to operate within the States. In a colloquial sense, the States are not responsible for the acts of the\n ETS 185 – Cybercrime (Convention), 23.XI.2001, Additional Protocol to the Convention on Cyber Crime (Council Of Europe) adopted on 23rd November 2001) adopted in the year 2001.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nNon-State Actors; mere geographical and territorial link is not enough to hold the State responsible, the State can be held responsible under two circumstances in doing so, the draft Articles on State Responsibility on internationally wrongful Acts has to be considered. The text was adopted in the 53rd Session as submitted to the General Assembly in the year 2001. Article 2 States that, “Elements of an internationally wrongful act of a State\nThere is an internationally wrongful act of a State when conduct consisting of an action or omission:\n(a) is attributable to the State under international law; and\n(b) It Constitutes a breach of an international obligation of the State.”\nBy the above Article the State can be held responsible for the actions of the Non-State Actors if it is an internationally wrongful act which can be attributed to the State. The State must have directed, controlled or instructed the unlawful conduct for it be liable. Therefore, State exercised effective control over the unlawful conduct in question. However, the above doctrine cannot be used widely and is unlikely to occur because, as it is difficult to establish factual link between State and Non-State Actor, the offender must be accurately identified. There are many technical intricacies attached to it, the devices connected to the International Protocol (IP) addresses do not reveal the actual device or offender where offense is committed moreover the use of Virtual Private Networks (VPN) and Botnets have made it difficult to determine the device and address to make this doctrine practically applicable.\n## The customary international law\nCustomary international law refers to international obligations arising from established State practice, as opposed to obligations arising from formal written international treaties. Under customary international law the States are obligated to prevent their territory from being used to cause harm to other countries. This principle was first articulated in the case of Corfu channel. The brief facts of the case are, two British warships were bombarded by the mines in the Albanian waters, in this instance the State’s responsibility was discussed in maintaining peace and security. The international court of Justice in this case could not establish that the mines were set up by the Albanian Government. The Albanian Government should have known the existence of mines and ought to have warned the ships in the international waters. Thus, it\n Corfu Channel Case (United Kingdom v. Albania); Assessment of Compensation, 15 XII 49, International Court of Justice (ICJ), 15 December 1949\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nis well established that there is inherent obligation of the State to prevent its territory being used by Non-State Actors to cause significant damage to other States. The Tallinn Manual, prepared by the group of experts on invitation of NATO Cooperative Cyber Defence of Excellence, In late 2009, they met a global gathering of legitimate researchers and professionals to draft a manual tending to the issue of how to translate universal law with regards to Cyber operations and Cyber conflicts. In that capacity, it was the principal push to analyse this subject thoroughly and definitively and to convey some level of clearness to the related complex legitimate issues. Rule 5 of the Manual states that, State shall not knowingly allow the Cyber infrastructure located in its territory or under its exclusive governmental control to be used for acts that adversely and unlawfully affect other States. This onus also applies to harmful conduct originating from a State's territory. By referring to the Nicaragua Case, International Court of Justice held that Nicaragua was under an obligation to prevent its territory being used as a trafficking route for military equipment which was exploited by insurgents in El Salvador. Using the same comparison it can be established that in Cyberspace there exists a customary obligation to prevent Trans boundary activities which will affect the States adversely but also to prevent the Non-State Actors from using the Cyber infrastructure from being exploited.\nIn the Bosnian Genocide case the ICJ held that,\n“it is clear that the obligation in question is one of conduct and not one of result, in the sense that a State cannot be under an obligation to succeed, whatever the circumstances, in preventing the commission of genocide: the obligation of States parties is rather to employ all means reasonably available to them, so as to prevent genocide as far as possible.”\nIn discussing the nature of State’s obligation to prevent a conflict it should be noticed that there is no absolute obligation on State to succeed in quelling the insurgency. There is an obligation of the State to act in due diligence, i.e. For the State to take all necessary actions by reasonable means available to it. Where a State fails to conduct itself reasonably and violates an obligation of conduct the State is liable for the failure to prevent the unlawful conduct and not for the act that produces the resulting harm, which is significant from the perspective of the adequacy of compensation/reparations owed to the victim. Obligations of prevention are usually\n Tallinn Manual on The International Law Applicable to Cyber Warfare, 31-32 (Cambridge University Press 2013).\n Nicaragua v United States of America [1986] ICJ Rep 14, para 157\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\ncommitments of counteractive action are normally interpreted as best endeavours commitments, obliging States to take all sensible or important measures to keep a given occasion from occurring, but without warranting that the occasion won't happen. Professor Pisillo- Mazzeschi in his work on due diligence and the nature of International responsibility of the State has Stated that,\n“careful examination of [State] practice reveals that the obligation to prevent has a twofold content; that is, it includes two distinct obligations of the State. The first is that of possessing, on a permanent basis, a legal and administrative apparatus normally able to guarantee respect for the international norm on prevention. The second obligation, instead, is that of using such apparatus with the diligence that the circumstances require”.\nIt is also important for the State to have a strong legal framework which prohibits and punishes the wrongdoing of Cyber warfare. It is a well-established principle under customary international law that the State is obligated to have legal mechanisms which will not affect the interests of other States adversely. Developing State capability of preventing Cyber-attacks will invariably require enacting legislations and establishment of effective judicial authority to monitor the same. The States shall possess a legal system and sufficient resources to maintain a mechanism to control and monitor the activities. The States with a well developed economy and strong resources with regards to Cyber infrastructure are in a better position to monitor and to have an effective control mechanism in comparison to the States which are not well equipped with technological expertise and resources. However, basic vigilance, employment of law enforcing authorities in the territory of the State which is a basic attributes of a Government are expected from a Statee. International law is not worried with the way in which States choose to meet this specific obligation of theirs, In as much as these laws are sensibly adequate to anticipate antagonistic acts or to rebuff them after they have happened, the State has played out its obligation.\n## An Obligation of Conduct\nThe Convention on Cybercrime, requires States to adopt measures to establish procedures for the purpose of criminal investigations into, and criminal proceedings for, these offences. The above provision clearly obligates a State to devise a mechanism to curb the offences of Cyber\n Ricardo Pisillo- Mazzeschi, International Obligations to provide for Reparation Claims , A.Randelzhofer and C. Tomuschat, State Responsibility and the Individual, 149-172 (Kluwer Law International) 1999.\n Convention on Cybercrime Budapest, 23.XI.2001, Article 14(1),\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nthreats. If a State is having a requisite legal framework, the obligation is to use the framework to address the threats and to reduce its effect. In the conduct of malicious Cyber threats and trans boundary attacks, the convention on Cyber Crime (Council of Europe) requires State parties to adopt legislative and other measures the offences listed in the Convention are punishable by effective means. There is an obligation of conduct in International Law the standard in which each State is expected to act in furtherance to achieve the objectives of International law. The standard set for care is the due diligence standard, the obligation of due diligence is applied to International environment law, international human right law etc. This Article aims to characterize the material substance of the commitment of due diligence with specific reference to the standard commitment upon States to utilize their ability to keep their Cyber framework from being utilized by Non-State actors as a stage to perform trans boundary Cyber attacks. One of the primary elements of due diligence is the element of knowledge, it is necessary for the State to have knowledge about the threat for it suppress it and take necessary action. In the Corfu case, it was held that, “it cannot be concluded from the mere fact of the control exercised by a State over its territory and waters that that State necessarily knew, or ought to have known what was happening”. It is to be observed that, because a threat emerged within a State’s territory it does not imply that the State ought to have known about the imminent threat. Referring the Corfu Case, the ICJ indicated that Albania ought to have known the presence of the mines in its coastal waters, which it had control of it, the fact that Albanian coastal forces demanded the foreign vessels to request for permission before they entered the Strait further shifted the liability on Albania. The court presumed that the States shall know about the facts which are which are widely known or can be known through official government channels. The preposition of “State should have known “, plays an important role in international law as it will not be in harmony if a State could avoid responsibility by claiming it of inadequate knowledge if it could have discovered illegal activity through diligent decision. It is true in international scenario if any activity contrary to international law appears to have taken place within the territory of a State may be called upon to give its explication about it but the States cannot elude such a request by citing its ignorance of such activities which happened within the territory of the State. In the context of having adequate knowledge about the circumstances, the immediate question which arises is, “whether it is reasonable to expect the State would have known about the threat in those circumstances?”, in light of Cyber\n Article 13, Convention on Cyber Crime, Council Of Europe adopted on 23rd November 2001.\n Supra 20\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\ninfrastructure it is reasonable to assert that the State having adequate technical capacity and Cyber Infrastructure to have known about the circumstances. After establishing the circumstances which ought to have been known by the State it also essential to address the due diligence standard require and how much affirmative action can be expected from the State. In a much broader sense the States are obligated to use their legislative framework and infrastructure to check the threats which are originated within the territory and deterring the future wrong doers. In a famous Pulp Mills decision between Uruguay and Argentina the ICJ rules that, “is an obligation which entails not only the adoption of appropriate rules and measures, but also a certain level of vigilance in their enforcement”. In fulfilling States obligation the States are required to conduct investigation process and effectively reprimand the individuals. This principle was further laid down in the Janes Case, Mexican authorities failed in their duty of due diligence to protect from harm an American citizen in Mexico because, the Mexican authorities took no proper steps to apprehend and punish Carbajal [the individual responsible for killing the American national] and that such efforts as were made were lax and inadequate. The Tribunal concluded that “[t]he culprit is liable for having killed or murdered an American national; the Government is liable for not having measured up to its duty of diligently prosecuting and properly punishing the offender”.\nHence, as an obligation of conduct, as opposed to come about, deciding how a reasonable State would have responded to a risk is liable to an 'accessible means' examination, which requires recognizable proof of the monetary, specialized and Human Resources of the State. The essence of the matter is that a due diligence commitment must be translated in a way which does not force an outlandish results or impose disproportionate burden on societies. Therefore in order to discharge due diligence obligation to prevent Cyber Attacks or any kind of an act which is contrary to the principle of International law, a State is required only to take those measures that are reasonably available and within its power.\n## Conclusion\nThis essay has discussed that customary international law imposes an obligation on member States to prevent Cyber Infrastructure present in the territory of the State from being used in a manner which causes injury to other States. The obligation includes, the States to have a legal mechanism within the territory which is capable of controlling Cyber Attacks and secondly,\n Pulp Mills on the River Uruguay (Argentina v. Uruguay), Judgment, I.C.J. Reports 2010, p. 14.\n Laura M. B. Janes Et Al. (U.S.A.) V. United Mexican States, Volume iv P.138.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nwhere a threat emerges and States have knowledge of that threat they must act reasonably and use the resources effectively to suppress the attacks. This duty does not specify the nature of legal mechanism that is required by the States to cogently address Cyber threats emerging from Cyber Space. In a heavily interconnected domain like Cyber Space the Non-State Actors will easily reroute their malicious Cyber Operations through the Cyber Infrastructure of a particular State whose technological capability is comparatively less to minimise the possibility of the State to suppress the attacks. For the above reasons, in a challenging domain like Cyber space it is necessary to have closely knit legal framework to curb the menace of malicious Cyber attacks. Devising of a Treaty to regulate how States address threats emerging from Cyber Space. The benefits of Treaty not only include co-operation among States but also by ameliorating States to adopt certain laws which are considered to suppress Cyber threats. With a specific end goal to make a safe the internet what is required is imminent participation and joint effort between the important partners (counting global associations, States, programming suppliers, digital security organizations and so forth) over issues of digital security and Internet administration. The Global Forum for Cyber Expertise (GFCE) established in the year 2015 with 50 members, aims to trade best practices and mastery on digital limit building. The point is to distinguish effective approaches, practices and thoughts and increase these on a worldwide level. Together with accomplices from NGOs, the tech group and the scholarly community GFCE individuals create handy activities to build Cyber capacity. However, it being a soft law mechanism it is necessary to address the issue with related Cyber-Specific Laws and International Treaty which addresses the same.\n12",
  "citations": {
    "style": "superscript",
    "flat_text": "HEINONLINE\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n# CYBERSPACE AND NON-STATE ACTORS: THE STATE'S INTERNATIONAL OBLIGATION\nValluri Parthasarthi, ICFAI University\n## Classification of Cyber conflict\nOne of the concerns in international humanitarian law is that of the classification of Cyber conflict, Classification of conflict is the first step in international humanitarian law as the identification determines legal subjects which are to be applied to it. It is essential to determine the character of the Cyber conflict, whether international or Non-international in nature. But prior to the inception of Geneva convention, Lassa Oppenheim’s definition of war was well accepted, which stated, “war is a contention between two or more States, through their armed forces, for the purpose of overpowering each other an imposing such conditions of peace as the victor pleases to be”. The key element in the mentioned definition is that the, conflict must have happened between two States. However the interstate conflict within the State was considered a non-international conflict unless it reaches a certain degree of belligerency. The term ‘belligerency’ and its implications have been discussed in United Kingdom’s ministry’s manual of Law and Armed conflict. After the carnage of the Second World War the international community took a different step in recognizing war in technical and material sense, hence developed into international customary law. Articles 2, 3 which are common for all the four Geneva Conventions there are two certain criteria which can be established to determine the international armed conflict that there is a confrontation between two States and the hostilities shall amount to armed conflict. According to Article 3, the armed conflict is not of an international nature but occurring in the territory of one of the contracting parties. The\n International humanitarian law distinguishes two types of armed conflicts, namely, international armed conflicts, opposing two or more States, and non-international armed conflicts, between governmental forces and nongovernmental armed groups, or between such groups only. IHL treaty law also establishes a distinction between non-international armed conflicts in the meaning of common Article 3 of the Geneva Conventions of 1949 and non-international armed conflicts falling within the definition provided in Art. 1 of Additional Protocol II.\n States and non-State actors like individuals, international organizations, multinational companies and international non-government organizations are regulated by, or subjected to, international law. They are called subjects of international law\n L Oppenheim, International Law: A Treatise II (Longman, Green and Co 1906) 56.\n UK Ministry of Defence, The Manual of the Law of Armed Conflict (2004) paragraph, 15.1.2. on belligerency\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nInternational Committee of Red Cross (ICRC) in the year 1949 broadened the scope of international armed conflict by its additional protocol I and II to the Geneva Conventions. The nature of armed conflict and the acts under it which constitute is mentioned under this Article. Geneva conventions and its additional protocols, conflict can be broadly classified into three categories they are:\na. International armed conflict between States.\nb. worldwide outfitted clash including national freedom developments.\nc. Non-international armed conflict between a State and armed groups or organized armed groups.\nThe first and third are recognized as customary classifications of conflict.\n## International Cyber conflict\nIt may be noted that for armed conflict there must be armed forces and it shall be international in nature (between States). It has to be further noted that, Cyber attacks are not aggressive and kinetic in nature per se. There are no weapons involved. Therefore at first instance, it can be deduced that Cyber-attacks are not armed in nature, such a deduction shall be dangerous and harmful to the Countries.\nAccording to Article 49 (1) of the Additional Protocol- 1 defines attacks. “as act of violence against the adversary either in attack or defence”. Similarly, the International Criminal Tribunal for former Yugoslavia in the case of Tadiac, said “resorting to armed force between States without recognizing any threshold for the duration or intensity of hostilities”. However, Cyber-attacks are not violent in nature but can trigger vehement circumstances. Hence, the classification of a cyber conflict requires nuanced examination.\n---\n Protocol Additional to the Geneva Conventions of 12 August 1949, and Relating to the Protection of Victims of Non-International Armed Conflicts (Protocol II)- Article 1 - Material field of application- 1. This Protocol, which develops and supplements Article 3 common to the Geneva Conventions of 12 August 1949 without modifying its existing conditions of application, shall apply to all armed conflicts which are not covered by Article 1 of the Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol I) and which take place in the territory of a High Contracting Party between its armed forces and dissident armed forces or other organized armed groups which, under responsible command, exercise such control over a part of its territory as to enable them to carry out sustained and concerted military operations and to implement this Protocol. 2- This Protocol shall not apply to situations of internal disturbances and tensions, such as riots, isolated and sporadic acts of violence and other acts of a similar nature, as not being armed conflicts.\n Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol 1)- Article 1(4)\n Prosecutor v. Dusko Tadic (Appeal Judgement), IT-94-1-A, International Criminal Tribunal for the former Yugoslavia (ICTY), 15 July 1999.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nIt is also pertinent to note that, according to the additional protocols to the Geneva Conventions, any hostility between the nations which results in the intervention of the members of the armed forces, it makes no difference as far as the intensity and duration of the conflict is concerned, as it is considered as an international conflict, Thus, a Cyber-attack will fall under ambit of ‘armed’ under International Humanitarian Law. The ICRC has taken a position on Cyber-attacks that, anything which disables an object is also an attack when it does not cause physical damage; this is a reasonable motion considering the extension for the notion of damage so is concerned. Since the operation is an attack, it is also armed in terms of qualification for armed conflict. That said, a de minimis standard should attach.\nIn addition to the attack being ‘armed’ it also has to be ‘international’ in nature. By the term international, it means an act by State or an act attributable by the State in a conflict. By the plain context of the arrangements referred to over, those led by a State's military qualify. In spite of the fact that Cyber-attack is not being specified in any of those arrangements, the author believes it is reasonable to attribute that the digital assaults by some of the law enforcement officers of the State qualify this analysis. The ICTY in this regard established in the case of Prosecutor v. Tadiac that, “Private individuals along or within the frame work of armed forces or in connection with the State authorities shall be deemed to be considered as a State organs.” Thus, it can be established that any attacks launched by the State, shall be deemed to have been launched by the State organs or by the individuals who were authorized to use the Cyber infrastructure on behalf of the State. A situation might arise, where in a relationship between a State and individual arise in conducting Cyber-attacks might not fall under the ambit of State organ or individuals acting on behalf of the State, the ICTY has declared that “overall control going beyond the mere financing and equipping of such forces and involving also participation in the planning and supervision of military operations”. In order to establish the term “overall control” and “international conflict”, the State must issue specific instructions or directives aimed at committing certain attacks. The obligation of the State not to facilitate or attribute any Cyber- attacks shall be discussed in the later stage of this Article.\n Y Sandoz and others (eds), Commentary on the Additional Protocols of 8 June 1977 to the Geneva Conventions of 12 August 1949 (Martinus Nijhof 1988) (AP Commentary) para 62\n 32nd International Conference: Resolutions and reports- www.icrc.org available at https://www.icrc.org/en/document/outcomes-32nd-international-conference-red-cross-and-red-crescent; last visited on April 27th, 2017.\n Supra 9\n Article 4 - Conduct of organs of a State, International Law Commission Report, A/56/10 August 2001.\n Supra 7\n Supra 7\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n# Non-International Cyber Conflict\nThe concept of Non-International armed conflict has been defined in negative by the common Article 3 in the Geneva conventions. Any violence between State’s armed groups and dissident armed groups within a State can be defined as Non-International armed conflict. The Additional Protocol – II, has also defined Non international armed conflict as a hostility between State’s forces and organized opposing armed forces. Hence, the two ingredients in determining the Non-International armed conflict are (i) participation by an organized armed group and (ii) with a particular level of intensity. According to common Article 3, the groups must be armed and organized for it to be considered as a party in the conflict. The ICTY has defined this element of it in the case of Prosecutor v. Limaj, “some degree of organisation by the parties will suffice to establish the existence of an armed conflict. This degree need not be the same as that required for establishing the responsibility of superiors for the acts of their subordinates within the organization, as no determination of individual criminal responsibility is intended under this provision of the Statute”. The group shall be organized, the term organized means acting in a cordial manner and capability to engage in violence in mission planning, sharing intelligence and exercising command and control, it is necessary for a group to possess these fundamentals to be considered as a party to the conflict. From the above it is clear that individuals who conduct Cyber-attacks against State cannot meet the organized criteria. Cyber-attacks conducted by a group on online are a bit difficult to classify because the members of the group might not know each other in their operations, however they act in a coordinated manner like setting objectives, identify the weakness in the system, injection of malware and maintain defences, all these activities are performed together in a coordinated manner. One of the other criterion to be met is the group shall be under the responsible command, it is not essential to have a hierarchical order of armed force but if capable of planning and executing operations, then it fall under this definition. In virtual organized group, this criteria can be met because of the nature of the operation carried for which it can be equated to military operations.\nIn summation to being organized, the group must also be armed. The meaning of armed in the Non-international armed conflict a be parallel comparison can be made to international armed conflict. As discussed above, it generally assumes the conduct of ‘attacks’. Yet, since Non-international armed conflict is ascertained on the activities of a group, as distinct from a State, the question of attribution of an individual member’s conduct to the group as a whole arises.\n Prosecutor V. Fatmir Limaj Haradin Bala Isak Musliu, It-03-66-T (2005)\n Paragraph 89, supra 14\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nSince it is the group that must be armed, the group itself must have a purpose of carrying out armed activities. If individual members of an organized group carry out Cyber attacks on their own accord, that is, not on behalf of the group, the group does not meet the armed criterion.\n## Non State Actors and ungoverned spaces\nThe concept of Non-State Actors and its presence in international law has increased steadily in past few decades. The Non-State actors are endowed with infrastructural, economic and institutional power but do not have any corresponding legal duties. The Non-State actors actions in recent times have amounted to gross violation to human rights and have committed violence to the largest degree possible, the impact of Non-State actors on international scenario has been immense hence the United Nations Security Council in the year 2004 passed resolution 1540, which says, “the States are required to refrain from providing any goods, services to or supporting Non State Actors s which develop, obtain, construct or transfer or use chemical weapons.” Historically, the international norms have failed to address the imbalance between legal obligation and duties of the Non-State Actors. The concept of Non-State actors can be understood as an entity, which is not actually a State and usually referred to armed, religious or civil groups. The CONTONOU defines Non State actors on a broader scale as, “The actors of cooperation will include: a: State (local, national and regional), b: Non-State: - Private Sector; - Economic and social partners, including trade union organizations; - Civil society in all its forms according to national characteristics”. The Non-State actors do not have any affiliation with the official State authorities nor have any financial/legal framework with reference to the States, they are often treated as new subjects of international law. The international law in recent times have undergone significant changes and attempts being made to reduce the gap between Non-State actors and international law paradigm. As said by Nicolas PM, “Nowadays international law reaches beyond nations, many acts such as certain criminal acts, trade, finance, commercial relationships, environmental issues, human rights and more. Now international law directly touches many individuals”. With reference to Cyber-attacks,\n United Nations Security Council, Resolution 1540 (2004), Non-Proliferation of Weapons of Mass Destruction, 28 April 2004\n Partnership Agreement Between the Members of the AFRICAN, CARIBEAN and PACIFIC Group of States of The One Part, and the European Community and its Member States, of the Other Part, Signed in COTONOU, BENIN ON 23 JUNE 2000. http://www.europarl.europa.eu available at http://www.europarl.europa.eu/intcoop/acp/03_01/pdf/mn3012634_en.pdf, last visited on April 13th, 2017.\n Rajkovic, N. M. (2012) “Global law” and governmentality: Reconceptualizing the ‘rule of law’ as rule ‘through’ law’, European Journal of International Relations, 18(1), 29–52.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nISIS (Islamic State) operates from territories such as Syria and Iraq and engages in criminal Cyber activities. Lately, ISIS is adept in using the internet for its own uses and in creating its own Cyber army, groups such as Cyber Caliphate, Islamic State Hacking Division, Islamic Cyber Army and Sons Caliphate army are the various Cyber attacking groups which carried out attacks on numerous networks such as hacking of Tony Blair (former Prime Minister U.K) and attacks on various governmental bodies and military organizations. The attack on destabilizing a French T.V network (tv5monde) and by propagating terror activities and execution videos on national network created panic and distress in international communities, later the France government in its official press release claimed it to be an act of terrorism and further using the official U.S Central command's YouTube account and telecasted terrorist propaganda videos, which was used for its recruitment purposes. All these activities were carried out from a State and using Cyber infrastructure, the liability of the State with regards to Cyber warfare has been a concern in international law.\n## State Obligation\nIt is an established principle in the international law, that States have inherent responsibility on its part to prevent cross border acts which are prohibited under international law. With reference to current international law, there are particularly four categories of offences which is an Obligation for the States to criminalise, they are offences against confidentiality, integrity and availability of Computer Systems, computer relates offences (Forgery, fraud) and offences related to Copyrights and related rights.\nAs discussed above the presence of Non-State actors in the international arena have been in ascendance, and the alleged acts committed by Non-State actors had caused considerable damage to the aggrieved countries. The States are obligated to obviate their Cyber framework from being exploited in any manner which is harmful to the international legal framework. The obligation consists of having a legal infrastructure domestically to prevent Cyber attacks and to take stringent measures against the offenders and also having a reasonable knowledge or anticipation the threat which might loom from their Cyber set up. The characteristics such as anonymity, accessibility and trans-borderless activities has privileged the Non-State Actors to operate within the States. In a colloquial sense, the States are not responsible for the acts of the\n ETS 185 – Cybercrime (Convention), 23.XI.2001, Additional Protocol to the Convention on Cyber Crime (Council Of Europe) adopted on 23rd November 2001) adopted in the year 2001.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nNon-State Actors; mere geographical and territorial link is not enough to hold the State responsible, the State can be held responsible under two circumstances in doing so, the draft Articles on State Responsibility on internationally wrongful Acts has to be considered. The text was adopted in the 53rd Session as submitted to the General Assembly in the year 2001. Article 2 States that, “Elements of an internationally wrongful act of a State\nThere is an internationally wrongful act of a State when conduct consisting of an action or omission:\n(a) is attributable to the State under international law; and\n(b) It Constitutes a breach of an international obligation of the State.”\nBy the above Article the State can be held responsible for the actions of the Non-State Actors if it is an internationally wrongful act which can be attributed to the State. The State must have directed, controlled or instructed the unlawful conduct for it be liable. Therefore, State exercised effective control over the unlawful conduct in question. However, the above doctrine cannot be used widely and is unlikely to occur because, as it is difficult to establish factual link between State and Non-State Actor, the offender must be accurately identified. There are many technical intricacies attached to it, the devices connected to the International Protocol (IP) addresses do not reveal the actual device or offender where offense is committed moreover the use of Virtual Private Networks (VPN) and Botnets have made it difficult to determine the device and address to make this doctrine practically applicable.\n## The customary international law\nCustomary international law refers to international obligations arising from established State practice, as opposed to obligations arising from formal written international treaties. Under customary international law the States are obligated to prevent their territory from being used to cause harm to other countries. This principle was first articulated in the case of Corfu channel. The brief facts of the case are, two British warships were bombarded by the mines in the Albanian waters, in this instance the State’s responsibility was discussed in maintaining peace and security. The international court of Justice in this case could not establish that the mines were set up by the Albanian Government. The Albanian Government should have known the existence of mines and ought to have warned the ships in the international waters. Thus, it\n Corfu Channel Case (United Kingdom v. Albania); Assessment of Compensation, 15 XII 49, International Court of Justice (ICJ), 15 December 1949\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nis well established that there is inherent obligation of the State to prevent its territory being used by Non-State Actors to cause significant damage to other States. The Tallinn Manual, prepared by the group of experts on invitation of NATO Cooperative Cyber Defence of Excellence, In late 2009, they met a global gathering of legitimate researchers and professionals to draft a manual tending to the issue of how to translate universal law with regards to Cyber operations and Cyber conflicts. In that capacity, it was the principal push to analyse this subject thoroughly and definitively and to convey some level of clearness to the related complex legitimate issues. Rule 5 of the Manual states that, State shall not knowingly allow the Cyber infrastructure located in its territory or under its exclusive governmental control to be used for acts that adversely and unlawfully affect other States. This onus also applies to harmful conduct originating from a State's territory. By referring to the Nicaragua Case, International Court of Justice held that Nicaragua was under an obligation to prevent its territory being used as a trafficking route for military equipment which was exploited by insurgents in El Salvador. Using the same comparison it can be established that in Cyberspace there exists a customary obligation to prevent Trans boundary activities which will affect the States adversely but also to prevent the Non-State Actors from using the Cyber infrastructure from being exploited.\nIn the Bosnian Genocide case the ICJ held that,\n“it is clear that the obligation in question is one of conduct and not one of result, in the sense that a State cannot be under an obligation to succeed, whatever the circumstances, in preventing the commission of genocide: the obligation of States parties is rather to employ all means reasonably available to them, so as to prevent genocide as far as possible.”\nIn discussing the nature of State’s obligation to prevent a conflict it should be noticed that there is no absolute obligation on State to succeed in quelling the insurgency. There is an obligation of the State to act in due diligence, i.e. For the State to take all necessary actions by reasonable means available to it. Where a State fails to conduct itself reasonably and violates an obligation of conduct the State is liable for the failure to prevent the unlawful conduct and not for the act that produces the resulting harm, which is significant from the perspective of the adequacy of compensation/reparations owed to the victim. Obligations of prevention are usually\n Tallinn Manual on The International Law Applicable to Cyber Warfare, 31-32 (Cambridge University Press 2013).\n Nicaragua v United States of America [1986] ICJ Rep 14, para 157\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\ncommitments of counteractive action are normally interpreted as best endeavours commitments, obliging States to take all sensible or important measures to keep a given occasion from occurring, but without warranting that the occasion won't happen. Professor Pisillo- Mazzeschi in his work on due diligence and the nature of International responsibility of the State has Stated that,\n“careful examination of [State] practice reveals that the obligation to prevent has a twofold content; that is, it includes two distinct obligations of the State. The first is that of possessing, on a permanent basis, a legal and administrative apparatus normally able to guarantee respect for the international norm on prevention. The second obligation, instead, is that of using such apparatus with the diligence that the circumstances require”.\nIt is also important for the State to have a strong legal framework which prohibits and punishes the wrongdoing of Cyber warfare. It is a well-established principle under customary international law that the State is obligated to have legal mechanisms which will not affect the interests of other States adversely. Developing State capability of preventing Cyber-attacks will invariably require enacting legislations and establishment of effective judicial authority to monitor the same. The States shall possess a legal system and sufficient resources to maintain a mechanism to control and monitor the activities. The States with a well developed economy and strong resources with regards to Cyber infrastructure are in a better position to monitor and to have an effective control mechanism in comparison to the States which are not well equipped with technological expertise and resources. However, basic vigilance, employment of law enforcing authorities in the territory of the State which is a basic attributes of a Government are expected from a Statee. International law is not worried with the way in which States choose to meet this specific obligation of theirs, In as much as these laws are sensibly adequate to anticipate antagonistic acts or to rebuff them after they have happened, the State has played out its obligation.\n## An Obligation of Conduct\nThe Convention on Cybercrime, requires States to adopt measures to establish procedures for the purpose of criminal investigations into, and criminal proceedings for, these offences. The above provision clearly obligates a State to devise a mechanism to curb the offences of Cyber\n Ricardo Pisillo- Mazzeschi, International Obligations to provide for Reparation Claims , A.Randelzhofer and C. Tomuschat, State Responsibility and the Individual, 149-172 (Kluwer Law International) 1999.\n Convention on Cybercrime Budapest, 23.XI.2001, Article 14(1),\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nthreats. If a State is having a requisite legal framework, the obligation is to use the framework to address the threats and to reduce its effect. In the conduct of malicious Cyber threats and trans boundary attacks, the convention on Cyber Crime (Council of Europe) requires State parties to adopt legislative and other measures the offences listed in the Convention are punishable by effective means. There is an obligation of conduct in International Law the standard in which each State is expected to act in furtherance to achieve the objectives of International law. The standard set for care is the due diligence standard, the obligation of due diligence is applied to International environment law, international human right law etc. This Article aims to characterize the material substance of the commitment of due diligence with specific reference to the standard commitment upon States to utilize their ability to keep their Cyber framework from being utilized by Non-State actors as a stage to perform trans boundary Cyber attacks. One of the primary elements of due diligence is the element of knowledge, it is necessary for the State to have knowledge about the threat for it suppress it and take necessary action. In the Corfu case, it was held that, “it cannot be concluded from the mere fact of the control exercised by a State over its territory and waters that that State necessarily knew, or ought to have known what was happening”. It is to be observed that, because a threat emerged within a State’s territory it does not imply that the State ought to have known about the imminent threat. Referring the Corfu Case, the ICJ indicated that Albania ought to have known the presence of the mines in its coastal waters, which it had control of it, the fact that Albanian coastal forces demanded the foreign vessels to request for permission before they entered the Strait further shifted the liability on Albania. The court presumed that the States shall know about the facts which are which are widely known or can be known through official government channels. The preposition of “State should have known “, plays an important role in international law as it will not be in harmony if a State could avoid responsibility by claiming it of inadequate knowledge if it could have discovered illegal activity through diligent decision. It is true in international scenario if any activity contrary to international law appears to have taken place within the territory of a State may be called upon to give its explication about it but the States cannot elude such a request by citing its ignorance of such activities which happened within the territory of the State. In the context of having adequate knowledge about the circumstances, the immediate question which arises is, “whether it is reasonable to expect the State would have known about the threat in those circumstances?”, in light of Cyber\n Article 13, Convention on Cyber Crime, Council Of Europe adopted on 23rd November 2001.\n Supra 20\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\ninfrastructure it is reasonable to assert that the State having adequate technical capacity and Cyber Infrastructure to have known about the circumstances. After establishing the circumstances which ought to have been known by the State it also essential to address the due diligence standard require and how much affirmative action can be expected from the State. In a much broader sense the States are obligated to use their legislative framework and infrastructure to check the threats which are originated within the territory and deterring the future wrong doers. In a famous Pulp Mills decision between Uruguay and Argentina the ICJ rules that, “is an obligation which entails not only the adoption of appropriate rules and measures, but also a certain level of vigilance in their enforcement”. In fulfilling States obligation the States are required to conduct investigation process and effectively reprimand the individuals. This principle was further laid down in the Janes Case, Mexican authorities failed in their duty of due diligence to protect from harm an American citizen in Mexico because, the Mexican authorities took no proper steps to apprehend and punish Carbajal [the individual responsible for killing the American national] and that such efforts as were made were lax and inadequate. The Tribunal concluded that “[t]he culprit is liable for having killed or murdered an American national; the Government is liable for not having measured up to its duty of diligently prosecuting and properly punishing the offender”.\nHence, as an obligation of conduct, as opposed to come about, deciding how a reasonable State would have responded to a risk is liable to an 'accessible means' examination, which requires recognizable proof of the monetary, specialized and Human Resources of the State. The essence of the matter is that a due diligence commitment must be translated in a way which does not force an outlandish results or impose disproportionate burden on societies. Therefore in order to discharge due diligence obligation to prevent Cyber Attacks or any kind of an act which is contrary to the principle of International law, a State is required only to take those measures that are reasonably available and within its power.\n## Conclusion\nThis essay has discussed that customary international law imposes an obligation on member States to prevent Cyber Infrastructure present in the territory of the State from being used in a manner which causes injury to other States. The obligation includes, the States to have a legal mechanism within the territory which is capable of controlling Cyber Attacks and secondly,\n Pulp Mills on the River Uruguay (Argentina v. Uruguay), Judgment, I.C.J. Reports 2010, p. 14.\n Laura M. B. Janes Et Al. (U.S.A.) V. United Mexican States, Volume iv P.138.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nwhere a threat emerges and States have knowledge of that threat they must act reasonably and use the resources effectively to suppress the attacks. This duty does not specify the nature of legal mechanism that is required by the States to cogently address Cyber threats emerging from Cyber Space. In a heavily interconnected domain like Cyber Space the Non-State Actors will easily reroute their malicious Cyber Operations through the Cyber Infrastructure of a particular State whose technological capability is comparatively less to minimise the possibility of the State to suppress the attacks. For the above reasons, in a challenging domain like Cyber space it is necessary to have closely knit legal framework to curb the menace of malicious Cyber attacks. Devising of a Treaty to regulate how States address threats emerging from Cyber Space. The benefits of Treaty not only include co-operation among States but also by ameliorating States to adopt certain laws which are considered to suppress Cyber threats. With a specific end goal to make a safe the internet what is required is imminent participation and joint effort between the important partners (counting global associations, States, programming suppliers, digital security organizations and so forth) over issues of digital security and Internet administration. The Global Forum for Cyber Expertise (GFCE) established in the year 2015 with 50 members, aims to trade best practices and mastery on digital limit building. The point is to distinguish effective approaches, practices and thoughts and increase these on a worldwide level. Together with accomplices from NGOs, the tech group and the scholarly community GFCE individuals create handy activities to build Cyber capacity. However, it being a soft law mechanism it is necessary to address the issue with related Cyber-Specific Laws and International Treaty which addresses the same.\n12",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 56,
        "success_occurrences": 56,
        "success_unique": 28,
        "bib_unique_total": 28,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 1.0,
        "success_percentage": 100.0,
        "style": "superscript"
      },
      "results": [
        {
          "index": 1,
          "intext_citation": "¹",
          "preceding_text": "assification of Cyber conflict",
          "footnote": "International humanitarian law distinguishes two types of armed conflicts, namely, international armed conflicts, opposing two or more States, and non-international armed conflicts, between governmental forces and nongovernmental armed groups, or between such groups only. IHL treaty law also establishes a distinction between non-international armed conflicts in the meaning of common Article 3 of the Geneva Conventions of 1949 and non-international armed conflicts falling within the definition provided in Art. 1 of Additional Protocol II.",
          "position": 578
        },
        {
          "index": 2,
          "intext_citation": "²",
          "preceding_text": "tion determines legal subjects",
          "footnote": "States and non-State actors like individuals, international organizations, multinational companies and international non-government organizations are regulated by, or subjected to, international law. They are called subjects of international law",
          "position": 707
        },
        {
          "index": 3,
          "intext_citation": "³",
          "preceding_text": "e as the victor pleases to be”",
          "footnote": "L Oppenheim, International Law: A Treatise II (Longman, Green and Co 1906) 56.",
          "position": 1163
        },
        {
          "index": 4,
          "intext_citation": "⁴",
          "preceding_text": "nual of Law and Armed conflict",
          "footnote": "UK Ministry of Defence, The Manual of the Law of Armed Conflict (2004) paragraph, 15.1.2. on belligerency",
          "position": 1544
        },
        {
          "index": 1,
          "intext_citation": "¹",
          "preceding_text": "The",
          "footnote": "International humanitarian law distinguishes two types of armed conflicts, namely, international armed conflicts, opposing two or more States, and non-international armed conflicts, between governmental forces and nongovernmental armed groups, or between such groups only. IHL treaty law also establishes a distinction between non-international armed conflicts in the meaning of common Article 3 of the Geneva Conventions of 1949 and non-international armed conflicts falling within the definition provided in Art. 1 of Additional Protocol II.",
          "position": 2158
        },
        {
          "index": 2,
          "intext_citation": "²",
          "preceding_text": "",
          "footnote": "States and non-State actors like individuals, international organizations, multinational companies and international non-government organizations are regulated by, or subjected to, international law. They are called subjects of international law",
          "position": 2704
        },
        {
          "index": 3,
          "intext_citation": "³",
          "preceding_text": "subjects of international law\n",
          "footnote": "L Oppenheim, International Law: A Treatise II (Longman, Green and Co 1906) 56.",
          "position": 2952
        },
        {
          "index": 4,
          "intext_citation": "⁴",
          "preceding_text": "",
          "footnote": "UK Ministry of Defence, The Manual of the Law of Armed Conflict (2004) paragraph, 15.1.2. on belligerency",
          "position": 3033
        },
        {
          "index": 5,
          "intext_citation": "⁵",
          "preceding_text": "s mentioned under this Article",
          "footnote": "Protocol Additional to the Geneva Conventions of 12 August 1949, and Relating to the Protection of Victims of Non-International Armed Conflicts (Protocol II)- Article 1 - Material field of application- 1. This Protocol, which develops and supplements Article 3 common to the Geneva Conventions of 12 August 1949 without modifying its existing conditions of application, shall apply to all armed conflicts which are not covered by Article 1 of the Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol I) and which take place in the territory of a High Contracting Party between its armed forces and dissident armed forces or other organized armed groups which, under responsible command, exercise such control over a part of its territory as to enable them to carry out sustained and concerted military operations and to implement this Protocol. 2- This Protocol shall not apply to situations of internal disturbances and tensions, such as riots, isolated and sporadic acts of violence and other acts of a similar nature, as not being armed conflicts.",
          "position": 3493
        },
        {
          "index": 6,
          "intext_citation": "⁶",
          "preceding_text": " national freedom developments",
          "footnote": "Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol 1)- Article 1(4)",
          "position": 3728
        },
        {
          "index": 7,
          "intext_citation": "⁷",
          "preceding_text": "goslavia in the case of Tadiac",
          "footnote": "Prosecutor v. Dusko Tadic (Appeal Judgement), IT-94-1-A, International Criminal Tribunal for the former Yugoslavia (ICTY), 15 July 1999.",
          "position": 4582
        },
        {
          "index": 5,
          "intext_citation": "⁵",
          "preceding_text": "---",
          "footnote": "Protocol Additional to the Geneva Conventions of 12 August 1949, and Relating to the Protection of Victims of Non-International Armed Conflicts (Protocol II)- Article 1 - Material field of application- 1. This Protocol, which develops and supplements Article 3 common to the Geneva Conventions of 12 August 1949 without modifying its existing conditions of application, shall apply to all armed conflicts which are not covered by Article 1 of the Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol I) and which take place in the territory of a High Contracting Party between its armed forces and dissident armed forces or other organized armed groups which, under responsible command, exercise such control over a part of its territory as to enable them to carry out sustained and concerted military operations and to implement this Protocol. 2- This Protocol shall not apply to situations of internal disturbances and tensions, such as riots, isolated and sporadic acts of violence and other acts of a similar nature, as not being armed conflicts.",
          "position": 4881
        },
        {
          "index": 6,
          "intext_citation": "⁶",
          "preceding_text": "",
          "footnote": "Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol 1)- Article 1(4)",
          "position": 6031
        },
        {
          "index": 7,
          "intext_citation": "⁷",
          "preceding_text": "ts (Protocol 1)- Article 1(4)\n",
          "footnote": "Prosecutor v. Dusko Tadic (Appeal Judgement), IT-94-1-A, International Criminal Tribunal for the former Yugoslavia (ICTY), 15 July 1999.",
          "position": 6200
        },
        {
          "index": 8,
          "intext_citation": "⁸",
          "preceding_text": "d as an international conflict",
          "footnote": "Y Sandoz and others (eds), Commentary on the Additional Protocols of 8 June 1977 to the Geneva Conventions of 12 August 1949 (Martinus Nijhof 1988) (AP Commentary) para 62",
          "position": 6758
        },
        {
          "index": 9,
          "intext_citation": "⁹",
          "preceding_text": "The ICRC",
          "footnote": "32nd International Conference: Resolutions and reports- www.icrc.org available at https://www.icrc.org/en/document/outcomes-32nd-international-conference-red-cross-and-red-crescent; last visited on April 27th, 2017.",
          "position": 6861
        },
        {
          "index": 10,
          "intext_citation": "¹⁰",
          "preceding_text": "does not cause physical damage",
          "footnote": "Supra 9",
          "position": 6997
        },
        {
          "index": 11,
          "intext_citation": "¹¹",
          "preceding_text": " officers of the State qualify",
          "footnote": "Article 4 - Conduct of organs of a State, International Law Commission Report, A/56/10 August 2001.",
          "position": 7758
        },
        {
          "index": 12,
          "intext_citation": "¹²",
          "preceding_text": "e considered as a State organs",
          "footnote": "Supra 7",
          "position": 8016
        },
        {
          "index": 13,
          "intext_citation": "¹³",
          "preceding_text": "vision of military operations”",
          "footnote": "Supra 7",
          "position": 8644
        },
        {
          "index": 8,
          "intext_citation": "⁸",
          "preceding_text": "",
          "footnote": "Y Sandoz and others (eds), Commentary on the Additional Protocols of 8 June 1977 to the Geneva Conventions of 12 August 1949 (Martinus Nijhof 1988) (AP Commentary) para 62",
          "position": 8954
        },
        {
          "index": 9,
          "intext_citation": "⁹",
          "preceding_text": "1988) (AP Commentary) para 62\n",
          "footnote": "32nd International Conference: Resolutions and reports- www.icrc.org available at https://www.icrc.org/en/document/outcomes-32nd-international-conference-red-cross-and-red-crescent; last visited on April 27th, 2017.",
          "position": 9128
        },
        {
          "index": 10,
          "intext_citation": "¹⁰",
          "preceding_text": "",
          "footnote": "Supra 9",
          "position": 9346
        },
        {
          "index": 11,
          "intext_citation": "¹¹",
          "preceding_text": "¹⁰ Supra 9",
          "footnote": "Article 4 - Conduct of organs of a State, International Law Commission Report, A/56/10 August 2001.",
          "position": 9357
        },
        {
          "index": 12,
          "intext_citation": "¹²",
          "preceding_text": "",
          "footnote": "Supra 7",
          "position": 9460
        },
        {
          "index": 13,
          "intext_citation": "¹³",
          "preceding_text": "¹² Supra 7",
          "footnote": "Supra 7",
          "position": 9471
        },
        {
          "index": 14,
          "intext_citation": "¹⁴",
          "preceding_text": "Limaj",
          "footnote": "Prosecutor V. Fatmir Limaj Haradin Bala Isak Musliu, It-03-66-T (2005)",
          "position": 10385
        },
        {
          "index": 15,
          "intext_citation": "¹⁵",
          "preceding_text": "this provision of the Statute”",
          "footnote": "Paragraph 89, supra 14",
          "position": 10760
        },
        {
          "index": 14,
          "intext_citation": "¹⁴",
          "preceding_text": "",
          "footnote": "Prosecutor V. Fatmir Limaj Haradin Bala Isak Musliu, It-03-66-T (2005)",
          "position": 12422
        },
        {
          "index": 15,
          "intext_citation": "¹⁵",
          "preceding_text": "sak Musliu, It-03-66-T (2005)\n",
          "footnote": "Paragraph 89, supra 14",
          "position": 12496
        },
        {
          "index": 16,
          "intext_citation": "¹⁶",
          "preceding_text": "ansfer or use chemical weapons",
          "footnote": "United Nations Security Council, Resolution 1540 (2004), Non-Proliferation of Weapons of Mass Destruction, 28 April 2004",
          "position": 13673
        },
        {
          "index": 17,
          "intext_citation": "¹⁷",
          "preceding_text": "ng to national characteristics",
          "footnote": "Partnership Agreement Between the Members of the AFRICAN, CARIBEAN and PACIFIC Group of States of The One Part, and the European Community and its Member States, of the Other Part, Signed in COTONOU, BENIN ON 23 JUNE 2000. http://www.europarl.europa.eu available at http://www.europarl.europa.eu/intcoop/acp/03_01/pdf/mn3012634_en.pdf, last visited on April 13th, 2017.",
          "position": 14280
        },
        {
          "index": 18,
          "intext_citation": "¹⁸",
          "preceding_text": "ctly touches many individuals”",
          "footnote": "Rajkovic, N. M. (2012) “Global law” and governmentality: Reconceptualizing the ‘rule of law’ as rule ‘through’ law’, European Journal of International Relations, 18(1), 29–52.",
          "position": 14931
        },
        {
          "index": 16,
          "intext_citation": "¹⁶",
          "preceding_text": "h reference to Cyber-attacks,\n",
          "footnote": "United Nations Security Council, Resolution 1540 (2004), Non-Proliferation of Weapons of Mass Destruction, 28 April 2004",
          "position": 14968
        },
        {
          "index": 17,
          "intext_citation": "¹⁷",
          "preceding_text": "ss Destruction, 28 April 2004\n",
          "footnote": "Partnership Agreement Between the Members of the AFRICAN, CARIBEAN and PACIFIC Group of States of The One Part, and the European Community and its Member States, of the Other Part, Signed in COTONOU, BENIN ON 23 JUNE 2000. http://www.europarl.europa.eu available at http://www.europarl.europa.eu/intcoop/acp/03_01/pdf/mn3012634_en.pdf, last visited on April 13th, 2017.",
          "position": 15092
        },
        {
          "index": 18,
          "intext_citation": "¹⁸",
          "preceding_text": "",
          "footnote": "Rajkovic, N. M. (2012) “Global law” and governmentality: Reconceptualizing the ‘rule of law’ as rule ‘through’ law’, European Journal of International Relations, 18(1), 29–52.",
          "position": 15465
        },
        {
          "index": 19,
          "intext_citation": "¹⁹",
          "preceding_text": " Copyrights and related rights",
          "footnote": "ETS 185 – Cybercrime (Convention), 23.XI.2001, Additional Protocol to the Convention on Cyber Crime (Council Of Europe) adopted on 23rd November 2001) adopted in the year 2001.",
          "position": 17423
        },
        {
          "index": 19,
          "intext_citation": "¹⁹",
          "preceding_text": "sponsible for the acts of the\n",
          "footnote": "ETS 185 – Cybercrime (Convention), 23.XI.2001, Additional Protocol to the Convention on Cyber Crime (Council Of Europe) adopted on 23rd November 2001) adopted in the year 2001.",
          "position": 18270
        },
        {
          "index": 20,
          "intext_citation": "²⁰",
          "preceding_text": "d in the case of Corfu channel",
          "footnote": "Corfu Channel Case (United Kingdom v. Albania); Assessment of Compensation, 15 XII 49, International Court of Justice (ICJ), 15 December 1949",
          "position": 20549
        },
        {
          "index": 20,
          "intext_citation": "²⁰",
          "preceding_text": "Thus, it",
          "footnote": "Corfu Channel Case (United Kingdom v. Albania); Assessment of Compensation, 15 XII 49, International Court of Justice (ICJ), 15 December 1949",
          "position": 21013
        },
        {
          "index": 21,
          "intext_citation": "²¹",
          "preceding_text": "unlawfully affect other States",
          "footnote": "Tallinn Manual on The International Law Applicable to Cyber Warfare, 31-32 (Cambridge University Press 2013).",
          "position": 22137
        },
        {
          "index": 22,
          "intext_citation": "²²",
          "preceding_text": "eferring to the Nicaragua Case",
          "footnote": "Nicaragua v United States of America [1986] ICJ Rep 14, para 157",
          "position": 22255
        },
        {
          "index": 21,
          "intext_citation": "²¹",
          "preceding_text": "ons of prevention are usually\n",
          "footnote": "Tallinn Manual on The International Law Applicable to Cyber Warfare, 31-32 (Cambridge University Press 2013).",
          "position": 23831
        },
        {
          "index": 22,
          "intext_citation": "²²",
          "preceding_text": "",
          "footnote": "Nicaragua v United States of America [1986] ICJ Rep 14, para 157",
          "position": 23944
        },
        {
          "index": 23,
          "intext_citation": "²³",
          "preceding_text": "that the circumstances require",
          "footnote": "Ricardo Pisillo- Mazzeschi, International Obligations to provide for Reparation Claims , A.Randelzhofer and C. Tomuschat, State Responsibility and the Individual, 149-172 (Kluwer Law International) 1999.",
          "position": 24917
        },
        {
          "index": 24,
          "intext_citation": "²⁴",
          "preceding_text": "roceedings for, these offences",
          "footnote": "Convention on Cybercrime Budapest, 23.XI.2001, Article 14(1),",
          "position": 26470
        },
        {
          "index": 23,
          "intext_citation": "²³",
          "preceding_text": "to curb the offences of Cyber\n",
          "footnote": "Ricardo Pisillo- Mazzeschi, International Obligations to provide for Reparation Claims , A.Randelzhofer and C. Tomuschat, State Responsibility and the Individual, 149-172 (Kluwer Law International) 1999.",
          "position": 26572
        },
        {
          "index": 24,
          "intext_citation": "²⁴",
          "preceding_text": "",
          "footnote": "Convention on Cybercrime Budapest, 23.XI.2001, Article 14(1),",
          "position": 26779
        },
        {
          "index": 25,
          "intext_citation": "²⁵",
          "preceding_text": " punishable by effective means",
          "footnote": "Article 13, Convention on Cyber Crime, Council Of Europe adopted on 23rd November 2001.",
          "position": 27322
        },
        {
          "index": 26,
          "intext_citation": "²⁶",
          "preceding_text": "have known what was happening”",
          "footnote": "Supra 20",
          "position": 28374
        },
        {
          "index": 25,
          "intext_citation": "²⁵",
          "preceding_text": "mstances?”, in light of Cyber\n",
          "footnote": "Article 13, Convention on Cyber Crime, Council Of Europe adopted on 23rd November 2001.",
          "position": 29840
        },
        {
          "index": 26,
          "intext_citation": "²⁶",
          "preceding_text": "",
          "footnote": "Supra 20",
          "position": 29931
        },
        {
          "index": 27,
          "intext_citation": "²⁷",
          "preceding_text": "igilance in their enforcement”",
          "footnote": "Pulp Mills on the River Uruguay (Argentina v. Uruguay), Judgment, I.C.J. Reports 2010, p. 14.",
          "position": 30819
        },
        {
          "index": 28,
          "intext_citation": "²⁸",
          "preceding_text": "er laid down in the Janes Case",
          "footnote": "Laura M. B. Janes Et Al. (U.S.A.) V. United Mexican States, Volume iv P.138.",
          "position": 31009
        },
        {
          "index": 27,
          "intext_citation": "²⁷",
          "preceding_text": "g Cyber Attacks and secondly,\n",
          "footnote": "Pulp Mills on the River Uruguay (Argentina v. Uruguay), Judgment, I.C.J. Reports 2010, p. 14.",
          "position": 32665
        },
        {
          "index": 28,
          "intext_citation": "²⁸",
          "preceding_text": "",
          "footnote": "Laura M. B. Janes Et Al. (U.S.A.) V. United Mexican States, Volume iv P.138.",
          "position": 32762
        }
      ],
      "flat_text": "HEINONLINE\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n# CYBERSPACE AND NON-STATE ACTORS: THE STATE'S INTERNATIONAL OBLIGATION\nValluri Parthasarthi, ICFAI University\n## Classification of Cyber conflict\nOne of the concerns in international humanitarian law is that of the classification of Cyber conflict, Classification of conflict is the first step in international humanitarian law as the identification determines legal subjects which are to be applied to it. It is essential to determine the character of the Cyber conflict, whether international or Non-international in nature. But prior to the inception of Geneva convention, Lassa Oppenheim’s definition of war was well accepted, which stated, “war is a contention between two or more States, through their armed forces, for the purpose of overpowering each other an imposing such conditions of peace as the victor pleases to be”. The key element in the mentioned definition is that the, conflict must have happened between two States. However the interstate conflict within the State was considered a non-international conflict unless it reaches a certain degree of belligerency. The term ‘belligerency’ and its implications have been discussed in United Kingdom’s ministry’s manual of Law and Armed conflict. After the carnage of the Second World War the international community took a different step in recognizing war in technical and material sense, hence developed into international customary law. Articles 2, 3 which are common for all the four Geneva Conventions there are two certain criteria which can be established to determine the international armed conflict that there is a confrontation between two States and the hostilities shall amount to armed conflict. According to Article 3, the armed conflict is not of an international nature but occurring in the territory of one of the contracting parties. The\n International humanitarian law distinguishes two types of armed conflicts, namely, international armed conflicts, opposing two or more States, and non-international armed conflicts, between governmental forces and nongovernmental armed groups, or between such groups only. IHL treaty law also establishes a distinction between non-international armed conflicts in the meaning of common Article 3 of the Geneva Conventions of 1949 and non-international armed conflicts falling within the definition provided in Art. 1 of Additional Protocol II.\n States and non-State actors like individuals, international organizations, multinational companies and international non-government organizations are regulated by, or subjected to, international law. They are called subjects of international law\n L Oppenheim, International Law: A Treatise II (Longman, Green and Co 1906) 56.\n UK Ministry of Defence, The Manual of the Law of Armed Conflict (2004) paragraph, 15.1.2. on belligerency\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nInternational Committee of Red Cross (ICRC) in the year 1949 broadened the scope of international armed conflict by its additional protocol I and II to the Geneva Conventions. The nature of armed conflict and the acts under it which constitute is mentioned under this Article. Geneva conventions and its additional protocols, conflict can be broadly classified into three categories they are:\na. International armed conflict between States.\nb. worldwide outfitted clash including national freedom developments.\nc. Non-international armed conflict between a State and armed groups or organized armed groups.\nThe first and third are recognized as customary classifications of conflict.\n## International Cyber conflict\nIt may be noted that for armed conflict there must be armed forces and it shall be international in nature (between States). It has to be further noted that, Cyber attacks are not aggressive and kinetic in nature per se. There are no weapons involved. Therefore at first instance, it can be deduced that Cyber-attacks are not armed in nature, such a deduction shall be dangerous and harmful to the Countries.\nAccording to Article 49 (1) of the Additional Protocol- 1 defines attacks. “as act of violence against the adversary either in attack or defence”. Similarly, the International Criminal Tribunal for former Yugoslavia in the case of Tadiac, said “resorting to armed force between States without recognizing any threshold for the duration or intensity of hostilities”. However, Cyber-attacks are not violent in nature but can trigger vehement circumstances. Hence, the classification of a cyber conflict requires nuanced examination.\n---\n Protocol Additional to the Geneva Conventions of 12 August 1949, and Relating to the Protection of Victims of Non-International Armed Conflicts (Protocol II)- Article 1 - Material field of application- 1. This Protocol, which develops and supplements Article 3 common to the Geneva Conventions of 12 August 1949 without modifying its existing conditions of application, shall apply to all armed conflicts which are not covered by Article 1 of the Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol I) and which take place in the territory of a High Contracting Party between its armed forces and dissident armed forces or other organized armed groups which, under responsible command, exercise such control over a part of its territory as to enable them to carry out sustained and concerted military operations and to implement this Protocol. 2- This Protocol shall not apply to situations of internal disturbances and tensions, such as riots, isolated and sporadic acts of violence and other acts of a similar nature, as not being armed conflicts.\n Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol 1)- Article 1(4)\n Prosecutor v. Dusko Tadic (Appeal Judgement), IT-94-1-A, International Criminal Tribunal for the former Yugoslavia (ICTY), 15 July 1999.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nIt is also pertinent to note that, according to the additional protocols to the Geneva Conventions, any hostility between the nations which results in the intervention of the members of the armed forces, it makes no difference as far as the intensity and duration of the conflict is concerned, as it is considered as an international conflict, Thus, a Cyber-attack will fall under ambit of ‘armed’ under International Humanitarian Law. The ICRC has taken a position on Cyber-attacks that, anything which disables an object is also an attack when it does not cause physical damage; this is a reasonable motion considering the extension for the notion of damage so is concerned. Since the operation is an attack, it is also armed in terms of qualification for armed conflict. That said, a de minimis standard should attach.\nIn addition to the attack being ‘armed’ it also has to be ‘international’ in nature. By the term international, it means an act by State or an act attributable by the State in a conflict. By the plain context of the arrangements referred to over, those led by a State's military qualify. In spite of the fact that Cyber-attack is not being specified in any of those arrangements, the author believes it is reasonable to attribute that the digital assaults by some of the law enforcement officers of the State qualify this analysis. The ICTY in this regard established in the case of Prosecutor v. Tadiac that, “Private individuals along or within the frame work of armed forces or in connection with the State authorities shall be deemed to be considered as a State organs.” Thus, it can be established that any attacks launched by the State, shall be deemed to have been launched by the State organs or by the individuals who were authorized to use the Cyber infrastructure on behalf of the State. A situation might arise, where in a relationship between a State and individual arise in conducting Cyber-attacks might not fall under the ambit of State organ or individuals acting on behalf of the State, the ICTY has declared that “overall control going beyond the mere financing and equipping of such forces and involving also participation in the planning and supervision of military operations”. In order to establish the term “overall control” and “international conflict”, the State must issue specific instructions or directives aimed at committing certain attacks. The obligation of the State not to facilitate or attribute any Cyber- attacks shall be discussed in the later stage of this Article.\n Y Sandoz and others (eds), Commentary on the Additional Protocols of 8 June 1977 to the Geneva Conventions of 12 August 1949 (Martinus Nijhof 1988) (AP Commentary) para 62\n 32nd International Conference: Resolutions and reports- www.icrc.org available at https://www.icrc.org/en/document/outcomes-32nd-international-conference-red-cross-and-red-crescent; last visited on April 27th, 2017.\n Supra 9\n Article 4 - Conduct of organs of a State, International Law Commission Report, A/56/10 August 2001.\n Supra 7\n Supra 7\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n# Non-International Cyber Conflict\nThe concept of Non-International armed conflict has been defined in negative by the common Article 3 in the Geneva conventions. Any violence between State’s armed groups and dissident armed groups within a State can be defined as Non-International armed conflict. The Additional Protocol – II, has also defined Non international armed conflict as a hostility between State’s forces and organized opposing armed forces. Hence, the two ingredients in determining the Non-International armed conflict are (i) participation by an organized armed group and (ii) with a particular level of intensity. According to common Article 3, the groups must be armed and organized for it to be considered as a party in the conflict. The ICTY has defined this element of it in the case of Prosecutor v. Limaj, “some degree of organisation by the parties will suffice to establish the existence of an armed conflict. This degree need not be the same as that required for establishing the responsibility of superiors for the acts of their subordinates within the organization, as no determination of individual criminal responsibility is intended under this provision of the Statute”. The group shall be organized, the term organized means acting in a cordial manner and capability to engage in violence in mission planning, sharing intelligence and exercising command and control, it is necessary for a group to possess these fundamentals to be considered as a party to the conflict. From the above it is clear that individuals who conduct Cyber-attacks against State cannot meet the organized criteria. Cyber-attacks conducted by a group on online are a bit difficult to classify because the members of the group might not know each other in their operations, however they act in a coordinated manner like setting objectives, identify the weakness in the system, injection of malware and maintain defences, all these activities are performed together in a coordinated manner. One of the other criterion to be met is the group shall be under the responsible command, it is not essential to have a hierarchical order of armed force but if capable of planning and executing operations, then it fall under this definition. In virtual organized group, this criteria can be met because of the nature of the operation carried for which it can be equated to military operations.\nIn summation to being organized, the group must also be armed. The meaning of armed in the Non-international armed conflict a be parallel comparison can be made to international armed conflict. As discussed above, it generally assumes the conduct of ‘attacks’. Yet, since Non-international armed conflict is ascertained on the activities of a group, as distinct from a State, the question of attribution of an individual member’s conduct to the group as a whole arises.\n Prosecutor V. Fatmir Limaj Haradin Bala Isak Musliu, It-03-66-T (2005)\n Paragraph 89, supra 14\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nSince it is the group that must be armed, the group itself must have a purpose of carrying out armed activities. If individual members of an organized group carry out Cyber attacks on their own accord, that is, not on behalf of the group, the group does not meet the armed criterion.\n## Non State Actors and ungoverned spaces\nThe concept of Non-State Actors and its presence in international law has increased steadily in past few decades. The Non-State actors are endowed with infrastructural, economic and institutional power but do not have any corresponding legal duties. The Non-State actors actions in recent times have amounted to gross violation to human rights and have committed violence to the largest degree possible, the impact of Non-State actors on international scenario has been immense hence the United Nations Security Council in the year 2004 passed resolution 1540, which says, “the States are required to refrain from providing any goods, services to or supporting Non State Actors s which develop, obtain, construct or transfer or use chemical weapons.” Historically, the international norms have failed to address the imbalance between legal obligation and duties of the Non-State Actors. The concept of Non-State actors can be understood as an entity, which is not actually a State and usually referred to armed, religious or civil groups. The CONTONOU defines Non State actors on a broader scale as, “The actors of cooperation will include: a: State (local, national and regional), b: Non-State: - Private Sector; - Economic and social partners, including trade union organizations; - Civil society in all its forms according to national characteristics”. The Non-State actors do not have any affiliation with the official State authorities nor have any financial/legal framework with reference to the States, they are often treated as new subjects of international law. The international law in recent times have undergone significant changes and attempts being made to reduce the gap between Non-State actors and international law paradigm. As said by Nicolas PM, “Nowadays international law reaches beyond nations, many acts such as certain criminal acts, trade, finance, commercial relationships, environmental issues, human rights and more. Now international law directly touches many individuals”. With reference to Cyber-attacks,\n United Nations Security Council, Resolution 1540 (2004), Non-Proliferation of Weapons of Mass Destruction, 28 April 2004\n Partnership Agreement Between the Members of the AFRICAN, CARIBEAN and PACIFIC Group of States of The One Part, and the European Community and its Member States, of the Other Part, Signed in COTONOU, BENIN ON 23 JUNE 2000. http://www.europarl.europa.eu available at http://www.europarl.europa.eu/intcoop/acp/03_01/pdf/mn3012634_en.pdf, last visited on April 13th, 2017.\n Rajkovic, N. M. (2012) “Global law” and governmentality: Reconceptualizing the ‘rule of law’ as rule ‘through’ law’, European Journal of International Relations, 18(1), 29–52.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nISIS (Islamic State) operates from territories such as Syria and Iraq and engages in criminal Cyber activities. Lately, ISIS is adept in using the internet for its own uses and in creating its own Cyber army, groups such as Cyber Caliphate, Islamic State Hacking Division, Islamic Cyber Army and Sons Caliphate army are the various Cyber attacking groups which carried out attacks on numerous networks such as hacking of Tony Blair (former Prime Minister U.K) and attacks on various governmental bodies and military organizations. The attack on destabilizing a French T.V network (tv5monde) and by propagating terror activities and execution videos on national network created panic and distress in international communities, later the France government in its official press release claimed it to be an act of terrorism and further using the official U.S Central command's YouTube account and telecasted terrorist propaganda videos, which was used for its recruitment purposes. All these activities were carried out from a State and using Cyber infrastructure, the liability of the State with regards to Cyber warfare has been a concern in international law.\n## State Obligation\nIt is an established principle in the international law, that States have inherent responsibility on its part to prevent cross border acts which are prohibited under international law. With reference to current international law, there are particularly four categories of offences which is an Obligation for the States to criminalise, they are offences against confidentiality, integrity and availability of Computer Systems, computer relates offences (Forgery, fraud) and offences related to Copyrights and related rights.\nAs discussed above the presence of Non-State actors in the international arena have been in ascendance, and the alleged acts committed by Non-State actors had caused considerable damage to the aggrieved countries. The States are obligated to obviate their Cyber framework from being exploited in any manner which is harmful to the international legal framework. The obligation consists of having a legal infrastructure domestically to prevent Cyber attacks and to take stringent measures against the offenders and also having a reasonable knowledge or anticipation the threat which might loom from their Cyber set up. The characteristics such as anonymity, accessibility and trans-borderless activities has privileged the Non-State Actors to operate within the States. In a colloquial sense, the States are not responsible for the acts of the\n ETS 185 – Cybercrime (Convention), 23.XI.2001, Additional Protocol to the Convention on Cyber Crime (Council Of Europe) adopted on 23rd November 2001) adopted in the year 2001.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nNon-State Actors; mere geographical and territorial link is not enough to hold the State responsible, the State can be held responsible under two circumstances in doing so, the draft Articles on State Responsibility on internationally wrongful Acts has to be considered. The text was adopted in the 53rd Session as submitted to the General Assembly in the year 2001. Article 2 States that, “Elements of an internationally wrongful act of a State\nThere is an internationally wrongful act of a State when conduct consisting of an action or omission:\n(a) is attributable to the State under international law; and\n(b) It Constitutes a breach of an international obligation of the State.”\nBy the above Article the State can be held responsible for the actions of the Non-State Actors if it is an internationally wrongful act which can be attributed to the State. The State must have directed, controlled or instructed the unlawful conduct for it be liable. Therefore, State exercised effective control over the unlawful conduct in question. However, the above doctrine cannot be used widely and is unlikely to occur because, as it is difficult to establish factual link between State and Non-State Actor, the offender must be accurately identified. There are many technical intricacies attached to it, the devices connected to the International Protocol (IP) addresses do not reveal the actual device or offender where offense is committed moreover the use of Virtual Private Networks (VPN) and Botnets have made it difficult to determine the device and address to make this doctrine practically applicable.\n## The customary international law\nCustomary international law refers to international obligations arising from established State practice, as opposed to obligations arising from formal written international treaties. Under customary international law the States are obligated to prevent their territory from being used to cause harm to other countries. This principle was first articulated in the case of Corfu channel. The brief facts of the case are, two British warships were bombarded by the mines in the Albanian waters, in this instance the State’s responsibility was discussed in maintaining peace and security. The international court of Justice in this case could not establish that the mines were set up by the Albanian Government. The Albanian Government should have known the existence of mines and ought to have warned the ships in the international waters. Thus, it\n Corfu Channel Case (United Kingdom v. Albania); Assessment of Compensation, 15 XII 49, International Court of Justice (ICJ), 15 December 1949\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nis well established that there is inherent obligation of the State to prevent its territory being used by Non-State Actors to cause significant damage to other States. The Tallinn Manual, prepared by the group of experts on invitation of NATO Cooperative Cyber Defence of Excellence, In late 2009, they met a global gathering of legitimate researchers and professionals to draft a manual tending to the issue of how to translate universal law with regards to Cyber operations and Cyber conflicts. In that capacity, it was the principal push to analyse this subject thoroughly and definitively and to convey some level of clearness to the related complex legitimate issues. Rule 5 of the Manual states that, State shall not knowingly allow the Cyber infrastructure located in its territory or under its exclusive governmental control to be used for acts that adversely and unlawfully affect other States. This onus also applies to harmful conduct originating from a State's territory. By referring to the Nicaragua Case, International Court of Justice held that Nicaragua was under an obligation to prevent its territory being used as a trafficking route for military equipment which was exploited by insurgents in El Salvador. Using the same comparison it can be established that in Cyberspace there exists a customary obligation to prevent Trans boundary activities which will affect the States adversely but also to prevent the Non-State Actors from using the Cyber infrastructure from being exploited.\nIn the Bosnian Genocide case the ICJ held that,\n“it is clear that the obligation in question is one of conduct and not one of result, in the sense that a State cannot be under an obligation to succeed, whatever the circumstances, in preventing the commission of genocide: the obligation of States parties is rather to employ all means reasonably available to them, so as to prevent genocide as far as possible.”\nIn discussing the nature of State’s obligation to prevent a conflict it should be noticed that there is no absolute obligation on State to succeed in quelling the insurgency. There is an obligation of the State to act in due diligence, i.e. For the State to take all necessary actions by reasonable means available to it. Where a State fails to conduct itself reasonably and violates an obligation of conduct the State is liable for the failure to prevent the unlawful conduct and not for the act that produces the resulting harm, which is significant from the perspective of the adequacy of compensation/reparations owed to the victim. Obligations of prevention are usually\n Tallinn Manual on The International Law Applicable to Cyber Warfare, 31-32 (Cambridge University Press 2013).\n Nicaragua v United States of America [1986] ICJ Rep 14, para 157\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\ncommitments of counteractive action are normally interpreted as best endeavours commitments, obliging States to take all sensible or important measures to keep a given occasion from occurring, but without warranting that the occasion won't happen. Professor Pisillo- Mazzeschi in his work on due diligence and the nature of International responsibility of the State has Stated that,\n“careful examination of [State] practice reveals that the obligation to prevent has a twofold content; that is, it includes two distinct obligations of the State. The first is that of possessing, on a permanent basis, a legal and administrative apparatus normally able to guarantee respect for the international norm on prevention. The second obligation, instead, is that of using such apparatus with the diligence that the circumstances require”.\nIt is also important for the State to have a strong legal framework which prohibits and punishes the wrongdoing of Cyber warfare. It is a well-established principle under customary international law that the State is obligated to have legal mechanisms which will not affect the interests of other States adversely. Developing State capability of preventing Cyber-attacks will invariably require enacting legislations and establishment of effective judicial authority to monitor the same. The States shall possess a legal system and sufficient resources to maintain a mechanism to control and monitor the activities. The States with a well developed economy and strong resources with regards to Cyber infrastructure are in a better position to monitor and to have an effective control mechanism in comparison to the States which are not well equipped with technological expertise and resources. However, basic vigilance, employment of law enforcing authorities in the territory of the State which is a basic attributes of a Government are expected from a Statee. International law is not worried with the way in which States choose to meet this specific obligation of theirs, In as much as these laws are sensibly adequate to anticipate antagonistic acts or to rebuff them after they have happened, the State has played out its obligation.\n## An Obligation of Conduct\nThe Convention on Cybercrime, requires States to adopt measures to establish procedures for the purpose of criminal investigations into, and criminal proceedings for, these offences. The above provision clearly obligates a State to devise a mechanism to curb the offences of Cyber\n Ricardo Pisillo- Mazzeschi, International Obligations to provide for Reparation Claims , A.Randelzhofer and C. Tomuschat, State Responsibility and the Individual, 149-172 (Kluwer Law International) 1999.\n Convention on Cybercrime Budapest, 23.XI.2001, Article 14(1),\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nthreats. If a State is having a requisite legal framework, the obligation is to use the framework to address the threats and to reduce its effect. In the conduct of malicious Cyber threats and trans boundary attacks, the convention on Cyber Crime (Council of Europe) requires State parties to adopt legislative and other measures the offences listed in the Convention are punishable by effective means. There is an obligation of conduct in International Law the standard in which each State is expected to act in furtherance to achieve the objectives of International law. The standard set for care is the due diligence standard, the obligation of due diligence is applied to International environment law, international human right law etc. This Article aims to characterize the material substance of the commitment of due diligence with specific reference to the standard commitment upon States to utilize their ability to keep their Cyber framework from being utilized by Non-State actors as a stage to perform trans boundary Cyber attacks. One of the primary elements of due diligence is the element of knowledge, it is necessary for the State to have knowledge about the threat for it suppress it and take necessary action. In the Corfu case, it was held that, “it cannot be concluded from the mere fact of the control exercised by a State over its territory and waters that that State necessarily knew, or ought to have known what was happening”. It is to be observed that, because a threat emerged within a State’s territory it does not imply that the State ought to have known about the imminent threat. Referring the Corfu Case, the ICJ indicated that Albania ought to have known the presence of the mines in its coastal waters, which it had control of it, the fact that Albanian coastal forces demanded the foreign vessels to request for permission before they entered the Strait further shifted the liability on Albania. The court presumed that the States shall know about the facts which are which are widely known or can be known through official government channels. The preposition of “State should have known “, plays an important role in international law as it will not be in harmony if a State could avoid responsibility by claiming it of inadequate knowledge if it could have discovered illegal activity through diligent decision. It is true in international scenario if any activity contrary to international law appears to have taken place within the territory of a State may be called upon to give its explication about it but the States cannot elude such a request by citing its ignorance of such activities which happened within the territory of the State. In the context of having adequate knowledge about the circumstances, the immediate question which arises is, “whether it is reasonable to expect the State would have known about the threat in those circumstances?”, in light of Cyber\n Article 13, Convention on Cyber Crime, Council Of Europe adopted on 23rd November 2001.\n Supra 20\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\ninfrastructure it is reasonable to assert that the State having adequate technical capacity and Cyber Infrastructure to have known about the circumstances. After establishing the circumstances which ought to have been known by the State it also essential to address the due diligence standard require and how much affirmative action can be expected from the State. In a much broader sense the States are obligated to use their legislative framework and infrastructure to check the threats which are originated within the territory and deterring the future wrong doers. In a famous Pulp Mills decision between Uruguay and Argentina the ICJ rules that, “is an obligation which entails not only the adoption of appropriate rules and measures, but also a certain level of vigilance in their enforcement”. In fulfilling States obligation the States are required to conduct investigation process and effectively reprimand the individuals. This principle was further laid down in the Janes Case, Mexican authorities failed in their duty of due diligence to protect from harm an American citizen in Mexico because, the Mexican authorities took no proper steps to apprehend and punish Carbajal [the individual responsible for killing the American national] and that such efforts as were made were lax and inadequate. The Tribunal concluded that “[t]he culprit is liable for having killed or murdered an American national; the Government is liable for not having measured up to its duty of diligently prosecuting and properly punishing the offender”.\nHence, as an obligation of conduct, as opposed to come about, deciding how a reasonable State would have responded to a risk is liable to an 'accessible means' examination, which requires recognizable proof of the monetary, specialized and Human Resources of the State. The essence of the matter is that a due diligence commitment must be translated in a way which does not force an outlandish results or impose disproportionate burden on societies. Therefore in order to discharge due diligence obligation to prevent Cyber Attacks or any kind of an act which is contrary to the principle of International law, a State is required only to take those measures that are reasonably available and within its power.\n## Conclusion\nThis essay has discussed that customary international law imposes an obligation on member States to prevent Cyber Infrastructure present in the territory of the State from being used in a manner which causes injury to other States. The obligation includes, the States to have a legal mechanism within the territory which is capable of controlling Cyber Attacks and secondly,\n Pulp Mills on the River Uruguay (Argentina v. Uruguay), Judgment, I.C.J. Reports 2010, p. 14.\n Laura M. B. Janes Et Al. (U.S.A.) V. United Mexican States, Volume iv P.138.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nwhere a threat emerges and States have knowledge of that threat they must act reasonably and use the resources effectively to suppress the attacks. This duty does not specify the nature of legal mechanism that is required by the States to cogently address Cyber threats emerging from Cyber Space. In a heavily interconnected domain like Cyber Space the Non-State Actors will easily reroute their malicious Cyber Operations through the Cyber Infrastructure of a particular State whose technological capability is comparatively less to minimise the possibility of the State to suppress the attacks. For the above reasons, in a challenging domain like Cyber space it is necessary to have closely knit legal framework to curb the menace of malicious Cyber attacks. Devising of a Treaty to regulate how States address threats emerging from Cyber Space. The benefits of Treaty not only include co-operation among States but also by ameliorating States to adopt certain laws which are considered to suppress Cyber threats. With a specific end goal to make a safe the internet what is required is imminent participation and joint effort between the important partners (counting global associations, States, programming suppliers, digital security organizations and so forth) over issues of digital security and Internet administration. The Global Forum for Cyber Expertise (GFCE) established in the year 2015 with 50 members, aims to trade best practices and mastery on digital limit building. The point is to distinguish effective approaches, practices and thoughts and increase these on a worldwide level. Together with accomplices from NGOs, the tech group and the scholarly community GFCE individuals create handy activities to build Cyber capacity. However, it being a soft law mechanism it is necessary to address the issue with related Cyber-Specific Laws and International Treaty which addresses the same.\n12"
    },
    "numeric": {
      "total": {
        "intext_total": 1,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [
        {
          "index": "1986",
          "intext_citation": "[1986]",
          "preceding_text": "²² Nicaragua v United States of America",
          "footnote": null
        }
      ],
      "flat_text": "HEINONLINE\n-- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License\n-- The search text of this PDF is generated from uncorrected OCR text.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n# CYBERSPACE AND NON-STATE ACTORS: THE STATE'S INTERNATIONAL OBLIGATION\nValluri Parthasarthi, ICFAI University\n## Classification of Cyber conflict\nOne of the concerns in international humanitarian law is that of the classification of Cyber conflict¹, Classification of conflict is the first step in international humanitarian law as the identification determines legal subjects² which are to be applied to it. It is essential to determine the character of the Cyber conflict, whether international or Non-international in nature. But prior to the inception of Geneva convention, Lassa Oppenheim’s definition of war was well accepted, which stated, “war is a contention between two or more States, through their armed forces, for the purpose of overpowering each other an imposing such conditions of peace as the victor pleases to be”³. The key element in the mentioned definition is that the, conflict must have happened between two States. However the interstate conflict within the State was considered a non-international conflict unless it reaches a certain degree of belligerency. The term ‘belligerency’ and its implications have been discussed in United Kingdom’s ministry’s manual of Law and Armed conflict⁴. After the carnage of the Second World War the international community took a different step in recognizing war in technical and material sense, hence developed into international customary law. Articles 2, 3 which are common for all the four Geneva Conventions there are two certain criteria which can be established to determine the international armed conflict that there is a confrontation between two States and the hostilities shall amount to armed conflict. According to Article 3, the armed conflict is not of an international nature but occurring in the territory of one of the contracting parties. The\n¹ International humanitarian law distinguishes two types of armed conflicts, namely, international armed conflicts, opposing two or more States, and non-international armed conflicts, between governmental forces and nongovernmental armed groups, or between such groups only. IHL treaty law also establishes a distinction between non-international armed conflicts in the meaning of common Article 3 of the Geneva Conventions of 1949 and non-international armed conflicts falling within the definition provided in Art. 1 of Additional Protocol II.\n² States and non-State actors like individuals, international organizations, multinational companies and international non-government organizations are regulated by, or subjected to, international law. They are called subjects of international law\n³ L Oppenheim, International Law: A Treatise II (Longman, Green and Co 1906) 56.\n⁴ UK Ministry of Defence, The Manual of the Law of Armed Conflict (2004) paragraph, 15.1.2. on belligerency\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nInternational Committee of Red Cross (ICRC) in the year 1949 broadened the scope of international armed conflict by its additional protocol I and II to the Geneva Conventions. The nature of armed conflict and the acts under it which constitute is mentioned under this Article⁵. Geneva conventions and its additional protocols, conflict can be broadly classified into three categories they are:\na. International armed conflict between States.\nb. worldwide outfitted clash including national freedom developments⁶.\nc. Non-international armed conflict between a State and armed groups or organized armed groups.\nThe first and third are recognized as customary classifications of conflict.\n## International Cyber conflict\nIt may be noted that for armed conflict there must be armed forces and it shall be international in nature (between States). It has to be further noted that, Cyber attacks are not aggressive and kinetic in nature per se. There are no weapons involved. Therefore at first instance, it can be deduced that Cyber-attacks are not armed in nature, such a deduction shall be dangerous and harmful to the Countries.\nAccording to Article 49 (1) of the Additional Protocol- 1 defines attacks. “as act of violence against the adversary either in attack or defence”. Similarly, the International Criminal Tribunal for former Yugoslavia in the case of Tadiac⁷, said “resorting to armed force between States without recognizing any threshold for the duration or intensity of hostilities”. However, Cyber-attacks are not violent in nature but can trigger vehement circumstances. Hence, the classification of a cyber conflict requires nuanced examination.\n---\n⁵ Protocol Additional to the Geneva Conventions of 12 August 1949, and Relating to the Protection of Victims of Non-International Armed Conflicts (Protocol II)- Article 1 - Material field of application- 1. This Protocol, which develops and supplements Article 3 common to the Geneva Conventions of 12 August 1949 without modifying its existing conditions of application, shall apply to all armed conflicts which are not covered by Article 1 of the Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol I) and which take place in the territory of a High Contracting Party between its armed forces and dissident armed forces or other organized armed groups which, under responsible command, exercise such control over a part of its territory as to enable them to carry out sustained and concerted military operations and to implement this Protocol. 2- This Protocol shall not apply to situations of internal disturbances and tensions, such as riots, isolated and sporadic acts of violence and other acts of a similar nature, as not being armed conflicts.\n⁶ Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol 1)- Article 1(4)\n⁷ Prosecutor v. Dusko Tadic (Appeal Judgement), IT-94-1-A, International Criminal Tribunal for the former Yugoslavia (ICTY), 15 July 1999.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nIt is also pertinent to note that, according to the additional protocols to the Geneva Conventions, any hostility between the nations which results in the intervention of the members of the armed forces, it makes no difference as far as the intensity and duration of the conflict is concerned, as it is considered as an international conflict⁸, Thus, a Cyber-attack will fall under ambit of ‘armed’ under International Humanitarian Law. The ICRC⁹ has taken a position on Cyber-attacks that, anything which disables an object is also an attack when it does not cause physical damage¹⁰; this is a reasonable motion considering the extension for the notion of damage so is concerned. Since the operation is an attack, it is also armed in terms of qualification for armed conflict. That said, a de minimis standard should attach.\nIn addition to the attack being ‘armed’ it also has to be ‘international’ in nature. By the term international, it means an act by State or an act attributable by the State in a conflict. By the plain context of the arrangements referred to over, those led by a State's military qualify. In spite of the fact that Cyber-attack is not being specified in any of those arrangements, the author believes it is reasonable to attribute that the digital assaults by some of the law enforcement officers of the State qualify¹¹ this analysis. The ICTY in this regard established in the case of Prosecutor v. Tadiac that, “Private individuals along or within the frame work of armed forces or in connection with the State authorities shall be deemed to be considered as a State organs¹².” Thus, it can be established that any attacks launched by the State, shall be deemed to have been launched by the State organs or by the individuals who were authorized to use the Cyber infrastructure on behalf of the State. A situation might arise, where in a relationship between a State and individual arise in conducting Cyber-attacks might not fall under the ambit of State organ or individuals acting on behalf of the State, the ICTY has declared that “overall control going beyond the mere financing and equipping of such forces and involving also participation in the planning and supervision of military operations”¹³. In order to establish the term “overall control” and “international conflict”, the State must issue specific instructions or directives aimed at committing certain attacks. The obligation of the State not to facilitate or attribute any Cyber- attacks shall be discussed in the later stage of this Article.\n⁸ Y Sandoz and others (eds), Commentary on the Additional Protocols of 8 June 1977 to the Geneva Conventions of 12 August 1949 (Martinus Nijhof 1988) (AP Commentary) para 62\n⁹ 32nd International Conference: Resolutions and reports- www.icrc.org available at https://www.icrc.org/en/document/outcomes-32nd-international-conference-red-cross-and-red-crescent; last visited on April 27th, 2017.\n¹⁰ Supra 9\n¹¹ Article 4 - Conduct of organs of a State, International Law Commission Report, A/56/10 August 2001.\n¹² Supra 7\n¹³ Supra 7\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\n# Non-International Cyber Conflict\nThe concept of Non-International armed conflict has been defined in negative by the common Article 3 in the Geneva conventions. Any violence between State’s armed groups and dissident armed groups within a State can be defined as Non-International armed conflict. The Additional Protocol – II, has also defined Non international armed conflict as a hostility between State’s forces and organized opposing armed forces. Hence, the two ingredients in determining the Non-International armed conflict are (i) participation by an organized armed group and (ii) with a particular level of intensity. According to common Article 3, the groups must be armed and organized for it to be considered as a party in the conflict. The ICTY has defined this element of it in the case of Prosecutor v. Limaj¹⁴, “some degree of organisation by the parties will suffice to establish the existence of an armed conflict. This degree need not be the same as that required for establishing the responsibility of superiors for the acts of their subordinates within the organization, as no determination of individual criminal responsibility is intended under this provision of the Statute”¹⁵. The group shall be organized, the term organized means acting in a cordial manner and capability to engage in violence in mission planning, sharing intelligence and exercising command and control, it is necessary for a group to possess these fundamentals to be considered as a party to the conflict. From the above it is clear that individuals who conduct Cyber-attacks against State cannot meet the organized criteria. Cyber-attacks conducted by a group on online are a bit difficult to classify because the members of the group might not know each other in their operations, however they act in a coordinated manner like setting objectives, identify the weakness in the system, injection of malware and maintain defences, all these activities are performed together in a coordinated manner. One of the other criterion to be met is the group shall be under the responsible command, it is not essential to have a hierarchical order of armed force but if capable of planning and executing operations, then it fall under this definition. In virtual organized group, this criteria can be met because of the nature of the operation carried for which it can be equated to military operations.\nIn summation to being organized, the group must also be armed. The meaning of armed in the Non-international armed conflict a be parallel comparison can be made to international armed conflict. As discussed above, it generally assumes the conduct of ‘attacks’. Yet, since Non-international armed conflict is ascertained on the activities of a group, as distinct from a State, the question of attribution of an individual member’s conduct to the group as a whole arises.\n¹⁴ Prosecutor V. Fatmir Limaj Haradin Bala Isak Musliu, It-03-66-T (2005)\n¹⁵ Paragraph 89, supra 14\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nSince it is the group that must be armed, the group itself must have a purpose of carrying out armed activities. If individual members of an organized group carry out Cyber attacks on their own accord, that is, not on behalf of the group, the group does not meet the armed criterion.\n## Non State Actors and ungoverned spaces\nThe concept of Non-State Actors and its presence in international law has increased steadily in past few decades. The Non-State actors are endowed with infrastructural, economic and institutional power but do not have any corresponding legal duties. The Non-State actors actions in recent times have amounted to gross violation to human rights and have committed violence to the largest degree possible, the impact of Non-State actors on international scenario has been immense hence the United Nations Security Council in the year 2004 passed resolution 1540, which says, “the States are required to refrain from providing any goods, services to or supporting Non State Actors s which develop, obtain, construct or transfer or use chemical weapons¹⁶.” Historically, the international norms have failed to address the imbalance between legal obligation and duties of the Non-State Actors. The concept of Non-State actors can be understood as an entity, which is not actually a State and usually referred to armed, religious or civil groups. The CONTONOU defines Non State actors on a broader scale as, “The actors of cooperation will include: a: State (local, national and regional), b: Non-State: - Private Sector; - Economic and social partners, including trade union organizations; - Civil society in all its forms according to national characteristics¹⁷”. The Non-State actors do not have any affiliation with the official State authorities nor have any financial/legal framework with reference to the States, they are often treated as new subjects of international law. The international law in recent times have undergone significant changes and attempts being made to reduce the gap between Non-State actors and international law paradigm. As said by Nicolas PM, “Nowadays international law reaches beyond nations, many acts such as certain criminal acts, trade, finance, commercial relationships, environmental issues, human rights and more. Now international law directly touches many individuals”¹⁸. With reference to Cyber-attacks,\n¹⁶ United Nations Security Council, Resolution 1540 (2004), Non-Proliferation of Weapons of Mass Destruction, 28 April 2004\n¹⁷ Partnership Agreement Between the Members of the AFRICAN, CARIBEAN and PACIFIC Group of States of The One Part, and the European Community and its Member States, of the Other Part, Signed in COTONOU, BENIN ON 23 JUNE 2000. http://www.europarl.europa.eu available at http://www.europarl.europa.eu/intcoop/acp/03_01/pdf/mn3012634_en.pdf, last visited on April 13th, 2017.\n¹⁸ Rajkovic, N. M. (2012) “Global law” and governmentality: Reconceptualizing the ‘rule of law’ as rule ‘through’ law’, European Journal of International Relations, 18(1), 29–52.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nISIS (Islamic State) operates from territories such as Syria and Iraq and engages in criminal Cyber activities. Lately, ISIS is adept in using the internet for its own uses and in creating its own Cyber army, groups such as Cyber Caliphate, Islamic State Hacking Division, Islamic Cyber Army and Sons Caliphate army are the various Cyber attacking groups which carried out attacks on numerous networks such as hacking of Tony Blair (former Prime Minister U.K) and attacks on various governmental bodies and military organizations. The attack on destabilizing a French T.V network (tv5monde) and by propagating terror activities and execution videos on national network created panic and distress in international communities, later the France government in its official press release claimed it to be an act of terrorism and further using the official U.S Central command's YouTube account and telecasted terrorist propaganda videos, which was used for its recruitment purposes. All these activities were carried out from a State and using Cyber infrastructure, the liability of the State with regards to Cyber warfare has been a concern in international law.\n## State Obligation\nIt is an established principle in the international law, that States have inherent responsibility on its part to prevent cross border acts which are prohibited under international law. With reference to current international law, there are particularly four categories of offences which is an Obligation for the States to criminalise, they are offences against confidentiality, integrity and availability of Computer Systems, computer relates offences (Forgery, fraud) and offences related to Copyrights and related rights¹⁹.\nAs discussed above the presence of Non-State actors in the international arena have been in ascendance, and the alleged acts committed by Non-State actors had caused considerable damage to the aggrieved countries. The States are obligated to obviate their Cyber framework from being exploited in any manner which is harmful to the international legal framework. The obligation consists of having a legal infrastructure domestically to prevent Cyber attacks and to take stringent measures against the offenders and also having a reasonable knowledge or anticipation the threat which might loom from their Cyber set up. The characteristics such as anonymity, accessibility and trans-borderless activities has privileged the Non-State Actors to operate within the States. In a colloquial sense, the States are not responsible for the acts of the\n¹⁹ ETS 185 – Cybercrime (Convention), 23.XI.2001, Additional Protocol to the Convention on Cyber Crime (Council Of Europe) adopted on 23rd November 2001) adopted in the year 2001.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nNon-State Actors; mere geographical and territorial link is not enough to hold the State responsible, the State can be held responsible under two circumstances in doing so, the draft Articles on State Responsibility on internationally wrongful Acts has to be considered. The text was adopted in the 53rd Session as submitted to the General Assembly in the year 2001. Article 2 States that, “Elements of an internationally wrongful act of a State\nThere is an internationally wrongful act of a State when conduct consisting of an action or omission:\n(a) is attributable to the State under international law; and\n(b) It Constitutes a breach of an international obligation of the State.”\nBy the above Article the State can be held responsible for the actions of the Non-State Actors if it is an internationally wrongful act which can be attributed to the State. The State must have directed, controlled or instructed the unlawful conduct for it be liable. Therefore, State exercised effective control over the unlawful conduct in question. However, the above doctrine cannot be used widely and is unlikely to occur because, as it is difficult to establish factual link between State and Non-State Actor, the offender must be accurately identified. There are many technical intricacies attached to it, the devices connected to the International Protocol (IP) addresses do not reveal the actual device or offender where offense is committed moreover the use of Virtual Private Networks (VPN) and Botnets have made it difficult to determine the device and address to make this doctrine practically applicable.\n## The customary international law\nCustomary international law refers to international obligations arising from established State practice, as opposed to obligations arising from formal written international treaties. Under customary international law the States are obligated to prevent their territory from being used to cause harm to other countries. This principle was first articulated in the case of Corfu channel²⁰. The brief facts of the case are, two British warships were bombarded by the mines in the Albanian waters, in this instance the State’s responsibility was discussed in maintaining peace and security. The international court of Justice in this case could not establish that the mines were set up by the Albanian Government. The Albanian Government should have known the existence of mines and ought to have warned the ships in the international waters. Thus, it\n²⁰ Corfu Channel Case (United Kingdom v. Albania); Assessment of Compensation, 15 XII 49, International Court of Justice (ICJ), 15 December 1949\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nis well established that there is inherent obligation of the State to prevent its territory being used by Non-State Actors to cause significant damage to other States. The Tallinn Manual, prepared by the group of experts on invitation of NATO Cooperative Cyber Defence of Excellence, In late 2009, they met a global gathering of legitimate researchers and professionals to draft a manual tending to the issue of how to translate universal law with regards to Cyber operations and Cyber conflicts. In that capacity, it was the principal push to analyse this subject thoroughly and definitively and to convey some level of clearness to the related complex legitimate issues. Rule 5 of the Manual states that, State shall not knowingly allow the Cyber infrastructure located in its territory or under its exclusive governmental control to be used for acts that adversely and unlawfully affect other States²¹. This onus also applies to harmful conduct originating from a State's territory. By referring to the Nicaragua Case²², International Court of Justice held that Nicaragua was under an obligation to prevent its territory being used as a trafficking route for military equipment which was exploited by insurgents in El Salvador. Using the same comparison it can be established that in Cyberspace there exists a customary obligation to prevent Trans boundary activities which will affect the States adversely but also to prevent the Non-State Actors from using the Cyber infrastructure from being exploited.\nIn the Bosnian Genocide case the ICJ held that,\n“it is clear that the obligation in question is one of conduct and not one of result, in the sense that a State cannot be under an obligation to succeed, whatever the circumstances, in preventing the commission of genocide: the obligation of States parties is rather to employ all means reasonably available to them, so as to prevent genocide as far as possible.”\nIn discussing the nature of State’s obligation to prevent a conflict it should be noticed that there is no absolute obligation on State to succeed in quelling the insurgency. There is an obligation of the State to act in due diligence, i.e. For the State to take all necessary actions by reasonable means available to it. Where a State fails to conduct itself reasonably and violates an obligation of conduct the State is liable for the failure to prevent the unlawful conduct and not for the act that produces the resulting harm, which is significant from the perspective of the adequacy of compensation/reparations owed to the victim. Obligations of prevention are usually\n²¹ Tallinn Manual on The International Law Applicable to Cyber Warfare, 31-32 (Cambridge University Press 2013).\n²² Nicaragua v United States of America  ICJ Rep 14, para 157\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\ncommitments of counteractive action are normally interpreted as best endeavours commitments, obliging States to take all sensible or important measures to keep a given occasion from occurring, but without warranting that the occasion won't happen. Professor Pisillo- Mazzeschi in his work on due diligence and the nature of International responsibility of the State has Stated that,\n“careful examination of [State] practice reveals that the obligation to prevent has a twofold content; that is, it includes two distinct obligations of the State. The first is that of possessing, on a permanent basis, a legal and administrative apparatus normally able to guarantee respect for the international norm on prevention. The second obligation, instead, is that of using such apparatus with the diligence that the circumstances require²³”.\nIt is also important for the State to have a strong legal framework which prohibits and punishes the wrongdoing of Cyber warfare. It is a well-established principle under customary international law that the State is obligated to have legal mechanisms which will not affect the interests of other States adversely. Developing State capability of preventing Cyber-attacks will invariably require enacting legislations and establishment of effective judicial authority to monitor the same. The States shall possess a legal system and sufficient resources to maintain a mechanism to control and monitor the activities. The States with a well developed economy and strong resources with regards to Cyber infrastructure are in a better position to monitor and to have an effective control mechanism in comparison to the States which are not well equipped with technological expertise and resources. However, basic vigilance, employment of law enforcing authorities in the territory of the State which is a basic attributes of a Government are expected from a Statee. International law is not worried with the way in which States choose to meet this specific obligation of theirs, In as much as these laws are sensibly adequate to anticipate antagonistic acts or to rebuff them after they have happened, the State has played out its obligation.\n## An Obligation of Conduct\nThe Convention on Cybercrime, requires States to adopt measures to establish procedures for the purpose of criminal investigations into, and criminal proceedings for, these offences²⁴. The above provision clearly obligates a State to devise a mechanism to curb the offences of Cyber\n²³ Ricardo Pisillo- Mazzeschi, International Obligations to provide for Reparation Claims , A.Randelzhofer and C. Tomuschat, State Responsibility and the Individual, 149-172 (Kluwer Law International) 1999.\n²⁴ Convention on Cybercrime Budapest, 23.XI.2001, Article 14(1),\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nthreats. If a State is having a requisite legal framework, the obligation is to use the framework to address the threats and to reduce its effect. In the conduct of malicious Cyber threats and trans boundary attacks, the convention on Cyber Crime (Council of Europe) requires State parties to adopt legislative and other measures the offences listed in the Convention are punishable by effective means²⁵. There is an obligation of conduct in International Law the standard in which each State is expected to act in furtherance to achieve the objectives of International law. The standard set for care is the due diligence standard, the obligation of due diligence is applied to International environment law, international human right law etc. This Article aims to characterize the material substance of the commitment of due diligence with specific reference to the standard commitment upon States to utilize their ability to keep their Cyber framework from being utilized by Non-State actors as a stage to perform trans boundary Cyber attacks. One of the primary elements of due diligence is the element of knowledge, it is necessary for the State to have knowledge about the threat for it suppress it and take necessary action. In the Corfu case, it was held that, “it cannot be concluded from the mere fact of the control exercised by a State over its territory and waters that that State necessarily knew, or ought to have known what was happening”²⁶. It is to be observed that, because a threat emerged within a State’s territory it does not imply that the State ought to have known about the imminent threat. Referring the Corfu Case, the ICJ indicated that Albania ought to have known the presence of the mines in its coastal waters, which it had control of it, the fact that Albanian coastal forces demanded the foreign vessels to request for permission before they entered the Strait further shifted the liability on Albania. The court presumed that the States shall know about the facts which are which are widely known or can be known through official government channels. The preposition of “State should have known “, plays an important role in international law as it will not be in harmony if a State could avoid responsibility by claiming it of inadequate knowledge if it could have discovered illegal activity through diligent decision. It is true in international scenario if any activity contrary to international law appears to have taken place within the territory of a State may be called upon to give its explication about it but the States cannot elude such a request by citing its ignorance of such activities which happened within the territory of the State. In the context of having adequate knowledge about the circumstances, the immediate question which arises is, “whether it is reasonable to expect the State would have known about the threat in those circumstances?”, in light of Cyber\n²⁵ Article 13, Convention on Cyber Crime, Council Of Europe adopted on 23rd November 2001.\n²⁶ Supra 20\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\ninfrastructure it is reasonable to assert that the State having adequate technical capacity and Cyber Infrastructure to have known about the circumstances. After establishing the circumstances which ought to have been known by the State it also essential to address the due diligence standard require and how much affirmative action can be expected from the State. In a much broader sense the States are obligated to use their legislative framework and infrastructure to check the threats which are originated within the territory and deterring the future wrong doers. In a famous Pulp Mills decision between Uruguay and Argentina the ICJ rules that, “is an obligation which entails not only the adoption of appropriate rules and measures, but also a certain level of vigilance in their enforcement”²⁷. In fulfilling States obligation the States are required to conduct investigation process and effectively reprimand the individuals. This principle was further laid down in the Janes Case²⁸, Mexican authorities failed in their duty of due diligence to protect from harm an American citizen in Mexico because, the Mexican authorities took no proper steps to apprehend and punish Carbajal [the individual responsible for killing the American national] and that such efforts as were made were lax and inadequate. The Tribunal concluded that “[t]he culprit is liable for having killed or murdered an American national; the Government is liable for not having measured up to its duty of diligently prosecuting and properly punishing the offender”.\nHence, as an obligation of conduct, as opposed to come about, deciding how a reasonable State would have responded to a risk is liable to an 'accessible means' examination, which requires recognizable proof of the monetary, specialized and Human Resources of the State. The essence of the matter is that a due diligence commitment must be translated in a way which does not force an outlandish results or impose disproportionate burden on societies. Therefore in order to discharge due diligence obligation to prevent Cyber Attacks or any kind of an act which is contrary to the principle of International law, a State is required only to take those measures that are reasonably available and within its power.\n## Conclusion\nThis essay has discussed that customary international law imposes an obligation on member States to prevent Cyber Infrastructure present in the territory of the State from being used in a manner which causes injury to other States. The obligation includes, the States to have a legal mechanism within the territory which is capable of controlling Cyber Attacks and secondly,\n²⁷ Pulp Mills on the River Uruguay (Argentina v. Uruguay), Judgment, I.C.J. Reports 2010, p. 14.\n²⁸ Laura M. B. Janes Et Al. (U.S.A.) V. United Mexican States, Volume iv P.138.\nIndian Journal of Law and Legal Research\nVolume II Issue I | ISSN: 2582 8878\nwhere a threat emerges and States have knowledge of that threat they must act reasonably and use the resources effectively to suppress the attacks. This duty does not specify the nature of legal mechanism that is required by the States to cogently address Cyber threats emerging from Cyber Space. In a heavily interconnected domain like Cyber Space the Non-State Actors will easily reroute their malicious Cyber Operations through the Cyber Infrastructure of a particular State whose technological capability is comparatively less to minimise the possibility of the State to suppress the attacks. For the above reasons, in a challenging domain like Cyber space it is necessary to have closely knit legal framework to curb the menace of malicious Cyber attacks. Devising of a Treaty to regulate how States address threats emerging from Cyber Space. The benefits of Treaty not only include co-operation among States but also by ameliorating States to adopt certain laws which are considered to suppress Cyber threats. With a specific end goal to make a safe the internet what is required is imminent participation and joint effort between the important partners (counting global associations, States, programming suppliers, digital security organizations and so forth) over issues of digital security and Internet administration. The Global Forum for Cyber Expertise (GFCE) established in the year 2015 with 50 members, aims to trade best practices and mastery on digital limit building. The point is to distinguish effective approaches, practices and thoughts and increase these on a worldwide level. Together with accomplices from NGOs, the tech group and the scholarly community GFCE individuals create handy activities to build Cyber capacity. However, it being a soft law mechanism it is necessary to address the issue with related Cyber-Specific Laws and International Treaty which addresses the same.\n12"
    },
    "author_year": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "author_year"
      },
      "results": [],
      "flat_text": "HEINONLINE -- Your use of this HeinOnline PDF indicates your acceptance of HeinOnline's Terms and Conditions of the license agreement available at https://heinonline.org/HOL/License -- The search text of this PDF is generated from uncorrected OCR text.\nIndian Journal of Law and Legal Research Volume II Issue I | ISSN: 2582 8878 # CYBERSPACE AND NON-STATE ACTORS: THE STATE'S INTERNATIONAL OBLIGATION Valluri Parthasarthi, ICFAI University ## Classification of Cyber conflict One of the concerns in international humanitarian law is that of the classification of Cyber conflict¹, Classification of conflict is the first step in international humanitarian law as the identification determines legal subjects² which are to be applied to it. It is essential to determine the character of the Cyber conflict, whether international or Non-international in nature. But prior to the inception of Geneva convention, Lassa Oppenheim’s definition of war was well accepted, which stated, “war is a contention between two or more States, through their armed forces, for the purpose of overpowering each other an imposing such conditions of peace as the victor pleases to be”³. The key element in the mentioned definition is that the, conflict must have happened between two States. However the interstate conflict within the State was considered a non-international conflict unless it reaches a certain degree of belligerency. The term ‘belligerency’ and its implications have been discussed in United Kingdom’s ministry’s manual of Law and Armed conflict⁴. After the carnage of the Second World War the international community took a different step in recognizing war in technical and material sense, hence developed into international customary law. Articles 2, 3 which are common for all the four Geneva Conventions there are two certain criteria which can be established to determine the international armed conflict that there is a confrontation between two States and the hostilities shall amount to armed conflict. According to Article 3, the armed conflict is not of an international nature but occurring in the territory of one of the contracting parties. The ¹ International humanitarian law distinguishes two types of armed conflicts, namely, international armed conflicts, opposing two or more States, and non-international armed conflicts, between governmental forces and nongovernmental armed groups, or between such groups only. IHL treaty law also establishes a distinction between non-international armed conflicts in the meaning of common Article 3 of the Geneva Conventions of 1949 and non-international armed conflicts falling within the definition provided in Art. 1 of Additional Protocol II.\n² States and non-State actors like individuals, international organizations, multinational companies and international non-government organizations are regulated by, or subjected to, international law. They are called subjects of international law ³ L Oppenheim, International Law: A Treatise II (Longman, Green and Co 1906) 56.\n⁴ UK Ministry of Defence, The Manual of the Law of Armed Conflict (2004) paragraph, 15.1.2. on belligerency Indian Journal of Law and Legal Research Volume II Issue I | ISSN: 2582 8878 International Committee of Red Cross (ICRC) in the year 1949 broadened the scope of international armed conflict by its additional protocol I and II to the Geneva Conventions. The nature of armed conflict and the acts under it which constitute is mentioned under this Article⁵. Geneva conventions and its additional protocols, conflict can be broadly classified into three categories they are: a. International armed conflict between States.\nb. worldwide outfitted clash including national freedom developments⁶.\nc. Non-international armed conflict between a State and armed groups or organized armed groups.\nThe first and third are recognized as customary classifications of conflict.\n## International Cyber conflict It may be noted that for armed conflict there must be armed forces and it shall be international in nature (between States). It has to be further noted that, Cyber attacks are not aggressive and kinetic in nature per se. There are no weapons involved. Therefore at first instance, it can be deduced that Cyber-attacks are not armed in nature, such a deduction shall be dangerous and harmful to the Countries.\nAccording to Article 49 (1) of the Additional Protocol- 1 defines attacks. “as act of violence against the adversary either in attack or defence”. Similarly, the International Criminal Tribunal for former Yugoslavia in the case of Tadiac⁷, said “resorting to armed force between States without recognizing any threshold for the duration or intensity of hostilities”. However, Cyber-attacks are not violent in nature but can trigger vehement circumstances. Hence, the classification of a cyber conflict requires nuanced examination.\n--- ⁵ Protocol Additional to the Geneva Conventions of 12 August 1949, and Relating to the Protection of Victims of Non-International Armed Conflicts (Protocol II)- Article 1 - Material field of application- 1. This Protocol, which develops and supplements Article 3 common to the Geneva Conventions of 12 August 1949 without modifying its existing conditions of application, shall apply to all armed conflicts which are not covered by Article 1 of the Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol I) and which take place in the territory of a High Contracting Party between its armed forces and dissident armed forces or other organized armed groups which, under responsible command, exercise such control over a part of its territory as to enable them to carry out sustained and concerted military operations and to implement this Protocol. 2- This Protocol shall not apply to situations of internal disturbances and tensions, such as riots, isolated and sporadic acts of violence and other acts of a similar nature, as not being armed conflicts.\n⁶ Protocol Additional to the Geneva Conventions of 12 August 1949, and relating to the Protection of Victims of International Armed Conflicts (Protocol 1)- Article 1(4) ⁷ Prosecutor v. Dusko Tadic (Appeal Judgement), IT-94-1-A, International Criminal Tribunal for the former Yugoslavia (ICTY), 15 July 1999.\nIndian Journal of Law and Legal Research Volume II Issue I | ISSN: 2582 8878 It is also pertinent to note that, according to the additional protocols to the Geneva Conventions, any hostility between the nations which results in the intervention of the members of the armed forces, it makes no difference as far as the intensity and duration of the conflict is concerned, as it is considered as an international conflict⁸, Thus, a Cyber-attack will fall under ambit of ‘armed’ under International Humanitarian Law. The ICRC⁹ has taken a position on Cyber-attacks that, anything which disables an object is also an attack when it does not cause physical damage¹⁰; this is a reasonable motion considering the extension for the notion of damage so is concerned. Since the operation is an attack, it is also armed in terms of qualification for armed conflict. That said, a de minimis standard should attach.\nIn addition to the attack being ‘armed’ it also has to be ‘international’ in nature. By the term international, it means an act by State or an act attributable by the State in a conflict. By the plain context of the arrangements referred to over, those led by a State's military qualify. In spite of the fact that Cyber-attack is not being specified in any of those arrangements, the author believes it is reasonable to attribute that the digital assaults by some of the law enforcement officers of the State qualify¹¹ this analysis. The ICTY in this regard established in the case of Prosecutor v. Tadiac that, “Private individuals along or within the frame work of armed forces or in connection with the State authorities shall be deemed to be considered as a State organs¹².” Thus, it can be established that any attacks launched by the State, shall be deemed to have been launched by the State organs or by the individuals who were authorized to use the Cyber infrastructure on behalf of the State. A situation might arise, where in a relationship between a State and individual arise in conducting Cyber-attacks might not fall under the ambit of State organ or individuals acting on behalf of the State, the ICTY has declared that “overall control going beyond the mere financing and equipping of such forces and involving also participation in the planning and supervision of military operations”¹³. In order to establish the term “overall control” and “international conflict”, the State must issue specific instructions or directives aimed at committing certain attacks. The obligation of the State not to facilitate or attribute any Cyber- attacks shall be discussed in the later stage of this Article.\n⁸ Y Sandoz and others (eds), Commentary on the Additional Protocols of 8 June 1977 to the Geneva Conventions of 12 August 1949 (Martinus Nijhof 1988) (AP Commentary) para 62 ⁹ 32nd International Conference: Resolutions and reports- www.icrc.org available at https://www.icrc.org/en/document/outcomes-32nd-international-conference-red-cross-and-red-crescent; last visited on April 27th, 2017.\n¹⁰ Supra 9 ¹¹ Article 4 - Conduct of organs of a State, International Law Commission Report, A/56/10 August 2001.\n¹² Supra 7 ¹³ Supra 7 Indian Journal of Law and Legal Research Volume II Issue I | ISSN: 2582 8878 # Non-International Cyber Conflict The concept of Non-International armed conflict has been defined in negative by the common Article 3 in the Geneva conventions. Any violence between State’s armed groups and dissident armed groups within a State can be defined as Non-International armed conflict. The Additional Protocol – II, has also defined Non international armed conflict as a hostility between State’s forces and organized opposing armed forces. Hence, the two ingredients in determining the Non-International armed conflict are (i) participation by an organized armed group and (ii) with a particular level of intensity. According to common Article 3, the groups must be armed and organized for it to be considered as a party in the conflict. The ICTY has defined this element of it in the case of Prosecutor v. Limaj¹⁴, “some degree of organisation by the parties will suffice to establish the existence of an armed conflict. This degree need not be the same as that required for establishing the responsibility of superiors for the acts of their subordinates within the organization, as no determination of individual criminal responsibility is intended under this provision of the Statute”¹⁵. The group shall be organized, the term organized means acting in a cordial manner and capability to engage in violence in mission planning, sharing intelligence and exercising command and control, it is necessary for a group to possess these fundamentals to be considered as a party to the conflict. From the above it is clear that individuals who conduct Cyber-attacks against State cannot meet the organized criteria. Cyber-attacks conducted by a group on online are a bit difficult to classify because the members of the group might not know each other in their operations, however they act in a coordinated manner like setting objectives, identify the weakness in the system, injection of malware and maintain defences, all these activities are performed together in a coordinated manner. One of the other criterion to be met is the group shall be under the responsible command, it is not essential to have a hierarchical order of armed force but if capable of planning and executing operations, then it fall under this definition. In virtual organized group, this criteria can be met because of the nature of the operation carried for which it can be equated to military operations.\nIn summation to being organized, the group must also be armed. The meaning of armed in the Non-international armed conflict a be parallel comparison can be made to international armed conflict. As discussed above, it generally assumes the conduct of ‘attacks’. Yet, since Non-international armed conflict is ascertained on the activities of a group, as distinct from a State, the question of attribution of an individual member’s conduct to the group as a whole arises.\n¹⁴ Prosecutor V. Fatmir Limaj Haradin Bala Isak Musliu, It-03-66-T (2005) ¹⁵ Paragraph 89, supra 14 Indian Journal of Law and Legal Research Volume II Issue I | ISSN: 2582 8878 Since it is the group that must be armed, the group itself must have a purpose of carrying out armed activities. If individual members of an organized group carry out Cyber attacks on their own accord, that is, not on behalf of the group, the group does not meet the armed criterion.\n## Non State Actors and ungoverned spaces The concept of Non-State Actors and its presence in international law has increased steadily in past few decades. The Non-State actors are endowed with infrastructural, economic and institutional power but do not have any corresponding legal duties. The Non-State actors actions in recent times have amounted to gross violation to human rights and have committed violence to the largest degree possible, the impact of Non-State actors on international scenario has been immense hence the United Nations Security Council in the year 2004 passed resolution 1540, which says, “the States are required to refrain from providing any goods, services to or supporting Non State Actors s which develop, obtain, construct or transfer or use chemical weapons¹⁶.” Historically, the international norms have failed to address the imbalance between legal obligation and duties of the Non-State Actors. The concept of Non-State actors can be understood as an entity, which is not actually a State and usually referred to armed, religious or civil groups. The CONTONOU defines Non State actors on a broader scale as, “The actors of cooperation will include: a: State (local, national and regional), b: Non-State: - Private Sector; - Economic and social partners, including trade union organizations; - Civil society in all its forms according to national characteristics¹⁷”. The Non-State actors do not have any affiliation with the official State authorities nor have any financial/legal framework with reference to the States, they are often treated as new subjects of international law. The international law in recent times have undergone significant changes and attempts being made to reduce the gap between Non-State actors and international law paradigm. As said by Nicolas PM, “Nowadays international law reaches beyond nations, many acts such as certain criminal acts, trade, finance, commercial relationships, environmental issues, human rights and more. Now international law directly touches many individuals”¹⁸. With reference to Cyber-attacks, ¹⁶ United Nations Security Council, Resolution 1540 (2004), Non-Proliferation of Weapons of Mass Destruction, 28 April 2004 ¹⁷ Partnership Agreement Between the Members of the AFRICAN, CARIBEAN and PACIFIC Group of States of The One Part, and the European Community and its Member States, of the Other Part, Signed in COTONOU, BENIN ON 23 JUNE 2000. http://www.europarl.europa.eu available at http://www.europarl.europa.eu/intcoop/acp/03_01/pdf/mn3012634_en.pdf, last visited on April 13th, 2017.\n¹⁸ Rajkovic, N. M. (2012) “Global law” and governmentality: Reconceptualizing the ‘rule of law’ as rule ‘through’ law’, European Journal of International Relations, 18(1), 29–52.\nIndian Journal of Law and Legal Research Volume II Issue I | ISSN: 2582 8878 ISIS (Islamic State) operates from territories such as Syria and Iraq and engages in criminal Cyber activities. Lately, ISIS is adept in using the internet for its own uses and in creating its own Cyber army, groups such as Cyber Caliphate, Islamic State Hacking Division, Islamic Cyber Army and Sons Caliphate army are the various Cyber attacking groups which carried out attacks on numerous networks such as hacking of Tony Blair (former Prime Minister U.K) and attacks on various governmental bodies and military organizations. The attack on destabilizing a French T.V network (tv5monde) and by propagating terror activities and execution videos on national network created panic and distress in international communities, later the France government in its official press release claimed it to be an act of terrorism and further using the official U.S Central command's YouTube account and telecasted terrorist propaganda videos, which was used for its recruitment purposes. All these activities were carried out from a State and using Cyber infrastructure, the liability of the State with regards to Cyber warfare has been a concern in international law.\n## State Obligation It is an established principle in the international law, that States have inherent responsibility on its part to prevent cross border acts which are prohibited under international law. With reference to current international law, there are particularly four categories of offences which is an Obligation for the States to criminalise, they are offences against confidentiality, integrity and availability of Computer Systems, computer relates offences (Forgery, fraud) and offences related to Copyrights and related rights¹⁹.\nAs discussed above the presence of Non-State actors in the international arena have been in ascendance, and the alleged acts committed by Non-State actors had caused considerable damage to the aggrieved countries. The States are obligated to obviate their Cyber framework from being exploited in any manner which is harmful to the international legal framework. The obligation consists of having a legal infrastructure domestically to prevent Cyber attacks and to take stringent measures against the offenders and also having a reasonable knowledge or anticipation the threat which might loom from their Cyber set up. The characteristics such as anonymity, accessibility and trans-borderless activities has privileged the Non-State Actors to operate within the States. In a colloquial sense, the States are not responsible for the acts of the ¹⁹ ETS 185 – Cybercrime (Convention), 23.XI.2001, Additional Protocol to the Convention on Cyber Crime (Council Of Europe) adopted on 23rd November 2001) adopted in the year 2001.\nIndian Journal of Law and Legal Research Volume II Issue I | ISSN: 2582 8878 Non-State Actors; mere geographical and territorial link is not enough to hold the State responsible, the State can be held responsible under two circumstances in doing so, the draft Articles on State Responsibility on internationally wrongful Acts has to be considered. The text was adopted in the 53rd Session as submitted to the General Assembly in the year 2001. Article 2 States that, “Elements of an internationally wrongful act of a State There is an internationally wrongful act of a State when conduct consisting of an action or omission: (a) is attributable to the State under international law; and (b) It Constitutes a breach of an international obligation of the State.”\nBy the above Article the State can be held responsible for the actions of the Non-State Actors if it is an internationally wrongful act which can be attributed to the State. The State must have directed, controlled or instructed the unlawful conduct for it be liable. Therefore, State exercised effective control over the unlawful conduct in question. However, the above doctrine cannot be used widely and is unlikely to occur because, as it is difficult to establish factual link between State and Non-State Actor, the offender must be accurately identified. There are many technical intricacies attached to it, the devices connected to the International Protocol (IP) addresses do not reveal the actual device or offender where offense is committed moreover the use of Virtual Private Networks (VPN) and Botnets have made it difficult to determine the device and address to make this doctrine practically applicable.\n## The customary international law Customary international law refers to international obligations arising from established State practice, as opposed to obligations arising from formal written international treaties. Under customary international law the States are obligated to prevent their territory from being used to cause harm to other countries. This principle was first articulated in the case of Corfu channel²⁰. The brief facts of the case are, two British warships were bombarded by the mines in the Albanian waters, in this instance the State’s responsibility was discussed in maintaining peace and security. The international court of Justice in this case could not establish that the mines were set up by the Albanian Government. The Albanian Government should have known the existence of mines and ought to have warned the ships in the international waters. Thus, it ²⁰ Corfu Channel Case (United Kingdom v. Albania); Assessment of Compensation, 15 XII 49, International Court of Justice (ICJ), 15 December 1949 Indian Journal of Law and Legal Research Volume II Issue I | ISSN: 2582 8878 is well established that there is inherent obligation of the State to prevent its territory being used by Non-State Actors to cause significant damage to other States. The Tallinn Manual, prepared by the group of experts on invitation of NATO Cooperative Cyber Defence of Excellence, In late 2009, they met a global gathering of legitimate researchers and professionals to draft a manual tending to the issue of how to translate universal law with regards to Cyber operations and Cyber conflicts. In that capacity, it was the principal push to analyse this subject thoroughly and definitively and to convey some level of clearness to the related complex legitimate issues. Rule 5 of the Manual states that, State shall not knowingly allow the Cyber infrastructure located in its territory or under its exclusive governmental control to be used for acts that adversely and unlawfully affect other States²¹. This onus also applies to harmful conduct originating from a State's territory. By referring to the Nicaragua Case²², International Court of Justice held that Nicaragua was under an obligation to prevent its territory being used as a trafficking route for military equipment which was exploited by insurgents in El Salvador. Using the same comparison it can be established that in Cyberspace there exists a customary obligation to prevent Trans boundary activities which will affect the States adversely but also to prevent the Non-State Actors from using the Cyber infrastructure from being exploited.\nIn the Bosnian Genocide case the ICJ held that, “it is clear that the obligation in question is one of conduct and not one of result, in the sense that a State cannot be under an obligation to succeed, whatever the circumstances, in preventing the commission of genocide: the obligation of States parties is rather to employ all means reasonably available to them, so as to prevent genocide as far as possible.”\nIn discussing the nature of State’s obligation to prevent a conflict it should be noticed that there is no absolute obligation on State to succeed in quelling the insurgency. There is an obligation of the State to act in due diligence, i.e. For the State to take all necessary actions by reasonable means available to it. Where a State fails to conduct itself reasonably and violates an obligation of conduct the State is liable for the failure to prevent the unlawful conduct and not for the act that produces the resulting harm, which is significant from the perspective of the adequacy of compensation/reparations owed to the victim. Obligations of prevention are usually ²¹ Tallinn Manual on The International Law Applicable to Cyber Warfare, 31-32 (Cambridge University Press 2013).\n²² Nicaragua v United States of America [1986] ICJ Rep 14, para 157 Indian Journal of Law and Legal Research Volume II Issue I | ISSN: 2582 8878 commitments of counteractive action are normally interpreted as best endeavours commitments, obliging States to take all sensible or important measures to keep a given occasion from occurring, but without warranting that the occasion won't happen. Professor Pisillo- Mazzeschi in his work on due diligence and the nature of International responsibility of the State has Stated that, “careful examination of [State] practice reveals that the obligation to prevent has a twofold content; that is, it includes two distinct obligations of the State. The first is that of possessing, on a permanent basis, a legal and administrative apparatus normally able to guarantee respect for the international norm on prevention. The second obligation, instead, is that of using such apparatus with the diligence that the circumstances require²³”.\nIt is also important for the State to have a strong legal framework which prohibits and punishes the wrongdoing of Cyber warfare. It is a well-established principle under customary international law that the State is obligated to have legal mechanisms which will not affect the interests of other States adversely. Developing State capability of preventing Cyber-attacks will invariably require enacting legislations and establishment of effective judicial authority to monitor the same. The States shall possess a legal system and sufficient resources to maintain a mechanism to control and monitor the activities. The States with a well developed economy and strong resources with regards to Cyber infrastructure are in a better position to monitor and to have an effective control mechanism in comparison to the States which are not well equipped with technological expertise and resources. However, basic vigilance, employment of law enforcing authorities in the territory of the State which is a basic attributes of a Government are expected from a Statee. International law is not worried with the way in which States choose to meet this specific obligation of theirs, In as much as these laws are sensibly adequate to anticipate antagonistic acts or to rebuff them after they have happened, the State has played out its obligation.\n## An Obligation of Conduct The Convention on Cybercrime, requires States to adopt measures to establish procedures for the purpose of criminal investigations into, and criminal proceedings for, these offences²⁴. The above provision clearly obligates a State to devise a mechanism to curb the offences of Cyber ²³ Ricardo Pisillo- Mazzeschi, International Obligations to provide for Reparation Claims, A.Randelzhofer and C. Tomuschat, State Responsibility and the Individual, 149-172 (Kluwer Law International) 1999.\n²⁴ Convention on Cybercrime Budapest, 23.XI.2001, Article 14(1), Indian Journal of Law and Legal Research Volume II Issue I | ISSN: 2582 8878 threats. If a State is having a requisite legal framework, the obligation is to use the framework to address the threats and to reduce its effect. In the conduct of malicious Cyber threats and trans boundary attacks, the convention on Cyber Crime (Council of Europe) requires State parties to adopt legislative and other measures the offences listed in the Convention are punishable by effective means²⁵. There is an obligation of conduct in International Law the standard in which each State is expected to act in furtherance to achieve the objectives of International law. The standard set for care is the due diligence standard, the obligation of due diligence is applied to International environment law, international human right law etc. This Article aims to characterize the material substance of the commitment of due diligence with specific reference to the standard commitment upon States to utilize their ability to keep their Cyber framework from being utilized by Non-State actors as a stage to perform trans boundary Cyber attacks. One of the primary elements of due diligence is the element of knowledge, it is necessary for the State to have knowledge about the threat for it suppress it and take necessary action. In the Corfu case, it was held that, “it cannot be concluded from the mere fact of the control exercised by a State over its territory and waters that that State necessarily knew, or ought to have known what was happening”²⁶. It is to be observed that, because a threat emerged within a State’s territory it does not imply that the State ought to have known about the imminent threat. Referring the Corfu Case, the ICJ indicated that Albania ought to have known the presence of the mines in its coastal waters, which it had control of it, the fact that Albanian coastal forces demanded the foreign vessels to request for permission before they entered the Strait further shifted the liability on Albania. The court presumed that the States shall know about the facts which are which are widely known or can be known through official government channels. The preposition of “State should have known “, plays an important role in international law as it will not be in harmony if a State could avoid responsibility by claiming it of inadequate knowledge if it could have discovered illegal activity through diligent decision. It is true in international scenario if any activity contrary to international law appears to have taken place within the territory of a State may be called upon to give its explication about it but the States cannot elude such a request by citing its ignorance of such activities which happened within the territory of the State. In the context of having adequate knowledge about the circumstances, the immediate question which arises is, “whether it is reasonable to expect the State would have known about the threat in those circumstances?”, in light of Cyber ²⁵ Article 13, Convention on Cyber Crime, Council Of Europe adopted on 23rd November 2001.\n²⁶ Supra 20 Indian Journal of Law and Legal Research Volume II Issue I | ISSN: 2582 8878 infrastructure it is reasonable to assert that the State having adequate technical capacity and Cyber Infrastructure to have known about the circumstances. After establishing the circumstances which ought to have been known by the State it also essential to address the due diligence standard require and how much affirmative action can be expected from the State. In a much broader sense the States are obligated to use their legislative framework and infrastructure to check the threats which are originated within the territory and deterring the future wrong doers. In a famous Pulp Mills decision between Uruguay and Argentina the ICJ rules that, “is an obligation which entails not only the adoption of appropriate rules and measures, but also a certain level of vigilance in their enforcement”²⁷. In fulfilling States obligation the States are required to conduct investigation process and effectively reprimand the individuals. This principle was further laid down in the Janes Case²⁸, Mexican authorities failed in their duty of due diligence to protect from harm an American citizen in Mexico because, the Mexican authorities took no proper steps to apprehend and punish Carbajal [the individual responsible for killing the American national] and that such efforts as were made were lax and inadequate. The Tribunal concluded that “[t]he culprit is liable for having killed or murdered an American national; the Government is liable for not having measured up to its duty of diligently prosecuting and properly punishing the offender”.\nHence, as an obligation of conduct, as opposed to come about, deciding how a reasonable State would have responded to a risk is liable to an 'accessible means' examination, which requires recognizable proof of the monetary, specialized and Human Resources of the State. The essence of the matter is that a due diligence commitment must be translated in a way which does not force an outlandish results or impose disproportionate burden on societies. Therefore in order to discharge due diligence obligation to prevent Cyber Attacks or any kind of an act which is contrary to the principle of International law, a State is required only to take those measures that are reasonably available and within its power.\n## Conclusion This essay has discussed that customary international law imposes an obligation on member States to prevent Cyber Infrastructure present in the territory of the State from being used in a manner which causes injury to other States. The obligation includes, the States to have a legal mechanism within the territory which is capable of controlling Cyber Attacks and secondly, ²⁷ Pulp Mills on the River Uruguay (Argentina v. Uruguay), Judgment, I.C.J. Reports 2010, p. 14.\n²⁸ Laura M. B. Janes Et Al. (U.S.A.) V. United Mexican States, Volume iv P.138.\nIndian Journal of Law and Legal Research Volume II Issue I | ISSN: 2582 8878 where a threat emerges and States have knowledge of that threat they must act reasonably and use the resources effectively to suppress the attacks. This duty does not specify the nature of legal mechanism that is required by the States to cogently address Cyber threats emerging from Cyber Space. In a heavily interconnected domain like Cyber Space the Non-State Actors will easily reroute their malicious Cyber Operations through the Cyber Infrastructure of a particular State whose technological capability is comparatively less to minimise the possibility of the State to suppress the attacks. For the above reasons, in a challenging domain like Cyber space it is necessary to have closely knit legal framework to curb the menace of malicious Cyber attacks. Devising of a Treaty to regulate how States address threats emerging from Cyber Space. The benefits of Treaty not only include co-operation among States but also by ameliorating States to adopt certain laws which are considered to suppress Cyber threats. With a specific end goal to make a safe the internet what is required is imminent participation and joint effort between the important partners (counting global associations, States, programming suppliers, digital security organizations and so forth) over issues of digital security and Internet administration. The Global Forum for Cyber Expertise (GFCE) established in the year 2015 with 50 members, aims to trade best practices and mastery on digital limit building. The point is to distinguish effective approaches, practices and thoughts and increase these on a worldwide level. Together with accomplices from NGOs, the tech group and the scholarly community GFCE individuals create handy activities to build Cyber capacity. However, it being a soft law mechanism it is necessary to address the issue with related Cyber-Specific Laws and International Treaty which addresses the same.\n12"
    }
  },
  "citation_summary": {
    "style": "superscript",
    "dominant_bucket": "tex",
    "dominant": {
      "intext_total": 56.0,
      "success_occurrences": 56.0,
      "success_unique": 28.0,
      "bib_unique_total": 28.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 1.0,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "superscript"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 56.0,
        "success_occurrences": 56.0,
        "success_unique": 28.0,
        "bib_unique_total": 28.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 1.0,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "superscript"
      },
      "numeric": {
        "intext_total": 1.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "CYBERSPACE AND NON-STATE ACTORS: THE STATE'S INTERNATIONAL OBLIGATION",
    "subtitle": "## Classification of Cyber conflict",
    "document_type": "journal_article",
    "venue": "Indian Journal of Law and Legal Research",
    "publication_year": 1906,
    "authors": [
      "Valluri Parthasarthi"
    ],
    "affiliations": [
      "Valluri Parthasarthi, ICFAI University",
      "⁴ UK Ministry of Defence, The Manual of the Law of Armed Conflict (2004) paragraph, 15.1.2. on belligerency"
    ],
    "emails": [],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "",
    "keywords": [],
    "publication_dates": {},
    "identifiers": {
      "doi": [],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "https://heinonline.org/HOL/License",
        "www.icrc.org",
        "https://www.icrc.org/en/document/outcomes-32nd-international-conference-red-cross-and-red-crescent",
        "http://www.europarl.europa.eu",
        "http://www.europarl.europa.eu/intcoop/acp/03_01/pdf/mn3012634_en.pdf"
      ]
    },
    "references_block_count": 0,
    "references_entries_estimated": 0,
    "heading_count": 9,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "no_abstract",
        "no_identifier"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 56,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 0.7857142857142857,
      "footnote_coverage": 1.0,
      "unique_index_count": 28
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "superscript",
      "recommended_style": "superscript",
      "aligned": true,
      "signals": {
        "superscript_hits": 56,
        "superscript_definition_lines": 28,
        "numeric_bracket_hits": 1,
        "numeric_endnote_lines": 0,
        "author_year_hits": 0
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 28.0,
      "dominant_bib_coverage_rate": 1.0,
      "dominant_link_target": "footnotes",
      "dominant_unresolved_flag": "unresolved_footnote_links"
    },
    "heading_validation": {
      "heading_count": 9,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": false,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": true,
        "emails": false,
        "orcids": false,
        "abstract": false,
        "keywords": false,
        "venue": true,
        "persistent_identifier": false,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 1,
        "affiliations": 2,
        "emails": 0,
        "orcids": 0,
        "keywords": 0,
        "doi": 0,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 5
      },
      "coverage": {
        "core_coverage": 0.6666666666666666,
        "email_author_link_rate": 0.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "no_abstract",
          "no_identifier"
        ],
        "toc_dot_lines": 0
      },
      "flags": [
        "meta_missing_abstract_and_keywords",
        "meta_missing_persistent_identifier"
      ]
    },
    "flags": [
      "missing_preceding_text",
      "missing_reference_heading",
      "meta_missing_abstract_and_keywords",
      "meta_missing_persistent_identifier"
    ]
  },
  "updated_at_utc": "2026-02-14T08:28:48.814166+00:00"
}