{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\S5EV8ZHQ\\L4PXZS27.pdf",
  "custom_id": "421",
  "response": {
    "id": "batch-b6235e9e-422-47b45710-1732-46a0-80cd-31e5aa0dc061",
    "custom_id": "421",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "International Journal of Cyber Warfare and Terrorism\n\nVolume 9 • Issue 3 • July-September 2019\n\n# The Impact of Cyber-Physical Warfare on Global Human Security\n\nBryson R. Payne, University of North Georgia, Dahlonega, USA\n\nEdward L. Mienie, University of North Georgia, Dahlonega, USA\n\n# ABSTRACT\n\nCyber is deeply enmeshed and interwoven across national security, as evidenced by its inclusion in the national security policies of a growing number of OECD countries. But it is the impact of cyber across the other components of national and human security that remains to be sufficiently addressed at the national policy level, or in international standards of behavior with respect to cyberwarfare and hybrid conflict. In addition to standing on its own as a national security concern, cybersecurity impacts economic and trade security, ecological/environmental and biosecurity, energy and critical infrastructure security, food security, transportation, and public health, as well as communications, physical and even political security. This work examines the role of threats from cyberwarfare, hybrid conflict, and cyber-physical attacks across human security from a national and global perspective, makes near-term predictions about the future of cyberwarfare, and provides recommendations with respect to preparing for cyberwarfare and ongoing hybrid conflict.\n\n# KEYWORDS\n\nAsymmetric Warfare, Attribution, Cyber Intelligence, Cyber-Physical Attacks, Cybersecurity, Cyberwarfare, Denial of Service, Hybrid Conflict\n\n# INTRODUCTION\n\nIn 1947, the third industrial revolution began with the invention of the transistor, from which flowed massive technological changes that transformed societies and economies in the world. This resulted in governments, military and civilian organizations investing heavily in computer systems, making computers an essential part of large-scale operations during the 1950s and 1960s. By the 1980s, the proliferation of digital technology and computers spread into private homes and small offices via the personal\n\nDOI: 10.4018/IJCWT.2019070103\n\nCopyright © 2019, IGI Global. Copying or distributing in print or electronic forms without written permission of IGI Global is prohibited.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 1,
            "markdown": "International Journal of Cyber Warfare and Terrorism\n\nVolume 9 • Issue 3 • July-September 2019\n\ncomputer, or PC, eventually integrating with virtually all aspects of life in developed nations. The end of the 20th century saw industrial robots, graphics for video game entertainment, and automated teller cash machines in banks. By 1995 the world wide web became widely available, as it expanded across the globe (Hughes-Wilson, 2016).\n\nThe first decade of the 21st century saw the introduction of the smartphone, which quickly became commonplace with the proliferation of the wireless Internet and the smart electricity grid. By 2018 we had 3.3 billion smartphone users, and approximately 4.2 billion users accessed the Internet. The world has become interconnected using smartphones, tablets, and computer-based devices for both social networking and day-to-day business. It is worthwhile to note, however, that 85% of the infrastructure of the Internet is privately owned (GAO, 2009), primarily by telecommunications corporations and technology service providers, and therefore the majority of the Internet is not necessarily protected by municipal, state, or national governments.\n\nDuring these past two decades especially, as governments and defense manufacturers realized the potential for smart weapons, a new generation of technological military systems and missiles were developed (Hughes-Wilson, 2016), most of which rely upon wireless communications and the global positioning system (GPS) or similar navigational systems.\n\nBy 2015, cloud computing was ubiquitous, data could be uploaded in real time, and we saw tablet computers and smartphone use exceed personal computer use. The proliferation of the smart electrical grid, automated industrial and building controls, and the Internet of Things and smart Internet-connected devices in homes, offices, factories, and in automobiles has brought great efficiency and convenience, while simultaneously making us more vulnerable to cyberattacks in virtually every setting.\n\n# BACKGROUND\n\nIn 1946, the US Army Ordinance Corps financed and developed the world's first true reprogrammable computer. Intelligence showed a keen interest, and in 1952, President Harry Truman established the National Security Agency who in turn became a major investor in and customer of computers. In 1985, NSA merged with the National Computer Security Center to house the world's single largest group of supercomputers (National Research Council, 1990).\n\nIn the 1960s, Cray Data Corporation first introduced supercomputers and could process 33 quadrillion floating-point operations per second. At a price tag of $500,000 apiece, this placed Cray in the hands of well-funded governments and a handful of very large corporations and banks. Today, NSA's latest facility at Fort Meade houses one of three High-Performance Computing Centers, each with their own 150-megawatt power substation providing 60 megawatts of electricity. Each center comes at a price tag of $3.2 Billion. The British NSA equivalent, GCHQ, has remained in step with the digital revolution, as have the other members of the UN Security Council. Similarly, digital intelligence is very high on the Chinese list of national priorities.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 2,
            "markdown": "International Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n\nWith real-time digital intelligence now available, the Intelligence Community (IC) has accepted that it is here to stay. There is a school of thought that the traditional intelligence cycle approach (Tasking, Processing, Evaluation, and Dissemination) is too slow. Digital intelligence is revolutionizing the way intelligence does business. The IC now needs algorithms and applications to work on data and provide recommendations in order to keep pace with open-source media.\n\nIn 2009, the US Cyber Command was established to operate in the digital space and recruitment and retention of a technically qualified cyber force has become a challenge. There is talk of changing (not lowering) recruiting standards in an effort to recruit information security specialists as a matter of urgency. The creation of a separate cyber corps has become a struggle among military bureaucracies worldwide because of interagency competition (Hughes-Wilson, 2016).\n\nThe digital revolution has exposed new vulnerabilities of governments, and these have to be addressed by digital means, up to and including cyberwarfare. For the past century, the front lines of war have moved closer to modern households, as war is no longer something that happens on a far-away battlefield. The illusion of living in the safety of our own homes is slowly being eroded, as we increasingly become victims of cyber breaches, malware and ransomware infections, and denial of service attacks (DoS) that take down individual systems or complete networks. In addition to the issue previously mentioned with corporations, not governments, owning 85% of critical Internet infrastructure, research has shown that \"90 to 95 percent of US government traffic, including sensitive diplomatic and military orders, travels over privately-owned cables to reach officials in the field\" (Winseck, 2017).\n\n## The Progression from Cyberattacks to Cyber-Physical Attacks\n\nCyberwar has become a threat to modern society. Robert Morris became the first person to be convicted under the US Computer Fraud and Abuse Act in 1988. His act became known as the \"Morris Worm,\" which used weaknesses in the UNIX system and spread in less than 24 hours to an estimated 10 percent of all computers then connected to the Internet (FBI, 2018). This worm slowed down computers to the point of an early denial-of-service, leaving systems largely unusable. Morris served no jail time but performed community service as part of his sentence. It is understood that today, Prof. Morris is working as a professor at MIT (Dooley, 2018).\n\nIn 1994, a Russian called Vladimir Levin used a laptop in London to access the Citibank network. He accessed a list of customer passwords and codes and shared that with some of his associates. He used wire transfers to steal $3.7 million himself and set up accounts in Finland, the US, Netherlands, Germany, and Israel. His accomplices were eventually arrested, and they implicated Levin who was detained by the British police in 1995. Citibank recovered all but $400k of the eventual $10.7 million stolen (Goodman, 2015).\n\nComputer hacking has become a genuine international threat and is becoming more widespread and dangerous. Classic security targets of sabotage, espionage, and to a lesser extent subversion are in the sights of hackers. Cyber-attacks are hard to",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 3,
            "markdown": "International Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n\npin on any adversary at the time of the attack, but intelligence agencies are becoming significantly more skilled at attribution, especially among highly skilled peer nations and known non-state groups. Remote access trojan attacks, a type of malware designed to give an attacker persistent remote control of a computer system, grew 650% year-over-year (HIPAA Journal, 2019). These attacks are especially concerning due to the ongoing, covert control an adversary can maintain over data and systems from anywhere in the world.\n\nIt used to be that the most damaging of cyber-attacks were Denial of Service or DoS attacks, but we are now seeing large-scale ransomware attacks, targeting banks, credit card companies and local government (Wirtz, 2019). Ransomware attacks, in which files or entire computer systems are locked via encryption and require payment of an illegal ransom to regain access, increased 235% from 2018 to 2019 (HIPAA Journal, 2019).\n\nThe city of Atlanta, the ninth largest US metropolitan city, was crippled by a ransomware attack in March 2018 that shut down city government functions including courts, police records, and municipal water payment systems. The ransomware physically damaged components in a number of computers rendering them unusable—several years' worth of video footage captured by the city's police cars was lost and unable to be recovered (Deere, 2018). Over $17 Million in direct costs were disclosed, in addition to the reputation damage, lost productivity, and other so-called soft costs (Spitzer, 2018). Notably, the ransomware was attributed to two specific Iranian civilians, who were named by the FBI and indicted in November 2018. Two cities in Florida were later hit with a different strain of ransomware in 2019, paying $530,000 and $600,000 in bitcoin to regain access to their systems (Stoel-Walker, 2019).\n\nCyberattack targets of opportunity have expanded to include physical infrastructures such as power plants, water systems, fuel depots, communications, and transportation. Satellites are particularly vulnerable as this could compromise military systems such as control and command. In 2009, there were reports of Russian and Chinese attempts to infiltrate the US electrical grid. They left behind software programs that later could be used to cause major disruption to the system (Gorman, 2009). As recently as November 2018, US intelligence officials noted that Russian hackers were still actively probing US power grid targets for vulnerabilities (Newman, 2018). National and municipal utility companies around the globe are advised to be on high alert, both for direct attacks like those noted above, and for \"fallout\" effects and collateral damage that might occur against uninvolved nations, when two or more larger powers conceivably launch targeted cyberattacks against commonly used systems and equipment.\n\n## The Issue With Attribution in Cyberattacks\n\nFrom an intelligence point of view, the worst nightmare is not knowing who the enemy is while the attack is happening. While attribution, our ability to assign responsibility to an aggressor, in physical warfare has been relatively straightforward, cyberwarfare and cyber espionage are especially difficult to attribute in real-time due to the lack of physical evidence and the ability of attackers to alter digital forensic clues, although",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 4,
            "markdown": "intelligence agencies are improving rapidly in this regard (Rid & Buchanan, 2015). The lack of physical evidence and the difficulty of not being able to “see” cyber weapons or attacks has been cited as one of the reasons there have not yet been well‐established international ethical norms in cyberwarfare (Schmitt & Vihul, 2016). There is a real danger in intercepting and even modifying classified information from the other side of the world, not knowing who sent it or whether it is genuine.\n\nIn 1999, the US accidentally discovered someone trying to access the systems at the US Department of Energy, the Pentagon, NASA, private universities, as well as research labs (Rid, 2011). The US traced this attack back to Russia, but Russia denied this, and the sponsor is unknown. The so‐called “Titan Rain” attack in 2003 on Redstone Arsenal in Huntsville, Alabama, was most likely perpetrated by the Chinese. The main servers used in the attack were traced back to Guangdong, China, although there is some uncertainty as to whether the Chinese government or Chinese hacktivists were responsible. The servers were masked by proxy sites, “zombie computers,” which infected spyware and viruses into the computer systems (Clarke & Knake, 2010). The base is used as the Centre for the US Army's missile and rocket programs.\n\nIn 2007, cyberwar became a reality for Estonia when distributed denial of service (DDoS) attacks disabled parliament, banks, newspapers, and broadcasters' computer networks. The Russians called the accusations against them unfounded and there was no evidence of their complicity. Later, the head of the Russian military forecasting center affirmed their ability to conduct a DoS attack (Hughes‐Wilson, 2016). This is yet another example that poses a problem for the broader IC by not knowing for sure the perpetrator of an attack while it is going on.\n\n## Cyber‐Physical Attacks on Critical Infrastructure\n\nThe first major cyber‐physical attack on critical industrial infrastructure occurred in 2009 when a very sophisticated attack was launched on Iran's centrifuges that came from a memory‐ stick flash‐drive through a Microsoft Windows operating system to the Siemens Step7 software that controlled the centrifuges. This was a malicious computer worm called Stuxnet (Farwell & Rohozinski, 2011). No‐one at the time knew where it had come from originally or who the intended victims were meant to be. Siemens claimed industrial espionage had been perpetrated against their business, while Iran claimed that their nuclear program had been sabotaged. Which was it? A combination of the two? How do we decide to retaliate? Against whom? By what means? And to what extent?\n\nWhile both the US and Israel are alleged as the possible sources of this cyber‐physical weapon, neither has publicly acknowledged responsibility. Although, it is believed that at General Ashkenazi's retirement from the Israeli Defense Force farewell reception, he referenced Stuxnet as one of his numerous operational successes (Hughes‐Wilson, 2016). While most of the collateral damage caused by Stuxnet was reported to be minimal, it affected systems in Germany (where the Siemens controllers originated) and elsewhere in smaller nations that were not involved in the dispute between Iran and its adversary or adversaries.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 5,
            "markdown": "International Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n\nIn 2014, the second known successful cyber-physical attack was revealed, this time apparently targeting a steel mill in Germany (Zetter, 2015). The weaponized software disrupted a blast furnace control system so that the furnace could not be properly shut down, causing massive damage to the facility. The German steel mill attack would have been the third such attack, as it was preceded by an attack on a US dam a year earlier, but the dam attack did not succeed in causing confirmed physical damage.\n\nPreviously, in 2013, seven members of Iran's Islamic Revolutionary Guards Corps allegedly took control of a flood-control dam 25 miles north of New York City through a cellular network modem, but they were unable to release water only because the sluice gate had been manually disconnected for maintenance at the time of the attack (Thompson, 2016). The FBI used its \"name and shame\" tactic in 2015 both to limit travel options for the seven individuals claimed to be involved, and to demonstrate that the US was getting better at attribution. Even so, it took over two years to bring the indictment. The eventual indictment noted that the attackers were also targeting banks, the New York Stock Exchange, and telecommunications giant AT&amp;T.\n\nSeveral smaller cyber-physical effects were achieved through ransomware similar to that used in the attack on the city of Atlanta, though. Ransomware is especially concerning for human physical and health security in the cases of hospitals, such as the Hollywood Presbyterian Medical Center ransomware attack in February 2016 (Winton, 2016). While the hospital paid the $17,000 bitcoin ransom and recovered control of its computers, in the week and a half of the shutdown caused by the ransomware, several patients were sent to other area hospitals, although no cases of direct injury to patients were noted.\n\nIn addition to public health facilities themselves, individual medical devices, such as pacemakers and insulin pumps, have been found to have major vulnerabilities that could conceivably cause deaths from targeted cyber-physical attacks against these devices (Hern, 2018). While no patient deaths have been reported to date as a result of hacking, there have been recalls affecting as many as half a million devices in a single case (Hern, 2017), affecting both private medical device manufacturers and hundreds of thousands of patients.\n\nPerhaps the largest cyber-physical attacks, though, were the two separate attacks on Ukraine's power grid in December 2015 and December 2016, which shut down power to hundreds of thousands of customers in the cold of winter (Greenberg, 2017). Each attack lasted only a few hours, the length of time it took engineers to scramble to physical substations to engage manual override switches. But they demonstrated the power and precision of the alleged Russian military cyberwar machine, with the second attack fully automated and striking at precisely midnight on Saturday. The attacks contributed to the destabilization surrounding the annexation of Crimea and several clashes between Russian and Ukrainian forces in the Donetsk and Luhansk regions of Ukraine. This time, attribution was relatively swift, but the smaller Ukraine was not able to retaliate in kind against its much more cyber-capable adversary.\n\n41",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 6,
            "markdown": "International Journal of Cyber Warfare and Terrorism\n\nVolume 9 • Issue 3 • July-September 2019\n\n# Preparing for Cyberwarfare\n\nIn 2010, Richard Clarke, the White House counterterrorism chief warned that if the country were in a cyber war at that time, “the United States would lose” (Kakutani, 2010, C1). He stated that Russia, China, and North Korea had already recruited a myriad of hackers, while Iran claims to have the world’s largest cyber army. He warned that because we are so completely dependent on electronics, the West could be brought to its knees within fifteen minutes of a serious cyber-attack (Spillius, 2010). Since then, cyber-attacks have become regular features of an undeclared war.\n\nThe Chinese People’s Liberation Army is known to be hacking into major US and European corporations going after intellectual property and targets include IT, electronics, software, defense, aerospace, biomedical and pharmaceutical breakthroughs, energy, finance, banks, and agriculture. In 2012, a major Russian IT security company called “Kaspersky” identified a cyber-attack called “Red October” that had been operating since 2007. The virus used Word and Excel to gather information from military installations, energy providers, government embassies, nuclear infrastructures, research firms, and other critical infrastructure operators (Herr, 2014).\n\nMI5 and the Director General of GCHQ have expressed concern about cyber-attacks and how that may cause significant damage to their reputations and revenue. US Cyber Command has to decide daily whether they are being confronted by criminal activity or breaches of national security. Into which category does commercial espionage and theft of intellectual property fall? In 2014, after Sony Pictures produced a low budget movie poking fun at North Korean leader Kim Jong-Un, Kim launched 6,000 hackers against Sony, which inflicted a cost on Sony of $100M (Hughes-Wilson, 2016). The FBI claimed to have conclusive evidence that it was the North Korean government behind it. President Obama called them out and retaliated with a controlled cyber strike against North Korea’s weak internet. Was this a case of cyber terrorism, cyberwar, or cybercrime? North Korea has denied their complicity and has demanded an apology.\n\nIt should be noted that not everyone is in agreement with the FBI’s conclusion that the attack was indeed perpetrated by North Korea (Hughes-Wilson, 2016). The detractors claim that the attack was too sophisticated and that it was more than likely an inside job. This is a great example of the difficulty a cyber-attack poses to the IC by not knowing for sure who the enemy is and yet a counter-offensive was launched. This cannot bode well as an example of possibly misidentifying the attacker and launching an attack on the wrong target. We are stuck with the underlying difficulty of identifying the real cyber-aggressor. We should keep in mind that weak retaliation emboldens others and the bad actor can maximize the threshold-level event to suit their aims and objectives (Hughes-Wilson, 2016). This could make cyberwarfare the ultimate asymmetric war and has changed the landscape of cyber conflict.\n\n# Cyber-Espionage and the Intelligence Community\n\nLegislation would have to be passed by Congress for there to be intelligence sharing between the IC and the private sector. The Snowden case warned about this. The",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 7,
            "markdown": "International Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n\nUS has much more to lose than any other nation because it has more research and development than any other world power. There is a definite cyber-threat to this type of intelligence sharing. Sixty percent of known cyber-attacks are against commercial targets (Hughes-Wilson, 2016). \"Cyber-attacks\" is the 21st century preferred form of international trade theft. The threat is growing exponentially and in 2015 it increased by more than 600% over a three-year period. Attempts to breach security in the energy, oil, and gas sectors increased to just under 400 percent. Questions that we are facing are how much security is enough? Should it be run internally or outsourced? How much should be spent? What tools and people are most effective?\n\nAs the Chinese state and its economy are intertwined, illicit intelligence gathering raises to the level of national security interests (Hughes-Wilson, 2016). The pressure of economic sanctions against Russia due to their actions in the Ukraine has resulted in an increase in cyber-attacks against the West. The cyber-attack growth from 2009 to 2015 increased from 3.9 million incidents to more than 50 million. We have observed that international agreements to limit such behavior are ineffective. Russia and China strongly deny accusations of intellectual property theft or cyber espionage. However, in light of NSA activities as revealed by the 2013 Edward Snowden saga that the US spied on Germany and Brazil, China and Russia have become emboldened to accuse the US of obvious hypocrisy.\n\nIt is no longer a secret that the US, Russia, China, Israel, and North Korea are engaged in a ruthless, secret and potentially dangerous cyber struggle. By 2016, the Pentagon's IT and cyber programs increased seven-fold in spending from $13.3 million in 2015 to $84 million in 2016 (Hughes-Wilson, 2016). To further underscore the resolve of the US Government to do everything possible to mitigate the threat of cyber war, the CIA announced in 2015 their first new Directorate in fifty years, namely the Directorate for Digital Innovation. The problem we face is that no-one knows exactly what the real threat is and because of that there is a strong temptation to throw taxpayers' money at some ill-defined enemy. As an alternative to conventional warfare, cyberwar is a new, ill-defined form of warfare with intelligence at its cutting edge. As the threat of hybrid warfare is increasingly growing to replace conventional warfare, a cyber-attack has become the main disabling weapon.\n\nAnd especially in smaller nations, we must not only protect ourselves from direct cyber threats from both terrorist groups and other nation-states, but from the potential collateral damage resulting from larger powers' use of cyber weapons both in warfare and in so-called hybrid conflict short of war.\n\nThe era of cyber war has introduced weapons of mass disruption as opposed to conventional war's weapons of mass destruction. Weapons of mass disruption are often targeted, such as the \"Stuxnet\" example, specialized, ongoing, secret, and may range from the level of a crime and a nuisance like specialized ransomware to a complete shutdown of critical infrastructure in the case of cyber-physical attacks. On the other hand, weapons of mass destruction can cause huge casualties such as the case of Hiroshima and Nagasaki, are indiscriminate, transparent, fall clearly into the category of warfare, and are strategic.\n\n43",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 8,
            "markdown": "We should also be mindful that there is no single accepted definition of “cyber” and analysts and states do not have the same frame of reference when using the term (Futter, 2018). Some people regard cyberwarfare as military actions through the Internet. For others, it involves information warfare (Futter, 2018). Not having a universal understanding of the term makes understanding and responding to different threats very complicated. Perhaps it is best to think of cyber as comprising a set of tools, and the question then is not which cyber technologies can do something specific, but rather how the new context changes the way we understand and interact with the world (Futter, 2018).\n\n## THE FUTURE OF CYBERWARFARE\n\nWhat does the cyber weapon of the future look like? While no one can say with certainty, here are a few of the considerations that nations large and small should keep in mind to protect national and human security in this period of cyber proliferation and cyber escalation.\n\nFirst, we have already seen most of the individual weapons, as outlined in the sections above, from ransomware and trojan viruses to industrial attacks and disinformation. What will be different in an all‐out cyberwar is the massive aggregation of cyber weapons in a coordinated barrage of attacks (Deng et al. 2017). Ransomware attacks launched broadly against hospitals, public safety, banks, transportation and logistics firms, and local governments have already increased 235% from 2018 to 2019, while we are supposedly at peace (HIPAA Journal, 2019), and remote access trojan attacks are up 650% during the same period. Highly targeted attacks on industrial control systems, power and water distribution in major cities based on precursors like the Iranian and Russian power grid attacks and Stuxnet; information operations and disinformation campaigns aimed at social media and traditional news outlets; and massive denial of service attacks against stock markets and major telecommunications providers.\n\nHuman security concerns recognize the conditions that menace survival (UNDP, 2008), such as attacks on power/water supply, medical systems, or other physical systems that could endanger public health (Barnett et al. 2013). Physical, personal, and community security are affected by loss of trust in system, and violent or disruptive acts have a “negative impact on social cohesion,” irrespective of whether it is committed by state or non‐state actors (Werthes et al. 2011).\n\nInformation operations and info warfare can achieve scale and speed never before possible, as Kopp predicted almost 20 years ago (Kopp, 2000) — for example, did fake postings on Facebook impact the US election (Allcott & Gentzkow, 2017)? And imagine the impact of all that going on, while simultaneously experiencing traditional kinetic attacks against key military and political targets on the ground from artillery, missiles and good‐old‐fashioned bombs. We predict that future warfare is not just cyberwar but cyber plus war. It is not War 2.0 or 3.0, but War to the second or third power, exponentially more devastating than traditional or even nuclear weapons alone.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 9,
            "markdown": "International Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n\nSecond, social engineering and traditional human intelligence operations will continue to grow in importance in cyber warfare. Releasing targeted weapons over the Internet is complicated by considerations of collateral damage, as was the case in Stuxnet (Farwell &amp; Rohozinski, 2011) and several ransomware attacks, and it increases the risk of detection and neutralization by third parties (Payne, 2018). Human intelligence operatives will continue to be able to deliver portable USB drives and other physical electronic devices, combined with ever-evolving remote delivery systems like drones, as well as local social engineering attacks, to gain access to even air-gapped, non-networked systems like those in sensitive government, military, and public utility company operations (Gioe, 2018). Cyber operators will not likely replace intelligence operatives, as some have envisioned; rather, they will rely even more heavily upon their human intel colleagues, both to bring sensitive information to the table, and to deliver targeted electronic payloads where signals, wires, and fiber optic cables may not reach.\n\nThird, cyber defense will evolve and morph almost as rapidly as the shifting cyber landscape. Vigilant cyber hygiene and aggressive patching and updating of systems are not enough. We must also expand and accelerate cyber operations training for professionals in the military, in government, and in corporations (De Borchgrave et al., 2001). Currently, there is a global skills gap of over 1 million unfilled cyber jobs growing to a shortfall of 3.5 million skilled cyber professionals by 2021 (Morgan, 2017), and we cannot just throw money at cyber if there is no workforce to carry out the mission (Vogel, 2016).\n\nWe must become orders of magnitude better both at cyber threat hunting and at sharing information on likely cyber-attacks and vulnerabilities between national agencies and private industry (De Borchgrave et al., 2001). The US has begun efforts toward this end, but it may be hindered by its size; this is an area that smaller nations could potentially do better than their traditionally more powerful peers (Mienie, 2019). Smaller nations will continue to suffer collateral damage as major cyber powers and cybercriminals inflict damage on larger targets, and so these smaller countries must use their size and speed to their advantage to detect and defend against cyberattacks.\n\nFinally, cyber warfare will continue to be exacerbated, and to some extent obscured, by traditional cybercrime and espionage (Payne, 2018), which we can only characterize with the word \"more\". More denial of service attacks (Rayome, 2019), more Internet of Things (IoT) device-related attacks, which increased by 600% and 217.5% in 2018 and 2019, respectively (Rayome, 2018; Gatlan, 2019), more ransomware and crypto attacks (HIPAA Journal, 2019), more targeted attacks against specific infrastructure and devices (McMillen, 2016), and more information warfare (Pomerleau, 2019). Examining these trends, we can only predict more disruption, more annoyance, more danger to our economies, our borders and biosecurity, our food, energy and natural resources, our transportation and communication, and even our public health, physical and political security.\n\n45",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 10,
            "markdown": "International Journal of Cyber Warfare and Terrorism\n\nVolume 9 • Issue 3 • July-September 2019\n\n# CONCLUSION\n\nCyber is deeply enmeshed and interwoven across both national and human security concerns. In the interests of more cyber threat awareness, we propose that tabletop exercises and cyber simulations for political leaders, armed forces, police, and critical infrastructure personnel down to the local government level be conducted regularly. Awareness training for civil and municipal government employees should be the norm and not the exception. Telecom companies and device manufacturers can assist in the prevention of malware, phishing, and network-borne attacks by being proactive in our combined efforts to mitigate those attacks and to share information with government agencies in a more concerted and immediate manner.\n\nMoreover, technology and cyber education in schools should become part of the core curriculum. The moment our fingers touch a keyboard or touchscreen, or the moment we use our voices to interact with the technology listening in our cars, homes or smartphones, irrespective of our educational discipline, we are exposed and vulnerable to a cyber-attack. Individual responsibility can mitigate national cybersecurity threats collectively, but we must make a collective effort to develop a new generation of cyber heroes, cyber guardians, and cyber professionals. An uneducated populace is a luxury developed nations can no longer afford. It is our sincerest hope that discussion and acknowledgment of the scope of future war, and that public, academic publications like this one can spark the kinds of national policy debates that can energize our collective will to prepare for the next generation of cyber warfare that is already at our doorstep, that we have already seen in part, but that has the potential to forever change our future and our children's future.\n\n46",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 11,
            "markdown": "International Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n\n# REFERENCES\n\nAllcott, H., &amp; Gentzkow, M. (2017). Social media and fake news in the 2016 election. The Journal of Economic Perspectives, 31(2), 211–236. doi:10.1257/jep.31.2.211\n\nBarnett, D. J., Sell, T. K., Lord, R. K., Jenkins, C. J., Terbush, J. W., &amp; Burke, T. A. (2013). Cyber Security Threats to Public Health. World Medical &amp; Health Policy, 5(1), 37–46. doi:10.1002/wmh3.19\n\nClarke, R. A., &amp; Knake, R. K. (2010). Cyber war. New York, NY: Harper Collins.\n\nDe Borchgrave, A., Cilluffo, F. J., Cardash, S. L., &amp; Ledgerwood, M. M. (2001). Cyber Threats and Information Security: Meeting the 21st Century Challenge. Center for Strategic &amp; International Studies.\n\nDeer, S. (2018, August 1). Atlanta’s cyber attack could cost taxpayers $17 million. Atlanta Journal-Constitution. Retrieved from https://www.ajc.com/news/confidential-report-atlanta-cyber-attack-could-hit-million/GAljmndAF3EQdVWlMcXS0K/\n\nDeng, R., Zhuang, P., &amp; Liang, H. (2017). CCPA: Coordinated cyber-physical attacks and countermeasures in smart grid. IEEE Transactions on Smart Grid, 8(5), 2420–2430. doi:10.1109/TSG.2017.2702125\n\nDooley, J. F. (2018). Cyber Weapons and Cyber Warfare. In History of Cryptography and Cryptanalysis (pp. 213–239). Cham, CH: Springer. doi:10.1007/978-3-319-90443-6_13\n\nFarwell, J. P., &amp; Rohozinski, R. (2011). Stuxnet and the future of cyber war. Survival, 53(1), 23–40. doi:10.1080/00396338.2011.555586\n\nFBI. (2018). The Morris Worm: 30 years since first major attack on the Internet. November 2, 2018. Retrieved from https://www.fbi.gov/news/stories/morris-worm-30-years-since-first-major-attack-on-internet-110218\n\nFutter, A. (2018). Hacking the Bomb: Cyber Threats and Nuclear Weapons. Washington, DC: Georgetown University Press.\n\nGatlan, S. (2019, March 29). IoT attacks escalating with a 217.5% increase in volume. BleepingComputer. Retrieved from https://www.bleepingcomputer.com/news/security/iot-attacks-escalating-with-a-2175-percent-increase-in-volume/\n\nGioe, D. V. (2018). Cyber operations and useful fools: The approach of Russian hybrid intelligence. Intelligence and National Security, 33(7), 954–973. doi:10.1080/02684527.2018.1479345\n\nGoodman, M. (2015). Future crimes: Everything is connected, everyone is vulnerable and what we can do about it. Norwell, MA: Anchor Press.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 12,
            "markdown": "International Journal of Cyber Warfare and Terrorism\n\nVolume 9 • Issue 3 • July-September 2019\n\nGorman, S. (2009, April 8). Electricity grid in US penetrated by spies. The Wall Street Journal, 8. Retrieved from https://www.wsj.com/articles/SB123914805204099085\n\nGovernment Accountability Office (GAO). (2009, June 26). The Department of Homeland Security's (DHS) Critical Infrastructure Protection Cost-Benefit Report.\n\nGreenberg, A. (2017, June). How an entire nation became Russia's test lab for cyberwar. Wired. Retrieved from https://www.wired.com/story/russian-hackers-attack-ukraine/\n\nHern, A. (2017, August 31). Hacking risk leads to recall of 500,000 pacemakers due to patient death fears. The Guardian. Retrieved from https://www.theguardian.com/technology/2017/aug/31/hacking-risk-recall-pacemakers-patient-death-fears-fda-firmware-update\n\nHern, A. (2018, August 9). Hackable implanted medical devices could cause deaths, researchers say. The Guardian. Retrieved from https://www.theguardian.com/technology/2018/aug/09/implanted-medical-devices-hacking-risks-medtronic\n\nHerr, T. (2014). PrEP: A framework for malware &amp; cyber weapons. Journal of Information Warfare, 13(1), 87–106.\n\nHughes-Wilson, J. (2016). The Secret State: A History of Intelligence and Espionage. New York, NY: Pegasus Books, Ltd.\n\nHIPAA Journal. (2019, May 3). Ransomware attacks increased by 195% in Q1, 2019, but trojans remain the biggest threat. Retrieved from https://www.hipaajournal.com/ransomware-attacks-increased-by-195-in-q1-2019-but-trojans-remain-the-biggest-threat/\n\nKakutani, M. (2010, April 27). The Attack Coming From Bytes, Not Bombs. New York Times. Retrieved from https://archive.nytimes.com/www.nytimes.com/2010/04/27/books/27book.html\n\nKopp, C. (2000, May). Moore's law and its implications for information warfare. Proceedings of the International AOC Electronic Warfare Conference, Alexandria, VA (Vol. 3). Academic Press.\n\nMcMillen, D. (2016). Attacks Targeting Industrial Control Systems (ICS) Up 110 Percent. SecurityIntelligence. December 27, 2016. Retrieved from https://securityintelligence.com/attacks-targeting-industrial-control-systems-ics-up-110-percent/\n\nMienie, E. (2019). The role of cyber in national and global human security. Proceedings of the International Conference on Cyber Warfare and Security (ICCWS), Stellenbosch, South Africa, February 28. Academic Press.\n\nMorgan, S. (2017). Cybersecurity labor crunch to hit 3.5 million unfilled jobs by 2021. Cybersecurity Business Report.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 13,
            "markdown": "International Journal of Cyber Warfare and Terrorism\n\nVolume 9 • Issue 3 • July-September 2019\n\nNational Research Council, System Security Study Committee. (1990). Computers at risk: safe computing in the information age. National Academies Press.\n\nNewman, L. H. (2018, November). Russian hackers haven't stopped probing the power grid. Wired. Retrieved from https://www.wired.com/story/russian-hackers-us-power-grid-attacks/\n\nPayne, B. R. (2018). The expanding role of cyber in national security, Line of Defence, 1 (8), Winter 2018. Auckland, NZ: DefSec Media.\n\nPomerleau, M. (2019, July 11). Joint Chiefs nominee wants to boost information warfare. C4ISRNet. Retrieved from https://www.c4isrnet.com/information-warfare/2019/07/11/joint-chiefs-nominee-wants-to-boost-information-warfare/\n\nRayome, A. D. (2018, March 21). As IoT attacks increase 600% in one year, businesses need to up their security. TechRepublic.com. Retrieved from https://www.techrepublic.com/article/as-iot-attacks-increase-600-in-one-year-businesses-need-to-up-their-security/\n\nRayome, A. D. (2019, April 24). Major DDoS attacks increased 967% this year. TechRepublic.com. Retrieved from https://www.techrepublic.com/article/major-ddos-attacks-increased-967-this-year/\n\nRid, T. (2012). Cyber war will not take place. The Journal of Strategic Studies, 35(1), 5–32. doi:10.1080/01402390.2011.608939\n\nRid, T., &amp; Buchanan, B. (2015). Attributing cyber attacks. The Journal of Strategic Studies, 38(1-2), 4–37. doi:10.1080/01402390.2014.977382\n\nSchmitt, M. N., &amp; Vihul, L. (2016). The emergence of international legal norms for Cyberconflict. In F. Allhoff, A. Henschke, &amp; B. J. Strawser (Eds.), *Binary bullets: The ethics of cyberwarfare* (pp. 34–55). London, UK: Oxford University Press. doi:10.1093/acprof:oso/9780190221072.003.0003\n\nSpillius, A. (2010, May 7). Cyber attack ‘could fell US within 15 minutes’. The Telegraph. Retrieved from https://www.telegraph.co.uk/news/worldnews/northamerica/usa/7691500/Cyber-attack-could-fell-US-within-15-minutes.html\n\nSpitzer, J. (2018, August 6). Atlanta’s ransomware attack may cost the city $17M. Becker’s Hospital Review. Retrieved from https://www.beckershospitalreview.com/cybersecurity/atlanta-s-ransomware-attack-may-cost-the-city-17m.html\n\nStokel-Walker, C. (2019, July 5). Ransomware attacks are on the rise and the criminals are winning. New Scientist. Retrieved from https://www.newscientist.com/article/2208897-ransomware-attacks-are-on-the-rise-and-the-criminals-are-winning/\n\nThompson, M. (2016, March 24). Iranian cyber attack on New York dam shows future of war. Time. Retrieved from http://time.com/4270728/iran-cyber-attack-dam-fbi/",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 14,
            "markdown": "International Journal of Cyber Warfare and Terrorism\n\nVolume 9 • Issue 3 • July-September 2019\n\nUnited Nations Development Program (UNDP). (2008). Human security. Retrieved from http://hdr.undp.org/en/media/hdinsights_feb2008.pdf\n\nVogel, R. (2016). Closing the cybersecurity skills gap. *Salus Journal*, 4(2), 32.\n\nWerthes, S., Heaven, C., Vollnhals, S. (2011). Assessing human insecurity worldwide. The way to a human (in)security index. *Institute for Development and Peace (INEF) Report 102/2011*.\n\nWinseck, D. (2017). The Geopolitical Economy of the Global Internet Infrastructure. *Journal of Information Policy*, 7, 228–267. doi:10.5325/jinfopoli.7.2017.0228\n\nWinton, R. (2016, February 18). Hollywood hospital pays $17,000 in bitcoin to hackers; FBI investigating. *Los Angeles Times*. Retrieved from https://www.latimes.com/business/technology/la-me-ln-hollywood-hospital-bitcoin-20160217-story.html\n\nWirtz, J. J. (2019). Intelligence and the Besieged State. *International Journal of Intelligence and CounterIntelligence*, 32(1), 198–201. doi:10.1080/08850607.2018.1524248\n\nZetter, K. (2015, January). A cyberattack has caused confirmed physical damage for the second time ever. *Wired*. Retrieved from https://www.wired.com/2015/01/german-steel-mill-hack-destruction/\n\nBryson Payne (PhD) is a TEDx speaker, best-selling author, and the founding Director of the Center for Cyber Operations Education at the University of North Georgia, an NSA Center for Academic Excellence in Cyber Defense. He is a tenured professor of computer science at UNG, where he has taught aspiring coders and cyber professionals since 1998. He holds a Ph.D. in computer science from Georgia State University and is a Certified Information Systems Security Professional (CISSP) and Certified Ethical Hacker (CEH), and he holds the elite SANS|GIAC GPEN certification, among other industry certifications. Featured in CIO magazine, Campus Technology, and the Wall Street Journal, Dr. Payne is the best-selling author of Teach Your Kids to Code: A Parent-Friendly Guide to Python Programming (2015, No Starch Press), Learn Java the Easy Way (2017, No Starch Press), and Hacking for Kids (2019, No Starch Press).\n\nEdward L. Mienie (PhD) is the Executive Director of Strategic &amp; Security Studies and an Associate Professor of Political Science &amp; International Affairs. Dr. Mienie has more than 20 years of experience working in international relations and business, media relations, and coalition building. He earned a bachelor's degree in law from the University of South Africa and received his doctorate in international conflict management at Kennesaw State University. He is fluent in English, Afrikaans, and German. He served in the Diplomatic Corps of South Africa from 1987-1998, including four years as Deputy-Ambassador to Switzerland, and four years as the Political Advisor to the Ambassador and US Government/Congressional Liaison, Washington, D.C., 1989-1992. Dr. Mienie is also a veteran of the South African Army, having served four years' active duty in the Infantry during the Angolan War in the 1980's.\n\n50",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          },
          {
            "index": 15,
            "markdown": "Reproduced with permission of copyright owner. Further reproduction prohibited without permission.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2000,
              "width": 1400
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 16,
          "doc_size_bytes": 451195
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "International Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n# The Impact of Cyber-Physical Warfare on Global Human Security\nBryson R. Payne, University of North Georgia, Dahlonega, USA\nEdward L. Mienie, University of North Georgia, Dahlonega, USA\n# ABSTRACT\nCyber is deeply enmeshed and interwoven across national security, as evidenced by its inclusion in the national security policies of a growing number of OECD countries. But it is the impact of cyber across the other components of national and human security that remains to be sufficiently addressed at the national policy level, or in international standards of behavior with respect to cyberwarfare and hybrid conflict. In addition to standing on its own as a national security concern, cybersecurity impacts economic and trade security, ecological/environmental and biosecurity, energy and critical infrastructure security, food security, transportation, and public health, as well as communications, physical and even political security. This work examines the role of threats from cyberwarfare, hybrid conflict, and cyber-physical attacks across human security from a national and global perspective, makes near-term predictions about the future of cyberwarfare, and provides recommendations with respect to preparing for cyberwarfare and ongoing hybrid conflict.\n# KEYWORDS\nAsymmetric Warfare, Attribution, Cyber Intelligence, Cyber-Physical Attacks, Cybersecurity, Cyberwarfare, Denial of Service, Hybrid Conflict\n# INTRODUCTION\nIn 1947, the third industrial revolution began with the invention of the transistor, from which flowed massive technological changes that transformed societies and economies in the world. This resulted in governments, military and civilian organizations investing heavily in computer systems, making computers an essential part of large-scale operations during the 1950s and 1960s. By the 1980s, the proliferation of digital technology and computers spread into private homes and small offices via the personal\nDOI: 10.4018/IJCWT.2019070103\nCopyright © 2019, IGI Global. Copying or distributing in print or electronic forms without written permission of IGI Global is prohibited.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\ncomputer, or PC, eventually integrating with virtually all aspects of life in developed nations. The end of the 20th century saw industrial robots, graphics for video game entertainment, and automated teller cash machines in banks. By 1995 the world wide web became widely available, as it expanded across the globe (Hughes-Wilson, 2016).\nThe first decade of the 21st century saw the introduction of the smartphone, which quickly became commonplace with the proliferation of the wireless Internet and the smart electricity grid. By 2018 we had 3.3 billion smartphone users, and approximately 4.2 billion users accessed the Internet. The world has become interconnected using smartphones, tablets, and computer-based devices for both social networking and day-to-day business. It is worthwhile to note, however, that 85% of the infrastructure of the Internet is privately owned (GAO, 2009), primarily by telecommunications corporations and technology service providers, and therefore the majority of the Internet is not necessarily protected by municipal, state, or national governments.\nDuring these past two decades especially, as governments and defense manufacturers realized the potential for smart weapons, a new generation of technological military systems and missiles were developed (Hughes-Wilson, 2016), most of which rely upon wireless communications and the global positioning system (GPS) or similar navigational systems.\nBy 2015, cloud computing was ubiquitous, data could be uploaded in real time, and we saw tablet computers and smartphone use exceed personal computer use. The proliferation of the smart electrical grid, automated industrial and building controls, and the Internet of Things and smart Internet-connected devices in homes, offices, factories, and in automobiles has brought great efficiency and convenience, while simultaneously making us more vulnerable to cyberattacks in virtually every setting.\n# BACKGROUND\nIn 1946, the US Army Ordinance Corps financed and developed the world's first true reprogrammable computer. Intelligence showed a keen interest, and in 1952, President Harry Truman established the National Security Agency who in turn became a major investor in and customer of computers. In 1985, NSA merged with the National Computer Security Center to house the world's single largest group of supercomputers (National Research Council, 1990).\nIn the 1960s, Cray Data Corporation first introduced supercomputers and could process 33 quadrillion floating-point operations per second. At a price tag of $500,000 apiece, this placed Cray in the hands of well-funded governments and a handful of very large corporations and banks. Today, NSA's latest facility at Fort Meade houses one of three High-Performance Computing Centers, each with their own 150-megawatt power substation providing 60 megawatts of electricity. Each center comes at a price tag of $3.2 Billion. The British NSA equivalent, GCHQ, has remained in step with the digital revolution, as have the other members of the UN Security Council. Similarly, digital intelligence is very high on the Chinese list of national priorities.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nWith real-time digital intelligence now available, the Intelligence Community (IC) has accepted that it is here to stay. There is a school of thought that the traditional intelligence cycle approach (Tasking, Processing, Evaluation, and Dissemination) is too slow. Digital intelligence is revolutionizing the way intelligence does business. The IC now needs algorithms and applications to work on data and provide recommendations in order to keep pace with open-source media.\nIn 2009, the US Cyber Command was established to operate in the digital space and recruitment and retention of a technically qualified cyber force has become a challenge. There is talk of changing (not lowering) recruiting standards in an effort to recruit information security specialists as a matter of urgency. The creation of a separate cyber corps has become a struggle among military bureaucracies worldwide because of interagency competition (Hughes-Wilson, 2016).\nThe digital revolution has exposed new vulnerabilities of governments, and these have to be addressed by digital means, up to and including cyberwarfare. For the past century, the front lines of war have moved closer to modern households, as war is no longer something that happens on a far-away battlefield. The illusion of living in the safety of our own homes is slowly being eroded, as we increasingly become victims of cyber breaches, malware and ransomware infections, and denial of service attacks (DoS) that take down individual systems or complete networks. In addition to the issue previously mentioned with corporations, not governments, owning 85% of critical Internet infrastructure, research has shown that \"90 to 95 percent of US government traffic, including sensitive diplomatic and military orders, travels over privately-owned cables to reach officials in the field\" (Winseck, 2017).\n## The Progression from Cyberattacks to Cyber-Physical Attacks\nCyberwar has become a threat to modern society. Robert Morris became the first person to be convicted under the US Computer Fraud and Abuse Act in 1988. His act became known as the \"Morris Worm,\" which used weaknesses in the UNIX system and spread in less than 24 hours to an estimated 10 percent of all computers then connected to the Internet (FBI, 2018). This worm slowed down computers to the point of an early denial-of-service, leaving systems largely unusable. Morris served no jail time but performed community service as part of his sentence. It is understood that today, Prof. Morris is working as a professor at MIT (Dooley, 2018).\nIn 1994, a Russian called Vladimir Levin used a laptop in London to access the Citibank network. He accessed a list of customer passwords and codes and shared that with some of his associates. He used wire transfers to steal $3.7 million himself and set up accounts in Finland, the US, Netherlands, Germany, and Israel. His accomplices were eventually arrested, and they implicated Levin who was detained by the British police in 1995. Citibank recovered all but $400k of the eventual $10.7 million stolen (Goodman, 2015).\nComputer hacking has become a genuine international threat and is becoming more widespread and dangerous. Classic security targets of sabotage, espionage, and to a lesser extent subversion are in the sights of hackers. Cyber-attacks are hard to\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\npin on any adversary at the time of the attack, but intelligence agencies are becoming significantly more skilled at attribution, especially among highly skilled peer nations and known non-state groups. Remote access trojan attacks, a type of malware designed to give an attacker persistent remote control of a computer system, grew 650% year-over-year (HIPAA Journal, 2019). These attacks are especially concerning due to the ongoing, covert control an adversary can maintain over data and systems from anywhere in the world.\nIt used to be that the most damaging of cyber-attacks were Denial of Service or DoS attacks, but we are now seeing large-scale ransomware attacks, targeting banks, credit card companies and local government (Wirtz, 2019). Ransomware attacks, in which files or entire computer systems are locked via encryption and require payment of an illegal ransom to regain access, increased 235% from 2018 to 2019 (HIPAA Journal, 2019).\nThe city of Atlanta, the ninth largest US metropolitan city, was crippled by a ransomware attack in March 2018 that shut down city government functions including courts, police records, and municipal water payment systems. The ransomware physically damaged components in a number of computers rendering them unusable—several years' worth of video footage captured by the city's police cars was lost and unable to be recovered (Deere, 2018). Over $17 Million in direct costs were disclosed, in addition to the reputation damage, lost productivity, and other so-called soft costs (Spitzer, 2018). Notably, the ransomware was attributed to two specific Iranian civilians, who were named by the FBI and indicted in November 2018. Two cities in Florida were later hit with a different strain of ransomware in 2019, paying $530,000 and $600,000 in bitcoin to regain access to their systems (Stoel-Walker, 2019).\nCyberattack targets of opportunity have expanded to include physical infrastructures such as power plants, water systems, fuel depots, communications, and transportation. Satellites are particularly vulnerable as this could compromise military systems such as control and command. In 2009, there were reports of Russian and Chinese attempts to infiltrate the US electrical grid. They left behind software programs that later could be used to cause major disruption to the system (Gorman, 2009). As recently as November 2018, US intelligence officials noted that Russian hackers were still actively probing US power grid targets for vulnerabilities (Newman, 2018). National and municipal utility companies around the globe are advised to be on high alert, both for direct attacks like those noted above, and for \"fallout\" effects and collateral damage that might occur against uninvolved nations, when two or more larger powers conceivably launch targeted cyberattacks against commonly used systems and equipment.\n## The Issue With Attribution in Cyberattacks\nFrom an intelligence point of view, the worst nightmare is not knowing who the enemy is while the attack is happening. While attribution, our ability to assign responsibility to an aggressor, in physical warfare has been relatively straightforward, cyberwarfare and cyber espionage are especially difficult to attribute in real-time due to the lack of physical evidence and the ability of attackers to alter digital forensic clues, although\nintelligence agencies are improving rapidly in this regard (Rid & Buchanan, 2015). The lack of physical evidence and the difficulty of not being able to “see” cyber weapons or attacks has been cited as one of the reasons there have not yet been well‐established international ethical norms in cyberwarfare (Schmitt & Vihul, 2016). There is a real danger in intercepting and even modifying classified information from the other side of the world, not knowing who sent it or whether it is genuine.\nIn 1999, the US accidentally discovered someone trying to access the systems at the US Department of Energy, the Pentagon, NASA, private universities, as well as research labs (Rid, 2011). The US traced this attack back to Russia, but Russia denied this, and the sponsor is unknown. The so‐called “Titan Rain” attack in 2003 on Redstone Arsenal in Huntsville, Alabama, was most likely perpetrated by the Chinese. The main servers used in the attack were traced back to Guangdong, China, although there is some uncertainty as to whether the Chinese government or Chinese hacktivists were responsible. The servers were masked by proxy sites, “zombie computers,” which infected spyware and viruses into the computer systems (Clarke & Knake, 2010). The base is used as the Centre for the US Army's missile and rocket programs.\nIn 2007, cyberwar became a reality for Estonia when distributed denial of service (DDoS) attacks disabled parliament, banks, newspapers, and broadcasters' computer networks. The Russians called the accusations against them unfounded and there was no evidence of their complicity. Later, the head of the Russian military forecasting center affirmed their ability to conduct a DoS attack (Hughes‐Wilson, 2016). This is yet another example that poses a problem for the broader IC by not knowing for sure the perpetrator of an attack while it is going on.\n## Cyber‐Physical Attacks on Critical Infrastructure\nThe first major cyber‐physical attack on critical industrial infrastructure occurred in 2009 when a very sophisticated attack was launched on Iran's centrifuges that came from a memory‐ stick flash‐drive through a Microsoft Windows operating system to the Siemens Step7 software that controlled the centrifuges. This was a malicious computer worm called Stuxnet (Farwell & Rohozinski, 2011). No‐one at the time knew where it had come from originally or who the intended victims were meant to be. Siemens claimed industrial espionage had been perpetrated against their business, while Iran claimed that their nuclear program had been sabotaged. Which was it? A combination of the two? How do we decide to retaliate? Against whom? By what means? And to what extent?\nWhile both the US and Israel are alleged as the possible sources of this cyber‐physical weapon, neither has publicly acknowledged responsibility. Although, it is believed that at General Ashkenazi's retirement from the Israeli Defense Force farewell reception, he referenced Stuxnet as one of his numerous operational successes (Hughes‐Wilson, 2016). While most of the collateral damage caused by Stuxnet was reported to be minimal, it affected systems in Germany (where the Siemens controllers originated) and elsewhere in smaller nations that were not involved in the dispute between Iran and its adversary or adversaries.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nIn 2014, the second known successful cyber-physical attack was revealed, this time apparently targeting a steel mill in Germany (Zetter, 2015). The weaponized software disrupted a blast furnace control system so that the furnace could not be properly shut down, causing massive damage to the facility. The German steel mill attack would have been the third such attack, as it was preceded by an attack on a US dam a year earlier, but the dam attack did not succeed in causing confirmed physical damage.\nPreviously, in 2013, seven members of Iran's Islamic Revolutionary Guards Corps allegedly took control of a flood-control dam 25 miles north of New York City through a cellular network modem, but they were unable to release water only because the sluice gate had been manually disconnected for maintenance at the time of the attack (Thompson, 2016). The FBI used its \"name and shame\" tactic in 2015 both to limit travel options for the seven individuals claimed to be involved, and to demonstrate that the US was getting better at attribution. Even so, it took over two years to bring the indictment. The eventual indictment noted that the attackers were also targeting banks, the New York Stock Exchange, and telecommunications giant AT&amp;T.\nSeveral smaller cyber-physical effects were achieved through ransomware similar to that used in the attack on the city of Atlanta, though. Ransomware is especially concerning for human physical and health security in the cases of hospitals, such as the Hollywood Presbyterian Medical Center ransomware attack in February 2016 (Winton, 2016). While the hospital paid the $17,000 bitcoin ransom and recovered control of its computers, in the week and a half of the shutdown caused by the ransomware, several patients were sent to other area hospitals, although no cases of direct injury to patients were noted.\nIn addition to public health facilities themselves, individual medical devices, such as pacemakers and insulin pumps, have been found to have major vulnerabilities that could conceivably cause deaths from targeted cyber-physical attacks against these devices (Hern, 2018). While no patient deaths have been reported to date as a result of hacking, there have been recalls affecting as many as half a million devices in a single case (Hern, 2017), affecting both private medical device manufacturers and hundreds of thousands of patients.\nPerhaps the largest cyber-physical attacks, though, were the two separate attacks on Ukraine's power grid in December 2015 and December 2016, which shut down power to hundreds of thousands of customers in the cold of winter (Greenberg, 2017). Each attack lasted only a few hours, the length of time it took engineers to scramble to physical substations to engage manual override switches. But they demonstrated the power and precision of the alleged Russian military cyberwar machine, with the second attack fully automated and striking at precisely midnight on Saturday. The attacks contributed to the destabilization surrounding the annexation of Crimea and several clashes between Russian and Ukrainian forces in the Donetsk and Luhansk regions of Ukraine. This time, attribution was relatively swift, but the smaller Ukraine was not able to retaliate in kind against its much more cyber-capable adversary.\n41\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n# Preparing for Cyberwarfare\nIn 2010, Richard Clarke, the White House counterterrorism chief warned that if the country were in a cyber war at that time, “the United States would lose” (Kakutani, 2010, C1). He stated that Russia, China, and North Korea had already recruited a myriad of hackers, while Iran claims to have the world’s largest cyber army. He warned that because we are so completely dependent on electronics, the West could be brought to its knees within fifteen minutes of a serious cyber-attack (Spillius, 2010). Since then, cyber-attacks have become regular features of an undeclared war.\nThe Chinese People’s Liberation Army is known to be hacking into major US and European corporations going after intellectual property and targets include IT, electronics, software, defense, aerospace, biomedical and pharmaceutical breakthroughs, energy, finance, banks, and agriculture. In 2012, a major Russian IT security company called “Kaspersky” identified a cyber-attack called “Red October” that had been operating since 2007. The virus used Word and Excel to gather information from military installations, energy providers, government embassies, nuclear infrastructures, research firms, and other critical infrastructure operators (Herr, 2014).\nMI5 and the Director General of GCHQ have expressed concern about cyber-attacks and how that may cause significant damage to their reputations and revenue. US Cyber Command has to decide daily whether they are being confronted by criminal activity or breaches of national security. Into which category does commercial espionage and theft of intellectual property fall? In 2014, after Sony Pictures produced a low budget movie poking fun at North Korean leader Kim Jong-Un, Kim launched 6,000 hackers against Sony, which inflicted a cost on Sony of $100M (Hughes-Wilson, 2016). The FBI claimed to have conclusive evidence that it was the North Korean government behind it. President Obama called them out and retaliated with a controlled cyber strike against North Korea’s weak internet. Was this a case of cyber terrorism, cyberwar, or cybercrime? North Korea has denied their complicity and has demanded an apology.\nIt should be noted that not everyone is in agreement with the FBI’s conclusion that the attack was indeed perpetrated by North Korea (Hughes-Wilson, 2016). The detractors claim that the attack was too sophisticated and that it was more than likely an inside job. This is a great example of the difficulty a cyber-attack poses to the IC by not knowing for sure who the enemy is and yet a counter-offensive was launched. This cannot bode well as an example of possibly misidentifying the attacker and launching an attack on the wrong target. We are stuck with the underlying difficulty of identifying the real cyber-aggressor. We should keep in mind that weak retaliation emboldens others and the bad actor can maximize the threshold-level event to suit their aims and objectives (Hughes-Wilson, 2016). This could make cyberwarfare the ultimate asymmetric war and has changed the landscape of cyber conflict.\n# Cyber-Espionage and the Intelligence Community\nLegislation would have to be passed by Congress for there to be intelligence sharing between the IC and the private sector. The Snowden case warned about this. The\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nUS has much more to lose than any other nation because it has more research and development than any other world power. There is a definite cyber-threat to this type of intelligence sharing. Sixty percent of known cyber-attacks are against commercial targets (Hughes-Wilson, 2016). \"Cyber-attacks\" is the 21st century preferred form of international trade theft. The threat is growing exponentially and in 2015 it increased by more than 600% over a three-year period. Attempts to breach security in the energy, oil, and gas sectors increased to just under 400 percent. Questions that we are facing are how much security is enough? Should it be run internally or outsourced? How much should be spent? What tools and people are most effective?\nAs the Chinese state and its economy are intertwined, illicit intelligence gathering raises to the level of national security interests (Hughes-Wilson, 2016). The pressure of economic sanctions against Russia due to their actions in the Ukraine has resulted in an increase in cyber-attacks against the West. The cyber-attack growth from 2009 to 2015 increased from 3.9 million incidents to more than 50 million. We have observed that international agreements to limit such behavior are ineffective. Russia and China strongly deny accusations of intellectual property theft or cyber espionage. However, in light of NSA activities as revealed by the 2013 Edward Snowden saga that the US spied on Germany and Brazil, China and Russia have become emboldened to accuse the US of obvious hypocrisy.\nIt is no longer a secret that the US, Russia, China, Israel, and North Korea are engaged in a ruthless, secret and potentially dangerous cyber struggle. By 2016, the Pentagon's IT and cyber programs increased seven-fold in spending from $13.3 million in 2015 to $84 million in 2016 (Hughes-Wilson, 2016). To further underscore the resolve of the US Government to do everything possible to mitigate the threat of cyber war, the CIA announced in 2015 their first new Directorate in fifty years, namely the Directorate for Digital Innovation. The problem we face is that no-one knows exactly what the real threat is and because of that there is a strong temptation to throw taxpayers' money at some ill-defined enemy. As an alternative to conventional warfare, cyberwar is a new, ill-defined form of warfare with intelligence at its cutting edge. As the threat of hybrid warfare is increasingly growing to replace conventional warfare, a cyber-attack has become the main disabling weapon.\nAnd especially in smaller nations, we must not only protect ourselves from direct cyber threats from both terrorist groups and other nation-states, but from the potential collateral damage resulting from larger powers' use of cyber weapons both in warfare and in so-called hybrid conflict short of war.\nThe era of cyber war has introduced weapons of mass disruption as opposed to conventional war's weapons of mass destruction. Weapons of mass disruption are often targeted, such as the \"Stuxnet\" example, specialized, ongoing, secret, and may range from the level of a crime and a nuisance like specialized ransomware to a complete shutdown of critical infrastructure in the case of cyber-physical attacks. On the other hand, weapons of mass destruction can cause huge casualties such as the case of Hiroshima and Nagasaki, are indiscriminate, transparent, fall clearly into the category of warfare, and are strategic.\n43\nWe should also be mindful that there is no single accepted definition of “cyber” and analysts and states do not have the same frame of reference when using the term (Futter, 2018). Some people regard cyberwarfare as military actions through the Internet. For others, it involves information warfare (Futter, 2018). Not having a universal understanding of the term makes understanding and responding to different threats very complicated. Perhaps it is best to think of cyber as comprising a set of tools, and the question then is not which cyber technologies can do something specific, but rather how the new context changes the way we understand and interact with the world (Futter, 2018).\n## THE FUTURE OF CYBERWARFARE\nWhat does the cyber weapon of the future look like? While no one can say with certainty, here are a few of the considerations that nations large and small should keep in mind to protect national and human security in this period of cyber proliferation and cyber escalation.\nFirst, we have already seen most of the individual weapons, as outlined in the sections above, from ransomware and trojan viruses to industrial attacks and disinformation. What will be different in an all‐out cyberwar is the massive aggregation of cyber weapons in a coordinated barrage of attacks (Deng et al. 2017). Ransomware attacks launched broadly against hospitals, public safety, banks, transportation and logistics firms, and local governments have already increased 235% from 2018 to 2019, while we are supposedly at peace (HIPAA Journal, 2019), and remote access trojan attacks are up 650% during the same period. Highly targeted attacks on industrial control systems, power and water distribution in major cities based on precursors like the Iranian and Russian power grid attacks and Stuxnet; information operations and disinformation campaigns aimed at social media and traditional news outlets; and massive denial of service attacks against stock markets and major telecommunications providers.\nHuman security concerns recognize the conditions that menace survival (UNDP, 2008), such as attacks on power/water supply, medical systems, or other physical systems that could endanger public health (Barnett et al. 2013). Physical, personal, and community security are affected by loss of trust in system, and violent or disruptive acts have a “negative impact on social cohesion,” irrespective of whether it is committed by state or non‐state actors (Werthes et al. 2011).\nInformation operations and info warfare can achieve scale and speed never before possible, as Kopp predicted almost 20 years ago (Kopp, 2000) — for example, did fake postings on Facebook impact the US election (Allcott & Gentzkow, 2017)? And imagine the impact of all that going on, while simultaneously experiencing traditional kinetic attacks against key military and political targets on the ground from artillery, missiles and good‐old‐fashioned bombs. We predict that future warfare is not just cyberwar but cyber plus war. It is not War 2.0 or 3.0, but War to the second or third power, exponentially more devastating than traditional or even nuclear weapons alone.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nSecond, social engineering and traditional human intelligence operations will continue to grow in importance in cyber warfare. Releasing targeted weapons over the Internet is complicated by considerations of collateral damage, as was the case in Stuxnet (Farwell &amp; Rohozinski, 2011) and several ransomware attacks, and it increases the risk of detection and neutralization by third parties (Payne, 2018). Human intelligence operatives will continue to be able to deliver portable USB drives and other physical electronic devices, combined with ever-evolving remote delivery systems like drones, as well as local social engineering attacks, to gain access to even air-gapped, non-networked systems like those in sensitive government, military, and public utility company operations (Gioe, 2018). Cyber operators will not likely replace intelligence operatives, as some have envisioned; rather, they will rely even more heavily upon their human intel colleagues, both to bring sensitive information to the table, and to deliver targeted electronic payloads where signals, wires, and fiber optic cables may not reach.\nThird, cyber defense will evolve and morph almost as rapidly as the shifting cyber landscape. Vigilant cyber hygiene and aggressive patching and updating of systems are not enough. We must also expand and accelerate cyber operations training for professionals in the military, in government, and in corporations (De Borchgrave et al., 2001). Currently, there is a global skills gap of over 1 million unfilled cyber jobs growing to a shortfall of 3.5 million skilled cyber professionals by 2021 (Morgan, 2017), and we cannot just throw money at cyber if there is no workforce to carry out the mission (Vogel, 2016).\nWe must become orders of magnitude better both at cyber threat hunting and at sharing information on likely cyber-attacks and vulnerabilities between national agencies and private industry (De Borchgrave et al., 2001). The US has begun efforts toward this end, but it may be hindered by its size; this is an area that smaller nations could potentially do better than their traditionally more powerful peers (Mienie, 2019). Smaller nations will continue to suffer collateral damage as major cyber powers and cybercriminals inflict damage on larger targets, and so these smaller countries must use their size and speed to their advantage to detect and defend against cyberattacks.\nFinally, cyber warfare will continue to be exacerbated, and to some extent obscured, by traditional cybercrime and espionage (Payne, 2018), which we can only characterize with the word \"more\". More denial of service attacks (Rayome, 2019), more Internet of Things (IoT) device-related attacks, which increased by 600% and 217.5% in 2018 and 2019, respectively (Rayome, 2018; Gatlan, 2019), more ransomware and crypto attacks (HIPAA Journal, 2019), more targeted attacks against specific infrastructure and devices (McMillen, 2016), and more information warfare (Pomerleau, 2019). Examining these trends, we can only predict more disruption, more annoyance, more danger to our economies, our borders and biosecurity, our food, energy and natural resources, our transportation and communication, and even our public health, physical and political security.\n45\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n# CONCLUSION\nCyber is deeply enmeshed and interwoven across both national and human security concerns. In the interests of more cyber threat awareness, we propose that tabletop exercises and cyber simulations for political leaders, armed forces, police, and critical infrastructure personnel down to the local government level be conducted regularly. Awareness training for civil and municipal government employees should be the norm and not the exception. Telecom companies and device manufacturers can assist in the prevention of malware, phishing, and network-borne attacks by being proactive in our combined efforts to mitigate those attacks and to share information with government agencies in a more concerted and immediate manner.\nMoreover, technology and cyber education in schools should become part of the core curriculum. The moment our fingers touch a keyboard or touchscreen, or the moment we use our voices to interact with the technology listening in our cars, homes or smartphones, irrespective of our educational discipline, we are exposed and vulnerable to a cyber-attack. Individual responsibility can mitigate national cybersecurity threats collectively, but we must make a collective effort to develop a new generation of cyber heroes, cyber guardians, and cyber professionals. An uneducated populace is a luxury developed nations can no longer afford. It is our sincerest hope that discussion and acknowledgment of the scope of future war, and that public, academic publications like this one can spark the kinds of national policy debates that can energize our collective will to prepare for the next generation of cyber warfare that is already at our doorstep, that we have already seen in part, but that has the potential to forever change our future and our children's future.\n46\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019",
  "references": [
    "# REFERENCES\nAllcott, H., &amp; Gentzkow, M. (2017). Social media and fake news in the 2016 election. The Journal of Economic Perspectives, 31(2), 211–236. doi:10.1257/jep.31.2.211\nBarnett, D. J., Sell, T. K., Lord, R. K., Jenkins, C. J., Terbush, J. W., &amp; Burke, T. A. (2013). Cyber Security Threats to Public Health. World Medical &amp; Health Policy, 5(1), 37–46. doi:10.1002/wmh3.19\nClarke, R. A., &amp; Knake, R. K. (2010). Cyber war. New York, NY: Harper Collins.\nDe Borchgrave, A., Cilluffo, F. J., Cardash, S. L., &amp; Ledgerwood, M. M. (2001). Cyber Threats and Information Security: Meeting the 21st Century Challenge. Center for Strategic &amp; International Studies.\nDeer, S. (2018, August 1). Atlanta’s cyber attack could cost taxpayers $17 million. Atlanta Journal-Constitution. Retrieved from https://www.ajc.com/news/confidential-report-atlanta-cyber-attack-could-hit-million/GAljmndAF3EQdVWlMcXS0K/\nDeng, R., Zhuang, P., &amp; Liang, H. (2017). CCPA: Coordinated cyber-physical attacks and countermeasures in smart grid. IEEE Transactions on Smart Grid, 8(5), 2420–2430. doi:10.1109/TSG.2017.2702125\nDooley, J. F. (2018). Cyber Weapons and Cyber Warfare. In History of Cryptography and Cryptanalysis (pp. 213–239). Cham, CH: Springer. doi:10.1007/978-3-319-90443-6_13\nFarwell, J. P., &amp; Rohozinski, R. (2011). Stuxnet and the future of cyber war. Survival, 53(1), 23–40. doi:10.1080/00396338.2011.555586\nFBI. (2018). The Morris Worm: 30 years since first major attack on the Internet. November 2, 2018. Retrieved from https://www.fbi.gov/news/stories/morris-worm-30-years-since-first-major-attack-on-internet-110218\nFutter, A. (2018). Hacking the Bomb: Cyber Threats and Nuclear Weapons. Washington, DC: Georgetown University Press.\nGatlan, S. (2019, March 29). IoT attacks escalating with a 217.5% increase in volume. BleepingComputer. Retrieved from https://www.bleepingcomputer.com/news/security/iot-attacks-escalating-with-a-2175-percent-increase-in-volume/\nGioe, D. V. (2018). Cyber operations and useful fools: The approach of Russian hybrid intelligence. Intelligence and National Security, 33(7), 954–973. doi:10.1080/02684527.2018.1479345\nGoodman, M. (2015). Future crimes: Everything is connected, everyone is vulnerable and what we can do about it. Norwell, MA: Anchor Press.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nGorman, S. (2009, April 8). Electricity grid in US penetrated by spies. The Wall Street Journal, 8. Retrieved from https://www.wsj.com/articles/SB123914805204099085\nGovernment Accountability Office (GAO). (2009, June 26). The Department of Homeland Security's (DHS) Critical Infrastructure Protection Cost-Benefit Report.\nGreenberg, A. (2017, June). How an entire nation became Russia's test lab for cyberwar. Wired. Retrieved from https://www.wired.com/story/russian-hackers-attack-ukraine/\nHern, A. (2017, August 31). Hacking risk leads to recall of 500,000 pacemakers due to patient death fears. The Guardian. Retrieved from https://www.theguardian.com/technology/2017/aug/31/hacking-risk-recall-pacemakers-patient-death-fears-fda-firmware-update\nHern, A. (2018, August 9). Hackable implanted medical devices could cause deaths, researchers say. The Guardian. Retrieved from https://www.theguardian.com/technology/2018/aug/09/implanted-medical-devices-hacking-risks-medtronic\nHerr, T. (2014). PrEP: A framework for malware &amp; cyber weapons. Journal of Information Warfare, 13(1), 87–106.\nHughes-Wilson, J. (2016). The Secret State: A History of Intelligence and Espionage. New York, NY: Pegasus Books, Ltd.\nHIPAA Journal. (2019, May 3). Ransomware attacks increased by 195% in Q1, 2019, but trojans remain the biggest threat. Retrieved from https://www.hipaajournal.com/ransomware-attacks-increased-by-195-in-q1-2019-but-trojans-remain-the-biggest-threat/\nKakutani, M. (2010, April 27). The Attack Coming From Bytes, Not Bombs. New York Times. Retrieved from https://archive.nytimes.com/www.nytimes.com/2010/04/27/books/27book.html\nKopp, C. (2000, May). Moore's law and its implications for information warfare. Proceedings of the International AOC Electronic Warfare Conference, Alexandria, VA (Vol. 3). Academic Press.\nMcMillen, D. (2016). Attacks Targeting Industrial Control Systems (ICS) Up 110 Percent. SecurityIntelligence. December 27, 2016. Retrieved from https://securityintelligence.com/attacks-targeting-industrial-control-systems-ics-up-110-percent/\nMienie, E. (2019). The role of cyber in national and global human security. Proceedings of the International Conference on Cyber Warfare and Security (ICCWS), Stellenbosch, South Africa, February 28. Academic Press.\nMorgan, S. (2017). Cybersecurity labor crunch to hit 3.5 million unfilled jobs by 2021. Cybersecurity Business Report.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nNational Research Council, System Security Study Committee. (1990). Computers at risk: safe computing in the information age. National Academies Press.\nNewman, L. H. (2018, November). Russian hackers haven't stopped probing the power grid. Wired. Retrieved from https://www.wired.com/story/russian-hackers-us-power-grid-attacks/\nPayne, B. R. (2018). The expanding role of cyber in national security, Line of Defence, 1 (8), Winter 2018. Auckland, NZ: DefSec Media.\nPomerleau, M. (2019, July 11). Joint Chiefs nominee wants to boost information warfare. C4ISRNet. Retrieved from https://www.c4isrnet.com/information-warfare/2019/07/11/joint-chiefs-nominee-wants-to-boost-information-warfare/\nRayome, A. D. (2018, March 21). As IoT attacks increase 600% in one year, businesses need to up their security. TechRepublic.com. Retrieved from https://www.techrepublic.com/article/as-iot-attacks-increase-600-in-one-year-businesses-need-to-up-their-security/\nRayome, A. D. (2019, April 24). Major DDoS attacks increased 967% this year. TechRepublic.com. Retrieved from https://www.techrepublic.com/article/major-ddos-attacks-increased-967-this-year/\nRid, T. (2012). Cyber war will not take place. The Journal of Strategic Studies, 35(1), 5–32. doi:10.1080/01402390.2011.608939\nRid, T., &amp; Buchanan, B. (2015). Attributing cyber attacks. The Journal of Strategic Studies, 38(1-2), 4–37. doi:10.1080/01402390.2014.977382\nSchmitt, M. N., &amp; Vihul, L. (2016). The emergence of international legal norms for Cyberconflict. In F. Allhoff, A. Henschke, &amp; B. J. Strawser (Eds.), *Binary bullets: The ethics of cyberwarfare* (pp. 34–55). London, UK: Oxford University Press. doi:10.1093/acprof:oso/9780190221072.003.0003\nSpillius, A. (2010, May 7). Cyber attack ‘could fell US within 15 minutes’. The Telegraph. Retrieved from https://www.telegraph.co.uk/news/worldnews/northamerica/usa/7691500/Cyber-attack-could-fell-US-within-15-minutes.html\nSpitzer, J. (2018, August 6). Atlanta’s ransomware attack may cost the city $17M. Becker’s Hospital Review. Retrieved from https://www.beckershospitalreview.com/cybersecurity/atlanta-s-ransomware-attack-may-cost-the-city-17m.html\nStokel-Walker, C. (2019, July 5). Ransomware attacks are on the rise and the criminals are winning. New Scientist. Retrieved from https://www.newscientist.com/article/2208897-ransomware-attacks-are-on-the-rise-and-the-criminals-are-winning/\nThompson, M. (2016, March 24). Iranian cyber attack on New York dam shows future of war. Time. Retrieved from http://time.com/4270728/iran-cyber-attack-dam-fbi/\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nUnited Nations Development Program (UNDP). (2008). Human security. Retrieved from http://hdr.undp.org/en/media/hdinsights_feb2008.pdf\nVogel, R. (2016). Closing the cybersecurity skills gap. *Salus Journal*, 4(2), 32.\nWerthes, S., Heaven, C., Vollnhals, S. (2011). Assessing human insecurity worldwide. The way to a human (in)security index. *Institute for Development and Peace (INEF) Report 102/2011*.\nWinseck, D. (2017). The Geopolitical Economy of the Global Internet Infrastructure. *Journal of Information Policy*, 7, 228–267. doi:10.5325/jinfopoli.7.2017.0228\nWinton, R. (2016, February 18). Hollywood hospital pays $17,000 in bitcoin to hackers; FBI investigating. *Los Angeles Times*. Retrieved from https://www.latimes.com/business/technology/la-me-ln-hollywood-hospital-bitcoin-20160217-story.html\nWirtz, J. J. (2019). Intelligence and the Besieged State. *International Journal of Intelligence and CounterIntelligence*, 32(1), 198–201. doi:10.1080/08850607.2018.1524248\nZetter, K. (2015, January). A cyberattack has caused confirmed physical damage for the second time ever. *Wired*. Retrieved from https://www.wired.com/2015/01/german-steel-mill-hack-destruction/\nBryson Payne (PhD) is a TEDx speaker, best-selling author, and the founding Director of the Center for Cyber Operations Education at the University of North Georgia, an NSA Center for Academic Excellence in Cyber Defense. He is a tenured professor of computer science at UNG, where he has taught aspiring coders and cyber professionals since 1998. He holds a Ph.D. in computer science from Georgia State University and is a Certified Information Systems Security Professional (CISSP) and Certified Ethical Hacker (CEH), and he holds the elite SANS|GIAC GPEN certification, among other industry certifications. Featured in CIO magazine, Campus Technology, and the Wall Street Journal, Dr. Payne is the best-selling author of Teach Your Kids to Code: A Parent-Friendly Guide to Python Programming (2015, No Starch Press), Learn Java the Easy Way (2017, No Starch Press), and Hacking for Kids (2019, No Starch Press).\nEdward L. Mienie (PhD) is the Executive Director of Strategic &amp; Security Studies and an Associate Professor of Political Science &amp; International Affairs. Dr. Mienie has more than 20 years of experience working in international relations and business, media relations, and coalition building. He earned a bachelor's degree in law from the University of South Africa and received his doctorate in international conflict management at Kennesaw State University. He is fluent in English, Afrikaans, and German. He served in the Diplomatic Corps of South Africa from 1987-1998, including four years as Deputy-Ambassador to Switzerland, and four years as the Political Advisor to the Ambassador and US Government/Congressional Liaison, Washington, D.C., 1989-1992. Dr. Mienie is also a veteran of the South African Army, having served four years' active duty in the Infantry during the Angolan War in the 1980's.\n50\nReproduced with permission of copyright owner. Further reproduction prohibited without permission."
  ],
  "flat_text": "International Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 # The Impact of Cyber-Physical Warfare on Global Human Security Bryson R. Payne, University of North Georgia, Dahlonega, USA Edward L. Mienie, University of North Georgia, Dahlonega, USA # ABSTRACT Cyber is deeply enmeshed and interwoven across national security, as evidenced by its inclusion in the national security policies of a growing number of OECD countries. But it is the impact of cyber across the other components of national and human security that remains to be sufficiently addressed at the national policy level, or in international standards of behavior with respect to cyberwarfare and hybrid conflict. In addition to standing on its own as a national security concern, cybersecurity impacts economic and trade security, ecological/environmental and biosecurity, energy and critical infrastructure security, food security, transportation, and public health, as well as communications, physical and even political security. This work examines the role of threats from cyberwarfare, hybrid conflict, and cyber-physical attacks across human security from a national and global perspective, makes near-term predictions about the future of cyberwarfare, and provides recommendations with respect to preparing for cyberwarfare and ongoing hybrid conflict.\n# KEYWORDS Asymmetric Warfare, Attribution, Cyber Intelligence, Cyber-Physical Attacks, Cybersecurity, Cyberwarfare, Denial of Service, Hybrid Conflict # INTRODUCTION In 1947, the third industrial revolution began with the invention of the transistor, from which flowed massive technological changes that transformed societies and economies in the world. This resulted in governments, military and civilian organizations investing heavily in computer systems, making computers an essential part of large-scale operations during the 1950s and 1960s. By the 1980s, the proliferation of digital technology and computers spread into private homes and small offices via the personal DOI: 10.4018/IJCWT.2019070103 Copyright © 2019, IGI Global. Copying or distributing in print or electronic forms without written permission of IGI Global is prohibited.\nInternational Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 computer, or PC, eventually integrating with virtually all aspects of life in developed nations. The end of the 20th century saw industrial robots, graphics for video game entertainment, and automated teller cash machines in banks. By 1995 the world wide web became widely available, as it expanded across the globe.\nThe first decade of the 21st century saw the introduction of the smartphone, which quickly became commonplace with the proliferation of the wireless Internet and the smart electricity grid. By 2018 we had 3.3 billion smartphone users, and approximately 4.2 billion users accessed the Internet. The world has become interconnected using smartphones, tablets, and computer-based devices for both social networking and day-to-day business. It is worthwhile to note, however, that 85% of the infrastructure of the Internet is privately owned, primarily by telecommunications corporations and technology service providers, and therefore the majority of the Internet is not necessarily protected by municipal, state, or national governments.\nDuring these past two decades especially, as governments and defense manufacturers realized the potential for smart weapons, a new generation of technological military systems and missiles were developed, most of which rely upon wireless communications and the global positioning system (GPS) or similar navigational systems.\nBy 2015, cloud computing was ubiquitous, data could be uploaded in real time, and we saw tablet computers and smartphone use exceed personal computer use. The proliferation of the smart electrical grid, automated industrial and building controls, and the Internet of Things and smart Internet-connected devices in homes, offices, factories, and in automobiles has brought great efficiency and convenience, while simultaneously making us more vulnerable to cyberattacks in virtually every setting.\n# BACKGROUND In 1946, the US Army Ordinance Corps financed and developed the world's first true reprogrammable computer. Intelligence showed a keen interest, and in 1952, President Harry Truman established the National Security Agency who in turn became a major investor in and customer of computers. In 1985, NSA merged with the National Computer Security Center to house the world's single largest group of supercomputers (National Research Council, 1990).\nIn the 1960s, Cray Data Corporation first introduced supercomputers and could process 33 quadrillion floating-point operations per second. At a price tag of $500,000 apiece, this placed Cray in the hands of well-funded governments and a handful of very large corporations and banks. Today, NSA's latest facility at Fort Meade houses one of three High-Performance Computing Centers, each with their own 150-megawatt power substation providing 60 megawatts of electricity. Each center comes at a price tag of $3.2 Billion. The British NSA equivalent, GCHQ, has remained in step with the digital revolution, as have the other members of the UN Security Council. Similarly, digital intelligence is very high on the Chinese list of national priorities.\nInternational Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 With real-time digital intelligence now available, the Intelligence Community (IC) has accepted that it is here to stay. There is a school of thought that the traditional intelligence cycle approach (Tasking, Processing, Evaluation, and Dissemination) is too slow. Digital intelligence is revolutionizing the way intelligence does business. The IC now needs algorithms and applications to work on data and provide recommendations in order to keep pace with open-source media.\nIn 2009, the US Cyber Command was established to operate in the digital space and recruitment and retention of a technically qualified cyber force has become a challenge. There is talk of changing (not lowering) recruiting standards in an effort to recruit information security specialists as a matter of urgency. The creation of a separate cyber corps has become a struggle among military bureaucracies worldwide because of interagency competition.\nThe digital revolution has exposed new vulnerabilities of governments, and these have to be addressed by digital means, up to and including cyberwarfare. For the past century, the front lines of war have moved closer to modern households, as war is no longer something that happens on a far-away battlefield. The illusion of living in the safety of our own homes is slowly being eroded, as we increasingly become victims of cyber breaches, malware and ransomware infections, and denial of service attacks (DoS) that take down individual systems or complete networks. In addition to the issue previously mentioned with corporations, not governments, owning 85% of critical Internet infrastructure, research has shown that\"90 to 95 percent of US government traffic, including sensitive diplomatic and military orders, travels over privately-owned cables to reach officials in the field\".\n## The Progression from Cyberattacks to Cyber-Physical Attacks Cyberwar has become a threat to modern society. Robert Morris became the first person to be convicted under the US Computer Fraud and Abuse Act in 1988. His act became known as the\"Morris Worm,\"which used weaknesses in the UNIX system and spread in less than 24 hours to an estimated 10 percent of all computers then connected to the Internet. This worm slowed down computers to the point of an early denial-of-service, leaving systems largely unusable. Morris served no jail time but performed community service as part of his sentence. It is understood that today, Prof. Morris is working as a professor at MIT.\nIn 1994, a Russian called Vladimir Levin used a laptop in London to access the Citibank network. He accessed a list of customer passwords and codes and shared that with some of his associates. He used wire transfers to steal $3.7 million himself and set up accounts in Finland, the US, Netherlands, Germany, and Israel. His accomplices were eventually arrested, and they implicated Levin who was detained by the British police in 1995. Citibank recovered all but $400k of the eventual $10.7 million stolen.\nComputer hacking has become a genuine international threat and is becoming more widespread and dangerous. Classic security targets of sabotage, espionage, and to a lesser extent subversion are in the sights of hackers. Cyber-attacks are hard to International Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 pin on any adversary at the time of the attack, but intelligence agencies are becoming significantly more skilled at attribution, especially among highly skilled peer nations and known non-state groups. Remote access trojan attacks, a type of malware designed to give an attacker persistent remote control of a computer system, grew 650% year-over-year (HIPAA Journal, 2019). These attacks are especially concerning due to the ongoing, covert control an adversary can maintain over data and systems from anywhere in the world.\nIt used to be that the most damaging of cyber-attacks were Denial of Service or DoS attacks, but we are now seeing large-scale ransomware attacks, targeting banks, credit card companies and local government. Ransomware attacks, in which files or entire computer systems are locked via encryption and require payment of an illegal ransom to regain access, increased 235% from 2018 to 2019 (HIPAA Journal, 2019).\nThe city of Atlanta, the ninth largest US metropolitan city, was crippled by a ransomware attack in March 2018 that shut down city government functions including courts, police records, and municipal water payment systems. The ransomware physically damaged components in a number of computers rendering them unusable—several years' worth of video footage captured by the city's police cars was lost and unable to be recovered. Over $17 Million in direct costs were disclosed, in addition to the reputation damage, lost productivity, and other so-called soft costs. Notably, the ransomware was attributed to two specific Iranian civilians, who were named by the FBI and indicted in November 2018. Two cities in Florida were later hit with a different strain of ransomware in 2019, paying $530,000 and $600,000 in bitcoin to regain access to their systems.\nCyberattack targets of opportunity have expanded to include physical infrastructures such as power plants, water systems, fuel depots, communications, and transportation. Satellites are particularly vulnerable as this could compromise military systems such as control and command. In 2009, there were reports of Russian and Chinese attempts to infiltrate the US electrical grid. They left behind software programs that later could be used to cause major disruption to the system. As recently as November 2018, US intelligence officials noted that Russian hackers were still actively probing US power grid targets for vulnerabilities. National and municipal utility companies around the globe are advised to be on high alert, both for direct attacks like those noted above, and for\"fallout\"effects and collateral damage that might occur against uninvolved nations, when two or more larger powers conceivably launch targeted cyberattacks against commonly used systems and equipment.\n## The Issue With Attribution in Cyberattacks From an intelligence point of view, the worst nightmare is not knowing who the enemy is while the attack is happening. While attribution, our ability to assign responsibility to an aggressor, in physical warfare has been relatively straightforward, cyberwarfare and cyber espionage are especially difficult to attribute in real-time due to the lack of physical evidence and the ability of attackers to alter digital forensic clues, although intelligence agencies are improving rapidly in this regard. The lack of physical evidence and the difficulty of not being able to “see” cyber weapons or attacks has been cited as one of the reasons there have not yet been well‐established international ethical norms in cyberwarfare. There is a real danger in intercepting and even modifying classified information from the other side of the world, not knowing who sent it or whether it is genuine.\nIn 1999, the US accidentally discovered someone trying to access the systems at the US Department of Energy, the Pentagon, NASA, private universities, as well as research labs. The US traced this attack back to Russia, but Russia denied this, and the sponsor is unknown. The so‐called “Titan Rain” attack in 2003 on Redstone Arsenal in Huntsville, Alabama, was most likely perpetrated by the Chinese. The main servers used in the attack were traced back to Guangdong, China, although there is some uncertainty as to whether the Chinese government or Chinese hacktivists were responsible. The servers were masked by proxy sites, “zombie computers,” which infected spyware and viruses into the computer systems. The base is used as the Centre for the US Army's missile and rocket programs.\nIn 2007, cyberwar became a reality for Estonia when distributed denial of service (DDoS) attacks disabled parliament, banks, newspapers, and broadcasters' computer networks. The Russians called the accusations against them unfounded and there was no evidence of their complicity. Later, the head of the Russian military forecasting center affirmed their ability to conduct a DoS attack (Hughes‐Wilson, 2016). This is yet another example that poses a problem for the broader IC by not knowing for sure the perpetrator of an attack while it is going on.\n## Cyber‐Physical Attacks on Critical Infrastructure The first major cyber‐physical attack on critical industrial infrastructure occurred in 2009 when a very sophisticated attack was launched on Iran's centrifuges that came from a memory‐ stick flash‐drive through a Microsoft Windows operating system to the Siemens Step7 software that controlled the centrifuges. This was a malicious computer worm called Stuxnet. No‐one at the time knew where it had come from originally or who the intended victims were meant to be. Siemens claimed industrial espionage had been perpetrated against their business, while Iran claimed that their nuclear program had been sabotaged. Which was it? A combination of the two? How do we decide to retaliate? Against whom? By what means? And to what extent?\nWhile both the US and Israel are alleged as the possible sources of this cyber‐physical weapon, neither has publicly acknowledged responsibility. Although, it is believed that at General Ashkenazi's retirement from the Israeli Defense Force farewell reception, he referenced Stuxnet as one of his numerous operational successes (Hughes‐Wilson, 2016). While most of the collateral damage caused by Stuxnet was reported to be minimal, it affected systems in Germany (where the Siemens controllers originated) and elsewhere in smaller nations that were not involved in the dispute between Iran and its adversary or adversaries.\nInternational Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 In 2014, the second known successful cyber-physical attack was revealed, this time apparently targeting a steel mill in Germany. The weaponized software disrupted a blast furnace control system so that the furnace could not be properly shut down, causing massive damage to the facility. The German steel mill attack would have been the third such attack, as it was preceded by an attack on a US dam a year earlier, but the dam attack did not succeed in causing confirmed physical damage.\nPreviously, in 2013, seven members of Iran's Islamic Revolutionary Guards Corps allegedly took control of a flood-control dam 25 miles north of New York City through a cellular network modem, but they were unable to release water only because the sluice gate had been manually disconnected for maintenance at the time of the attack. The FBI used its\"name and shame\"tactic in 2015 both to limit travel options for the seven individuals claimed to be involved, and to demonstrate that the US was getting better at attribution. Even so, it took over two years to bring the indictment. The eventual indictment noted that the attackers were also targeting banks, the New York Stock Exchange, and telecommunications giant AT&amp;T.\nSeveral smaller cyber-physical effects were achieved through ransomware similar to that used in the attack on the city of Atlanta, though. Ransomware is especially concerning for human physical and health security in the cases of hospitals, such as the Hollywood Presbyterian Medical Center ransomware attack in February 2016. While the hospital paid the $17,000 bitcoin ransom and recovered control of its computers, in the week and a half of the shutdown caused by the ransomware, several patients were sent to other area hospitals, although no cases of direct injury to patients were noted.\nIn addition to public health facilities themselves, individual medical devices, such as pacemakers and insulin pumps, have been found to have major vulnerabilities that could conceivably cause deaths from targeted cyber-physical attacks against these devices. While no patient deaths have been reported to date as a result of hacking, there have been recalls affecting as many as half a million devices in a single case, affecting both private medical device manufacturers and hundreds of thousands of patients.\nPerhaps the largest cyber-physical attacks, though, were the two separate attacks on Ukraine's power grid in December 2015 and December 2016, which shut down power to hundreds of thousands of customers in the cold of winter. Each attack lasted only a few hours, the length of time it took engineers to scramble to physical substations to engage manual override switches. But they demonstrated the power and precision of the alleged Russian military cyberwar machine, with the second attack fully automated and striking at precisely midnight on Saturday. The attacks contributed to the destabilization surrounding the annexation of Crimea and several clashes between Russian and Ukrainian forces in the Donetsk and Luhansk regions of Ukraine. This time, attribution was relatively swift, but the smaller Ukraine was not able to retaliate in kind against its much more cyber-capable adversary.\n\nVolume 9 • Issue 3 • July-September 2019 # Preparing for Cyberwarfare In 2010, Richard Clarke, the White House counterterrorism chief warned that if the country were in a cyber war at that time, “the United States would lose”. He stated that Russia, China, and North Korea had already recruited a myriad of hackers, while Iran claims to have the world’s largest cyber army. He warned that because we are so completely dependent on electronics, the West could be brought to its knees within fifteen minutes of a serious cyber-attack. Since then, cyber-attacks have become regular features of an undeclared war.\nThe Chinese People’s Liberation Army is known to be hacking into major US and European corporations going after intellectual property and targets include IT, electronics, software, defense, aerospace, biomedical and pharmaceutical breakthroughs, energy, finance, banks, and agriculture. In 2012, a major Russian IT security company called “Kaspersky” identified a cyber-attack called “Red October” that had been operating since 2007. The virus used Word and Excel to gather information from military installations, energy providers, government embassies, nuclear infrastructures, research firms, and other critical infrastructure operators.\nMI5 and the Director General of GCHQ have expressed concern about cyber-attacks and how that may cause significant damage to their reputations and revenue. US Cyber Command has to decide daily whether they are being confronted by criminal activity or breaches of national security. Into which category does commercial espionage and theft of intellectual property fall? In 2014, after Sony Pictures produced a low budget movie poking fun at North Korean leader Kim Jong-Un, Kim launched 6,000 hackers against Sony, which inflicted a cost on Sony of $100M. The FBI claimed to have conclusive evidence that it was the North Korean government behind it. President Obama called them out and retaliated with a controlled cyber strike against North Korea’s weak internet. Was this a case of cyber terrorism, cyberwar, or cybercrime? North Korea has denied their complicity and has demanded an apology.\nIt should be noted that not everyone is in agreement with the FBI’s conclusion that the attack was indeed perpetrated by North Korea. The detractors claim that the attack was too sophisticated and that it was more than likely an inside job. This is a great example of the difficulty a cyber-attack poses to the IC by not knowing for sure who the enemy is and yet a counter-offensive was launched. This cannot bode well as an example of possibly misidentifying the attacker and launching an attack on the wrong target. We are stuck with the underlying difficulty of identifying the real cyber-aggressor. We should keep in mind that weak retaliation emboldens others and the bad actor can maximize the threshold-level event to suit their aims and objectives. This could make cyberwarfare the ultimate asymmetric war and has changed the landscape of cyber conflict.\n# Cyber-Espionage and the Intelligence Community Legislation would have to be passed by Congress for there to be intelligence sharing between the IC and the private sector. The Snowden case warned about this. The International Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 US has much more to lose than any other nation because it has more research and development than any other world power. There is a definite cyber-threat to this type of intelligence sharing. Sixty percent of known cyber-attacks are against commercial targets.\"Cyber-attacks\"is the 21st century preferred form of international trade theft. The threat is growing exponentially and in 2015 it increased by more than 600% over a three-year period. Attempts to breach security in the energy, oil, and gas sectors increased to just under 400 percent. Questions that we are facing are how much security is enough? Should it be run internally or outsourced? How much should be spent? What tools and people are most effective?\nAs the Chinese state and its economy are intertwined, illicit intelligence gathering raises to the level of national security interests. The pressure of economic sanctions against Russia due to their actions in the Ukraine has resulted in an increase in cyber-attacks against the West. The cyber-attack growth from 2009 to 2015 increased from 3.9 million incidents to more than 50 million. We have observed that international agreements to limit such behavior are ineffective. Russia and China strongly deny accusations of intellectual property theft or cyber espionage. However, in light of NSA activities as revealed by the 2013 Edward Snowden saga that the US spied on Germany and Brazil, China and Russia have become emboldened to accuse the US of obvious hypocrisy.\nIt is no longer a secret that the US, Russia, China, Israel, and North Korea are engaged in a ruthless, secret and potentially dangerous cyber struggle. By 2016, the Pentagon's IT and cyber programs increased seven-fold in spending from $13.3 million in 2015 to $84 million in 2016. To further underscore the resolve of the US Government to do everything possible to mitigate the threat of cyber war, the CIA announced in 2015 their first new Directorate in fifty years, namely the Directorate for Digital Innovation. The problem we face is that no-one knows exactly what the real threat is and because of that there is a strong temptation to throw taxpayers' money at some ill-defined enemy. As an alternative to conventional warfare, cyberwar is a new, ill-defined form of warfare with intelligence at its cutting edge. As the threat of hybrid warfare is increasingly growing to replace conventional warfare, a cyber-attack has become the main disabling weapon.\nAnd especially in smaller nations, we must not only protect ourselves from direct cyber threats from both terrorist groups and other nation-states, but from the potential collateral damage resulting from larger powers' use of cyber weapons both in warfare and in so-called hybrid conflict short of war.\nThe era of cyber war has introduced weapons of mass disruption as opposed to conventional war's weapons of mass destruction. Weapons of mass disruption are often targeted, such as the\"Stuxnet\"example, specialized, ongoing, secret, and may range from the level of a crime and a nuisance like specialized ransomware to a complete shutdown of critical infrastructure in the case of cyber-physical attacks. On the other hand, weapons of mass destruction can cause huge casualties such as the case of Hiroshima and Nagasaki, are indiscriminate, transparent, fall clearly into the category of warfare, and are strategic.\n\n## THE FUTURE OF CYBERWARFARE\nWhat does the cyber weapon of the future look like? While no one can say with certainty, here are a few of the considerations that nations large and small should keep in mind to protect national and human security in this period of cyber proliferation and cyber escalation.\nFirst, we have already seen most of the individual weapons, as outlined in the sections above, from ransomware and trojan viruses to industrial attacks and disinformation. What will be different in an all‐out cyberwar is the massive aggregation of cyber weapons in a coordinated barrage of attacks . Ransomware attacks launched broadly against hospitals, public safety, banks, transportation and logistics firms, and local governments have already increased 235% from 2018 to 2019, while we are supposedly at peace (HIPAA Journal, 2019), and remote access trojan attacks are up 650% during the same period. Highly targeted attacks on industrial control systems, power and water distribution in major cities based on precursors like the Iranian and Russian power grid attacks and Stuxnet; information operations and disinformation campaigns aimed at social media and traditional news outlets; and massive denial of service attacks against stock markets and major telecommunications providers.\nHuman security concerns recognize the conditions that menace survival , such as attacks on power/water supply, medical systems, or other physical systems that could endanger public health . Physical, personal, and community security are affected by loss of trust in system, and violent or disruptive acts have a “negative impact on social cohesion,” irrespective of whether it is committed by state or non‐state actors .\nInformation operations and info warfare can achieve scale and speed never before possible, as Kopp predicted almost 20 years ago  — for example, did fake postings on Facebook impact the US election ? And imagine the impact of all that going on, while simultaneously experiencing traditional kinetic attacks against key military and political targets on the ground from artillery, missiles and good‐old‐fashioned bombs. We predict that future warfare is not just cyberwar but cyber plus war. It is not War 2.0 or 3.0, but War to the second or third power, exponentially more devastating than traditional or even nuclear weapons alone.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nSecond, social engineering and traditional human intelligence operations will continue to grow in importance in cyber warfare. Releasing targeted weapons over the Internet is complicated by considerations of collateral damage, as was the case in Stuxnet (Farwell &amp; Rohozinski, 2011) and several ransomware attacks, and it increases the risk of detection and neutralization by third parties . Human intelligence operatives will continue to be able to deliver portable USB drives and other physical electronic devices, combined with ever-evolving remote delivery systems like drones, as well as local social engineering attacks, to gain access to even air-gapped, non-networked systems like those in sensitive government, military, and public utility company operations . Cyber operators will not likely replace intelligence operatives, as some have envisioned; rather, they will rely even more heavily upon their human intel colleagues, both to bring sensitive information to the table, and to deliver targeted electronic payloads where signals, wires, and fiber optic cables may not reach.\nThird, cyber defense will evolve and morph almost as rapidly as the shifting cyber landscape. Vigilant cyber hygiene and aggressive patching and updating of systems are not enough. We must also expand and accelerate cyber operations training for professionals in the military, in government, and in corporations (De Borchgrave et al., 2001). Currently, there is a global skills gap of over 1 million unfilled cyber jobs growing to a shortfall of 3.5 million skilled cyber professionals by 2021 , and we cannot just throw money at cyber if there is no workforce to carry out the mission .\nWe must become orders of magnitude better both at cyber threat hunting and at sharing information on likely cyber-attacks and vulnerabilities between national agencies and private industry (De Borchgrave et al., 2001). The US has begun efforts toward this end, but it may be hindered by its size; this is an area that smaller nations could potentially do better than their traditionally more powerful peers . Smaller nations will continue to suffer collateral damage as major cyber powers and cybercriminals inflict damage on larger targets, and so these smaller countries must use their size and speed to their advantage to detect and defend against cyberattacks.\nFinally, cyber warfare will continue to be exacerbated, and to some extent obscured, by traditional cybercrime and espionage , which we can only characterize with the word \"more\". More denial of service attacks , more Internet of Things (IoT) device-related attacks, which increased by 600% and 217.5% in 2018 and 2019, respectively , more ransomware and crypto attacks (HIPAA Journal, 2019), more targeted attacks against specific infrastructure and devices , and more information warfare . Examining these trends, we can only predict more disruption, more annoyance, more danger to our economies, our borders and biosecurity, our food, energy and natural resources, our transportation and communication, and even our public health, physical and political security.\n\nVolume 9 • Issue 3 • July-September 2019 # CONCLUSION Cyber is deeply enmeshed and interwoven across both national and human security concerns. In the interests of more cyber threat awareness, we propose that tabletop exercises and cyber simulations for political leaders, armed forces, police, and critical infrastructure personnel down to the local government level be conducted regularly. Awareness training for civil and municipal government employees should be the norm and not the exception. Telecom companies and device manufacturers can assist in the prevention of malware, phishing, and network-borne attacks by being proactive in our combined efforts to mitigate those attacks and to share information with government agencies in a more concerted and immediate manner.\nMoreover, technology and cyber education in schools should become part of the core curriculum. The moment our fingers touch a keyboard or touchscreen, or the moment we use our voices to interact with the technology listening in our cars, homes or smartphones, irrespective of our educational discipline, we are exposed and vulnerable to a cyber-attack. Individual responsibility can mitigate national cybersecurity threats collectively, but we must make a collective effort to develop a new generation of cyber heroes, cyber guardians, and cyber professionals. An uneducated populace is a luxury developed nations can no longer afford. It is our sincerest hope that discussion and acknowledgment of the scope of future war, and that public, academic publications like this one can spark the kinds of national policy debates that can energize our collective will to prepare for the next generation of cyber warfare that is already at our doorstep, that we have already seen in part, but that has the potential to forever change our future and our children's future.\n\nVolume 9 • Issue 3 • July-September 2019",
  "citations": {
    "style": "author_year",
    "flat_text": "International Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 # The Impact of Cyber-Physical Warfare on Global Human Security Bryson R. Payne, University of North Georgia, Dahlonega, USA Edward L. Mienie, University of North Georgia, Dahlonega, USA # ABSTRACT Cyber is deeply enmeshed and interwoven across national security, as evidenced by its inclusion in the national security policies of a growing number of OECD countries. But it is the impact of cyber across the other components of national and human security that remains to be sufficiently addressed at the national policy level, or in international standards of behavior with respect to cyberwarfare and hybrid conflict. In addition to standing on its own as a national security concern, cybersecurity impacts economic and trade security, ecological/environmental and biosecurity, energy and critical infrastructure security, food security, transportation, and public health, as well as communications, physical and even political security. This work examines the role of threats from cyberwarfare, hybrid conflict, and cyber-physical attacks across human security from a national and global perspective, makes near-term predictions about the future of cyberwarfare, and provides recommendations with respect to preparing for cyberwarfare and ongoing hybrid conflict.\n# KEYWORDS Asymmetric Warfare, Attribution, Cyber Intelligence, Cyber-Physical Attacks, Cybersecurity, Cyberwarfare, Denial of Service, Hybrid Conflict # INTRODUCTION In 1947, the third industrial revolution began with the invention of the transistor, from which flowed massive technological changes that transformed societies and economies in the world. This resulted in governments, military and civilian organizations investing heavily in computer systems, making computers an essential part of large-scale operations during the 1950s and 1960s. By the 1980s, the proliferation of digital technology and computers spread into private homes and small offices via the personal DOI: 10.4018/IJCWT.2019070103 Copyright © 2019, IGI Global. Copying or distributing in print or electronic forms without written permission of IGI Global is prohibited.\nInternational Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 computer, or PC, eventually integrating with virtually all aspects of life in developed nations. The end of the 20th century saw industrial robots, graphics for video game entertainment, and automated teller cash machines in banks. By 1995 the world wide web became widely available, as it expanded across the globe.\nThe first decade of the 21st century saw the introduction of the smartphone, which quickly became commonplace with the proliferation of the wireless Internet and the smart electricity grid. By 2018 we had 3.3 billion smartphone users, and approximately 4.2 billion users accessed the Internet. The world has become interconnected using smartphones, tablets, and computer-based devices for both social networking and day-to-day business. It is worthwhile to note, however, that 85% of the infrastructure of the Internet is privately owned, primarily by telecommunications corporations and technology service providers, and therefore the majority of the Internet is not necessarily protected by municipal, state, or national governments.\nDuring these past two decades especially, as governments and defense manufacturers realized the potential for smart weapons, a new generation of technological military systems and missiles were developed, most of which rely upon wireless communications and the global positioning system (GPS) or similar navigational systems.\nBy 2015, cloud computing was ubiquitous, data could be uploaded in real time, and we saw tablet computers and smartphone use exceed personal computer use. The proliferation of the smart electrical grid, automated industrial and building controls, and the Internet of Things and smart Internet-connected devices in homes, offices, factories, and in automobiles has brought great efficiency and convenience, while simultaneously making us more vulnerable to cyberattacks in virtually every setting.\n# BACKGROUND In 1946, the US Army Ordinance Corps financed and developed the world's first true reprogrammable computer. Intelligence showed a keen interest, and in 1952, President Harry Truman established the National Security Agency who in turn became a major investor in and customer of computers. In 1985, NSA merged with the National Computer Security Center to house the world's single largest group of supercomputers (National Research Council, 1990).\nIn the 1960s, Cray Data Corporation first introduced supercomputers and could process 33 quadrillion floating-point operations per second. At a price tag of $500,000 apiece, this placed Cray in the hands of well-funded governments and a handful of very large corporations and banks. Today, NSA's latest facility at Fort Meade houses one of three High-Performance Computing Centers, each with their own 150-megawatt power substation providing 60 megawatts of electricity. Each center comes at a price tag of $3.2 Billion. The British NSA equivalent, GCHQ, has remained in step with the digital revolution, as have the other members of the UN Security Council. Similarly, digital intelligence is very high on the Chinese list of national priorities.\nInternational Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 With real-time digital intelligence now available, the Intelligence Community (IC) has accepted that it is here to stay. There is a school of thought that the traditional intelligence cycle approach (Tasking, Processing, Evaluation, and Dissemination) is too slow. Digital intelligence is revolutionizing the way intelligence does business. The IC now needs algorithms and applications to work on data and provide recommendations in order to keep pace with open-source media.\nIn 2009, the US Cyber Command was established to operate in the digital space and recruitment and retention of a technically qualified cyber force has become a challenge. There is talk of changing (not lowering) recruiting standards in an effort to recruit information security specialists as a matter of urgency. The creation of a separate cyber corps has become a struggle among military bureaucracies worldwide because of interagency competition.\nThe digital revolution has exposed new vulnerabilities of governments, and these have to be addressed by digital means, up to and including cyberwarfare. For the past century, the front lines of war have moved closer to modern households, as war is no longer something that happens on a far-away battlefield. The illusion of living in the safety of our own homes is slowly being eroded, as we increasingly become victims of cyber breaches, malware and ransomware infections, and denial of service attacks (DoS) that take down individual systems or complete networks. In addition to the issue previously mentioned with corporations, not governments, owning 85% of critical Internet infrastructure, research has shown that\"90 to 95 percent of US government traffic, including sensitive diplomatic and military orders, travels over privately-owned cables to reach officials in the field\".\n## The Progression from Cyberattacks to Cyber-Physical Attacks Cyberwar has become a threat to modern society. Robert Morris became the first person to be convicted under the US Computer Fraud and Abuse Act in 1988. His act became known as the\"Morris Worm,\"which used weaknesses in the UNIX system and spread in less than 24 hours to an estimated 10 percent of all computers then connected to the Internet. This worm slowed down computers to the point of an early denial-of-service, leaving systems largely unusable. Morris served no jail time but performed community service as part of his sentence. It is understood that today, Prof. Morris is working as a professor at MIT.\nIn 1994, a Russian called Vladimir Levin used a laptop in London to access the Citibank network. He accessed a list of customer passwords and codes and shared that with some of his associates. He used wire transfers to steal $3.7 million himself and set up accounts in Finland, the US, Netherlands, Germany, and Israel. His accomplices were eventually arrested, and they implicated Levin who was detained by the British police in 1995. Citibank recovered all but $400k of the eventual $10.7 million stolen.\nComputer hacking has become a genuine international threat and is becoming more widespread and dangerous. Classic security targets of sabotage, espionage, and to a lesser extent subversion are in the sights of hackers. Cyber-attacks are hard to International Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 pin on any adversary at the time of the attack, but intelligence agencies are becoming significantly more skilled at attribution, especially among highly skilled peer nations and known non-state groups. Remote access trojan attacks, a type of malware designed to give an attacker persistent remote control of a computer system, grew 650% year-over-year (HIPAA Journal, 2019). These attacks are especially concerning due to the ongoing, covert control an adversary can maintain over data and systems from anywhere in the world.\nIt used to be that the most damaging of cyber-attacks were Denial of Service or DoS attacks, but we are now seeing large-scale ransomware attacks, targeting banks, credit card companies and local government. Ransomware attacks, in which files or entire computer systems are locked via encryption and require payment of an illegal ransom to regain access, increased 235% from 2018 to 2019 (HIPAA Journal, 2019).\nThe city of Atlanta, the ninth largest US metropolitan city, was crippled by a ransomware attack in March 2018 that shut down city government functions including courts, police records, and municipal water payment systems. The ransomware physically damaged components in a number of computers rendering them unusable—several years' worth of video footage captured by the city's police cars was lost and unable to be recovered. Over $17 Million in direct costs were disclosed, in addition to the reputation damage, lost productivity, and other so-called soft costs. Notably, the ransomware was attributed to two specific Iranian civilians, who were named by the FBI and indicted in November 2018. Two cities in Florida were later hit with a different strain of ransomware in 2019, paying $530,000 and $600,000 in bitcoin to regain access to their systems.\nCyberattack targets of opportunity have expanded to include physical infrastructures such as power plants, water systems, fuel depots, communications, and transportation. Satellites are particularly vulnerable as this could compromise military systems such as control and command. In 2009, there were reports of Russian and Chinese attempts to infiltrate the US electrical grid. They left behind software programs that later could be used to cause major disruption to the system. As recently as November 2018, US intelligence officials noted that Russian hackers were still actively probing US power grid targets for vulnerabilities. National and municipal utility companies around the globe are advised to be on high alert, both for direct attacks like those noted above, and for\"fallout\"effects and collateral damage that might occur against uninvolved nations, when two or more larger powers conceivably launch targeted cyberattacks against commonly used systems and equipment.\n## The Issue With Attribution in Cyberattacks From an intelligence point of view, the worst nightmare is not knowing who the enemy is while the attack is happening. While attribution, our ability to assign responsibility to an aggressor, in physical warfare has been relatively straightforward, cyberwarfare and cyber espionage are especially difficult to attribute in real-time due to the lack of physical evidence and the ability of attackers to alter digital forensic clues, although intelligence agencies are improving rapidly in this regard. The lack of physical evidence and the difficulty of not being able to “see” cyber weapons or attacks has been cited as one of the reasons there have not yet been well‐established international ethical norms in cyberwarfare. There is a real danger in intercepting and even modifying classified information from the other side of the world, not knowing who sent it or whether it is genuine.\nIn 1999, the US accidentally discovered someone trying to access the systems at the US Department of Energy, the Pentagon, NASA, private universities, as well as research labs. The US traced this attack back to Russia, but Russia denied this, and the sponsor is unknown. The so‐called “Titan Rain” attack in 2003 on Redstone Arsenal in Huntsville, Alabama, was most likely perpetrated by the Chinese. The main servers used in the attack were traced back to Guangdong, China, although there is some uncertainty as to whether the Chinese government or Chinese hacktivists were responsible. The servers were masked by proxy sites, “zombie computers,” which infected spyware and viruses into the computer systems. The base is used as the Centre for the US Army's missile and rocket programs.\nIn 2007, cyberwar became a reality for Estonia when distributed denial of service (DDoS) attacks disabled parliament, banks, newspapers, and broadcasters' computer networks. The Russians called the accusations against them unfounded and there was no evidence of their complicity. Later, the head of the Russian military forecasting center affirmed their ability to conduct a DoS attack (Hughes‐Wilson, 2016). This is yet another example that poses a problem for the broader IC by not knowing for sure the perpetrator of an attack while it is going on.\n## Cyber‐Physical Attacks on Critical Infrastructure The first major cyber‐physical attack on critical industrial infrastructure occurred in 2009 when a very sophisticated attack was launched on Iran's centrifuges that came from a memory‐ stick flash‐drive through a Microsoft Windows operating system to the Siemens Step7 software that controlled the centrifuges. This was a malicious computer worm called Stuxnet. No‐one at the time knew where it had come from originally or who the intended victims were meant to be. Siemens claimed industrial espionage had been perpetrated against their business, while Iran claimed that their nuclear program had been sabotaged. Which was it? A combination of the two? How do we decide to retaliate? Against whom? By what means? And to what extent?\nWhile both the US and Israel are alleged as the possible sources of this cyber‐physical weapon, neither has publicly acknowledged responsibility. Although, it is believed that at General Ashkenazi's retirement from the Israeli Defense Force farewell reception, he referenced Stuxnet as one of his numerous operational successes (Hughes‐Wilson, 2016). While most of the collateral damage caused by Stuxnet was reported to be minimal, it affected systems in Germany (where the Siemens controllers originated) and elsewhere in smaller nations that were not involved in the dispute between Iran and its adversary or adversaries.\nInternational Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 In 2014, the second known successful cyber-physical attack was revealed, this time apparently targeting a steel mill in Germany. The weaponized software disrupted a blast furnace control system so that the furnace could not be properly shut down, causing massive damage to the facility. The German steel mill attack would have been the third such attack, as it was preceded by an attack on a US dam a year earlier, but the dam attack did not succeed in causing confirmed physical damage.\nPreviously, in 2013, seven members of Iran's Islamic Revolutionary Guards Corps allegedly took control of a flood-control dam 25 miles north of New York City through a cellular network modem, but they were unable to release water only because the sluice gate had been manually disconnected for maintenance at the time of the attack. The FBI used its\"name and shame\"tactic in 2015 both to limit travel options for the seven individuals claimed to be involved, and to demonstrate that the US was getting better at attribution. Even so, it took over two years to bring the indictment. The eventual indictment noted that the attackers were also targeting banks, the New York Stock Exchange, and telecommunications giant AT&amp;T.\nSeveral smaller cyber-physical effects were achieved through ransomware similar to that used in the attack on the city of Atlanta, though. Ransomware is especially concerning for human physical and health security in the cases of hospitals, such as the Hollywood Presbyterian Medical Center ransomware attack in February 2016. While the hospital paid the $17,000 bitcoin ransom and recovered control of its computers, in the week and a half of the shutdown caused by the ransomware, several patients were sent to other area hospitals, although no cases of direct injury to patients were noted.\nIn addition to public health facilities themselves, individual medical devices, such as pacemakers and insulin pumps, have been found to have major vulnerabilities that could conceivably cause deaths from targeted cyber-physical attacks against these devices. While no patient deaths have been reported to date as a result of hacking, there have been recalls affecting as many as half a million devices in a single case, affecting both private medical device manufacturers and hundreds of thousands of patients.\nPerhaps the largest cyber-physical attacks, though, were the two separate attacks on Ukraine's power grid in December 2015 and December 2016, which shut down power to hundreds of thousands of customers in the cold of winter. Each attack lasted only a few hours, the length of time it took engineers to scramble to physical substations to engage manual override switches. But they demonstrated the power and precision of the alleged Russian military cyberwar machine, with the second attack fully automated and striking at precisely midnight on Saturday. The attacks contributed to the destabilization surrounding the annexation of Crimea and several clashes between Russian and Ukrainian forces in the Donetsk and Luhansk regions of Ukraine. This time, attribution was relatively swift, but the smaller Ukraine was not able to retaliate in kind against its much more cyber-capable adversary.\n\nVolume 9 • Issue 3 • July-September 2019 # Preparing for Cyberwarfare In 2010, Richard Clarke, the White House counterterrorism chief warned that if the country were in a cyber war at that time, “the United States would lose”. He stated that Russia, China, and North Korea had already recruited a myriad of hackers, while Iran claims to have the world’s largest cyber army. He warned that because we are so completely dependent on electronics, the West could be brought to its knees within fifteen minutes of a serious cyber-attack. Since then, cyber-attacks have become regular features of an undeclared war.\nThe Chinese People’s Liberation Army is known to be hacking into major US and European corporations going after intellectual property and targets include IT, electronics, software, defense, aerospace, biomedical and pharmaceutical breakthroughs, energy, finance, banks, and agriculture. In 2012, a major Russian IT security company called “Kaspersky” identified a cyber-attack called “Red October” that had been operating since 2007. The virus used Word and Excel to gather information from military installations, energy providers, government embassies, nuclear infrastructures, research firms, and other critical infrastructure operators.\nMI5 and the Director General of GCHQ have expressed concern about cyber-attacks and how that may cause significant damage to their reputations and revenue. US Cyber Command has to decide daily whether they are being confronted by criminal activity or breaches of national security. Into which category does commercial espionage and theft of intellectual property fall? In 2014, after Sony Pictures produced a low budget movie poking fun at North Korean leader Kim Jong-Un, Kim launched 6,000 hackers against Sony, which inflicted a cost on Sony of $100M. The FBI claimed to have conclusive evidence that it was the North Korean government behind it. President Obama called them out and retaliated with a controlled cyber strike against North Korea’s weak internet. Was this a case of cyber terrorism, cyberwar, or cybercrime? North Korea has denied their complicity and has demanded an apology.\nIt should be noted that not everyone is in agreement with the FBI’s conclusion that the attack was indeed perpetrated by North Korea. The detractors claim that the attack was too sophisticated and that it was more than likely an inside job. This is a great example of the difficulty a cyber-attack poses to the IC by not knowing for sure who the enemy is and yet a counter-offensive was launched. This cannot bode well as an example of possibly misidentifying the attacker and launching an attack on the wrong target. We are stuck with the underlying difficulty of identifying the real cyber-aggressor. We should keep in mind that weak retaliation emboldens others and the bad actor can maximize the threshold-level event to suit their aims and objectives. This could make cyberwarfare the ultimate asymmetric war and has changed the landscape of cyber conflict.\n# Cyber-Espionage and the Intelligence Community Legislation would have to be passed by Congress for there to be intelligence sharing between the IC and the private sector. The Snowden case warned about this. The International Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 US has much more to lose than any other nation because it has more research and development than any other world power. There is a definite cyber-threat to this type of intelligence sharing. Sixty percent of known cyber-attacks are against commercial targets.\"Cyber-attacks\"is the 21st century preferred form of international trade theft. The threat is growing exponentially and in 2015 it increased by more than 600% over a three-year period. Attempts to breach security in the energy, oil, and gas sectors increased to just under 400 percent. Questions that we are facing are how much security is enough? Should it be run internally or outsourced? How much should be spent? What tools and people are most effective?\nAs the Chinese state and its economy are intertwined, illicit intelligence gathering raises to the level of national security interests. The pressure of economic sanctions against Russia due to their actions in the Ukraine has resulted in an increase in cyber-attacks against the West. The cyber-attack growth from 2009 to 2015 increased from 3.9 million incidents to more than 50 million. We have observed that international agreements to limit such behavior are ineffective. Russia and China strongly deny accusations of intellectual property theft or cyber espionage. However, in light of NSA activities as revealed by the 2013 Edward Snowden saga that the US spied on Germany and Brazil, China and Russia have become emboldened to accuse the US of obvious hypocrisy.\nIt is no longer a secret that the US, Russia, China, Israel, and North Korea are engaged in a ruthless, secret and potentially dangerous cyber struggle. By 2016, the Pentagon's IT and cyber programs increased seven-fold in spending from $13.3 million in 2015 to $84 million in 2016. To further underscore the resolve of the US Government to do everything possible to mitigate the threat of cyber war, the CIA announced in 2015 their first new Directorate in fifty years, namely the Directorate for Digital Innovation. The problem we face is that no-one knows exactly what the real threat is and because of that there is a strong temptation to throw taxpayers' money at some ill-defined enemy. As an alternative to conventional warfare, cyberwar is a new, ill-defined form of warfare with intelligence at its cutting edge. As the threat of hybrid warfare is increasingly growing to replace conventional warfare, a cyber-attack has become the main disabling weapon.\nAnd especially in smaller nations, we must not only protect ourselves from direct cyber threats from both terrorist groups and other nation-states, but from the potential collateral damage resulting from larger powers' use of cyber weapons both in warfare and in so-called hybrid conflict short of war.\nThe era of cyber war has introduced weapons of mass disruption as opposed to conventional war's weapons of mass destruction. Weapons of mass disruption are often targeted, such as the\"Stuxnet\"example, specialized, ongoing, secret, and may range from the level of a crime and a nuisance like specialized ransomware to a complete shutdown of critical infrastructure in the case of cyber-physical attacks. On the other hand, weapons of mass destruction can cause huge casualties such as the case of Hiroshima and Nagasaki, are indiscriminate, transparent, fall clearly into the category of warfare, and are strategic.\n\n## THE FUTURE OF CYBERWARFARE\nWhat does the cyber weapon of the future look like? While no one can say with certainty, here are a few of the considerations that nations large and small should keep in mind to protect national and human security in this period of cyber proliferation and cyber escalation.\nFirst, we have already seen most of the individual weapons, as outlined in the sections above, from ransomware and trojan viruses to industrial attacks and disinformation. What will be different in an all‐out cyberwar is the massive aggregation of cyber weapons in a coordinated barrage of attacks . Ransomware attacks launched broadly against hospitals, public safety, banks, transportation and logistics firms, and local governments have already increased 235% from 2018 to 2019, while we are supposedly at peace (HIPAA Journal, 2019), and remote access trojan attacks are up 650% during the same period. Highly targeted attacks on industrial control systems, power and water distribution in major cities based on precursors like the Iranian and Russian power grid attacks and Stuxnet; information operations and disinformation campaigns aimed at social media and traditional news outlets; and massive denial of service attacks against stock markets and major telecommunications providers.\nHuman security concerns recognize the conditions that menace survival , such as attacks on power/water supply, medical systems, or other physical systems that could endanger public health . Physical, personal, and community security are affected by loss of trust in system, and violent or disruptive acts have a “negative impact on social cohesion,” irrespective of whether it is committed by state or non‐state actors .\nInformation operations and info warfare can achieve scale and speed never before possible, as Kopp predicted almost 20 years ago  — for example, did fake postings on Facebook impact the US election ? And imagine the impact of all that going on, while simultaneously experiencing traditional kinetic attacks against key military and political targets on the ground from artillery, missiles and good‐old‐fashioned bombs. We predict that future warfare is not just cyberwar but cyber plus war. It is not War 2.0 or 3.0, but War to the second or third power, exponentially more devastating than traditional or even nuclear weapons alone.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nSecond, social engineering and traditional human intelligence operations will continue to grow in importance in cyber warfare. Releasing targeted weapons over the Internet is complicated by considerations of collateral damage, as was the case in Stuxnet (Farwell &amp; Rohozinski, 2011) and several ransomware attacks, and it increases the risk of detection and neutralization by third parties . Human intelligence operatives will continue to be able to deliver portable USB drives and other physical electronic devices, combined with ever-evolving remote delivery systems like drones, as well as local social engineering attacks, to gain access to even air-gapped, non-networked systems like those in sensitive government, military, and public utility company operations . Cyber operators will not likely replace intelligence operatives, as some have envisioned; rather, they will rely even more heavily upon their human intel colleagues, both to bring sensitive information to the table, and to deliver targeted electronic payloads where signals, wires, and fiber optic cables may not reach.\nThird, cyber defense will evolve and morph almost as rapidly as the shifting cyber landscape. Vigilant cyber hygiene and aggressive patching and updating of systems are not enough. We must also expand and accelerate cyber operations training for professionals in the military, in government, and in corporations (De Borchgrave et al., 2001). Currently, there is a global skills gap of over 1 million unfilled cyber jobs growing to a shortfall of 3.5 million skilled cyber professionals by 2021 , and we cannot just throw money at cyber if there is no workforce to carry out the mission .\nWe must become orders of magnitude better both at cyber threat hunting and at sharing information on likely cyber-attacks and vulnerabilities between national agencies and private industry (De Borchgrave et al., 2001). The US has begun efforts toward this end, but it may be hindered by its size; this is an area that smaller nations could potentially do better than their traditionally more powerful peers . Smaller nations will continue to suffer collateral damage as major cyber powers and cybercriminals inflict damage on larger targets, and so these smaller countries must use their size and speed to their advantage to detect and defend against cyberattacks.\nFinally, cyber warfare will continue to be exacerbated, and to some extent obscured, by traditional cybercrime and espionage , which we can only characterize with the word \"more\". More denial of service attacks , more Internet of Things (IoT) device-related attacks, which increased by 600% and 217.5% in 2018 and 2019, respectively , more ransomware and crypto attacks (HIPAA Journal, 2019), more targeted attacks against specific infrastructure and devices , and more information warfare . Examining these trends, we can only predict more disruption, more annoyance, more danger to our economies, our borders and biosecurity, our food, energy and natural resources, our transportation and communication, and even our public health, physical and political security.\n\nVolume 9 • Issue 3 • July-September 2019 # CONCLUSION Cyber is deeply enmeshed and interwoven across both national and human security concerns. In the interests of more cyber threat awareness, we propose that tabletop exercises and cyber simulations for political leaders, armed forces, police, and critical infrastructure personnel down to the local government level be conducted regularly. Awareness training for civil and municipal government employees should be the norm and not the exception. Telecom companies and device manufacturers can assist in the prevention of malware, phishing, and network-borne attacks by being proactive in our combined efforts to mitigate those attacks and to share information with government agencies in a more concerted and immediate manner.\nMoreover, technology and cyber education in schools should become part of the core curriculum. The moment our fingers touch a keyboard or touchscreen, or the moment we use our voices to interact with the technology listening in our cars, homes or smartphones, irrespective of our educational discipline, we are exposed and vulnerable to a cyber-attack. Individual responsibility can mitigate national cybersecurity threats collectively, but we must make a collective effort to develop a new generation of cyber heroes, cyber guardians, and cyber professionals. An uneducated populace is a luxury developed nations can no longer afford. It is our sincerest hope that discussion and acknowledgment of the scope of future war, and that public, academic publications like this one can spark the kinds of national policy debates that can energize our collective will to prepare for the next generation of cyber warfare that is already at our doorstep, that we have already seen in part, but that has the potential to forever change our future and our children's future.\n\nVolume 9 • Issue 3 • July-September 2019",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "International Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n# The Impact of Cyber-Physical Warfare on Global Human Security\nBryson R. Payne, University of North Georgia, Dahlonega, USA\nEdward L. Mienie, University of North Georgia, Dahlonega, USA\n# ABSTRACT\nCyber is deeply enmeshed and interwoven across national security, as evidenced by its inclusion in the national security policies of a growing number of OECD countries. But it is the impact of cyber across the other components of national and human security that remains to be sufficiently addressed at the national policy level, or in international standards of behavior with respect to cyberwarfare and hybrid conflict. In addition to standing on its own as a national security concern, cybersecurity impacts economic and trade security, ecological/environmental and biosecurity, energy and critical infrastructure security, food security, transportation, and public health, as well as communications, physical and even political security. This work examines the role of threats from cyberwarfare, hybrid conflict, and cyber-physical attacks across human security from a national and global perspective, makes near-term predictions about the future of cyberwarfare, and provides recommendations with respect to preparing for cyberwarfare and ongoing hybrid conflict.\n# KEYWORDS\nAsymmetric Warfare, Attribution, Cyber Intelligence, Cyber-Physical Attacks, Cybersecurity, Cyberwarfare, Denial of Service, Hybrid Conflict\n# INTRODUCTION\nIn 1947, the third industrial revolution began with the invention of the transistor, from which flowed massive technological changes that transformed societies and economies in the world. This resulted in governments, military and civilian organizations investing heavily in computer systems, making computers an essential part of large-scale operations during the 1950s and 1960s. By the 1980s, the proliferation of digital technology and computers spread into private homes and small offices via the personal\nDOI: 10.4018/IJCWT.2019070103\nCopyright © 2019, IGI Global. Copying or distributing in print or electronic forms without written permission of IGI Global is prohibited.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\ncomputer, or PC, eventually integrating with virtually all aspects of life in developed nations. The end of the 20th century saw industrial robots, graphics for video game entertainment, and automated teller cash machines in banks. By 1995 the world wide web became widely available, as it expanded across the globe (Hughes-Wilson, 2016).\nThe first decade of the 21st century saw the introduction of the smartphone, which quickly became commonplace with the proliferation of the wireless Internet and the smart electricity grid. By 2018 we had 3.3 billion smartphone users, and approximately 4.2 billion users accessed the Internet. The world has become interconnected using smartphones, tablets, and computer-based devices for both social networking and day-to-day business. It is worthwhile to note, however, that 85% of the infrastructure of the Internet is privately owned (GAO, 2009), primarily by telecommunications corporations and technology service providers, and therefore the majority of the Internet is not necessarily protected by municipal, state, or national governments.\nDuring these past two decades especially, as governments and defense manufacturers realized the potential for smart weapons, a new generation of technological military systems and missiles were developed (Hughes-Wilson, 2016), most of which rely upon wireless communications and the global positioning system (GPS) or similar navigational systems.\nBy 2015, cloud computing was ubiquitous, data could be uploaded in real time, and we saw tablet computers and smartphone use exceed personal computer use. The proliferation of the smart electrical grid, automated industrial and building controls, and the Internet of Things and smart Internet-connected devices in homes, offices, factories, and in automobiles has brought great efficiency and convenience, while simultaneously making us more vulnerable to cyberattacks in virtually every setting.\n# BACKGROUND\nIn 1946, the US Army Ordinance Corps financed and developed the world's first true reprogrammable computer. Intelligence showed a keen interest, and in 1952, President Harry Truman established the National Security Agency who in turn became a major investor in and customer of computers. In 1985, NSA merged with the National Computer Security Center to house the world's single largest group of supercomputers (National Research Council, 1990).\nIn the 1960s, Cray Data Corporation first introduced supercomputers and could process 33 quadrillion floating-point operations per second. At a price tag of $500,000 apiece, this placed Cray in the hands of well-funded governments and a handful of very large corporations and banks. Today, NSA's latest facility at Fort Meade houses one of three High-Performance Computing Centers, each with their own 150-megawatt power substation providing 60 megawatts of electricity. Each center comes at a price tag of $3.2 Billion. The British NSA equivalent, GCHQ, has remained in step with the digital revolution, as have the other members of the UN Security Council. Similarly, digital intelligence is very high on the Chinese list of national priorities.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nWith real-time digital intelligence now available, the Intelligence Community (IC) has accepted that it is here to stay. There is a school of thought that the traditional intelligence cycle approach (Tasking, Processing, Evaluation, and Dissemination) is too slow. Digital intelligence is revolutionizing the way intelligence does business. The IC now needs algorithms and applications to work on data and provide recommendations in order to keep pace with open-source media.\nIn 2009, the US Cyber Command was established to operate in the digital space and recruitment and retention of a technically qualified cyber force has become a challenge. There is talk of changing (not lowering) recruiting standards in an effort to recruit information security specialists as a matter of urgency. The creation of a separate cyber corps has become a struggle among military bureaucracies worldwide because of interagency competition (Hughes-Wilson, 2016).\nThe digital revolution has exposed new vulnerabilities of governments, and these have to be addressed by digital means, up to and including cyberwarfare. For the past century, the front lines of war have moved closer to modern households, as war is no longer something that happens on a far-away battlefield. The illusion of living in the safety of our own homes is slowly being eroded, as we increasingly become victims of cyber breaches, malware and ransomware infections, and denial of service attacks (DoS) that take down individual systems or complete networks. In addition to the issue previously mentioned with corporations, not governments, owning 85% of critical Internet infrastructure, research has shown that \"90 to 95 percent of US government traffic, including sensitive diplomatic and military orders, travels over privately-owned cables to reach officials in the field\" (Winseck, 2017).\n## The Progression from Cyberattacks to Cyber-Physical Attacks\nCyberwar has become a threat to modern society. Robert Morris became the first person to be convicted under the US Computer Fraud and Abuse Act in 1988. His act became known as the \"Morris Worm,\" which used weaknesses in the UNIX system and spread in less than 24 hours to an estimated 10 percent of all computers then connected to the Internet (FBI, 2018). This worm slowed down computers to the point of an early denial-of-service, leaving systems largely unusable. Morris served no jail time but performed community service as part of his sentence. It is understood that today, Prof. Morris is working as a professor at MIT (Dooley, 2018).\nIn 1994, a Russian called Vladimir Levin used a laptop in London to access the Citibank network. He accessed a list of customer passwords and codes and shared that with some of his associates. He used wire transfers to steal $3.7 million himself and set up accounts in Finland, the US, Netherlands, Germany, and Israel. His accomplices were eventually arrested, and they implicated Levin who was detained by the British police in 1995. Citibank recovered all but $400k of the eventual $10.7 million stolen (Goodman, 2015).\nComputer hacking has become a genuine international threat and is becoming more widespread and dangerous. Classic security targets of sabotage, espionage, and to a lesser extent subversion are in the sights of hackers. Cyber-attacks are hard to\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\npin on any adversary at the time of the attack, but intelligence agencies are becoming significantly more skilled at attribution, especially among highly skilled peer nations and known non-state groups. Remote access trojan attacks, a type of malware designed to give an attacker persistent remote control of a computer system, grew 650% year-over-year (HIPAA Journal, 2019). These attacks are especially concerning due to the ongoing, covert control an adversary can maintain over data and systems from anywhere in the world.\nIt used to be that the most damaging of cyber-attacks were Denial of Service or DoS attacks, but we are now seeing large-scale ransomware attacks, targeting banks, credit card companies and local government (Wirtz, 2019). Ransomware attacks, in which files or entire computer systems are locked via encryption and require payment of an illegal ransom to regain access, increased 235% from 2018 to 2019 (HIPAA Journal, 2019).\nThe city of Atlanta, the ninth largest US metropolitan city, was crippled by a ransomware attack in March 2018 that shut down city government functions including courts, police records, and municipal water payment systems. The ransomware physically damaged components in a number of computers rendering them unusable—several years' worth of video footage captured by the city's police cars was lost and unable to be recovered (Deere, 2018). Over $17 Million in direct costs were disclosed, in addition to the reputation damage, lost productivity, and other so-called soft costs (Spitzer, 2018). Notably, the ransomware was attributed to two specific Iranian civilians, who were named by the FBI and indicted in November 2018. Two cities in Florida were later hit with a different strain of ransomware in 2019, paying $530,000 and $600,000 in bitcoin to regain access to their systems (Stoel-Walker, 2019).\nCyberattack targets of opportunity have expanded to include physical infrastructures such as power plants, water systems, fuel depots, communications, and transportation. Satellites are particularly vulnerable as this could compromise military systems such as control and command. In 2009, there were reports of Russian and Chinese attempts to infiltrate the US electrical grid. They left behind software programs that later could be used to cause major disruption to the system (Gorman, 2009). As recently as November 2018, US intelligence officials noted that Russian hackers were still actively probing US power grid targets for vulnerabilities (Newman, 2018). National and municipal utility companies around the globe are advised to be on high alert, both for direct attacks like those noted above, and for \"fallout\" effects and collateral damage that might occur against uninvolved nations, when two or more larger powers conceivably launch targeted cyberattacks against commonly used systems and equipment.\n## The Issue With Attribution in Cyberattacks\nFrom an intelligence point of view, the worst nightmare is not knowing who the enemy is while the attack is happening. While attribution, our ability to assign responsibility to an aggressor, in physical warfare has been relatively straightforward, cyberwarfare and cyber espionage are especially difficult to attribute in real-time due to the lack of physical evidence and the ability of attackers to alter digital forensic clues, although\nintelligence agencies are improving rapidly in this regard (Rid & Buchanan, 2015). The lack of physical evidence and the difficulty of not being able to “see” cyber weapons or attacks has been cited as one of the reasons there have not yet been well‐established international ethical norms in cyberwarfare (Schmitt & Vihul, 2016). There is a real danger in intercepting and even modifying classified information from the other side of the world, not knowing who sent it or whether it is genuine.\nIn 1999, the US accidentally discovered someone trying to access the systems at the US Department of Energy, the Pentagon, NASA, private universities, as well as research labs (Rid, 2011). The US traced this attack back to Russia, but Russia denied this, and the sponsor is unknown. The so‐called “Titan Rain” attack in 2003 on Redstone Arsenal in Huntsville, Alabama, was most likely perpetrated by the Chinese. The main servers used in the attack were traced back to Guangdong, China, although there is some uncertainty as to whether the Chinese government or Chinese hacktivists were responsible. The servers were masked by proxy sites, “zombie computers,” which infected spyware and viruses into the computer systems (Clarke & Knake, 2010). The base is used as the Centre for the US Army's missile and rocket programs.\nIn 2007, cyberwar became a reality for Estonia when distributed denial of service (DDoS) attacks disabled parliament, banks, newspapers, and broadcasters' computer networks. The Russians called the accusations against them unfounded and there was no evidence of their complicity. Later, the head of the Russian military forecasting center affirmed their ability to conduct a DoS attack (Hughes‐Wilson, 2016). This is yet another example that poses a problem for the broader IC by not knowing for sure the perpetrator of an attack while it is going on.\n## Cyber‐Physical Attacks on Critical Infrastructure\nThe first major cyber‐physical attack on critical industrial infrastructure occurred in 2009 when a very sophisticated attack was launched on Iran's centrifuges that came from a memory‐ stick flash‐drive through a Microsoft Windows operating system to the Siemens Step7 software that controlled the centrifuges. This was a malicious computer worm called Stuxnet (Farwell & Rohozinski, 2011). No‐one at the time knew where it had come from originally or who the intended victims were meant to be. Siemens claimed industrial espionage had been perpetrated against their business, while Iran claimed that their nuclear program had been sabotaged. Which was it? A combination of the two? How do we decide to retaliate? Against whom? By what means? And to what extent?\nWhile both the US and Israel are alleged as the possible sources of this cyber‐physical weapon, neither has publicly acknowledged responsibility. Although, it is believed that at General Ashkenazi's retirement from the Israeli Defense Force farewell reception, he referenced Stuxnet as one of his numerous operational successes (Hughes‐Wilson, 2016). While most of the collateral damage caused by Stuxnet was reported to be minimal, it affected systems in Germany (where the Siemens controllers originated) and elsewhere in smaller nations that were not involved in the dispute between Iran and its adversary or adversaries.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nIn 2014, the second known successful cyber-physical attack was revealed, this time apparently targeting a steel mill in Germany (Zetter, 2015). The weaponized software disrupted a blast furnace control system so that the furnace could not be properly shut down, causing massive damage to the facility. The German steel mill attack would have been the third such attack, as it was preceded by an attack on a US dam a year earlier, but the dam attack did not succeed in causing confirmed physical damage.\nPreviously, in 2013, seven members of Iran's Islamic Revolutionary Guards Corps allegedly took control of a flood-control dam 25 miles north of New York City through a cellular network modem, but they were unable to release water only because the sluice gate had been manually disconnected for maintenance at the time of the attack (Thompson, 2016). The FBI used its \"name and shame\" tactic in 2015 both to limit travel options for the seven individuals claimed to be involved, and to demonstrate that the US was getting better at attribution. Even so, it took over two years to bring the indictment. The eventual indictment noted that the attackers were also targeting banks, the New York Stock Exchange, and telecommunications giant AT&amp;T.\nSeveral smaller cyber-physical effects were achieved through ransomware similar to that used in the attack on the city of Atlanta, though. Ransomware is especially concerning for human physical and health security in the cases of hospitals, such as the Hollywood Presbyterian Medical Center ransomware attack in February 2016 (Winton, 2016). While the hospital paid the $17,000 bitcoin ransom and recovered control of its computers, in the week and a half of the shutdown caused by the ransomware, several patients were sent to other area hospitals, although no cases of direct injury to patients were noted.\nIn addition to public health facilities themselves, individual medical devices, such as pacemakers and insulin pumps, have been found to have major vulnerabilities that could conceivably cause deaths from targeted cyber-physical attacks against these devices (Hern, 2018). While no patient deaths have been reported to date as a result of hacking, there have been recalls affecting as many as half a million devices in a single case (Hern, 2017), affecting both private medical device manufacturers and hundreds of thousands of patients.\nPerhaps the largest cyber-physical attacks, though, were the two separate attacks on Ukraine's power grid in December 2015 and December 2016, which shut down power to hundreds of thousands of customers in the cold of winter (Greenberg, 2017). Each attack lasted only a few hours, the length of time it took engineers to scramble to physical substations to engage manual override switches. But they demonstrated the power and precision of the alleged Russian military cyberwar machine, with the second attack fully automated and striking at precisely midnight on Saturday. The attacks contributed to the destabilization surrounding the annexation of Crimea and several clashes between Russian and Ukrainian forces in the Donetsk and Luhansk regions of Ukraine. This time, attribution was relatively swift, but the smaller Ukraine was not able to retaliate in kind against its much more cyber-capable adversary.\n41\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n# Preparing for Cyberwarfare\nIn 2010, Richard Clarke, the White House counterterrorism chief warned that if the country were in a cyber war at that time, “the United States would lose” (Kakutani, 2010, C1). He stated that Russia, China, and North Korea had already recruited a myriad of hackers, while Iran claims to have the world’s largest cyber army. He warned that because we are so completely dependent on electronics, the West could be brought to its knees within fifteen minutes of a serious cyber-attack (Spillius, 2010). Since then, cyber-attacks have become regular features of an undeclared war.\nThe Chinese People’s Liberation Army is known to be hacking into major US and European corporations going after intellectual property and targets include IT, electronics, software, defense, aerospace, biomedical and pharmaceutical breakthroughs, energy, finance, banks, and agriculture. In 2012, a major Russian IT security company called “Kaspersky” identified a cyber-attack called “Red October” that had been operating since 2007. The virus used Word and Excel to gather information from military installations, energy providers, government embassies, nuclear infrastructures, research firms, and other critical infrastructure operators (Herr, 2014).\nMI5 and the Director General of GCHQ have expressed concern about cyber-attacks and how that may cause significant damage to their reputations and revenue. US Cyber Command has to decide daily whether they are being confronted by criminal activity or breaches of national security. Into which category does commercial espionage and theft of intellectual property fall? In 2014, after Sony Pictures produced a low budget movie poking fun at North Korean leader Kim Jong-Un, Kim launched 6,000 hackers against Sony, which inflicted a cost on Sony of $100M (Hughes-Wilson, 2016). The FBI claimed to have conclusive evidence that it was the North Korean government behind it. President Obama called them out and retaliated with a controlled cyber strike against North Korea’s weak internet. Was this a case of cyber terrorism, cyberwar, or cybercrime? North Korea has denied their complicity and has demanded an apology.\nIt should be noted that not everyone is in agreement with the FBI’s conclusion that the attack was indeed perpetrated by North Korea (Hughes-Wilson, 2016). The detractors claim that the attack was too sophisticated and that it was more than likely an inside job. This is a great example of the difficulty a cyber-attack poses to the IC by not knowing for sure who the enemy is and yet a counter-offensive was launched. This cannot bode well as an example of possibly misidentifying the attacker and launching an attack on the wrong target. We are stuck with the underlying difficulty of identifying the real cyber-aggressor. We should keep in mind that weak retaliation emboldens others and the bad actor can maximize the threshold-level event to suit their aims and objectives (Hughes-Wilson, 2016). This could make cyberwarfare the ultimate asymmetric war and has changed the landscape of cyber conflict.\n# Cyber-Espionage and the Intelligence Community\nLegislation would have to be passed by Congress for there to be intelligence sharing between the IC and the private sector. The Snowden case warned about this. The\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nUS has much more to lose than any other nation because it has more research and development than any other world power. There is a definite cyber-threat to this type of intelligence sharing. Sixty percent of known cyber-attacks are against commercial targets (Hughes-Wilson, 2016). \"Cyber-attacks\" is the 21st century preferred form of international trade theft. The threat is growing exponentially and in 2015 it increased by more than 600% over a three-year period. Attempts to breach security in the energy, oil, and gas sectors increased to just under 400 percent. Questions that we are facing are how much security is enough? Should it be run internally or outsourced? How much should be spent? What tools and people are most effective?\nAs the Chinese state and its economy are intertwined, illicit intelligence gathering raises to the level of national security interests (Hughes-Wilson, 2016). The pressure of economic sanctions against Russia due to their actions in the Ukraine has resulted in an increase in cyber-attacks against the West. The cyber-attack growth from 2009 to 2015 increased from 3.9 million incidents to more than 50 million. We have observed that international agreements to limit such behavior are ineffective. Russia and China strongly deny accusations of intellectual property theft or cyber espionage. However, in light of NSA activities as revealed by the 2013 Edward Snowden saga that the US spied on Germany and Brazil, China and Russia have become emboldened to accuse the US of obvious hypocrisy.\nIt is no longer a secret that the US, Russia, China, Israel, and North Korea are engaged in a ruthless, secret and potentially dangerous cyber struggle. By 2016, the Pentagon's IT and cyber programs increased seven-fold in spending from $13.3 million in 2015 to $84 million in 2016 (Hughes-Wilson, 2016). To further underscore the resolve of the US Government to do everything possible to mitigate the threat of cyber war, the CIA announced in 2015 their first new Directorate in fifty years, namely the Directorate for Digital Innovation. The problem we face is that no-one knows exactly what the real threat is and because of that there is a strong temptation to throw taxpayers' money at some ill-defined enemy. As an alternative to conventional warfare, cyberwar is a new, ill-defined form of warfare with intelligence at its cutting edge. As the threat of hybrid warfare is increasingly growing to replace conventional warfare, a cyber-attack has become the main disabling weapon.\nAnd especially in smaller nations, we must not only protect ourselves from direct cyber threats from both terrorist groups and other nation-states, but from the potential collateral damage resulting from larger powers' use of cyber weapons both in warfare and in so-called hybrid conflict short of war.\nThe era of cyber war has introduced weapons of mass disruption as opposed to conventional war's weapons of mass destruction. Weapons of mass disruption are often targeted, such as the \"Stuxnet\" example, specialized, ongoing, secret, and may range from the level of a crime and a nuisance like specialized ransomware to a complete shutdown of critical infrastructure in the case of cyber-physical attacks. On the other hand, weapons of mass destruction can cause huge casualties such as the case of Hiroshima and Nagasaki, are indiscriminate, transparent, fall clearly into the category of warfare, and are strategic.\n43\nWe should also be mindful that there is no single accepted definition of “cyber” and analysts and states do not have the same frame of reference when using the term (Futter, 2018). Some people regard cyberwarfare as military actions through the Internet. For others, it involves information warfare (Futter, 2018). Not having a universal understanding of the term makes understanding and responding to different threats very complicated. Perhaps it is best to think of cyber as comprising a set of tools, and the question then is not which cyber technologies can do something specific, but rather how the new context changes the way we understand and interact with the world (Futter, 2018).\n## THE FUTURE OF CYBERWARFARE\nWhat does the cyber weapon of the future look like? While no one can say with certainty, here are a few of the considerations that nations large and small should keep in mind to protect national and human security in this period of cyber proliferation and cyber escalation.\nFirst, we have already seen most of the individual weapons, as outlined in the sections above, from ransomware and trojan viruses to industrial attacks and disinformation. What will be different in an all‐out cyberwar is the massive aggregation of cyber weapons in a coordinated barrage of attacks (Deng et al. 2017). Ransomware attacks launched broadly against hospitals, public safety, banks, transportation and logistics firms, and local governments have already increased 235% from 2018 to 2019, while we are supposedly at peace (HIPAA Journal, 2019), and remote access trojan attacks are up 650% during the same period. Highly targeted attacks on industrial control systems, power and water distribution in major cities based on precursors like the Iranian and Russian power grid attacks and Stuxnet; information operations and disinformation campaigns aimed at social media and traditional news outlets; and massive denial of service attacks against stock markets and major telecommunications providers.\nHuman security concerns recognize the conditions that menace survival (UNDP, 2008), such as attacks on power/water supply, medical systems, or other physical systems that could endanger public health (Barnett et al. 2013). Physical, personal, and community security are affected by loss of trust in system, and violent or disruptive acts have a “negative impact on social cohesion,” irrespective of whether it is committed by state or non‐state actors (Werthes et al. 2011).\nInformation operations and info warfare can achieve scale and speed never before possible, as Kopp predicted almost 20 years ago (Kopp, 2000) — for example, did fake postings on Facebook impact the US election (Allcott & Gentzkow, 2017)? And imagine the impact of all that going on, while simultaneously experiencing traditional kinetic attacks against key military and political targets on the ground from artillery, missiles and good‐old‐fashioned bombs. We predict that future warfare is not just cyberwar but cyber plus war. It is not War 2.0 or 3.0, but War to the second or third power, exponentially more devastating than traditional or even nuclear weapons alone.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nSecond, social engineering and traditional human intelligence operations will continue to grow in importance in cyber warfare. Releasing targeted weapons over the Internet is complicated by considerations of collateral damage, as was the case in Stuxnet (Farwell &amp; Rohozinski, 2011) and several ransomware attacks, and it increases the risk of detection and neutralization by third parties (Payne, 2018). Human intelligence operatives will continue to be able to deliver portable USB drives and other physical electronic devices, combined with ever-evolving remote delivery systems like drones, as well as local social engineering attacks, to gain access to even air-gapped, non-networked systems like those in sensitive government, military, and public utility company operations (Gioe, 2018). Cyber operators will not likely replace intelligence operatives, as some have envisioned; rather, they will rely even more heavily upon their human intel colleagues, both to bring sensitive information to the table, and to deliver targeted electronic payloads where signals, wires, and fiber optic cables may not reach.\nThird, cyber defense will evolve and morph almost as rapidly as the shifting cyber landscape. Vigilant cyber hygiene and aggressive patching and updating of systems are not enough. We must also expand and accelerate cyber operations training for professionals in the military, in government, and in corporations (De Borchgrave et al., 2001). Currently, there is a global skills gap of over 1 million unfilled cyber jobs growing to a shortfall of 3.5 million skilled cyber professionals by 2021 (Morgan, 2017), and we cannot just throw money at cyber if there is no workforce to carry out the mission (Vogel, 2016).\nWe must become orders of magnitude better both at cyber threat hunting and at sharing information on likely cyber-attacks and vulnerabilities between national agencies and private industry (De Borchgrave et al., 2001). The US has begun efforts toward this end, but it may be hindered by its size; this is an area that smaller nations could potentially do better than their traditionally more powerful peers (Mienie, 2019). Smaller nations will continue to suffer collateral damage as major cyber powers and cybercriminals inflict damage on larger targets, and so these smaller countries must use their size and speed to their advantage to detect and defend against cyberattacks.\nFinally, cyber warfare will continue to be exacerbated, and to some extent obscured, by traditional cybercrime and espionage (Payne, 2018), which we can only characterize with the word \"more\". More denial of service attacks (Rayome, 2019), more Internet of Things (IoT) device-related attacks, which increased by 600% and 217.5% in 2018 and 2019, respectively (Rayome, 2018; Gatlan, 2019), more ransomware and crypto attacks (HIPAA Journal, 2019), more targeted attacks against specific infrastructure and devices (McMillen, 2016), and more information warfare (Pomerleau, 2019). Examining these trends, we can only predict more disruption, more annoyance, more danger to our economies, our borders and biosecurity, our food, energy and natural resources, our transportation and communication, and even our public health, physical and political security.\n45\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n# CONCLUSION\nCyber is deeply enmeshed and interwoven across both national and human security concerns. In the interests of more cyber threat awareness, we propose that tabletop exercises and cyber simulations for political leaders, armed forces, police, and critical infrastructure personnel down to the local government level be conducted regularly. Awareness training for civil and municipal government employees should be the norm and not the exception. Telecom companies and device manufacturers can assist in the prevention of malware, phishing, and network-borne attacks by being proactive in our combined efforts to mitigate those attacks and to share information with government agencies in a more concerted and immediate manner.\nMoreover, technology and cyber education in schools should become part of the core curriculum. The moment our fingers touch a keyboard or touchscreen, or the moment we use our voices to interact with the technology listening in our cars, homes or smartphones, irrespective of our educational discipline, we are exposed and vulnerable to a cyber-attack. Individual responsibility can mitigate national cybersecurity threats collectively, but we must make a collective effort to develop a new generation of cyber heroes, cyber guardians, and cyber professionals. An uneducated populace is a luxury developed nations can no longer afford. It is our sincerest hope that discussion and acknowledgment of the scope of future war, and that public, academic publications like this one can spark the kinds of national policy debates that can energize our collective will to prepare for the next generation of cyber warfare that is already at our doorstep, that we have already seen in part, but that has the potential to forever change our future and our children's future.\n46\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019"
    },
    "numeric": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "International Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n# The Impact of Cyber-Physical Warfare on Global Human Security\nBryson R. Payne, University of North Georgia, Dahlonega, USA\nEdward L. Mienie, University of North Georgia, Dahlonega, USA\n# ABSTRACT\nCyber is deeply enmeshed and interwoven across national security, as evidenced by its inclusion in the national security policies of a growing number of OECD countries. But it is the impact of cyber across the other components of national and human security that remains to be sufficiently addressed at the national policy level, or in international standards of behavior with respect to cyberwarfare and hybrid conflict. In addition to standing on its own as a national security concern, cybersecurity impacts economic and trade security, ecological/environmental and biosecurity, energy and critical infrastructure security, food security, transportation, and public health, as well as communications, physical and even political security. This work examines the role of threats from cyberwarfare, hybrid conflict, and cyber-physical attacks across human security from a national and global perspective, makes near-term predictions about the future of cyberwarfare, and provides recommendations with respect to preparing for cyberwarfare and ongoing hybrid conflict.\n# KEYWORDS\nAsymmetric Warfare, Attribution, Cyber Intelligence, Cyber-Physical Attacks, Cybersecurity, Cyberwarfare, Denial of Service, Hybrid Conflict\n# INTRODUCTION\nIn 1947, the third industrial revolution began with the invention of the transistor, from which flowed massive technological changes that transformed societies and economies in the world. This resulted in governments, military and civilian organizations investing heavily in computer systems, making computers an essential part of large-scale operations during the 1950s and 1960s. By the 1980s, the proliferation of digital technology and computers spread into private homes and small offices via the personal\nDOI: 10.4018/IJCWT.2019070103\nCopyright © 2019, IGI Global. Copying or distributing in print or electronic forms without written permission of IGI Global is prohibited.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\ncomputer, or PC, eventually integrating with virtually all aspects of life in developed nations. The end of the 20th century saw industrial robots, graphics for video game entertainment, and automated teller cash machines in banks. By 1995 the world wide web became widely available, as it expanded across the globe (Hughes-Wilson, 2016).\nThe first decade of the 21st century saw the introduction of the smartphone, which quickly became commonplace with the proliferation of the wireless Internet and the smart electricity grid. By 2018 we had 3.3 billion smartphone users, and approximately 4.2 billion users accessed the Internet. The world has become interconnected using smartphones, tablets, and computer-based devices for both social networking and day-to-day business. It is worthwhile to note, however, that 85% of the infrastructure of the Internet is privately owned (GAO, 2009), primarily by telecommunications corporations and technology service providers, and therefore the majority of the Internet is not necessarily protected by municipal, state, or national governments.\nDuring these past two decades especially, as governments and defense manufacturers realized the potential for smart weapons, a new generation of technological military systems and missiles were developed (Hughes-Wilson, 2016), most of which rely upon wireless communications and the global positioning system (GPS) or similar navigational systems.\nBy 2015, cloud computing was ubiquitous, data could be uploaded in real time, and we saw tablet computers and smartphone use exceed personal computer use. The proliferation of the smart electrical grid, automated industrial and building controls, and the Internet of Things and smart Internet-connected devices in homes, offices, factories, and in automobiles has brought great efficiency and convenience, while simultaneously making us more vulnerable to cyberattacks in virtually every setting.\n# BACKGROUND\nIn 1946, the US Army Ordinance Corps financed and developed the world's first true reprogrammable computer. Intelligence showed a keen interest, and in 1952, President Harry Truman established the National Security Agency who in turn became a major investor in and customer of computers. In 1985, NSA merged with the National Computer Security Center to house the world's single largest group of supercomputers (National Research Council, 1990).\nIn the 1960s, Cray Data Corporation first introduced supercomputers and could process 33 quadrillion floating-point operations per second. At a price tag of $500,000 apiece, this placed Cray in the hands of well-funded governments and a handful of very large corporations and banks. Today, NSA's latest facility at Fort Meade houses one of three High-Performance Computing Centers, each with their own 150-megawatt power substation providing 60 megawatts of electricity. Each center comes at a price tag of $3.2 Billion. The British NSA equivalent, GCHQ, has remained in step with the digital revolution, as have the other members of the UN Security Council. Similarly, digital intelligence is very high on the Chinese list of national priorities.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nWith real-time digital intelligence now available, the Intelligence Community (IC) has accepted that it is here to stay. There is a school of thought that the traditional intelligence cycle approach (Tasking, Processing, Evaluation, and Dissemination) is too slow. Digital intelligence is revolutionizing the way intelligence does business. The IC now needs algorithms and applications to work on data and provide recommendations in order to keep pace with open-source media.\nIn 2009, the US Cyber Command was established to operate in the digital space and recruitment and retention of a technically qualified cyber force has become a challenge. There is talk of changing (not lowering) recruiting standards in an effort to recruit information security specialists as a matter of urgency. The creation of a separate cyber corps has become a struggle among military bureaucracies worldwide because of interagency competition (Hughes-Wilson, 2016).\nThe digital revolution has exposed new vulnerabilities of governments, and these have to be addressed by digital means, up to and including cyberwarfare. For the past century, the front lines of war have moved closer to modern households, as war is no longer something that happens on a far-away battlefield. The illusion of living in the safety of our own homes is slowly being eroded, as we increasingly become victims of cyber breaches, malware and ransomware infections, and denial of service attacks (DoS) that take down individual systems or complete networks. In addition to the issue previously mentioned with corporations, not governments, owning 85% of critical Internet infrastructure, research has shown that \"90 to 95 percent of US government traffic, including sensitive diplomatic and military orders, travels over privately-owned cables to reach officials in the field\" (Winseck, 2017).\n## The Progression from Cyberattacks to Cyber-Physical Attacks\nCyberwar has become a threat to modern society. Robert Morris became the first person to be convicted under the US Computer Fraud and Abuse Act in 1988. His act became known as the \"Morris Worm,\" which used weaknesses in the UNIX system and spread in less than 24 hours to an estimated 10 percent of all computers then connected to the Internet (FBI, 2018). This worm slowed down computers to the point of an early denial-of-service, leaving systems largely unusable. Morris served no jail time but performed community service as part of his sentence. It is understood that today, Prof. Morris is working as a professor at MIT (Dooley, 2018).\nIn 1994, a Russian called Vladimir Levin used a laptop in London to access the Citibank network. He accessed a list of customer passwords and codes and shared that with some of his associates. He used wire transfers to steal $3.7 million himself and set up accounts in Finland, the US, Netherlands, Germany, and Israel. His accomplices were eventually arrested, and they implicated Levin who was detained by the British police in 1995. Citibank recovered all but $400k of the eventual $10.7 million stolen (Goodman, 2015).\nComputer hacking has become a genuine international threat and is becoming more widespread and dangerous. Classic security targets of sabotage, espionage, and to a lesser extent subversion are in the sights of hackers. Cyber-attacks are hard to\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\npin on any adversary at the time of the attack, but intelligence agencies are becoming significantly more skilled at attribution, especially among highly skilled peer nations and known non-state groups. Remote access trojan attacks, a type of malware designed to give an attacker persistent remote control of a computer system, grew 650% year-over-year (HIPAA Journal, 2019). These attacks are especially concerning due to the ongoing, covert control an adversary can maintain over data and systems from anywhere in the world.\nIt used to be that the most damaging of cyber-attacks were Denial of Service or DoS attacks, but we are now seeing large-scale ransomware attacks, targeting banks, credit card companies and local government (Wirtz, 2019). Ransomware attacks, in which files or entire computer systems are locked via encryption and require payment of an illegal ransom to regain access, increased 235% from 2018 to 2019 (HIPAA Journal, 2019).\nThe city of Atlanta, the ninth largest US metropolitan city, was crippled by a ransomware attack in March 2018 that shut down city government functions including courts, police records, and municipal water payment systems. The ransomware physically damaged components in a number of computers rendering them unusable—several years' worth of video footage captured by the city's police cars was lost and unable to be recovered (Deere, 2018). Over $17 Million in direct costs were disclosed, in addition to the reputation damage, lost productivity, and other so-called soft costs (Spitzer, 2018). Notably, the ransomware was attributed to two specific Iranian civilians, who were named by the FBI and indicted in November 2018. Two cities in Florida were later hit with a different strain of ransomware in 2019, paying $530,000 and $600,000 in bitcoin to regain access to their systems (Stoel-Walker, 2019).\nCyberattack targets of opportunity have expanded to include physical infrastructures such as power plants, water systems, fuel depots, communications, and transportation. Satellites are particularly vulnerable as this could compromise military systems such as control and command. In 2009, there were reports of Russian and Chinese attempts to infiltrate the US electrical grid. They left behind software programs that later could be used to cause major disruption to the system (Gorman, 2009). As recently as November 2018, US intelligence officials noted that Russian hackers were still actively probing US power grid targets for vulnerabilities (Newman, 2018). National and municipal utility companies around the globe are advised to be on high alert, both for direct attacks like those noted above, and for \"fallout\" effects and collateral damage that might occur against uninvolved nations, when two or more larger powers conceivably launch targeted cyberattacks against commonly used systems and equipment.\n## The Issue With Attribution in Cyberattacks\nFrom an intelligence point of view, the worst nightmare is not knowing who the enemy is while the attack is happening. While attribution, our ability to assign responsibility to an aggressor, in physical warfare has been relatively straightforward, cyberwarfare and cyber espionage are especially difficult to attribute in real-time due to the lack of physical evidence and the ability of attackers to alter digital forensic clues, although\nintelligence agencies are improving rapidly in this regard (Rid & Buchanan, 2015). The lack of physical evidence and the difficulty of not being able to “see” cyber weapons or attacks has been cited as one of the reasons there have not yet been well‐established international ethical norms in cyberwarfare (Schmitt & Vihul, 2016). There is a real danger in intercepting and even modifying classified information from the other side of the world, not knowing who sent it or whether it is genuine.\nIn 1999, the US accidentally discovered someone trying to access the systems at the US Department of Energy, the Pentagon, NASA, private universities, as well as research labs (Rid, 2011). The US traced this attack back to Russia, but Russia denied this, and the sponsor is unknown. The so‐called “Titan Rain” attack in 2003 on Redstone Arsenal in Huntsville, Alabama, was most likely perpetrated by the Chinese. The main servers used in the attack were traced back to Guangdong, China, although there is some uncertainty as to whether the Chinese government or Chinese hacktivists were responsible. The servers were masked by proxy sites, “zombie computers,” which infected spyware and viruses into the computer systems (Clarke & Knake, 2010). The base is used as the Centre for the US Army's missile and rocket programs.\nIn 2007, cyberwar became a reality for Estonia when distributed denial of service (DDoS) attacks disabled parliament, banks, newspapers, and broadcasters' computer networks. The Russians called the accusations against them unfounded and there was no evidence of their complicity. Later, the head of the Russian military forecasting center affirmed their ability to conduct a DoS attack (Hughes‐Wilson, 2016). This is yet another example that poses a problem for the broader IC by not knowing for sure the perpetrator of an attack while it is going on.\n## Cyber‐Physical Attacks on Critical Infrastructure\nThe first major cyber‐physical attack on critical industrial infrastructure occurred in 2009 when a very sophisticated attack was launched on Iran's centrifuges that came from a memory‐ stick flash‐drive through a Microsoft Windows operating system to the Siemens Step7 software that controlled the centrifuges. This was a malicious computer worm called Stuxnet (Farwell & Rohozinski, 2011). No‐one at the time knew where it had come from originally or who the intended victims were meant to be. Siemens claimed industrial espionage had been perpetrated against their business, while Iran claimed that their nuclear program had been sabotaged. Which was it? A combination of the two? How do we decide to retaliate? Against whom? By what means? And to what extent?\nWhile both the US and Israel are alleged as the possible sources of this cyber‐physical weapon, neither has publicly acknowledged responsibility. Although, it is believed that at General Ashkenazi's retirement from the Israeli Defense Force farewell reception, he referenced Stuxnet as one of his numerous operational successes (Hughes‐Wilson, 2016). While most of the collateral damage caused by Stuxnet was reported to be minimal, it affected systems in Germany (where the Siemens controllers originated) and elsewhere in smaller nations that were not involved in the dispute between Iran and its adversary or adversaries.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nIn 2014, the second known successful cyber-physical attack was revealed, this time apparently targeting a steel mill in Germany (Zetter, 2015). The weaponized software disrupted a blast furnace control system so that the furnace could not be properly shut down, causing massive damage to the facility. The German steel mill attack would have been the third such attack, as it was preceded by an attack on a US dam a year earlier, but the dam attack did not succeed in causing confirmed physical damage.\nPreviously, in 2013, seven members of Iran's Islamic Revolutionary Guards Corps allegedly took control of a flood-control dam 25 miles north of New York City through a cellular network modem, but they were unable to release water only because the sluice gate had been manually disconnected for maintenance at the time of the attack (Thompson, 2016). The FBI used its \"name and shame\" tactic in 2015 both to limit travel options for the seven individuals claimed to be involved, and to demonstrate that the US was getting better at attribution. Even so, it took over two years to bring the indictment. The eventual indictment noted that the attackers were also targeting banks, the New York Stock Exchange, and telecommunications giant AT&amp;T.\nSeveral smaller cyber-physical effects were achieved through ransomware similar to that used in the attack on the city of Atlanta, though. Ransomware is especially concerning for human physical and health security in the cases of hospitals, such as the Hollywood Presbyterian Medical Center ransomware attack in February 2016 (Winton, 2016). While the hospital paid the $17,000 bitcoin ransom and recovered control of its computers, in the week and a half of the shutdown caused by the ransomware, several patients were sent to other area hospitals, although no cases of direct injury to patients were noted.\nIn addition to public health facilities themselves, individual medical devices, such as pacemakers and insulin pumps, have been found to have major vulnerabilities that could conceivably cause deaths from targeted cyber-physical attacks against these devices (Hern, 2018). While no patient deaths have been reported to date as a result of hacking, there have been recalls affecting as many as half a million devices in a single case (Hern, 2017), affecting both private medical device manufacturers and hundreds of thousands of patients.\nPerhaps the largest cyber-physical attacks, though, were the two separate attacks on Ukraine's power grid in December 2015 and December 2016, which shut down power to hundreds of thousands of customers in the cold of winter (Greenberg, 2017). Each attack lasted only a few hours, the length of time it took engineers to scramble to physical substations to engage manual override switches. But they demonstrated the power and precision of the alleged Russian military cyberwar machine, with the second attack fully automated and striking at precisely midnight on Saturday. The attacks contributed to the destabilization surrounding the annexation of Crimea and several clashes between Russian and Ukrainian forces in the Donetsk and Luhansk regions of Ukraine. This time, attribution was relatively swift, but the smaller Ukraine was not able to retaliate in kind against its much more cyber-capable adversary.\n41\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n# Preparing for Cyberwarfare\nIn 2010, Richard Clarke, the White House counterterrorism chief warned that if the country were in a cyber war at that time, “the United States would lose” (Kakutani, 2010, C1). He stated that Russia, China, and North Korea had already recruited a myriad of hackers, while Iran claims to have the world’s largest cyber army. He warned that because we are so completely dependent on electronics, the West could be brought to its knees within fifteen minutes of a serious cyber-attack (Spillius, 2010). Since then, cyber-attacks have become regular features of an undeclared war.\nThe Chinese People’s Liberation Army is known to be hacking into major US and European corporations going after intellectual property and targets include IT, electronics, software, defense, aerospace, biomedical and pharmaceutical breakthroughs, energy, finance, banks, and agriculture. In 2012, a major Russian IT security company called “Kaspersky” identified a cyber-attack called “Red October” that had been operating since 2007. The virus used Word and Excel to gather information from military installations, energy providers, government embassies, nuclear infrastructures, research firms, and other critical infrastructure operators (Herr, 2014).\nMI5 and the Director General of GCHQ have expressed concern about cyber-attacks and how that may cause significant damage to their reputations and revenue. US Cyber Command has to decide daily whether they are being confronted by criminal activity or breaches of national security. Into which category does commercial espionage and theft of intellectual property fall? In 2014, after Sony Pictures produced a low budget movie poking fun at North Korean leader Kim Jong-Un, Kim launched 6,000 hackers against Sony, which inflicted a cost on Sony of $100M (Hughes-Wilson, 2016). The FBI claimed to have conclusive evidence that it was the North Korean government behind it. President Obama called them out and retaliated with a controlled cyber strike against North Korea’s weak internet. Was this a case of cyber terrorism, cyberwar, or cybercrime? North Korea has denied their complicity and has demanded an apology.\nIt should be noted that not everyone is in agreement with the FBI’s conclusion that the attack was indeed perpetrated by North Korea (Hughes-Wilson, 2016). The detractors claim that the attack was too sophisticated and that it was more than likely an inside job. This is a great example of the difficulty a cyber-attack poses to the IC by not knowing for sure who the enemy is and yet a counter-offensive was launched. This cannot bode well as an example of possibly misidentifying the attacker and launching an attack on the wrong target. We are stuck with the underlying difficulty of identifying the real cyber-aggressor. We should keep in mind that weak retaliation emboldens others and the bad actor can maximize the threshold-level event to suit their aims and objectives (Hughes-Wilson, 2016). This could make cyberwarfare the ultimate asymmetric war and has changed the landscape of cyber conflict.\n# Cyber-Espionage and the Intelligence Community\nLegislation would have to be passed by Congress for there to be intelligence sharing between the IC and the private sector. The Snowden case warned about this. The\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nUS has much more to lose than any other nation because it has more research and development than any other world power. There is a definite cyber-threat to this type of intelligence sharing. Sixty percent of known cyber-attacks are against commercial targets (Hughes-Wilson, 2016). \"Cyber-attacks\" is the 21st century preferred form of international trade theft. The threat is growing exponentially and in 2015 it increased by more than 600% over a three-year period. Attempts to breach security in the energy, oil, and gas sectors increased to just under 400 percent. Questions that we are facing are how much security is enough? Should it be run internally or outsourced? How much should be spent? What tools and people are most effective?\nAs the Chinese state and its economy are intertwined, illicit intelligence gathering raises to the level of national security interests (Hughes-Wilson, 2016). The pressure of economic sanctions against Russia due to their actions in the Ukraine has resulted in an increase in cyber-attacks against the West. The cyber-attack growth from 2009 to 2015 increased from 3.9 million incidents to more than 50 million. We have observed that international agreements to limit such behavior are ineffective. Russia and China strongly deny accusations of intellectual property theft or cyber espionage. However, in light of NSA activities as revealed by the 2013 Edward Snowden saga that the US spied on Germany and Brazil, China and Russia have become emboldened to accuse the US of obvious hypocrisy.\nIt is no longer a secret that the US, Russia, China, Israel, and North Korea are engaged in a ruthless, secret and potentially dangerous cyber struggle. By 2016, the Pentagon's IT and cyber programs increased seven-fold in spending from $13.3 million in 2015 to $84 million in 2016 (Hughes-Wilson, 2016). To further underscore the resolve of the US Government to do everything possible to mitigate the threat of cyber war, the CIA announced in 2015 their first new Directorate in fifty years, namely the Directorate for Digital Innovation. The problem we face is that no-one knows exactly what the real threat is and because of that there is a strong temptation to throw taxpayers' money at some ill-defined enemy. As an alternative to conventional warfare, cyberwar is a new, ill-defined form of warfare with intelligence at its cutting edge. As the threat of hybrid warfare is increasingly growing to replace conventional warfare, a cyber-attack has become the main disabling weapon.\nAnd especially in smaller nations, we must not only protect ourselves from direct cyber threats from both terrorist groups and other nation-states, but from the potential collateral damage resulting from larger powers' use of cyber weapons both in warfare and in so-called hybrid conflict short of war.\nThe era of cyber war has introduced weapons of mass disruption as opposed to conventional war's weapons of mass destruction. Weapons of mass disruption are often targeted, such as the \"Stuxnet\" example, specialized, ongoing, secret, and may range from the level of a crime and a nuisance like specialized ransomware to a complete shutdown of critical infrastructure in the case of cyber-physical attacks. On the other hand, weapons of mass destruction can cause huge casualties such as the case of Hiroshima and Nagasaki, are indiscriminate, transparent, fall clearly into the category of warfare, and are strategic.\n43\nWe should also be mindful that there is no single accepted definition of “cyber” and analysts and states do not have the same frame of reference when using the term (Futter, 2018). Some people regard cyberwarfare as military actions through the Internet. For others, it involves information warfare (Futter, 2018). Not having a universal understanding of the term makes understanding and responding to different threats very complicated. Perhaps it is best to think of cyber as comprising a set of tools, and the question then is not which cyber technologies can do something specific, but rather how the new context changes the way we understand and interact with the world (Futter, 2018).\n## THE FUTURE OF CYBERWARFARE\nWhat does the cyber weapon of the future look like? While no one can say with certainty, here are a few of the considerations that nations large and small should keep in mind to protect national and human security in this period of cyber proliferation and cyber escalation.\nFirst, we have already seen most of the individual weapons, as outlined in the sections above, from ransomware and trojan viruses to industrial attacks and disinformation. What will be different in an all‐out cyberwar is the massive aggregation of cyber weapons in a coordinated barrage of attacks (Deng et al. 2017). Ransomware attacks launched broadly against hospitals, public safety, banks, transportation and logistics firms, and local governments have already increased 235% from 2018 to 2019, while we are supposedly at peace (HIPAA Journal, 2019), and remote access trojan attacks are up 650% during the same period. Highly targeted attacks on industrial control systems, power and water distribution in major cities based on precursors like the Iranian and Russian power grid attacks and Stuxnet; information operations and disinformation campaigns aimed at social media and traditional news outlets; and massive denial of service attacks against stock markets and major telecommunications providers.\nHuman security concerns recognize the conditions that menace survival (UNDP, 2008), such as attacks on power/water supply, medical systems, or other physical systems that could endanger public health (Barnett et al. 2013). Physical, personal, and community security are affected by loss of trust in system, and violent or disruptive acts have a “negative impact on social cohesion,” irrespective of whether it is committed by state or non‐state actors (Werthes et al. 2011).\nInformation operations and info warfare can achieve scale and speed never before possible, as Kopp predicted almost 20 years ago (Kopp, 2000) — for example, did fake postings on Facebook impact the US election (Allcott & Gentzkow, 2017)? And imagine the impact of all that going on, while simultaneously experiencing traditional kinetic attacks against key military and political targets on the ground from artillery, missiles and good‐old‐fashioned bombs. We predict that future warfare is not just cyberwar but cyber plus war. It is not War 2.0 or 3.0, but War to the second or third power, exponentially more devastating than traditional or even nuclear weapons alone.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nSecond, social engineering and traditional human intelligence operations will continue to grow in importance in cyber warfare. Releasing targeted weapons over the Internet is complicated by considerations of collateral damage, as was the case in Stuxnet (Farwell &amp; Rohozinski, 2011) and several ransomware attacks, and it increases the risk of detection and neutralization by third parties (Payne, 2018). Human intelligence operatives will continue to be able to deliver portable USB drives and other physical electronic devices, combined with ever-evolving remote delivery systems like drones, as well as local social engineering attacks, to gain access to even air-gapped, non-networked systems like those in sensitive government, military, and public utility company operations (Gioe, 2018). Cyber operators will not likely replace intelligence operatives, as some have envisioned; rather, they will rely even more heavily upon their human intel colleagues, both to bring sensitive information to the table, and to deliver targeted electronic payloads where signals, wires, and fiber optic cables may not reach.\nThird, cyber defense will evolve and morph almost as rapidly as the shifting cyber landscape. Vigilant cyber hygiene and aggressive patching and updating of systems are not enough. We must also expand and accelerate cyber operations training for professionals in the military, in government, and in corporations (De Borchgrave et al., 2001). Currently, there is a global skills gap of over 1 million unfilled cyber jobs growing to a shortfall of 3.5 million skilled cyber professionals by 2021 (Morgan, 2017), and we cannot just throw money at cyber if there is no workforce to carry out the mission (Vogel, 2016).\nWe must become orders of magnitude better both at cyber threat hunting and at sharing information on likely cyber-attacks and vulnerabilities between national agencies and private industry (De Borchgrave et al., 2001). The US has begun efforts toward this end, but it may be hindered by its size; this is an area that smaller nations could potentially do better than their traditionally more powerful peers (Mienie, 2019). Smaller nations will continue to suffer collateral damage as major cyber powers and cybercriminals inflict damage on larger targets, and so these smaller countries must use their size and speed to their advantage to detect and defend against cyberattacks.\nFinally, cyber warfare will continue to be exacerbated, and to some extent obscured, by traditional cybercrime and espionage (Payne, 2018), which we can only characterize with the word \"more\". More denial of service attacks (Rayome, 2019), more Internet of Things (IoT) device-related attacks, which increased by 600% and 217.5% in 2018 and 2019, respectively (Rayome, 2018; Gatlan, 2019), more ransomware and crypto attacks (HIPAA Journal, 2019), more targeted attacks against specific infrastructure and devices (McMillen, 2016), and more information warfare (Pomerleau, 2019). Examining these trends, we can only predict more disruption, more annoyance, more danger to our economies, our borders and biosecurity, our food, energy and natural resources, our transportation and communication, and even our public health, physical and political security.\n45\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\n# CONCLUSION\nCyber is deeply enmeshed and interwoven across both national and human security concerns. In the interests of more cyber threat awareness, we propose that tabletop exercises and cyber simulations for political leaders, armed forces, police, and critical infrastructure personnel down to the local government level be conducted regularly. Awareness training for civil and municipal government employees should be the norm and not the exception. Telecom companies and device manufacturers can assist in the prevention of malware, phishing, and network-borne attacks by being proactive in our combined efforts to mitigate those attacks and to share information with government agencies in a more concerted and immediate manner.\nMoreover, technology and cyber education in schools should become part of the core curriculum. The moment our fingers touch a keyboard or touchscreen, or the moment we use our voices to interact with the technology listening in our cars, homes or smartphones, irrespective of our educational discipline, we are exposed and vulnerable to a cyber-attack. Individual responsibility can mitigate national cybersecurity threats collectively, but we must make a collective effort to develop a new generation of cyber heroes, cyber guardians, and cyber professionals. An uneducated populace is a luxury developed nations can no longer afford. It is our sincerest hope that discussion and acknowledgment of the scope of future war, and that public, academic publications like this one can spark the kinds of national policy debates that can energize our collective will to prepare for the next generation of cyber warfare that is already at our doorstep, that we have already seen in part, but that has the potential to forever change our future and our children's future.\n46\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019"
    },
    "author_year": {
      "total": {
        "intext_total": 53,
        "success_occurrences": 52,
        "success_unique": 41,
        "bib_unique_total": 99,
        "occurrence_match_rate": 0.9811320754716981,
        "bib_coverage_rate": 0.41414141414141414,
        "success_percentage": 98.11,
        "style": "author_year"
      },
      "results": [
        {
          "index": "hughes-wilson|2016",
          "intext_citation": "(Hughes-Wilson, 2016)",
          "preceding_text": "By 1995 the world wide web became widely available, as it expanded across the globe",
          "footnote": "Hughes-Wilson, J. (2016). The Secret State: A History of Intelligence and Espionage. New York, NY: Pegasus Books, Ltd."
        },
        {
          "index": "gao|2009",
          "intext_citation": "(GAO, 2009)",
          "preceding_text": "It is worthwhile to note, however, that 85% of the infrastructure of the Internet is privately owned",
          "footnote": "Government Accountability Office (GAO). (2009, June 26). The Department of Homeland Security's (DHS) Critical Infrastructure Protection Cost-Benefit Report."
        },
        {
          "index": "hughes-wilson|2016",
          "intext_citation": "(Hughes-Wilson, 2016)",
          "preceding_text": "During these past two decades especially, as governments and defense manufacturers realized the potential for smart weapons, a new generation of technological military systems and missiles were developed",
          "footnote": "Hughes-Wilson, J. (2016). The Secret State: A History of Intelligence and Espionage. New York, NY: Pegasus Books, Ltd."
        },
        {
          "index": "hughes-wilson|2016",
          "intext_citation": "(Hughes-Wilson, 2016)",
          "preceding_text": "The creation of a separate cyber corps has become a struggle among military bureaucracies worldwide because of interagency competition",
          "footnote": "Hughes-Wilson, J. (2016). The Secret State: A History of Intelligence and Espionage. New York, NY: Pegasus Books, Ltd."
        },
        {
          "index": "winseck|2017",
          "intext_citation": "(Winseck, 2017)",
          "preceding_text": "ions, not governments, owning 85% of critical Internet infrastructure, research has shown that \"90 to 95 percent of US government traffic, including sensitive diplomatic and military orders, travels over privately-owned cables to reach officials in the field\"",
          "footnote": "Winseck, D. (2017). The Geopolitical Economy of the Global Internet Infrastructure. *Journal of Information Policy*, 7, 228–267. doi:10.5325/jinfopoli.7.2017.0228"
        },
        {
          "index": "fbi|2018",
          "intext_citation": "(FBI, 2018)",
          "preceding_text": "His act became known as the \"Morris Worm,\" which used weaknesses in the UNIX system and spread in less than 24 hours to an estimated 10 percent of all computers then connected to the Internet",
          "footnote": "FBI. (2018). The Morris Worm: 30 years since first major attack on the Internet. November 2, 2018. Retrieved from https://www.fbi.gov/news/stories/morris-worm-30-years-since-first-major-attack-on-internet-110218"
        },
        {
          "index": "dooley|2018",
          "intext_citation": "(Dooley, 2018)",
          "preceding_text": "Morris served no jail time but performed community service as part of his sentence. It is understood that today, Prof. Morris is working as a professor at MIT",
          "footnote": "Dooley, J. F. (2018). Cyber Weapons and Cyber Warfare. In History of Cryptography and Cryptanalysis (pp. 213–239). Cham, CH: Springer. doi:10.1007/978-3-319-90443-6_13"
        },
        {
          "index": "goodman|2015",
          "intext_citation": "(Goodman, 2015)",
          "preceding_text": "His accomplices were eventually arrested, and they implicated Levin who was detained by the British police in 1995. Citibank recovered all but $400k of the eventual $10.7 million stolen",
          "footnote": "Goodman, M. (2015). Future crimes: Everything is connected, everyone is vulnerable and what we can do about it. Norwell, MA: Anchor Press."
        },
        {
          "index": "wirtz|2019",
          "intext_citation": "(Wirtz, 2019)",
          "preceding_text": "It used to be that the most damaging of cyber-attacks were Denial of Service or DoS attacks, but we are now seeing large-scale ransomware attacks, targeting banks, credit card companies and local government",
          "footnote": "Wirtz, J. J. (2019). Intelligence and the Besieged State. *International Journal of Intelligence and CounterIntelligence*, 32(1), 198–201. doi:10.1080/08850607.2018.1524248"
        },
        {
          "index": "deere|2018",
          "intext_citation": "(Deere, 2018)",
          "preceding_text": "ts, police records, and municipal water payment systems. The ransomware physically damaged components in a number of computers rendering them unusable—several years' worth of video footage captured by the city's police cars was lost and unable to be recovered",
          "footnote": "Deer, S. (2018, August 1). Atlanta’s cyber attack could cost taxpayers $17 million. Atlanta Journal-Constitution. Retrieved from https://www.ajc.com/news/confidential-report-atlanta-cyber-attack-could-hit-million/GAljmndAF3EQdVWlMcXS0K/"
        },
        {
          "index": "spitzer|2018",
          "intext_citation": "(Spitzer, 2018)",
          "preceding_text": "Over $17 Million in direct costs were disclosed, in addition to the reputation damage, lost productivity, and other so-called soft costs",
          "footnote": "Spitzer, J. (2018, August 6). Atlanta’s ransomware attack may cost the city $17M. Becker’s Hospital Review. Retrieved from https://www.beckershospitalreview.com/cybersecurity/atlanta-s-ransomware-attack-may-cost-the-city-17m.html"
        },
        {
          "index": "stoel-walker|2019",
          "intext_citation": "(Stoel-Walker, 2019)",
          "preceding_text": "Two cities in Florida were later hit with a different strain of ransomware in 2019, paying $530,000 and $600,000 in bitcoin to regain access to their systems",
          "footnote": null
        },
        {
          "index": "gorman|2009",
          "intext_citation": "(Gorman, 2009)",
          "preceding_text": "In 2009, there were reports of Russian and Chinese attempts to infiltrate the US electrical grid. They left behind software programs that later could be used to cause major disruption to the system",
          "footnote": "Gorman, S. (2009, April 8). Electricity grid in US penetrated by spies. The Wall Street Journal, 8. Retrieved from https://www.wsj.com/articles/SB123914805204099085"
        },
        {
          "index": "newman|2018",
          "intext_citation": "(Newman, 2018)",
          "preceding_text": "As recently as November 2018, US intelligence officials noted that Russian hackers were still actively probing US power grid targets for vulnerabilities",
          "footnote": "Newman, L. H. (2018, November). Russian hackers haven't stopped probing the power grid. Wired. Retrieved from https://www.wired.com/story/russian-hackers-us-power-grid-attacks/"
        },
        {
          "index": "rid|2015",
          "intext_citation": "(Rid & Buchanan, 2015)",
          "preceding_text": "intelligence agencies are improving rapidly in this regard",
          "footnote": "Rid, T., &amp; Buchanan, B. (2015). Attributing cyber attacks. The Journal of Strategic Studies, 38(1-2), 4–37. doi:10.1080/01402390.2014.977382"
        },
        {
          "index": "schmitt|2016",
          "intext_citation": "(Schmitt & Vihul, 2016)",
          "preceding_text": "this regard (Rid & Buchanan, 2015). The lack of physical evidence and the difficulty of not being able to “see” cyber weapons or attacks has been cited as one of the reasons there have not yet been well‐established international ethical norms in cyberwarfare",
          "footnote": "Schmitt, M. N., &amp; Vihul, L. (2016). The emergence of international legal norms for Cyberconflict. In F. Allhoff, A. Henschke, &amp; B. J. Strawser (Eds.), *Binary bullets: The ethics of cyberwarfare* (pp. 34–55). London, UK: Oxford University Press. doi:10.1093/acprof:oso/9780190221072.003.0003"
        },
        {
          "index": "rid|2011",
          "intext_citation": "(Rid, 2011)",
          "preceding_text": "In 1999, the US accidentally discovered someone trying to access the systems at the US Department of Energy, the Pentagon, NASA, private universities, as well as research labs",
          "footnote": "Rid, T. (2012). Cyber war will not take place. The Journal of Strategic Studies, 35(1), 5–32. doi:10.1080/01402390.2011.608939"
        },
        {
          "index": "clarke|2010",
          "intext_citation": "(Clarke & Knake, 2010)",
          "preceding_text": "The servers were masked by proxy sites, “zombie computers,” which infected spyware and viruses into the computer systems",
          "footnote": "Clarke, R. A., &amp; Knake, R. K. (2010). Cyber war. New York, NY: Harper Collins."
        },
        {
          "index": "farwell|2011",
          "intext_citation": "(Farwell & Rohozinski, 2011)",
          "preceding_text": "This was a malicious computer worm called Stuxnet",
          "footnote": "Farwell, J. P., &amp; Rohozinski, R. (2011). Stuxnet and the future of cyber war. Survival, 53(1), 23–40. doi:10.1080/00396338.2011.555586"
        },
        {
          "index": "zetter|2015",
          "intext_citation": "(Zetter, 2015)",
          "preceding_text": "In 2014, the second known successful cyber-physical attack was revealed, this time apparently targeting a steel mill in Germany",
          "footnote": "Zetter, K. (2015, January). A cyberattack has caused confirmed physical damage for the second time ever. *Wired*. Retrieved from https://www.wired.com/2015/01/german-steel-mill-hack-destruction/"
        },
        {
          "index": "thompson|2016",
          "intext_citation": "(Thompson, 2016)",
          "preceding_text": "s Corps allegedly took control of a flood-control dam 25 miles north of New York City through a cellular network modem, but they were unable to release water only because the sluice gate had been manually disconnected for maintenance at the time of the attack",
          "footnote": "Thompson, M. (2016, March 24). Iranian cyber attack on New York dam shows future of war. Time. Retrieved from http://time.com/4270728/iran-cyber-attack-dam-fbi/"
        },
        {
          "index": "winton|2016",
          "intext_citation": "(Winton, 2016)",
          "preceding_text": "Ransomware is especially concerning for human physical and health security in the cases of hospitals, such as the Hollywood Presbyterian Medical Center ransomware attack in February 2016",
          "footnote": "Winton, R. (2016, February 18). Hollywood hospital pays $17,000 in bitcoin to hackers; FBI investigating. *Los Angeles Times*. Retrieved from https://www.latimes.com/business/technology/la-me-ln-hollywood-hospital-bitcoin-20160217-story.html"
        },
        {
          "index": "hern|2018",
          "intext_citation": "(Hern, 2018)",
          "preceding_text": "In addition to public health facilities themselves, individual medical devices, such as pacemakers and insulin pumps, have been found to have major vulnerabilities that could conceivably cause deaths from targeted cyber-physical attacks against these devices",
          "footnote": "Hern, A. (2018, August 9). Hackable implanted medical devices could cause deaths, researchers say. The Guardian. Retrieved from https://www.theguardian.com/technology/2018/aug/09/implanted-medical-devices-hacking-risks-medtronic"
        },
        {
          "index": "hern|2017",
          "intext_citation": "(Hern, 2017)",
          "preceding_text": "While no patient deaths have been reported to date as a result of hacking, there have been recalls affecting as many as half a million devices in a single case",
          "footnote": "Hern, A. (2017, August 31). Hacking risk leads to recall of 500,000 pacemakers due to patient death fears. The Guardian. Retrieved from https://www.theguardian.com/technology/2017/aug/31/hacking-risk-recall-pacemakers-patient-death-fears-fda-firmware-update"
        },
        {
          "index": "greenberg|2017",
          "intext_citation": "(Greenberg, 2017)",
          "preceding_text": "Perhaps the largest cyber-physical attacks, though, were the two separate attacks on Ukraine's power grid in December 2015 and December 2016, which shut down power to hundreds of thousands of customers in the cold of winter",
          "footnote": "Greenberg, A. (2017, June). How an entire nation became Russia's test lab for cyberwar. Wired. Retrieved from https://www.wired.com/story/russian-hackers-attack-ukraine/"
        },
        {
          "index": "kakutani|2010",
          "intext_citation": "(Kakutani, 2010, C1)",
          "preceding_text": "In 2010, Richard Clarke, the White House counterterrorism chief warned that if the country were in a cyber war at that time, “the United States would lose”",
          "footnote": "Kakutani, M. (2010, April 27). The Attack Coming From Bytes, Not Bombs. New York Times. Retrieved from https://archive.nytimes.com/www.nytimes.com/2010/04/27/books/27book.html"
        },
        {
          "index": "spillius|2010",
          "intext_citation": "(Spillius, 2010)",
          "preceding_text": "He warned that because we are so completely dependent on electronics, the West could be brought to its knees within fifteen minutes of a serious cyber-attack",
          "footnote": "Spillius, A. (2010, May 7). Cyber attack ‘could fell US within 15 minutes’. The Telegraph. Retrieved from https://www.telegraph.co.uk/news/worldnews/northamerica/usa/7691500/Cyber-attack-could-fell-US-within-15-minutes.html"
        },
        {
          "index": "herr|2014",
          "intext_citation": "(Herr, 2014)",
          "preceding_text": "led “Red October” that had been operating since 2007. The virus used Word and Excel to gather information from military installations, energy providers, government embassies, nuclear infrastructures, research firms, and other critical infrastructure operators",
          "footnote": "Herr, T. (2014). PrEP: A framework for malware &amp; cyber weapons. Journal of Information Warfare, 13(1), 87–106."
        },
        {
          "index": "hughes-wilson|2016",
          "intext_citation": "(Hughes-Wilson, 2016)",
          "preceding_text": "In 2014, after Sony Pictures produced a low budget movie poking fun at North Korean leader Kim Jong-Un, Kim launched 6,000 hackers against Sony, which inflicted a cost on Sony of $100M",
          "footnote": "Hughes-Wilson, J. (2016). The Secret State: A History of Intelligence and Espionage. New York, NY: Pegasus Books, Ltd."
        },
        {
          "index": "hughes-wilson|2016",
          "intext_citation": "(Hughes-Wilson, 2016)",
          "preceding_text": "It should be noted that not everyone is in agreement with the FBI’s conclusion that the attack was indeed perpetrated by North Korea",
          "footnote": "Hughes-Wilson, J. (2016). The Secret State: A History of Intelligence and Espionage. New York, NY: Pegasus Books, Ltd."
        },
        {
          "index": "hughes-wilson|2016",
          "intext_citation": "(Hughes-Wilson, 2016)",
          "preceding_text": "We should keep in mind that weak retaliation emboldens others and the bad actor can maximize the threshold-level event to suit their aims and objectives",
          "footnote": "Hughes-Wilson, J. (2016). The Secret State: A History of Intelligence and Espionage. New York, NY: Pegasus Books, Ltd."
        },
        {
          "index": "hughes-wilson|2016",
          "intext_citation": "(Hughes-Wilson, 2016)",
          "preceding_text": "There is a definite cyber-threat to this type of intelligence sharing. Sixty percent of known cyber-attacks are against commercial targets",
          "footnote": "Hughes-Wilson, J. (2016). The Secret State: A History of Intelligence and Espionage. New York, NY: Pegasus Books, Ltd."
        },
        {
          "index": "hughes-wilson|2016",
          "intext_citation": "(Hughes-Wilson, 2016)",
          "preceding_text": "As the Chinese state and its economy are intertwined, illicit intelligence gathering raises to the level of national security interests",
          "footnote": "Hughes-Wilson, J. (2016). The Secret State: A History of Intelligence and Espionage. New York, NY: Pegasus Books, Ltd."
        },
        {
          "index": "hughes-wilson|2016",
          "intext_citation": "(Hughes-Wilson, 2016)",
          "preceding_text": "By 2016, the Pentagon's IT and cyber programs increased seven-fold in spending from $13.3 million in 2015 to $84 million in 2016",
          "footnote": "Hughes-Wilson, J. (2016). The Secret State: A History of Intelligence and Espionage. New York, NY: Pegasus Books, Ltd."
        },
        {
          "index": "futter|2018",
          "intext_citation": "(Futter, 2018)",
          "preceding_text": "We should also be mindful that there is no single accepted definition of “cyber” and analysts and states do not have the same frame of reference when using the term",
          "footnote": "Futter, A. (2018). Hacking the Bomb: Cyber Threats and Nuclear Weapons. Washington, DC: Georgetown University Press."
        },
        {
          "index": "futter|2018",
          "intext_citation": "(Futter, 2018)",
          "preceding_text": "Some people regard cyberwarfare as military actions through the Internet. For others, it involves information warfare",
          "footnote": "Futter, A. (2018). Hacking the Bomb: Cyber Threats and Nuclear Weapons. Washington, DC: Georgetown University Press."
        },
        {
          "index": "futter|2018",
          "intext_citation": "(Futter, 2018)",
          "preceding_text": "eats very complicated. Perhaps it is best to think of cyber as comprising a set of tools, and the question then is not which cyber technologies can do something specific, but rather how the new context changes the way we understand and interact with the world",
          "footnote": "Futter, A. (2018). Hacking the Bomb: Cyber Threats and Nuclear Weapons. Washington, DC: Georgetown University Press."
        },
        {
          "index": "deng|2017",
          "intext_citation": "(Deng et al. 2017)",
          "preceding_text": "What will be different in an all‐out cyberwar is the massive aggregation of cyber weapons in a coordinated barrage of attacks",
          "footnote": "Deng, R., Zhuang, P., &amp; Liang, H. (2017). CCPA: Coordinated cyber-physical attacks and countermeasures in smart grid. IEEE Transactions on Smart Grid, 8(5), 2420–2430. doi:10.1109/TSG.2017.2702125"
        },
        {
          "index": "undp|2008",
          "intext_citation": "(UNDP, 2008)",
          "preceding_text": "Human security concerns recognize the conditions that menace survival",
          "footnote": "United Nations Development Program (UNDP). (2008). Human security. Retrieved from http://hdr.undp.org/en/media/hdinsights_feb2008.pdf"
        },
        {
          "index": "barnett|2013",
          "intext_citation": "(Barnett et al. 2013)",
          "preceding_text": "Human security concerns recognize the conditions that menace survival (UNDP, 2008), such as attacks on power/water supply, medical systems, or other physical systems that could endanger public health",
          "footnote": "Barnett, D. J., Sell, T. K., Lord, R. K., Jenkins, C. J., Terbush, J. W., &amp; Burke, T. A. (2013). Cyber Security Threats to Public Health. World Medical &amp; Health Policy, 5(1), 37–46. doi:10.1002/wmh3.19"
        },
        {
          "index": "werthes|2011",
          "intext_citation": "(Werthes et al. 2011)",
          "preceding_text": "health (Barnett et al. 2013). Physical, personal, and community security are affected by loss of trust in system, and violent or disruptive acts have a “negative impact on social cohesion,” irrespective of whether it is committed by state or non‐state actors",
          "footnote": "Werthes, S., Heaven, C., Vollnhals, S. (2011). Assessing human insecurity worldwide. The way to a human (in)security index. *Institute for Development and Peace (INEF) Report 102/2011*."
        },
        {
          "index": "kopp|2000",
          "intext_citation": "(Kopp, 2000)",
          "preceding_text": "Information operations and info warfare can achieve scale and speed never before possible, as Kopp predicted almost 20 years ago",
          "footnote": "Kopp, C. (2000, May). Moore's law and its implications for information warfare. Proceedings of the International AOC Electronic Warfare Conference, Alexandria, VA (Vol. 3). Academic Press."
        },
        {
          "index": "allcott|2017",
          "intext_citation": "(Allcott & Gentzkow, 2017)",
          "preceding_text": "Information operations and info warfare can achieve scale and speed never before possible, as Kopp predicted almost 20 years ago (Kopp, 2000) — for example, did fake postings on Facebook impact the US election",
          "footnote": "Allcott, H., &amp; Gentzkow, M. (2017). Social media and fake news in the 2016 election. The Journal of Economic Perspectives, 31(2), 211–236. doi:10.1257/jep.31.2.211"
        },
        {
          "index": "payne|2018",
          "intext_citation": "(Payne, 2018)",
          "preceding_text": "ng targeted weapons over the Internet is complicated by considerations of collateral damage, as was the case in Stuxnet (Farwell &amp; Rohozinski, 2011) and several ransomware attacks, and it increases the risk of detection and neutralization by third parties",
          "footnote": "Payne, B. R. (2018). The expanding role of cyber in national security, Line of Defence, 1 (8), Winter 2018. Auckland, NZ: DefSec Media."
        },
        {
          "index": "gioe|2018",
          "intext_citation": "(Gioe, 2018)",
          "preceding_text": "devices, combined with ever-evolving remote delivery systems like drones, as well as local social engineering attacks, to gain access to even air-gapped, non-networked systems like those in sensitive government, military, and public utility company operations",
          "footnote": "Gioe, D. V. (2018). Cyber operations and useful fools: The approach of Russian hybrid intelligence. Intelligence and National Security, 33(7), 954–973. doi:10.1080/02684527.2018.1479345"
        },
        {
          "index": "morgan|2017",
          "intext_citation": "(Morgan, 2017)",
          "preceding_text": "Currently, there is a global skills gap of over 1 million unfilled cyber jobs growing to a shortfall of 3.5 million skilled cyber professionals by 2021",
          "footnote": "Morgan, S. (2017). Cybersecurity labor crunch to hit 3.5 million unfilled jobs by 2021. Cybersecurity Business Report."
        },
        {
          "index": "vogel|2016",
          "intext_citation": "(Vogel, 2016)",
          "preceding_text": ". Currently, there is a global skills gap of over 1 million unfilled cyber jobs growing to a shortfall of 3.5 million skilled cyber professionals by 2021 (Morgan, 2017), and we cannot just throw money at cyber if there is no workforce to carry out the mission",
          "footnote": "Vogel, R. (2016). Closing the cybersecurity skills gap. *Salus Journal*, 4(2), 32."
        },
        {
          "index": "mienie|2019",
          "intext_citation": "(Mienie, 2019)",
          "preceding_text": "The US has begun efforts toward this end, but it may be hindered by its size; this is an area that smaller nations could potentially do better than their traditionally more powerful peers",
          "footnote": "Mienie, E. (2019). The role of cyber in national and global human security. Proceedings of the International Conference on Cyber Warfare and Security (ICCWS), Stellenbosch, South Africa, February 28. Academic Press."
        },
        {
          "index": "payne|2018",
          "intext_citation": "(Payne, 2018)",
          "preceding_text": "Finally, cyber warfare will continue to be exacerbated, and to some extent obscured, by traditional cybercrime and espionage",
          "footnote": "Payne, B. R. (2018). The expanding role of cyber in national security, Line of Defence, 1 (8), Winter 2018. Auckland, NZ: DefSec Media."
        },
        {
          "index": "rayome|2019",
          "intext_citation": "(Rayome, 2019)",
          "preceding_text": "More denial of service attacks",
          "footnote": "Rayome, A. D. (2019, April 24). Major DDoS attacks increased 967% this year. TechRepublic.com. Retrieved from https://www.techrepublic.com/article/major-ddos-attacks-increased-967-this-year/"
        },
        {
          "index": "rayome|2018",
          "intext_citation": "(Rayome, 2018; Gatlan, 2019)",
          "preceding_text": "More denial of service attacks (Rayome, 2019), more Internet of Things (IoT) device-related attacks, which increased by 600% and 217.5% in 2018 and 2019, respectively",
          "footnote": "Rayome, A. D. (2018, March 21). As IoT attacks increase 600% in one year, businesses need to up their security. TechRepublic.com. Retrieved from https://www.techrepublic.com/article/as-iot-attacks-increase-600-in-one-year-businesses-need-to-up-their-security/"
        },
        {
          "index": "mcmillen|2016",
          "intext_citation": "(McMillen, 2016)",
          "preceding_text": "of Things (IoT) device-related attacks, which increased by 600% and 217.5% in 2018 and 2019, respectively (Rayome, 2018; Gatlan, 2019), more ransomware and crypto attacks (HIPAA Journal, 2019), more targeted attacks against specific infrastructure and devices",
          "footnote": "McMillen, D. (2016). Attacks Targeting Industrial Control Systems (ICS) Up 110 Percent. SecurityIntelligence. December 27, 2016. Retrieved from https://securityintelligence.com/attacks-targeting-industrial-control-systems-ics-up-110-percent/"
        },
        {
          "index": "pomerleau|2019",
          "intext_citation": "(Pomerleau, 2019)",
          "preceding_text": "ncreased by 600% and 217.5% in 2018 and 2019, respectively (Rayome, 2018; Gatlan, 2019), more ransomware and crypto attacks (HIPAA Journal, 2019), more targeted attacks against specific infrastructure and devices (McMillen, 2016), and more information warfare",
          "footnote": "Pomerleau, M. (2019, July 11). Joint Chiefs nominee wants to boost information warfare. C4ISRNet. Retrieved from https://www.c4isrnet.com/information-warfare/2019/07/11/joint-chiefs-nominee-wants-to-boost-information-warfare/"
        }
      ],
      "flat_text": "International Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 # The Impact of Cyber-Physical Warfare on Global Human Security Bryson R. Payne, University of North Georgia, Dahlonega, USA Edward L. Mienie, University of North Georgia, Dahlonega, USA # ABSTRACT Cyber is deeply enmeshed and interwoven across national security, as evidenced by its inclusion in the national security policies of a growing number of OECD countries. But it is the impact of cyber across the other components of national and human security that remains to be sufficiently addressed at the national policy level, or in international standards of behavior with respect to cyberwarfare and hybrid conflict. In addition to standing on its own as a national security concern, cybersecurity impacts economic and trade security, ecological/environmental and biosecurity, energy and critical infrastructure security, food security, transportation, and public health, as well as communications, physical and even political security. This work examines the role of threats from cyberwarfare, hybrid conflict, and cyber-physical attacks across human security from a national and global perspective, makes near-term predictions about the future of cyberwarfare, and provides recommendations with respect to preparing for cyberwarfare and ongoing hybrid conflict.\n# KEYWORDS Asymmetric Warfare, Attribution, Cyber Intelligence, Cyber-Physical Attacks, Cybersecurity, Cyberwarfare, Denial of Service, Hybrid Conflict # INTRODUCTION In 1947, the third industrial revolution began with the invention of the transistor, from which flowed massive technological changes that transformed societies and economies in the world. This resulted in governments, military and civilian organizations investing heavily in computer systems, making computers an essential part of large-scale operations during the 1950s and 1960s. By the 1980s, the proliferation of digital technology and computers spread into private homes and small offices via the personal DOI: 10.4018/IJCWT.2019070103 Copyright © 2019, IGI Global. Copying or distributing in print or electronic forms without written permission of IGI Global is prohibited.\nInternational Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 computer, or PC, eventually integrating with virtually all aspects of life in developed nations. The end of the 20th century saw industrial robots, graphics for video game entertainment, and automated teller cash machines in banks. By 1995 the world wide web became widely available, as it expanded across the globe.\nThe first decade of the 21st century saw the introduction of the smartphone, which quickly became commonplace with the proliferation of the wireless Internet and the smart electricity grid. By 2018 we had 3.3 billion smartphone users, and approximately 4.2 billion users accessed the Internet. The world has become interconnected using smartphones, tablets, and computer-based devices for both social networking and day-to-day business. It is worthwhile to note, however, that 85% of the infrastructure of the Internet is privately owned, primarily by telecommunications corporations and technology service providers, and therefore the majority of the Internet is not necessarily protected by municipal, state, or national governments.\nDuring these past two decades especially, as governments and defense manufacturers realized the potential for smart weapons, a new generation of technological military systems and missiles were developed, most of which rely upon wireless communications and the global positioning system (GPS) or similar navigational systems.\nBy 2015, cloud computing was ubiquitous, data could be uploaded in real time, and we saw tablet computers and smartphone use exceed personal computer use. The proliferation of the smart electrical grid, automated industrial and building controls, and the Internet of Things and smart Internet-connected devices in homes, offices, factories, and in automobiles has brought great efficiency and convenience, while simultaneously making us more vulnerable to cyberattacks in virtually every setting.\n# BACKGROUND In 1946, the US Army Ordinance Corps financed and developed the world's first true reprogrammable computer. Intelligence showed a keen interest, and in 1952, President Harry Truman established the National Security Agency who in turn became a major investor in and customer of computers. In 1985, NSA merged with the National Computer Security Center to house the world's single largest group of supercomputers (National Research Council, 1990).\nIn the 1960s, Cray Data Corporation first introduced supercomputers and could process 33 quadrillion floating-point operations per second. At a price tag of $500,000 apiece, this placed Cray in the hands of well-funded governments and a handful of very large corporations and banks. Today, NSA's latest facility at Fort Meade houses one of three High-Performance Computing Centers, each with their own 150-megawatt power substation providing 60 megawatts of electricity. Each center comes at a price tag of $3.2 Billion. The British NSA equivalent, GCHQ, has remained in step with the digital revolution, as have the other members of the UN Security Council. Similarly, digital intelligence is very high on the Chinese list of national priorities.\nInternational Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 With real-time digital intelligence now available, the Intelligence Community (IC) has accepted that it is here to stay. There is a school of thought that the traditional intelligence cycle approach (Tasking, Processing, Evaluation, and Dissemination) is too slow. Digital intelligence is revolutionizing the way intelligence does business. The IC now needs algorithms and applications to work on data and provide recommendations in order to keep pace with open-source media.\nIn 2009, the US Cyber Command was established to operate in the digital space and recruitment and retention of a technically qualified cyber force has become a challenge. There is talk of changing (not lowering) recruiting standards in an effort to recruit information security specialists as a matter of urgency. The creation of a separate cyber corps has become a struggle among military bureaucracies worldwide because of interagency competition.\nThe digital revolution has exposed new vulnerabilities of governments, and these have to be addressed by digital means, up to and including cyberwarfare. For the past century, the front lines of war have moved closer to modern households, as war is no longer something that happens on a far-away battlefield. The illusion of living in the safety of our own homes is slowly being eroded, as we increasingly become victims of cyber breaches, malware and ransomware infections, and denial of service attacks (DoS) that take down individual systems or complete networks. In addition to the issue previously mentioned with corporations, not governments, owning 85% of critical Internet infrastructure, research has shown that\"90 to 95 percent of US government traffic, including sensitive diplomatic and military orders, travels over privately-owned cables to reach officials in the field\".\n## The Progression from Cyberattacks to Cyber-Physical Attacks Cyberwar has become a threat to modern society. Robert Morris became the first person to be convicted under the US Computer Fraud and Abuse Act in 1988. His act became known as the\"Morris Worm,\"which used weaknesses in the UNIX system and spread in less than 24 hours to an estimated 10 percent of all computers then connected to the Internet. This worm slowed down computers to the point of an early denial-of-service, leaving systems largely unusable. Morris served no jail time but performed community service as part of his sentence. It is understood that today, Prof. Morris is working as a professor at MIT.\nIn 1994, a Russian called Vladimir Levin used a laptop in London to access the Citibank network. He accessed a list of customer passwords and codes and shared that with some of his associates. He used wire transfers to steal $3.7 million himself and set up accounts in Finland, the US, Netherlands, Germany, and Israel. His accomplices were eventually arrested, and they implicated Levin who was detained by the British police in 1995. Citibank recovered all but $400k of the eventual $10.7 million stolen.\nComputer hacking has become a genuine international threat and is becoming more widespread and dangerous. Classic security targets of sabotage, espionage, and to a lesser extent subversion are in the sights of hackers. Cyber-attacks are hard to International Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 pin on any adversary at the time of the attack, but intelligence agencies are becoming significantly more skilled at attribution, especially among highly skilled peer nations and known non-state groups. Remote access trojan attacks, a type of malware designed to give an attacker persistent remote control of a computer system, grew 650% year-over-year (HIPAA Journal, 2019). These attacks are especially concerning due to the ongoing, covert control an adversary can maintain over data and systems from anywhere in the world.\nIt used to be that the most damaging of cyber-attacks were Denial of Service or DoS attacks, but we are now seeing large-scale ransomware attacks, targeting banks, credit card companies and local government. Ransomware attacks, in which files or entire computer systems are locked via encryption and require payment of an illegal ransom to regain access, increased 235% from 2018 to 2019 (HIPAA Journal, 2019).\nThe city of Atlanta, the ninth largest US metropolitan city, was crippled by a ransomware attack in March 2018 that shut down city government functions including courts, police records, and municipal water payment systems. The ransomware physically damaged components in a number of computers rendering them unusable—several years' worth of video footage captured by the city's police cars was lost and unable to be recovered. Over $17 Million in direct costs were disclosed, in addition to the reputation damage, lost productivity, and other so-called soft costs. Notably, the ransomware was attributed to two specific Iranian civilians, who were named by the FBI and indicted in November 2018. Two cities in Florida were later hit with a different strain of ransomware in 2019, paying $530,000 and $600,000 in bitcoin to regain access to their systems.\nCyberattack targets of opportunity have expanded to include physical infrastructures such as power plants, water systems, fuel depots, communications, and transportation. Satellites are particularly vulnerable as this could compromise military systems such as control and command. In 2009, there were reports of Russian and Chinese attempts to infiltrate the US electrical grid. They left behind software programs that later could be used to cause major disruption to the system. As recently as November 2018, US intelligence officials noted that Russian hackers were still actively probing US power grid targets for vulnerabilities. National and municipal utility companies around the globe are advised to be on high alert, both for direct attacks like those noted above, and for\"fallout\"effects and collateral damage that might occur against uninvolved nations, when two or more larger powers conceivably launch targeted cyberattacks against commonly used systems and equipment.\n## The Issue With Attribution in Cyberattacks From an intelligence point of view, the worst nightmare is not knowing who the enemy is while the attack is happening. While attribution, our ability to assign responsibility to an aggressor, in physical warfare has been relatively straightforward, cyberwarfare and cyber espionage are especially difficult to attribute in real-time due to the lack of physical evidence and the ability of attackers to alter digital forensic clues, although intelligence agencies are improving rapidly in this regard. The lack of physical evidence and the difficulty of not being able to “see” cyber weapons or attacks has been cited as one of the reasons there have not yet been well‐established international ethical norms in cyberwarfare. There is a real danger in intercepting and even modifying classified information from the other side of the world, not knowing who sent it or whether it is genuine.\nIn 1999, the US accidentally discovered someone trying to access the systems at the US Department of Energy, the Pentagon, NASA, private universities, as well as research labs. The US traced this attack back to Russia, but Russia denied this, and the sponsor is unknown. The so‐called “Titan Rain” attack in 2003 on Redstone Arsenal in Huntsville, Alabama, was most likely perpetrated by the Chinese. The main servers used in the attack were traced back to Guangdong, China, although there is some uncertainty as to whether the Chinese government or Chinese hacktivists were responsible. The servers were masked by proxy sites, “zombie computers,” which infected spyware and viruses into the computer systems. The base is used as the Centre for the US Army's missile and rocket programs.\nIn 2007, cyberwar became a reality for Estonia when distributed denial of service (DDoS) attacks disabled parliament, banks, newspapers, and broadcasters' computer networks. The Russians called the accusations against them unfounded and there was no evidence of their complicity. Later, the head of the Russian military forecasting center affirmed their ability to conduct a DoS attack (Hughes‐Wilson, 2016). This is yet another example that poses a problem for the broader IC by not knowing for sure the perpetrator of an attack while it is going on.\n## Cyber‐Physical Attacks on Critical Infrastructure The first major cyber‐physical attack on critical industrial infrastructure occurred in 2009 when a very sophisticated attack was launched on Iran's centrifuges that came from a memory‐ stick flash‐drive through a Microsoft Windows operating system to the Siemens Step7 software that controlled the centrifuges. This was a malicious computer worm called Stuxnet. No‐one at the time knew where it had come from originally or who the intended victims were meant to be. Siemens claimed industrial espionage had been perpetrated against their business, while Iran claimed that their nuclear program had been sabotaged. Which was it? A combination of the two? How do we decide to retaliate? Against whom? By what means? And to what extent?\nWhile both the US and Israel are alleged as the possible sources of this cyber‐physical weapon, neither has publicly acknowledged responsibility. Although, it is believed that at General Ashkenazi's retirement from the Israeli Defense Force farewell reception, he referenced Stuxnet as one of his numerous operational successes (Hughes‐Wilson, 2016). While most of the collateral damage caused by Stuxnet was reported to be minimal, it affected systems in Germany (where the Siemens controllers originated) and elsewhere in smaller nations that were not involved in the dispute between Iran and its adversary or adversaries.\nInternational Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 In 2014, the second known successful cyber-physical attack was revealed, this time apparently targeting a steel mill in Germany. The weaponized software disrupted a blast furnace control system so that the furnace could not be properly shut down, causing massive damage to the facility. The German steel mill attack would have been the third such attack, as it was preceded by an attack on a US dam a year earlier, but the dam attack did not succeed in causing confirmed physical damage.\nPreviously, in 2013, seven members of Iran's Islamic Revolutionary Guards Corps allegedly took control of a flood-control dam 25 miles north of New York City through a cellular network modem, but they were unable to release water only because the sluice gate had been manually disconnected for maintenance at the time of the attack. The FBI used its\"name and shame\"tactic in 2015 both to limit travel options for the seven individuals claimed to be involved, and to demonstrate that the US was getting better at attribution. Even so, it took over two years to bring the indictment. The eventual indictment noted that the attackers were also targeting banks, the New York Stock Exchange, and telecommunications giant AT&amp;T.\nSeveral smaller cyber-physical effects were achieved through ransomware similar to that used in the attack on the city of Atlanta, though. Ransomware is especially concerning for human physical and health security in the cases of hospitals, such as the Hollywood Presbyterian Medical Center ransomware attack in February 2016. While the hospital paid the $17,000 bitcoin ransom and recovered control of its computers, in the week and a half of the shutdown caused by the ransomware, several patients were sent to other area hospitals, although no cases of direct injury to patients were noted.\nIn addition to public health facilities themselves, individual medical devices, such as pacemakers and insulin pumps, have been found to have major vulnerabilities that could conceivably cause deaths from targeted cyber-physical attacks against these devices. While no patient deaths have been reported to date as a result of hacking, there have been recalls affecting as many as half a million devices in a single case, affecting both private medical device manufacturers and hundreds of thousands of patients.\nPerhaps the largest cyber-physical attacks, though, were the two separate attacks on Ukraine's power grid in December 2015 and December 2016, which shut down power to hundreds of thousands of customers in the cold of winter. Each attack lasted only a few hours, the length of time it took engineers to scramble to physical substations to engage manual override switches. But they demonstrated the power and precision of the alleged Russian military cyberwar machine, with the second attack fully automated and striking at precisely midnight on Saturday. The attacks contributed to the destabilization surrounding the annexation of Crimea and several clashes between Russian and Ukrainian forces in the Donetsk and Luhansk regions of Ukraine. This time, attribution was relatively swift, but the smaller Ukraine was not able to retaliate in kind against its much more cyber-capable adversary.\n\nVolume 9 • Issue 3 • July-September 2019 # Preparing for Cyberwarfare In 2010, Richard Clarke, the White House counterterrorism chief warned that if the country were in a cyber war at that time, “the United States would lose”. He stated that Russia, China, and North Korea had already recruited a myriad of hackers, while Iran claims to have the world’s largest cyber army. He warned that because we are so completely dependent on electronics, the West could be brought to its knees within fifteen minutes of a serious cyber-attack. Since then, cyber-attacks have become regular features of an undeclared war.\nThe Chinese People’s Liberation Army is known to be hacking into major US and European corporations going after intellectual property and targets include IT, electronics, software, defense, aerospace, biomedical and pharmaceutical breakthroughs, energy, finance, banks, and agriculture. In 2012, a major Russian IT security company called “Kaspersky” identified a cyber-attack called “Red October” that had been operating since 2007. The virus used Word and Excel to gather information from military installations, energy providers, government embassies, nuclear infrastructures, research firms, and other critical infrastructure operators.\nMI5 and the Director General of GCHQ have expressed concern about cyber-attacks and how that may cause significant damage to their reputations and revenue. US Cyber Command has to decide daily whether they are being confronted by criminal activity or breaches of national security. Into which category does commercial espionage and theft of intellectual property fall? In 2014, after Sony Pictures produced a low budget movie poking fun at North Korean leader Kim Jong-Un, Kim launched 6,000 hackers against Sony, which inflicted a cost on Sony of $100M. The FBI claimed to have conclusive evidence that it was the North Korean government behind it. President Obama called them out and retaliated with a controlled cyber strike against North Korea’s weak internet. Was this a case of cyber terrorism, cyberwar, or cybercrime? North Korea has denied their complicity and has demanded an apology.\nIt should be noted that not everyone is in agreement with the FBI’s conclusion that the attack was indeed perpetrated by North Korea. The detractors claim that the attack was too sophisticated and that it was more than likely an inside job. This is a great example of the difficulty a cyber-attack poses to the IC by not knowing for sure who the enemy is and yet a counter-offensive was launched. This cannot bode well as an example of possibly misidentifying the attacker and launching an attack on the wrong target. We are stuck with the underlying difficulty of identifying the real cyber-aggressor. We should keep in mind that weak retaliation emboldens others and the bad actor can maximize the threshold-level event to suit their aims and objectives. This could make cyberwarfare the ultimate asymmetric war and has changed the landscape of cyber conflict.\n# Cyber-Espionage and the Intelligence Community Legislation would have to be passed by Congress for there to be intelligence sharing between the IC and the private sector. The Snowden case warned about this. The International Journal of Cyber Warfare and Terrorism Volume 9 • Issue 3 • July-September 2019 US has much more to lose than any other nation because it has more research and development than any other world power. There is a definite cyber-threat to this type of intelligence sharing. Sixty percent of known cyber-attacks are against commercial targets.\"Cyber-attacks\"is the 21st century preferred form of international trade theft. The threat is growing exponentially and in 2015 it increased by more than 600% over a three-year period. Attempts to breach security in the energy, oil, and gas sectors increased to just under 400 percent. Questions that we are facing are how much security is enough? Should it be run internally or outsourced? How much should be spent? What tools and people are most effective?\nAs the Chinese state and its economy are intertwined, illicit intelligence gathering raises to the level of national security interests. The pressure of economic sanctions against Russia due to their actions in the Ukraine has resulted in an increase in cyber-attacks against the West. The cyber-attack growth from 2009 to 2015 increased from 3.9 million incidents to more than 50 million. We have observed that international agreements to limit such behavior are ineffective. Russia and China strongly deny accusations of intellectual property theft or cyber espionage. However, in light of NSA activities as revealed by the 2013 Edward Snowden saga that the US spied on Germany and Brazil, China and Russia have become emboldened to accuse the US of obvious hypocrisy.\nIt is no longer a secret that the US, Russia, China, Israel, and North Korea are engaged in a ruthless, secret and potentially dangerous cyber struggle. By 2016, the Pentagon's IT and cyber programs increased seven-fold in spending from $13.3 million in 2015 to $84 million in 2016. To further underscore the resolve of the US Government to do everything possible to mitigate the threat of cyber war, the CIA announced in 2015 their first new Directorate in fifty years, namely the Directorate for Digital Innovation. The problem we face is that no-one knows exactly what the real threat is and because of that there is a strong temptation to throw taxpayers' money at some ill-defined enemy. As an alternative to conventional warfare, cyberwar is a new, ill-defined form of warfare with intelligence at its cutting edge. As the threat of hybrid warfare is increasingly growing to replace conventional warfare, a cyber-attack has become the main disabling weapon.\nAnd especially in smaller nations, we must not only protect ourselves from direct cyber threats from both terrorist groups and other nation-states, but from the potential collateral damage resulting from larger powers' use of cyber weapons both in warfare and in so-called hybrid conflict short of war.\nThe era of cyber war has introduced weapons of mass disruption as opposed to conventional war's weapons of mass destruction. Weapons of mass disruption are often targeted, such as the\"Stuxnet\"example, specialized, ongoing, secret, and may range from the level of a crime and a nuisance like specialized ransomware to a complete shutdown of critical infrastructure in the case of cyber-physical attacks. On the other hand, weapons of mass destruction can cause huge casualties such as the case of Hiroshima and Nagasaki, are indiscriminate, transparent, fall clearly into the category of warfare, and are strategic.\n\n## THE FUTURE OF CYBERWARFARE\nWhat does the cyber weapon of the future look like? While no one can say with certainty, here are a few of the considerations that nations large and small should keep in mind to protect national and human security in this period of cyber proliferation and cyber escalation.\nFirst, we have already seen most of the individual weapons, as outlined in the sections above, from ransomware and trojan viruses to industrial attacks and disinformation. What will be different in an all‐out cyberwar is the massive aggregation of cyber weapons in a coordinated barrage of attacks . Ransomware attacks launched broadly against hospitals, public safety, banks, transportation and logistics firms, and local governments have already increased 235% from 2018 to 2019, while we are supposedly at peace (HIPAA Journal, 2019), and remote access trojan attacks are up 650% during the same period. Highly targeted attacks on industrial control systems, power and water distribution in major cities based on precursors like the Iranian and Russian power grid attacks and Stuxnet; information operations and disinformation campaigns aimed at social media and traditional news outlets; and massive denial of service attacks against stock markets and major telecommunications providers.\nHuman security concerns recognize the conditions that menace survival , such as attacks on power/water supply, medical systems, or other physical systems that could endanger public health . Physical, personal, and community security are affected by loss of trust in system, and violent or disruptive acts have a “negative impact on social cohesion,” irrespective of whether it is committed by state or non‐state actors .\nInformation operations and info warfare can achieve scale and speed never before possible, as Kopp predicted almost 20 years ago  — for example, did fake postings on Facebook impact the US election ? And imagine the impact of all that going on, while simultaneously experiencing traditional kinetic attacks against key military and political targets on the ground from artillery, missiles and good‐old‐fashioned bombs. We predict that future warfare is not just cyberwar but cyber plus war. It is not War 2.0 or 3.0, but War to the second or third power, exponentially more devastating than traditional or even nuclear weapons alone.\nInternational Journal of Cyber Warfare and Terrorism\nVolume 9 • Issue 3 • July-September 2019\nSecond, social engineering and traditional human intelligence operations will continue to grow in importance in cyber warfare. Releasing targeted weapons over the Internet is complicated by considerations of collateral damage, as was the case in Stuxnet (Farwell &amp; Rohozinski, 2011) and several ransomware attacks, and it increases the risk of detection and neutralization by third parties . Human intelligence operatives will continue to be able to deliver portable USB drives and other physical electronic devices, combined with ever-evolving remote delivery systems like drones, as well as local social engineering attacks, to gain access to even air-gapped, non-networked systems like those in sensitive government, military, and public utility company operations . Cyber operators will not likely replace intelligence operatives, as some have envisioned; rather, they will rely even more heavily upon their human intel colleagues, both to bring sensitive information to the table, and to deliver targeted electronic payloads where signals, wires, and fiber optic cables may not reach.\nThird, cyber defense will evolve and morph almost as rapidly as the shifting cyber landscape. Vigilant cyber hygiene and aggressive patching and updating of systems are not enough. We must also expand and accelerate cyber operations training for professionals in the military, in government, and in corporations (De Borchgrave et al., 2001). Currently, there is a global skills gap of over 1 million unfilled cyber jobs growing to a shortfall of 3.5 million skilled cyber professionals by 2021 , and we cannot just throw money at cyber if there is no workforce to carry out the mission .\nWe must become orders of magnitude better both at cyber threat hunting and at sharing information on likely cyber-attacks and vulnerabilities between national agencies and private industry (De Borchgrave et al., 2001). The US has begun efforts toward this end, but it may be hindered by its size; this is an area that smaller nations could potentially do better than their traditionally more powerful peers . Smaller nations will continue to suffer collateral damage as major cyber powers and cybercriminals inflict damage on larger targets, and so these smaller countries must use their size and speed to their advantage to detect and defend against cyberattacks.\nFinally, cyber warfare will continue to be exacerbated, and to some extent obscured, by traditional cybercrime and espionage , which we can only characterize with the word \"more\". More denial of service attacks , more Internet of Things (IoT) device-related attacks, which increased by 600% and 217.5% in 2018 and 2019, respectively , more ransomware and crypto attacks (HIPAA Journal, 2019), more targeted attacks against specific infrastructure and devices , and more information warfare . Examining these trends, we can only predict more disruption, more annoyance, more danger to our economies, our borders and biosecurity, our food, energy and natural resources, our transportation and communication, and even our public health, physical and political security.\n\nVolume 9 • Issue 3 • July-September 2019 # CONCLUSION Cyber is deeply enmeshed and interwoven across both national and human security concerns. In the interests of more cyber threat awareness, we propose that tabletop exercises and cyber simulations for political leaders, armed forces, police, and critical infrastructure personnel down to the local government level be conducted regularly. Awareness training for civil and municipal government employees should be the norm and not the exception. Telecom companies and device manufacturers can assist in the prevention of malware, phishing, and network-borne attacks by being proactive in our combined efforts to mitigate those attacks and to share information with government agencies in a more concerted and immediate manner.\nMoreover, technology and cyber education in schools should become part of the core curriculum. The moment our fingers touch a keyboard or touchscreen, or the moment we use our voices to interact with the technology listening in our cars, homes or smartphones, irrespective of our educational discipline, we are exposed and vulnerable to a cyber-attack. Individual responsibility can mitigate national cybersecurity threats collectively, but we must make a collective effort to develop a new generation of cyber heroes, cyber guardians, and cyber professionals. An uneducated populace is a luxury developed nations can no longer afford. It is our sincerest hope that discussion and acknowledgment of the scope of future war, and that public, academic publications like this one can spark the kinds of national policy debates that can energize our collective will to prepare for the next generation of cyber warfare that is already at our doorstep, that we have already seen in part, but that has the potential to forever change our future and our children's future.\n\nVolume 9 • Issue 3 • July-September 2019"
    }
  },
  "citation_summary": {
    "style": "author_year",
    "dominant_bucket": "author_year",
    "dominant": {
      "intext_total": 53.0,
      "success_occurrences": 52.0,
      "success_unique": 41.0,
      "bib_unique_total": 99.0,
      "occurrence_match_rate": 0.9811320754716981,
      "bib_coverage_rate": 0.41414141414141414,
      "success_percentage": 98.11,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "author_year"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "numeric": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 53.0,
        "success_occurrences": 52.0,
        "success_unique": 41.0,
        "bib_unique_total": 99.0,
        "occurrence_match_rate": 0.9811320754716981,
        "bib_coverage_rate": 0.41414141414141414,
        "success_percentage": 98.11,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "The Impact of Cyber-Physical Warfare on Global Human Security",
    "subtitle": "Bryson R. Payne, University of North Georgia, Dahlonega, USA",
    "document_type": "journal_article",
    "venue": "International Journal of Cyber Warfare and Terrorism",
    "publication_year": 2019,
    "authors": [],
    "affiliations": [
      "Bryson R. Payne, University of North Georgia, Dahlonega, USA",
      "Edward L. Mienie, University of North Georgia, Dahlonega, USA"
    ],
    "emails": [],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "Cyber is deeply enmeshed and interwoven across national security, as evidenced by its inclusion in the national security policies of a growing number of OECD countries. But it is the impact of cyber across the other components of national and human security that remains to be sufficiently addressed at the national policy level, or in international standards of behavior with respect to cyberwarfare and hybrid conflict. In addition to standing on its own as a national security concern, cybersecurity impacts economic and trade security, ecological/environmental and biosecurity, energy and critical infrastructure security, food security, transportation, and public health, as well as communications, physical and even political security. This work examines the role of threats from cyberwarfare, hybrid conflict, and cyber-physical attacks across human security from a national and global perspective, makes near-term predictions about the future of cyberwarfare, and provides recommendations with respect to preparing for cyberwarfare and ongoing hybrid conflict.",
    "keywords": [
      "Asymmetric Warfare",
      "Attribution",
      "Cyber Intelligence",
      "Cyber-Physical Attacks",
      "Cybersecurity",
      "Cyberwarfare",
      "Denial of Service",
      "Hybrid Conflict"
    ],
    "publication_dates": {},
    "identifiers": {
      "doi": [
        "10.4018/IJCWT.2019070103",
        "10.1257/jep.31.2.211",
        "10.1002/wmh3.19",
        "10.1109/TSG.2017.2702125",
        "10.1007/978-3-319-90443-6_13",
        "10.1080/00396338.2011.555586",
        "10.1080/02684527.2018.1479345",
        "10.1080/01402390.2011.608939",
        "10.1080/01402390.2014.977382",
        "10.1093/acprof:oso/9780190221072.003.0003",
        "10.5325/jinfopoli.7.2017.0228",
        "10.1080/08850607.2018.1524248"
      ],
      "issn": [],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": []
    },
    "references_block_count": 1,
    "references_entries_estimated": 40,
    "heading_count": 13,
    "max_heading_level": 2,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [
        "no_authors"
      ],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 53,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 1.0,
      "footnote_coverage": 0.9811320754716981,
      "unique_index_count": 42
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "author_year",
      "recommended_style": "author_year",
      "aligned": true,
      "signals": {
        "superscript_hits": 0,
        "superscript_definition_lines": 0,
        "numeric_bracket_hits": 0,
        "numeric_endnote_lines": 0,
        "author_year_hits": 43
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 99.0,
      "dominant_bib_coverage_rate": 0.41414141414141414,
      "dominant_link_target": "bibliography",
      "dominant_unresolved_flag": "unresolved_reference_links"
    },
    "heading_validation": {
      "heading_count": 13,
      "max_heading_level": 2,
      "level_jump_violations": 0,
      "numbering_parent_violations": 0,
      "has_reference_heading": true,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": false,
        "affiliations": true,
        "emails": false,
        "orcids": false,
        "abstract": true,
        "keywords": true,
        "venue": true,
        "persistent_identifier": true,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 0,
        "affiliations": 2,
        "emails": 0,
        "orcids": 0,
        "keywords": 8,
        "doi": 12,
        "issn": 0,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 0
      },
      "coverage": {
        "core_coverage": 0.8333333333333334,
        "email_author_link_rate": 0.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [
          "no_authors"
        ],
        "toc_dot_lines": 0
      },
      "flags": [
        "meta_missing_authors"
      ]
    },
    "flags": [
      "unresolved_reference_links",
      "low_bib_coverage",
      "meta_missing_authors"
    ]
  },
  "updated_at_utc": "2026-02-14T08:29:03.125758+00:00"
}