{
  "pdf_path": "C:\\Users\\luano\\Zotero\\storage\\X485738N\\Zilincik et al. - 2019 - Cyber power and control a perspective from strategic theory.pdf",
  "custom_id": "491",
  "response": {
    "id": "batch-b6235e9e-492-f3c31b44-551d-4bd4-bec8-33bd8a5fb4a5",
    "custom_id": "491",
    "response": {
      "status_code": 200,
      "body": {
        "pages": [
          {
            "index": 0,
            "markdown": "CYBER POLICY\n\nJournal of Cyber Policy\n\nRoutledge Taylor &amp; Francis Group\n\nISSN: 2373-8871 (Print) 2373-8898 (Online) Journal homepage: www.tandfonline.com/journals/rcyb20\n\n# Cyber power and control: a perspective from strategic theory\n\nSamuel Zilincik, Michael Myklin &amp; Petr Kovanda\n\nTo cite this article: Samuel Zilincik, Michael Myklin &amp; Petr Kovanda (2019) Cyber power and control: a perspective from strategic theory, Journal of Cyber Policy, 4:2, 290-301, DOI: 10.1080/23738871.2019.1635177\n\nTo link to this article: https://doi.org/10.1080/23738871.2019.1635177\n\nPublished online: 07 Jul 2019.\n\nSubmit your article to this journal\n\nArticle views: 840\n\nView related articles\n\nView Crossmark data\n\nCiting articles: 1 View citing articles\n\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rcyb20",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 2314,
              "width": 1762
            }
          },
          {
            "index": 1,
            "markdown": "JOURNAL OF CYBER POLICY\n2019, VOL. 4, NO. 2, 290-301\nhttps://doi.org/10.1080/23738871.2019.1635177\n\nRoutledge Taylor &amp; Francis Group\n\nCheck for updates\n\n# Cyber power and control: a perspective from strategic theory\n\nSamuel Zilincikᵃ, Michael Myklinᵃ and Petr Kovandaᵇ\n\nᵃMasarykova Univerzita Fakulta socialnich studii; ᵇIng Univerzita obrany\n\n## ABSTRACT\n\nCyber power has not been sufficiently examined from the perspective of strategic theory. This research aims to fill this gap by closely analysing the connection between cyber power and the concept of control. For this purpose, the authors use the method of theoretical analysis augmented by an examination of particular historical examples. The findings indicate that cyber sabotage and cyber subversion may be able to produce varying levels of control depending on the particular context of each situation. Cyber espionage alone is unable to produce any level of control, but it may enable other instruments to achieve a level of control.\n\n## ARTICLE HISTORY\n\nReceived 15 October 2018\nRevised 21 February 2019\nAccepted 11 May 2019\n\n## KEYWORDS\n\nCyber power; strategy; control; espionage; subversion; sabotage\n\n# Introduction\n\nWhile the destructive potentials of cyber and nuclear power are vastly dissimilar, they do share one key attribute. They both attract flocks of thinkers, academics, analysts and journalists, and intrude into almost every aspect of contemporary thinking about security and strategy. In fields such as security studies and international relations, concepts related to cyberspace are securing their place among deterrence and conflict theories (Karatzogianni 2009; Kello 2013; Singer and Friedman 2014; Valeriano and Maness 2014). Cyber has gradually become a buzzword¹ yet journalists and policymakers often fail to understand the basics of the technology involved in cybersecurity even though they are directly engaged in cyber policymaking (Valeriano and Maness 2015, 3–19).²\n\nThere is one related field of study where the trend still has not become the dominant issue. In strategic studies, that unique discipline at the borderline between political science and military history, hot topics are sometimes much slower to gain traction or credit. The source of this scepticism within the community may lie in the frequent engagement with supposedly novel concepts, which often fail rigorous conceptual scrutiny.³\n\nOn the other hand, this scepticism may have consequences that might be damaging to the long-term development of the field. As Strachan (2008, 8) points out, strategy is the best tool for understanding the character of any war and then managing it. Without delving deep into the debate of whether cyber activities can indeed constitute an instance of war⁴, it is reasonable to expect that strategy may also be necessary to understand conflicts taking place in cyberspace. Conversely, the lack of attention dedicated to cyber power may hinder the fulfilment of the primary purpose of strategy.\n\n© 2019 Chatham House",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1953,
              "width": 1371
            }
          },
          {
            "index": 2,
            "markdown": "Not much work has been done towards understanding cyber power from the perspective of strategic theory, especially compared to the research conducted on the topics of land power, naval power and air power. The main reason for this relative lack of research may be that most contemporary strategists feel very uncertain about the new domain and they lack technical expertise or the will to explore it (Gray 2013, 6). Another reason might be that they tend to give priority to other domains of warfare, because they consider those to be much more influential in shaping the character of contemporary warfare (Ibid.). On the other hand, cyber specialists and technicians often lack sound education in strategic theory, and so they tend to examine cyber power solely from technological and tactical perspectives (Gray 2013, 6--7).\n\nThe purpose of this article is to fill this gap in the discussion at least partially. We aim to examine the concept of control and its relation to cyber power. The following questions will guide the research: Are operations in cyberspace able to achieve some measure of control over an adversary? If so, what level of control can they produce? Answers to these questions should provide a valuable contribution to the missing link between general strategic theory and the new domain of warfare.\n\nThe methodology of the research will be as follows. First, the concept of control will be examined through the lenses of conceptual history. In the process, the concept will be operationalised in order to enable the measurement of different levels of control. Then a theoretical analysis will be employed to evaluate three basic tactical cyber activities in terms of their potential for producing control in the abstract setting. Following this, the findings from the previous chapter will be reflected upon in the light of real-world impediments to the successful production of control. The data for characteristics of cyber power have been collected from expert monographs and articles describing particular qualities of cyber power. The data for strategic theory have been derived from the volumes of various strategic thinkers throughout military history.\n\nThe article is loosely divided into a theoretical part and an empirical part. In the former, the authors introduce and conceptualise the fundamental concepts of both control and cyber power and analyse their components. In the latter, the authors analyse cyber power using the tools introduced in the theoretical part. The second analysis then follows, focused on real-world impediments to the exercise of control. In conclusion, the findings are summarised and avenues for further research are discussed.\n\n### Definitions and concepts\n\nThe concept of control over an adversary was first introduced into the literature on strategic theory by Admiral J. C. Wylie, who in this regard had been intellectually inspired by the writings of Herbert Rosinski. In Military Strategy: A General Theory of Power Control, the concept constitutes a crucial element of Wylie's strategic theory. He first introduces the concept as the second of four fundamental assumptions about war in general. Here Wylie famously claims that ‘the aim of war is some measure of control over the enemy.' (Wylie 1967, 66) Discussing the means by which this effect is to be achieved, Wylie claims that: ‘The ultimate determinant in war is the man on the scene with the gun. This man is the final power in war. He is in control. He determines who wins.' (Wylie 1967, 72)\n\nMoving on, Wylie clarified that it is, in fact, the control of the strategic weights, or centres of gravity, in any war, which is the fundamental key to the conduct of warfare.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1953,
              "width": 1371
            }
          },
          {
            "index": 3,
            "markdown": "He then summarises his general theory in the following terms: ‘The primary aim of the strategist in the conduct of war is some selected degree of control of the enemy for the strategist's own purpose, this is achieved by control of the pattern of war, and this control of the pattern of war is had by manipulation of the centre of gravity of war to the advantage of the strategist and the disadvantage of the opponent ... The successful strategist is the one who controls the nature and the placement and the timing and the weight of the centres of gravity of war, and who exploits the resulting control of the pattern of war toward his own ends.' (Wylie 1967, 77) Stated more clearly, control is the desired effect, which needs to be produced, while the manipulation of centres of gravity and of the overall patterns of war constitutes the means to achieve this purpose (Wylie 1967, 77).\n\nWylie never really defines what he means by the centre of gravity (CoG). From the way he uses the term, it can be deduced that he considers it to be the most important theatre of war, though it may not necessarily reside in the physical realm (Wylie 1967, 89--90). He borrows this concept from Carl von Clausewitz, who defines it in several contradictory and not particularly helpful ways (Clausewitz 2000). One of the most authoritative modern interpreters of Clausewitz defines the concept as: ‘a focal point, the destruction of which leads to the collapse of the whole enemy's endeavour' (Echevarria 2007, 184--185). This definition is in line both with some of Clausewitz's ideas and with Wylie's assertion that the manipulation of this point can influence the general patterns of war. For this reason, Echevarria's definition of the centre of gravity will be used throughout this article.\n\nFrom its introduction, the concept gradually gained popularity among military professionals and academics in the field of strategic studies. Nowadays, the concept is regularly employed by several contemporary strategic thinkers such as Gray (1999), Lonsdale (2007) and Milevski (2015, 81) operationalised the concept into a useful analytical tool. The author differentiates three distinct levels of control which can be achieved over the adversary. On the first level, the actor is only able to avoid being controlled by the adversary. On the second level, the actor is able to actively reduce the opponent's freedom of action. On the final level, the actor can influence the adversary's policy and force him to accept the actor's will (Milevski 2015). These three levels of control will form the overarching framework for the examination of cyber power in this paper.\n\nAnother important term to define is cyber power. There are numerous definitions offered by contemporary experts. One of them defines cyber power as ‘the ability to use cyberspace to create advantages and influence events in all the operational environments and across the instruments of power.' (Kuehl 2009, 35). Colin Gray (2013, 9) says essentially the same thing, only in much more simple language: ‘Cyber power is the ability to do something strategically useful in cyber space.' Both definitions capture the essence associated with the utilisation of cyber operations for the generation of control. For the sake of expediency, this research will operate with Gray's definition.\n\nIt is also necessary to examine the tools by which cyber power can be exercised. There are three basic activities through which an actor can ‘do something useful in cyberspace'. The trio is composed of subversion, espionage and sabotage (Rid 2012, 15). Rid defines sabotage as: ‘a deliberate attempt to weaken or destroy an economic or military system.' He defines espionage as: ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information.' Subversion is then ‘a deliberate attempt to undermine the authority, the integrity, and the constitution of an established",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1953,
              "width": 1371
            }
          },
          {
            "index": 4,
            "markdown": "authority or order' (Rid 2012, 16--22). In the following analysis, each kind of action will be examined for its potential to produce control.\n\nWhen looking for real-world impediments to the production of control, one can do worse than to consult Carl von Clausewitz. According to the Prussian's theory, every war in human history has been composed of three constantly interacting elements: passions, chance and reason (Clausewitz 2000, 282). This trinity is an excellent tool for understanding the specific character of any conflict, but it may also be suitable for casting some light on real-world difficulties in exercising control. This is because there is no good reason to assume that any of these real-world impediments is missing from the conflicts taking place in cyberspace, as any conflict in that space is only relevant when it impacts the lives of humans.\n\n### Exercising cyber power in an abstract setting\n\n### Sabotage and control\n\nSabotage has been defined as ‘a deliberate attempt to weaken or destroy an economic or military system.' The main characteristic of sabotage is its capability to destroy things. This capability is closely related to the technical development and dependency of a particular society and its government and military (Rid 2012, 16). Due to this characteristic, the capability of sabotage to achieve any level of control depends on the technological sophistication of the adversary. It has been observed by one scholar of strategy that cyber power can cause serious destruction through sabotage (Echevarria 2017, 104). However, the kind of destruction produced by cyber sabotage is often unintended and very imprecise (Libicki 2007, 72). Echevarria (2017, 104) agrees that the destruction caused by sabotage usually constitutes only collateral damage. Hence destruction can be produced, but it is not automatically converted into control.\n\nWith regard to the first level of control, sabotage arguably cannot stop the adversary from exercising his control unless that control depends on his technology. In cases when some sophisticated technology does play a role in the adversary's ability to control our actions, it may be possible to eliminate that control through the destruction of the very instruments that guarantee that control. Possession of nuclear weapons may be a fine example of this scenario. If the adversary owns some of these weapons and we do not, he may be able to achieve control over us by a threat of nuclear attack. However, when we use cyber sabotage to destroy some munition stocks or development facilities for these weapons, we may be able to completely eliminate the control he enjoys over us.\n\nRegarding the second level of control, the destructive power of cyber sabotage may also be able to reduce the opponent's freedom of action, as it may effectively disarm him. This disarmament is produced by the destruction of important pieces of weaponry or facilities for its production. The most well-known case of cyber sabotage, Stuxnet, indicates that it may be possible to impair an adversary's freedom of action by this kind of disarmament (Carr 2012; Singer and Friedman 2014, 114--120). On the other hand, the effects of the sabotage, in this case, were only temporary and within a year Iran more than recovered from the attack (Sanger 2018).\n\nRegarding the third level of control, it is highly questionable whether the sheer destructive potential of sabotage may be enough to control an adversary's policy. His will may or",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1953,
              "width": 1371
            }
          },
          {
            "index": 5,
            "markdown": "may not be dependent on the functioning of some technological devices. This issue is further complicated by the problems of attribution associated with the exercise of cyber power (Rid and Buchanan 2014). Any form of direct coercion is thus very hard in cyber-space (Liff 2012, 414; Singer and Friedman 2014, 73). Even if we accept the idea that the population of a state can be considered its CoG, incidents of cyber sabotage conducted in recent years do not seem to have produced the third level of control. For example, in 2015 there was a cyber sabotage conducted by Russians against a segment of the Ukrainian public. In the middle of winter, some 230,000 people in Ukraine were left without electricity for a couple of hours (SANS, E-ISAC 2016). A similar situation also occurred the following year (Osborne 2018). Whether the Russian goal was to force the Ukrainian government to reconsider its halt of export of Russian natural gas, to intimidate it, or to discredit it by showing its inability to provide basic services for the population, none was achieved. Modern societies, though dependent upon many technological inventions, seem to be highly resilient in the face of the brief disruptions of basic services (Lonsdale 2004). Of course, all this might change should there emerge some rapid advancements in the destructive potential of cyber sabotage. We can only imagine how the situation in Ukraine might have turned out if the attacks had been considerably more extensive, affected millions of people and lasted longer. But for now, with specific cases on the table, the capacity of cyber sabotage to produce the third level of control, whether directly or indirectly, seems to be lacking.\n\n### Espionage and control\n\nEspionage has been defined as ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information' (Rid 2012). As such, it is the most common exercise of cyber power by several actors. This is probably because the technical requirements for espionage are less demanding than for sabotage. The main purpose of espionage is to gather information, not to directly shape the real world (Rid 2012, 20).\n\nThe simple fact that espionage is more about understanding the world than about changing it means that it cannot directly produce any level of control. That said, it still has an important potential to identify centres of gravity and thus facilitate their manipulation. As Jacobsen (2014, 20) points out, it can easily identify vulnerabilities before a conflict even begins. Subsequently, it may be possible to use espionage to gain information on how to reduce an adversary's control over us, how to reduce his freedom of action and also how to influence his policy. In this sense, espionage can be perceived as one of the key indirect enablers of all the levels of control.\n\nA good example of this comes from the Chinese attempts at espionage against the United States which were revealed to the public in 2016. In that year, a Chinese national pleaded guilty to conspiring to hack into US defence contractors' systems to steal sensitive military information, including technical documentation for the multirole fighter jet F-35 Lightning II and the tactical fighter jet F-22 Raptor (Department of Justice 2016). Thanks to this kind of espionage, China might have gained a better understanding of high-end US weapon systems and thus might be able to come up with effective countermeasures to them. This may then effectively reduce the potential of the US to exercise control over China, and it may also reduce the former's freedom of action.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1953,
              "width": 1371
            }
          },
          {
            "index": 6,
            "markdown": "Subversion and control\n\nSubversion has been defined as ‘a deliberate attempt to undermine some authority, its integrity or order in general' (Rid 2012). The main characteristic of subversion activities is that they target the cohesion of political collectives, their beliefs and mutual trust in general. Among the means of subversion, propaganda is now the most popular (Rid 2012, 22).\n\nWith regard to the first level of control, subversion, whether conducted in cyberspace or through more traditional means, seems to be able to prevent an adversary from exercising his control over us. For example, the outcome of the Vietnam War was partly influenced by this kind of information-based subversion. The population of the United States was the centre of gravity on the American side, because, due to its democratic political institutions, the polity was dependent upon public support to continue the war. Thus, when a particular kind of information was transferred to the American public via the media, this led to widespread protests against the government's policies on the domestic front. These protests then negatively affected the willingness of the US to participate in the conflict (Scott 2008).\n\nSome subversive activities of recent years have shown us that cyber subversion can produce the other two levels of control too. One example of this may be the subversive activities which took place in Libya, Egypt and several other countries in the years 2010 and 2011. Some of these activities later took the form of violent insurgencies, but the protests were first initiated and mobilised by the use of social media (Mitchell, Brown, and Guskin 2012). In the end, these activities not only reduced governments' freedom of action but also directly influenced their policies (Korotayev, Meshcherina, and Shishkina 2018). Similarly, Milevski (2018) hypothesises a similar scenario taking place in a potential conflict between NATO and Russia. He argues that in such a conflict, the Russian centre of gravity may be the public opinion of its population. Milevski also points to the fact that the Russian regime is well aware of this and that it already uses widespread censorship to prevent this from happening (Milevski 2018). Liberal democracies of the West might be even more vulnerable to this, because of the direct influence their citizens have on the state's policy and because it is much harder to enforce effective censorship in these kinds of political systems. An important illustration of this vulnerability was the hack of the emails of the US Democratic National Convention and the subsequent leakage of electronic communication to the public. The content of emails caused outrage among Democrat voters, hindered the presidential campaign of Hillary Clinton and it may also have contributed to Donald Trump's victory in the 2016 presidential election (Awad and Leiss 2018). This, though quite indirectly, could have produced control on the third level, as it effectively introduced changes to American internal and external policy.\n\n### Impediments to control posed by the real world\n\n### Calculating adversary\n\nAs Clausewitz makes clear on the first pages of his book, war can be thought of like a wrestling match on a larger scale (Clausewitz 2000, 264). Here he emphasizes the fact that war is about a dynamic interaction of belligerents, which implies that the adversary is always present. But he is not only present, he actively pursues his own objectives and tries to tailor his strategy in some rational manner (Ibid.). This is a fact that often seems to pass",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1953,
              "width": 1371
            }
          },
          {
            "index": 7,
            "markdown": "unnoticed, especially in the highly technical field of cyber. But the exercise of cyber power does not constitute an act of force against some inanimate object (though of course, the inanimate object constitutes the means). Instead, cyber power is all about influencing a thinking adversary who has his own will.\n\nThis has serious implications for the production of control in cyberspace. The presence of a thinking adversary means that all our perfectly crafted cyber operations may be countered by equally crafty defence measures. For example, it is perfectly possible that the enemy is preparing and improving his defence against our meticulously planned sophisticated sabotage, which we have prepared for so long because his own espionage operation against us revealed it. Or maybe the adversary can actively strive to improve the resilience of his population against our attempts at subversion. In the end, the very presence of an intelligent adversary also means that even if one enjoys technological superiority in one moment, this is usually only a temporary condition (Gray 2001, 36; Strachan 2013, 191). An adversary may adapt to the evolving situation and any technological advantage on one side may be erased or even reversed as a result.\n\nOne of the more important disadvantages of fighting a calculating adversary is that he does not have to keep the competition in cyberspace. He can choose to escalate the conflict in a different domain, not excluding the use of military power. Of course, this is mainly the case with states possessing considerable military capacity (Jacobsen 2014, 20). In fact, the creation and exploitation of these kinds of asymmetries is one of the fundamental functions of strategy (Milevski 2015, 79). When militarily strong states find themselves at a disadvantage in cyberspace, they can do worse than shift the conduct of warfare to the dimension they prefer, and in this way, completely remove any form of control they might have suffered from the adversary.\n\nThe adversary in conflict always has some influence on how the events unfold. Thus, it may be possible to put ourselves beyond the adversary's capacity to control us, but it is a very different thing to reduce his freedom of action or to influence his policy. The third level of control can really only be achieved if the adversary chooses to cooperate.\n\n### Uncertainty, chance and friction\n\nClausewitz argues that war, in general, is so saturated with uncertainty and chance that it is futile to search for any certainty within it. In fact, he argues that war is influenced by chance much more than any other human activity. In war, everything is quite simple in theory, but much more difficult in practice. This can be the result of both human and natural actions as well as of the inherent characteristics of instruments in use (Clausewitz 2000, 276--278). In the case of cyberspace, the technological nature of the domain contains many opportunities for chance and friction to exercise their influence.\n\nIf the manipulation of the centre of gravity is necessary to achieve some control over the adversary, then the identification of the centre of gravity is of crucial importance. However, due to constant uncertainties, the process of this identification can be much more difficult than the actor anticipates. Even if the centre of gravity is accurately identified, the dynamics of the conflict may lead to a shift of the centre of gravity at any given moment. To anticipate these changes and then to manipulate the centres of gravity might prove to be almost impossible, as pure chance can always render these attempts futile.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1953,
              "width": 1371
            }
          },
          {
            "index": 8,
            "markdown": "Another source of uncertainty and friction is inherent to the very instruments used in the cyber domain. They are hardly obedient and the results they are supposed to create may not only fail initial expectations but also produce negative effects instead. As Jacobsen (2014, 18--19) points out: ‘Computer code always does what it is programmed to do, but rarely exactly as intended.' Hence the exercises of cyber power are often prone to produce confusion rather than control (Libicki 2007, 72). This problem is augmented by the technical complications which may arise due to the large amount of time it takes for cyber instruments to take any effect.\n\n### Passions and emotions\n\nEmotions and passions can exert a powerful influence on any actor participating in war. They are often present in the very motivations which give rise to war and then they also shape its conduct. They can easily influence both individual leaders as well as the public (Clausewitz 2000, 264--268, 340--341).\n\nWhat this means for the exercise of cyber power is that even if a thinking adversary decides to cooperate and one is able to somehow bypass all the friction and uncertainty, there are still emotional elements and those can bring a lot of non-linearity into the conflict. In the case of cyber conflicts, these elements may impede rational calculation, they might multiply chance and uncertainty and they can also contribute to the escalation of violence from the cyber domain to the real world.\n\nPassions are present in any important decision-making process, which in turn is likely to be the target of any ambitious exercise of cyber power. Emotions may lead to the misidentification of the centre of gravity or its negligence and the pursuit of less important goals. Passions can also lead espionage to gather unimportant information, sabotage to target unimportant infrastructure and subversion to backfire because of cultural differences or misunderstandings.\n\n## Conclusions\n\nThis paper supports the previous findings that cyber power can be usefully analysed from the perspective of a general strategy. The findings indicate that the exercise of cyber power can, in the abstract setting, produce various levels of control over an adversary. First, sabotage in cyberspace may be able to reduce or remove the control an adversary enjoys over one's behaviour and it may also be possible to limit the adversary's freedom of action, but it does not yet seem to have the potential to directly influence his policy or to make him bow to one's will. Second, cyber subversion seems to be able to produce all three levels of control, but the effect very much depends on the political system of the adversary. Last, espionage cannot produce control, but it may serve as an enabler of any level of control by gathering the necessary information about the centre of gravity in the conflict.\n\nOn the other hand, there are also real-world impediments to the production of control. Every conflict includes an intelligent adversary, uncertainty, friction and factors of irrationality represented by emotions and passions. It is not possible to avoid these elements, whether one wants to exercise power over land, in the air, on the sea or in cyberspace. All of these elements can, in their unique ways, produce challenges that will make the production of control much harder, if not impossible. The real level of control produced by",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1953,
              "width": 1371
            }
          },
          {
            "index": 9,
            "markdown": "any kind of cyber activity ultimately depends on the particular interaction of these elements. For this reason, production is effectively unpredictable, although some trends may be identified in the future if more data about cases of cyber activities emerge.\n\nThere are several possible avenues for further research. Other scholars could aim to examine different concepts from strategic theory and their relation to cyberspace. So-called principles of war could prove to be decent candidates. Several methods could be used for this purpose. Case studies combined with the method of process-tracing could yield interesting results. A greater data set of documented cyber actions would be useful for this purpose, though it might take some time for that to emerge.\n\n## Notes\n\nThe issue of ‘cyber' semantics is well described by Futter (2018). In his article, he concludes that there is little consensus about the term ‘cyber' when it comes to the topic of national security usually spearheaded by politicians or academics. The different uses of the term in different contexts often leads to hype and bad policymaking further reinforced by the actions of the media.An example of the lack of knowledge about basic IT and cybersecurity issues in the highest political levels could be seen during the US congressional testimony of Facebook CEO Mark Zuckerberg. In this case, some of the US senators had very little idea about how Facebook and social media works (Tibken 2018). In Japan, minister Yoshitaka Sakurada in charge of cybersecurity admitted he has never used a computer in his professional life (McCurry 2018).During the last three decades there have emerged several theories about the supposedly changing nature of war (Kaldor 2013; Creveld 1991; Hoffman 2007). For example, we were told that contemporary wars are ‘new', ‘non-trinitarian' or ‘hybrid'. All of these ideas have repeatedly failed the tests of empirical accuracy and analytical utility (Kalyvas 2001; Gray 2016; Charap 2015). For this reason, many respected scholars in strategic studies are now suspicious of new concepts, especially those warning about the coming of ‘cyber' war.For those interested in this fascinating and necessary conceptual debate, the works of Rid (2012), Stone (2013), McGraw (2013) and Valeriano and Maness (2015) provide a decent introduction.Some valuable pieces have been written by Betz (2012), Echevarria (2017), Gray (2013), Henrotin (2016), Jacobsen (2014), Lonsdale (2004) and a few others.For a more detailed discussion of this inspiration, see Eccles (1965), Milevski (2012) and Rosinski (1958, 1977).Wylie hinted here that land power was special among military tools, because it provided the most direct control. He elaborated on this point later, when he made a clear distinction between the capabilities of different instruments of power to produce control. For example, he claimed that control is so strongly associated with land power because to achieve this effect is the primary purpose of the latter. He contrasted this with air power, the main purpose of which is destruction (Wylie 1967, 88).For a much deeper examination of all three of these activities, see Rid (2013, 55--113).A whole spectrum of cyberweapons exists to conduct these operations, ranging from generic weapons with low potential to more sophisticated ones with higher potential (Rid and McBurney 2012, 6). The use made of these weapons will be described to illustrate the theoretical points better, but the weapons themselves will not be examined in greater detail as that would be irrelevant for the purpose of this research.This idea is in line with Milevski's (2012, 235--239) assertion that cyber power can only ever produce the first level of control. For a possible counterpoint to this perspective, see the discussion of the concept of ‘cumulative deterrence' by Tor (2017). Tor's theoretical argumentation seems persuasive but the real-world evidence for the working of this mechanism seems insufficient so far. Another persceptive is provided by Fasana (2018).",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1953,
              "width": 1371
            }
          },
          {
            "index": 10,
            "markdown": "A good exposition of the mistaken belief in the notion that human will is rooted in the possession of some technological devices can be found in Gray (1990).This is proposed by Milevski (2018, 62) in his treatment of a potential NATO-Russian war.\n\n## Disclosure statement\n\nNo potential conflict of interest was reported by the authors.\n\n## Notes on contributors\n\nSamuel Žilinčík holds a master's degree in Security and Strategic Studies from Masaryk University in Brno, Czech Republic. In his doctoral research, he focuses on strategic theory and strategic history. He has authored and co-authored several scientific papers examining the character and nature of contemporary warfare.\n\nMichael Myklín is a doctoral student at Masaryk University in Brno, Czech Republic where he also obtained his masteŕs degree in Security and Strategy Studies. His area of interest is Russian nonlinear warfare, particularly its information and cyber aspects. He has a professional background in the field of cyber security analysis.\n\nLieutenant colonel Petr Kovanda is a leader of the Section for the Examination of the Art of War at the University of Defense. In his research he focuses on cyber operations, information warfare and the changing character of war. He has also directly participated in several missions to Iraq and Kosovo.\n\n## References\n\nAwad, M. and E. Leiss. 2018. “Did Technology Fail Us?: Security Concerns in Safeguarding Democracy.” Proceedings of the 11th International Conference on Theory and Practice of Electronic Governance. Galway, Ireland. pp. 626--630.\n\nBetz, D. 2012. “Cyberpower in Strategic Affairs: Neither Unthinkable nor Blessed.” Journal of Strategic Studies 35 (5): 689--711.\n\nCarr, J. 2012. Inside Cyber Warfare. Sebastopol: O'Reilly Media.\n\nCharap, S. 2015. “The Ghost of Hybrid War.” Survival 57 (6): 51--58.\n\nClausewitz, C. 2000. “On War.” In The Book of War: Sun-Tzu's “The Art of War” and Karl Von Clausewitz's “On War”, edited by Ralph Peters, 264--950. New York: The Modern Library.\n\nCreveld, M. V. 1991. The Transformation of War. New York: Free Press.\n\nEccles, H. 1965. Military Concepts and Philosophy. New Brunswick: Rutgers University Press.\n\nEchevarria, A. 2007. Clausewitz and Contemporary War. Oxford: Oxford University Press.\n\nEchevarria, A. 2017. Military Strategy: A Very Short Introduction. Oxford: Oxford University Press.\n\nFasana, K. 2018. “Another Manifestation of Cyber Conflict: Attaining Military Objectives Through Cyber Avenues of Approach.” Defence Studies 18 (2): 167--187.\n\nFutter, A. 2018. “‘Cyber' Semantics: why we Should Retire the Latest Buzzword in Security Studies.” Journal of Cyber Policy 3 (2): 201--216.\n\nGray, Colin S. 1990. “The Definitions and Assumptions of Deterrence: Questions of Theory and Practice.” Journal of Strategic Studies 13 (4): 1--18.\n\nGray, Colin S. 1999. Modern Strategy. Oxford: Oxford University Press.\n\nGray, Colin S. 2001. Weapons for Strategic Effect: How Important is Technology? Alabama: Air War College.\n\nGray, Colin S. 2013. Making Strategic Sense of Cyber-Power: Why the Sky is Not Falling. Carlisle: Strategic Studies Institute.\n\nGray, Colin S. 2016. The Strategy Bridge: Theory for Practice. Oxford: Oxford University Press. pp. 336.\n\nHenrotin, J. 2016. The Art of War in the Network Age. Hoboken: John Wiley & Sons, Inc.\n\nHoffman, Frank G. 2007. Conflict in the 21st Century: The Rise of Hybrid Wars. Potomac Institute for Policy Studies: Arlington.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1953,
              "width": 1371
            }
          },
          {
            "index": 11,
            "markdown": "Jacobsen, J. T. 2014. The Cyberwar Mirage and the Utility of Cyberattacks in War: How to Make Real Use of Clausewitz in the Age of Cyberspace. Copenhagen: Danish Institute for International Studies.\n\nKaldor, M. 2013. “In Defence of New Wars.” Stability: International Journal of Security and Development 2 (1): 1--16.\n\nKalyvas, S. N. 2001. “‘New' and ‘Old' Civil Wars: A Valid Distinction?” World Politics 54 (1): 99--118.\n\nKaratzogianni, A. 2009. Cyber-Conflict and Global Politics. (ed). New York: Routledge.\n\nKello, L. 2013. “The Meaning of the Cyber Revolution: Perils to Theory and Statecraft.” International Security 38 (2): 7--40.\n\nKorotayev, A. K. Meshcherina, and A. Shishkina. 2018. “A Wave of Global Sociopolitical Destabilization of the 2010s: A Quantitative Analysis.” Democracy and Security 14 (4): 331--357.\n\nKuehl, D. F. 2009. “From Cyberspace to Cyberpower: Defining the Problem.” In Cyberpower and National Security, edited by F. D. Kramer, S. H. Starr, and L. K. Wentz, 24--42. Lincoln: Potomac Books.\n\nLibicki, M. C. 2007. Conquest in Cyberspace. Cambridge: Cambridge University Press.\n\nLiff, P. A. 2012. “Cyberwar: A New ‘Absolute Weapon'? The Proliferation of Cyberwarfare Capabilities and Interstate War.” Journal of Strategic Studies 35 (3): 401--428.\n\nLonsdale, D. J. 2004. The Nature of War in the Information Age. London: Frank Cass.\n\nLonsdale, D. J. 2007. Alexander the Great: Lessons in Strategy. New York: Routledge.\n\nMcCurry, J. 2018. “System error: Japan cybersecurity minister admits he has never used a computer.” The Guardian, 15th Nov. Available at: https://www.theguardian.com/world/2018/nov/15/japan-cyber-security-ministernever-used-computer-yoshitaka-sakurada.\n\nMcGraw, G. 2013. “Cyber War is Inevitable (Unless We Build Security In).” Journal of Strategic Studies 36 (1): 109--119.\n\nMilevski, L. 2012. “Revisiting J.C. Wylie's Dichotomy of Strategy: The Effects of Sequential and Cumulative Patterns of Operations.” Journal of Strategic Studies 35 (2): 223--242.\n\nMilevski, L. 2015. “Asymmetry is Strategy, Strategy is Asymmetry.” Joint Force Quarterly 75 (4): 77--83.\n\nMilevski, L. 2018. “Prospective Strategy for Baltic Defense.” Military Review 98 (1): 59--69.\n\nMitchell, A. H. Brown, and E. Guskin. 2012. “The Role of Social Media in the Arab Uprisings.” Pew Research Center. http://www.journalism.org/2012/11/28/role-social-media-arab-uprisings/.\n\nOsborne, C. 2018. “Industroyer: An in-depth look at the culprit behind Ukraine's power grid blackout.” https://www.zdnet.com/article/industroyer-an-in-depth-look-at-the-culprit-behind-ukraines-power-grid-blackout/.\n\nRid, T. 2012. “Cyber War Will Not Take Place.” Journal of Strategic Studies 35 (1): 5--32.\n\nRid, T. 2013. Cyber War Will Not Take Place. New York: Oxford University Press.\n\nRid, T. and B. Buchanan. 2014. “Attributing Cyber Attacks.” Survival 38 (1-2): 4--37.\n\nRid, T. and P. McBurney. 2012. “Cyber-Weapons.” RUSI Journal 157 (1): 6--13.\n\nRosinski, H. 1958. The Evolution of the Conduct of War and of Strategic Thinking. Newport: Naval War College.\n\nRosinski, H. 1977. The Development of Naval Thought: Essays. Newport: Naval War College Press.\n\nSanger, D. 2018. The Perfect Weapon: War, Sabotage, and Fear in the Cyber Age. New York: Crown.\n\nSANS, E-ISAC. 2016. Analysis of the Cyber Attack on the Ukrainian Power Grid. https://ics.sans.org/media/E-ISAC_SANS_Ukraine_DUC_5.pdf.\n\nScott, Anthony. 2008. The Vietnam War Era's Impact on American Society. Thesis. New York: State University of New York.\n\nSinger, P. W. and A. Friedman. 2014. Cybersecurity and Cyberwar. Oxford: Oxford University Press.\n\nStone, J. 2013. “Cyber War Will Take Place!.” Journal of Strategic Studies 36 (1): 101--108.\n\nStrachan, Hew. 2008. “Strategy as a Balancing Act.” RUSI Journal 153 (3): 6--10.\n\nStrachan, Hew. 2013. The Direction of War. Cambridge: Cambridge University Press.\n\nTibken, S. 2018. “Questions to Mark Zuckerberg show many senators don't get Facebook.” Cnet. https://www.cnet.com/news/some-senators-in-congress-capitol-hill-just-dont-get-facebook-and-mark-zuckerberg/.\n\nTor, U. 2017. “‘Cumulative Deterrence' as a New Paradigm for Cyber Deterrence.” Journal of Strategic Studies 40 (1-2): 92--117.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1953,
              "width": 1371
            }
          },
          {
            "index": 12,
            "markdown": "JOURNAL OF CYBER POLICY\n301\n\nUS Department of Justice. 2016. \"Chinese National Pleads Guilty to Conspiring to Hack into U.S. Defense Contractors' Systems to Steal Sensitive Military Information.\" https://www.justice.gov/opa/pr/chinese-national-pleads-guilty-conspiring-hack-us-defense-contractors-systems-steal-sensitive.\n\nValeriano, B., and R. Maness. 2014. \"The Dynamics of Cyber Conflict Between Rival Antagonists, 2001–11.\" Journal of Peace Research 51 (3): 347–360.\n\nValeriano, B., and R. Maness. 2015. Cyber War Versus Cyber Realities. Oxford: Oxford University Press.\n\nWylie, J. C. 1967. Military Strategy: A General Theory of Power Control. Annapolis: Naval Institute Press.",
            "images": [],
            "dimensions": {
              "dpi": 200,
              "height": 1953,
              "width": 1371
            }
          }
        ],
        "model": "mistral-ocr-latest",
        "usage_info": {
          "pages_processed": 13,
          "doc_size_bytes": 1150412
        },
        "document_annotation": null
      }
    },
    "error": null
  },
  "full_text": "CYBER POLICY\nJournal of Cyber Policy\nRoutledge Taylor &amp; Francis Group\nISSN: 2373-8871 (Print) 2373-8898 (Online) Journal homepage: www.tandfonline.com/journals/rcyb20\n# Cyber power and control: a perspective from strategic theory\nSamuel Zilincik, Michael Myklin &amp; Petr Kovanda\nTo cite this article: Samuel Zilincik, Michael Myklin &amp; Petr Kovanda (2019) Cyber power and control: a perspective from strategic theory, Journal of Cyber Policy, 4:2, 290-301, DOI: 10.1080/23738871.2019.1635177\nTo link to this article: https://doi.org/10.1080/23738871.2019.1635177\nPublished online: 07 Jul 2019.\nSubmit your article to this journal\nArticle views: 840\nView related articles\nView Crossmark data\nCiting articles: 1 View citing articles\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rcyb20\nJOURNAL OF CYBER POLICY\n2019, VOL. 4, NO. 2, 290-301\nhttps://doi.org/10.1080/23738871.2019.1635177\nRoutledge Taylor &amp; Francis Group\nCheck for updates\n# Cyber power and control: a perspective from strategic theory\nSamuel Zilincikᵃ, Michael Myklinᵃ and Petr Kovandaᵇ\nᵃMasarykova Univerzita Fakulta socialnich studii; ᵇIng Univerzita obrany\n## ABSTRACT\nCyber power has not been sufficiently examined from the perspective of strategic theory. This research aims to fill this gap by closely analysing the connection between cyber power and the concept of control. For this purpose, the authors use the method of theoretical analysis augmented by an examination of particular historical examples. The findings indicate that cyber sabotage and cyber subversion may be able to produce varying levels of control depending on the particular context of each situation. Cyber espionage alone is unable to produce any level of control, but it may enable other instruments to achieve a level of control.\n## ARTICLE HISTORY\nReceived 15 October 2018\nRevised 21 February 2019\nAccepted 11 May 2019\n## KEYWORDS\nCyber power; strategy; control; espionage; subversion; sabotage\n# Introduction\nWhile the destructive potentials of cyber and nuclear power are vastly dissimilar, they do share one key attribute. They both attract flocks of thinkers, academics, analysts and journalists, and intrude into almost every aspect of contemporary thinking about security and strategy. In fields such as security studies and international relations, concepts related to cyberspace are securing their place among deterrence and conflict theories (Karatzogianni 2009; Kello 2013; Singer and Friedman 2014; Valeriano and Maness 2014). Cyber has gradually become a buzzword¹ yet journalists and policymakers often fail to understand the basics of the technology involved in cybersecurity even though they are directly engaged in cyber policymaking (Valeriano and Maness 2015, 3–19).²\nThere is one related field of study where the trend still has not become the dominant issue. In strategic studies, that unique discipline at the borderline between political science and military history, hot topics are sometimes much slower to gain traction or credit. The source of this scepticism within the community may lie in the frequent engagement with supposedly novel concepts, which often fail rigorous conceptual scrutiny.³\nOn the other hand, this scepticism may have consequences that might be damaging to the long-term development of the field. As Strachan (2008, 8) points out, strategy is the best tool for understanding the character of any war and then managing it. Without delving deep into the debate of whether cyber activities can indeed constitute an instance of war⁴, it is reasonable to expect that strategy may also be necessary to understand conflicts taking place in cyberspace. Conversely, the lack of attention dedicated to cyber power may hinder the fulfilment of the primary purpose of strategy.\n© 2019 Chatham House\nNot much work has been done towards understanding cyber power from the perspective of strategic theory, especially compared to the research conducted on the topics of land power, naval power and air power. The main reason for this relative lack of research may be that most contemporary strategists feel very uncertain about the new domain and they lack technical expertise or the will to explore it (Gray 2013, 6). Another reason might be that they tend to give priority to other domains of warfare, because they consider those to be much more influential in shaping the character of contemporary warfare (Ibid.). On the other hand, cyber specialists and technicians often lack sound education in strategic theory, and so they tend to examine cyber power solely from technological and tactical perspectives (Gray 2013, 6--7).\nThe purpose of this article is to fill this gap in the discussion at least partially. We aim to examine the concept of control and its relation to cyber power. The following questions will guide the research: Are operations in cyberspace able to achieve some measure of control over an adversary? If so, what level of control can they produce? Answers to these questions should provide a valuable contribution to the missing link between general strategic theory and the new domain of warfare.\nThe methodology of the research will be as follows. First, the concept of control will be examined through the lenses of conceptual history. In the process, the concept will be operationalised in order to enable the measurement of different levels of control. Then a theoretical analysis will be employed to evaluate three basic tactical cyber activities in terms of their potential for producing control in the abstract setting. Following this, the findings from the previous chapter will be reflected upon in the light of real-world impediments to the successful production of control. The data for characteristics of cyber power have been collected from expert monographs and articles describing particular qualities of cyber power. The data for strategic theory have been derived from the volumes of various strategic thinkers throughout military history.\nThe article is loosely divided into a theoretical part and an empirical part. In the former, the authors introduce and conceptualise the fundamental concepts of both control and cyber power and analyse their components. In the latter, the authors analyse cyber power using the tools introduced in the theoretical part. The second analysis then follows, focused on real-world impediments to the exercise of control. In conclusion, the findings are summarised and avenues for further research are discussed.\n### Definitions and concepts\nThe concept of control over an adversary was first introduced into the literature on strategic theory by Admiral J. C. Wylie, who in this regard had been intellectually inspired by the writings of Herbert Rosinski. In Military Strategy: A General Theory of Power Control, the concept constitutes a crucial element of Wylie's strategic theory. He first introduces the concept as the second of four fundamental assumptions about war in general. Here Wylie famously claims that ‘the aim of war is some measure of control over the enemy.' (Wylie 1967, 66) Discussing the means by which this effect is to be achieved, Wylie claims that: ‘The ultimate determinant in war is the man on the scene with the gun. This man is the final power in war. He is in control. He determines who wins.' (Wylie 1967, 72)\nMoving on, Wylie clarified that it is, in fact, the control of the strategic weights, or centres of gravity, in any war, which is the fundamental key to the conduct of warfare.\nHe then summarises his general theory in the following terms: ‘The primary aim of the strategist in the conduct of war is some selected degree of control of the enemy for the strategist's own purpose, this is achieved by control of the pattern of war, and this control of the pattern of war is had by manipulation of the centre of gravity of war to the advantage of the strategist and the disadvantage of the opponent ... The successful strategist is the one who controls the nature and the placement and the timing and the weight of the centres of gravity of war, and who exploits the resulting control of the pattern of war toward his own ends.' (Wylie 1967, 77) Stated more clearly, control is the desired effect, which needs to be produced, while the manipulation of centres of gravity and of the overall patterns of war constitutes the means to achieve this purpose (Wylie 1967, 77).\nWylie never really defines what he means by the centre of gravity (CoG). From the way he uses the term, it can be deduced that he considers it to be the most important theatre of war, though it may not necessarily reside in the physical realm (Wylie 1967, 89--90). He borrows this concept from Carl von Clausewitz, who defines it in several contradictory and not particularly helpful ways (Clausewitz 2000). One of the most authoritative modern interpreters of Clausewitz defines the concept as: ‘a focal point, the destruction of which leads to the collapse of the whole enemy's endeavour' (Echevarria 2007, 184--185). This definition is in line both with some of Clausewitz's ideas and with Wylie's assertion that the manipulation of this point can influence the general patterns of war. For this reason, Echevarria's definition of the centre of gravity will be used throughout this article.\nFrom its introduction, the concept gradually gained popularity among military professionals and academics in the field of strategic studies. Nowadays, the concept is regularly employed by several contemporary strategic thinkers such as Gray (1999), Lonsdale (2007) and Milevski (2015, 81) operationalised the concept into a useful analytical tool. The author differentiates three distinct levels of control which can be achieved over the adversary. On the first level, the actor is only able to avoid being controlled by the adversary. On the second level, the actor is able to actively reduce the opponent's freedom of action. On the final level, the actor can influence the adversary's policy and force him to accept the actor's will (Milevski 2015). These three levels of control will form the overarching framework for the examination of cyber power in this paper.\nAnother important term to define is cyber power. There are numerous definitions offered by contemporary experts. One of them defines cyber power as ‘the ability to use cyberspace to create advantages and influence events in all the operational environments and across the instruments of power.' (Kuehl 2009, 35). Colin Gray (2013, 9) says essentially the same thing, only in much more simple language: ‘Cyber power is the ability to do something strategically useful in cyber space.' Both definitions capture the essence associated with the utilisation of cyber operations for the generation of control. For the sake of expediency, this research will operate with Gray's definition.\nIt is also necessary to examine the tools by which cyber power can be exercised. There are three basic activities through which an actor can ‘do something useful in cyberspace'. The trio is composed of subversion, espionage and sabotage (Rid 2012, 15). Rid defines sabotage as: ‘a deliberate attempt to weaken or destroy an economic or military system.' He defines espionage as: ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information.' Subversion is then ‘a deliberate attempt to undermine the authority, the integrity, and the constitution of an established\nauthority or order' (Rid 2012, 16--22). In the following analysis, each kind of action will be examined for its potential to produce control.\nWhen looking for real-world impediments to the production of control, one can do worse than to consult Carl von Clausewitz. According to the Prussian's theory, every war in human history has been composed of three constantly interacting elements: passions, chance and reason (Clausewitz 2000, 282). This trinity is an excellent tool for understanding the specific character of any conflict, but it may also be suitable for casting some light on real-world difficulties in exercising control. This is because there is no good reason to assume that any of these real-world impediments is missing from the conflicts taking place in cyberspace, as any conflict in that space is only relevant when it impacts the lives of humans.\n### Exercising cyber power in an abstract setting\n### Sabotage and control\nSabotage has been defined as ‘a deliberate attempt to weaken or destroy an economic or military system.' The main characteristic of sabotage is its capability to destroy things. This capability is closely related to the technical development and dependency of a particular society and its government and military (Rid 2012, 16). Due to this characteristic, the capability of sabotage to achieve any level of control depends on the technological sophistication of the adversary. It has been observed by one scholar of strategy that cyber power can cause serious destruction through sabotage (Echevarria 2017, 104). However, the kind of destruction produced by cyber sabotage is often unintended and very imprecise (Libicki 2007, 72). Echevarria (2017, 104) agrees that the destruction caused by sabotage usually constitutes only collateral damage. Hence destruction can be produced, but it is not automatically converted into control.\nWith regard to the first level of control, sabotage arguably cannot stop the adversary from exercising his control unless that control depends on his technology. In cases when some sophisticated technology does play a role in the adversary's ability to control our actions, it may be possible to eliminate that control through the destruction of the very instruments that guarantee that control. Possession of nuclear weapons may be a fine example of this scenario. If the adversary owns some of these weapons and we do not, he may be able to achieve control over us by a threat of nuclear attack. However, when we use cyber sabotage to destroy some munition stocks or development facilities for these weapons, we may be able to completely eliminate the control he enjoys over us.\nRegarding the second level of control, the destructive power of cyber sabotage may also be able to reduce the opponent's freedom of action, as it may effectively disarm him. This disarmament is produced by the destruction of important pieces of weaponry or facilities for its production. The most well-known case of cyber sabotage, Stuxnet, indicates that it may be possible to impair an adversary's freedom of action by this kind of disarmament (Carr 2012; Singer and Friedman 2014, 114--120). On the other hand, the effects of the sabotage, in this case, were only temporary and within a year Iran more than recovered from the attack (Sanger 2018).\nRegarding the third level of control, it is highly questionable whether the sheer destructive potential of sabotage may be enough to control an adversary's policy. His will may or\nmay not be dependent on the functioning of some technological devices. This issue is further complicated by the problems of attribution associated with the exercise of cyber power (Rid and Buchanan 2014). Any form of direct coercion is thus very hard in cyber-space (Liff 2012, 414; Singer and Friedman 2014, 73). Even if we accept the idea that the population of a state can be considered its CoG, incidents of cyber sabotage conducted in recent years do not seem to have produced the third level of control. For example, in 2015 there was a cyber sabotage conducted by Russians against a segment of the Ukrainian public. In the middle of winter, some 230,000 people in Ukraine were left without electricity for a couple of hours (SANS, E-ISAC 2016). A similar situation also occurred the following year (Osborne 2018). Whether the Russian goal was to force the Ukrainian government to reconsider its halt of export of Russian natural gas, to intimidate it, or to discredit it by showing its inability to provide basic services for the population, none was achieved. Modern societies, though dependent upon many technological inventions, seem to be highly resilient in the face of the brief disruptions of basic services (Lonsdale 2004). Of course, all this might change should there emerge some rapid advancements in the destructive potential of cyber sabotage. We can only imagine how the situation in Ukraine might have turned out if the attacks had been considerably more extensive, affected millions of people and lasted longer. But for now, with specific cases on the table, the capacity of cyber sabotage to produce the third level of control, whether directly or indirectly, seems to be lacking.\n### Espionage and control\nEspionage has been defined as ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information' (Rid 2012). As such, it is the most common exercise of cyber power by several actors. This is probably because the technical requirements for espionage are less demanding than for sabotage. The main purpose of espionage is to gather information, not to directly shape the real world (Rid 2012, 20).\nThe simple fact that espionage is more about understanding the world than about changing it means that it cannot directly produce any level of control. That said, it still has an important potential to identify centres of gravity and thus facilitate their manipulation. As Jacobsen (2014, 20) points out, it can easily identify vulnerabilities before a conflict even begins. Subsequently, it may be possible to use espionage to gain information on how to reduce an adversary's control over us, how to reduce his freedom of action and also how to influence his policy. In this sense, espionage can be perceived as one of the key indirect enablers of all the levels of control.\nA good example of this comes from the Chinese attempts at espionage against the United States which were revealed to the public in 2016. In that year, a Chinese national pleaded guilty to conspiring to hack into US defence contractors' systems to steal sensitive military information, including technical documentation for the multirole fighter jet F-35 Lightning II and the tactical fighter jet F-22 Raptor (Department of Justice 2016). Thanks to this kind of espionage, China might have gained a better understanding of high-end US weapon systems and thus might be able to come up with effective countermeasures to them. This may then effectively reduce the potential of the US to exercise control over China, and it may also reduce the former's freedom of action.\nSubversion and control\nSubversion has been defined as ‘a deliberate attempt to undermine some authority, its integrity or order in general' (Rid 2012). The main characteristic of subversion activities is that they target the cohesion of political collectives, their beliefs and mutual trust in general. Among the means of subversion, propaganda is now the most popular (Rid 2012, 22).\nWith regard to the first level of control, subversion, whether conducted in cyberspace or through more traditional means, seems to be able to prevent an adversary from exercising his control over us. For example, the outcome of the Vietnam War was partly influenced by this kind of information-based subversion. The population of the United States was the centre of gravity on the American side, because, due to its democratic political institutions, the polity was dependent upon public support to continue the war. Thus, when a particular kind of information was transferred to the American public via the media, this led to widespread protests against the government's policies on the domestic front. These protests then negatively affected the willingness of the US to participate in the conflict (Scott 2008).\nSome subversive activities of recent years have shown us that cyber subversion can produce the other two levels of control too. One example of this may be the subversive activities which took place in Libya, Egypt and several other countries in the years 2010 and 2011. Some of these activities later took the form of violent insurgencies, but the protests were first initiated and mobilised by the use of social media (Mitchell, Brown, and Guskin 2012). In the end, these activities not only reduced governments' freedom of action but also directly influenced their policies (Korotayev, Meshcherina, and Shishkina 2018). Similarly, Milevski (2018) hypothesises a similar scenario taking place in a potential conflict between NATO and Russia. He argues that in such a conflict, the Russian centre of gravity may be the public opinion of its population. Milevski also points to the fact that the Russian regime is well aware of this and that it already uses widespread censorship to prevent this from happening (Milevski 2018). Liberal democracies of the West might be even more vulnerable to this, because of the direct influence their citizens have on the state's policy and because it is much harder to enforce effective censorship in these kinds of political systems. An important illustration of this vulnerability was the hack of the emails of the US Democratic National Convention and the subsequent leakage of electronic communication to the public. The content of emails caused outrage among Democrat voters, hindered the presidential campaign of Hillary Clinton and it may also have contributed to Donald Trump's victory in the 2016 presidential election (Awad and Leiss 2018). This, though quite indirectly, could have produced control on the third level, as it effectively introduced changes to American internal and external policy.\n### Impediments to control posed by the real world\n### Calculating adversary\nAs Clausewitz makes clear on the first pages of his book, war can be thought of like a wrestling match on a larger scale (Clausewitz 2000, 264). Here he emphasizes the fact that war is about a dynamic interaction of belligerents, which implies that the adversary is always present. But he is not only present, he actively pursues his own objectives and tries to tailor his strategy in some rational manner (Ibid.). This is a fact that often seems to pass\nunnoticed, especially in the highly technical field of cyber. But the exercise of cyber power does not constitute an act of force against some inanimate object (though of course, the inanimate object constitutes the means). Instead, cyber power is all about influencing a thinking adversary who has his own will.\nThis has serious implications for the production of control in cyberspace. The presence of a thinking adversary means that all our perfectly crafted cyber operations may be countered by equally crafty defence measures. For example, it is perfectly possible that the enemy is preparing and improving his defence against our meticulously planned sophisticated sabotage, which we have prepared for so long because his own espionage operation against us revealed it. Or maybe the adversary can actively strive to improve the resilience of his population against our attempts at subversion. In the end, the very presence of an intelligent adversary also means that even if one enjoys technological superiority in one moment, this is usually only a temporary condition (Gray 2001, 36; Strachan 2013, 191). An adversary may adapt to the evolving situation and any technological advantage on one side may be erased or even reversed as a result.\nOne of the more important disadvantages of fighting a calculating adversary is that he does not have to keep the competition in cyberspace. He can choose to escalate the conflict in a different domain, not excluding the use of military power. Of course, this is mainly the case with states possessing considerable military capacity (Jacobsen 2014, 20). In fact, the creation and exploitation of these kinds of asymmetries is one of the fundamental functions of strategy (Milevski 2015, 79). When militarily strong states find themselves at a disadvantage in cyberspace, they can do worse than shift the conduct of warfare to the dimension they prefer, and in this way, completely remove any form of control they might have suffered from the adversary.\nThe adversary in conflict always has some influence on how the events unfold. Thus, it may be possible to put ourselves beyond the adversary's capacity to control us, but it is a very different thing to reduce his freedom of action or to influence his policy. The third level of control can really only be achieved if the adversary chooses to cooperate.\n### Uncertainty, chance and friction\nClausewitz argues that war, in general, is so saturated with uncertainty and chance that it is futile to search for any certainty within it. In fact, he argues that war is influenced by chance much more than any other human activity. In war, everything is quite simple in theory, but much more difficult in practice. This can be the result of both human and natural actions as well as of the inherent characteristics of instruments in use (Clausewitz 2000, 276--278). In the case of cyberspace, the technological nature of the domain contains many opportunities for chance and friction to exercise their influence.\nIf the manipulation of the centre of gravity is necessary to achieve some control over the adversary, then the identification of the centre of gravity is of crucial importance. However, due to constant uncertainties, the process of this identification can be much more difficult than the actor anticipates. Even if the centre of gravity is accurately identified, the dynamics of the conflict may lead to a shift of the centre of gravity at any given moment. To anticipate these changes and then to manipulate the centres of gravity might prove to be almost impossible, as pure chance can always render these attempts futile.\nAnother source of uncertainty and friction is inherent to the very instruments used in the cyber domain. They are hardly obedient and the results they are supposed to create may not only fail initial expectations but also produce negative effects instead. As Jacobsen (2014, 18--19) points out: ‘Computer code always does what it is programmed to do, but rarely exactly as intended.' Hence the exercises of cyber power are often prone to produce confusion rather than control (Libicki 2007, 72). This problem is augmented by the technical complications which may arise due to the large amount of time it takes for cyber instruments to take any effect.\n### Passions and emotions\nEmotions and passions can exert a powerful influence on any actor participating in war. They are often present in the very motivations which give rise to war and then they also shape its conduct. They can easily influence both individual leaders as well as the public (Clausewitz 2000, 264--268, 340--341).\nWhat this means for the exercise of cyber power is that even if a thinking adversary decides to cooperate and one is able to somehow bypass all the friction and uncertainty, there are still emotional elements and those can bring a lot of non-linearity into the conflict. In the case of cyber conflicts, these elements may impede rational calculation, they might multiply chance and uncertainty and they can also contribute to the escalation of violence from the cyber domain to the real world.\nPassions are present in any important decision-making process, which in turn is likely to be the target of any ambitious exercise of cyber power. Emotions may lead to the misidentification of the centre of gravity or its negligence and the pursuit of less important goals. Passions can also lead espionage to gather unimportant information, sabotage to target unimportant infrastructure and subversion to backfire because of cultural differences or misunderstandings.\n## Conclusions\nThis paper supports the previous findings that cyber power can be usefully analysed from the perspective of a general strategy. The findings indicate that the exercise of cyber power can, in the abstract setting, produce various levels of control over an adversary. First, sabotage in cyberspace may be able to reduce or remove the control an adversary enjoys over one's behaviour and it may also be possible to limit the adversary's freedom of action, but it does not yet seem to have the potential to directly influence his policy or to make him bow to one's will. Second, cyber subversion seems to be able to produce all three levels of control, but the effect very much depends on the political system of the adversary. Last, espionage cannot produce control, but it may serve as an enabler of any level of control by gathering the necessary information about the centre of gravity in the conflict.\nOn the other hand, there are also real-world impediments to the production of control. Every conflict includes an intelligent adversary, uncertainty, friction and factors of irrationality represented by emotions and passions. It is not possible to avoid these elements, whether one wants to exercise power over land, in the air, on the sea or in cyberspace. All of these elements can, in their unique ways, produce challenges that will make the production of control much harder, if not impossible. The real level of control produced by\nany kind of cyber activity ultimately depends on the particular interaction of these elements. For this reason, production is effectively unpredictable, although some trends may be identified in the future if more data about cases of cyber activities emerge.\nThere are several possible avenues for further research. Other scholars could aim to examine different concepts from strategic theory and their relation to cyberspace. So-called principles of war could prove to be decent candidates. Several methods could be used for this purpose. Case studies combined with the method of process-tracing could yield interesting results. A greater data set of documented cyber actions would be useful for this purpose, though it might take some time for that to emerge.",
  "references": [
    "## Notes\nThe issue of ‘cyber' semantics is well described by Futter (2018). In his article, he concludes that there is little consensus about the term ‘cyber' when it comes to the topic of national security usually spearheaded by politicians or academics. The different uses of the term in different contexts often leads to hype and bad policymaking further reinforced by the actions of the media.An example of the lack of knowledge about basic IT and cybersecurity issues in the highest political levels could be seen during the US congressional testimony of Facebook CEO Mark Zuckerberg. In this case, some of the US senators had very little idea about how Facebook and social media works (Tibken 2018). In Japan, minister Yoshitaka Sakurada in charge of cybersecurity admitted he has never used a computer in his professional life (McCurry 2018).During the last three decades there have emerged several theories about the supposedly changing nature of war (Kaldor 2013; Creveld 1991; Hoffman 2007). For example, we were told that contemporary wars are ‘new', ‘non-trinitarian' or ‘hybrid'. All of these ideas have repeatedly failed the tests of empirical accuracy and analytical utility (Kalyvas 2001; Gray 2016; Charap 2015). For this reason, many respected scholars in strategic studies are now suspicious of new concepts, especially those warning about the coming of ‘cyber' war.For those interested in this fascinating and necessary conceptual debate, the works of Rid (2012), Stone (2013), McGraw (2013) and Valeriano and Maness (2015) provide a decent introduction.Some valuable pieces have been written by Betz (2012), Echevarria (2017), Gray (2013), Henrotin (2016), Jacobsen (2014), Lonsdale (2004) and a few others.For a more detailed discussion of this inspiration, see Eccles (1965), Milevski (2012) and Rosinski (1958, 1977).Wylie hinted here that land power was special among military tools, because it provided the most direct control. He elaborated on this point later, when he made a clear distinction between the capabilities of different instruments of power to produce control. For example, he claimed that control is so strongly associated with land power because to achieve this effect is the primary purpose of the latter. He contrasted this with air power, the main purpose of which is destruction (Wylie 1967, 88).For a much deeper examination of all three of these activities, see Rid (2013, 55--113).A whole spectrum of cyberweapons exists to conduct these operations, ranging from generic weapons with low potential to more sophisticated ones with higher potential (Rid and McBurney 2012, 6). The use made of these weapons will be described to illustrate the theoretical points better, but the weapons themselves will not be examined in greater detail as that would be irrelevant for the purpose of this research.This idea is in line with Milevski's (2012, 235--239) assertion that cyber power can only ever produce the first level of control. For a possible counterpoint to this perspective, see the discussion of the concept of ‘cumulative deterrence' by Tor (2017). Tor's theoretical argumentation seems persuasive but the real-world evidence for the working of this mechanism seems insufficient so far. Another persceptive is provided by Fasana (2018).\nA good exposition of the mistaken belief in the notion that human will is rooted in the possession of some technological devices can be found in Gray (1990).This is proposed by Milevski (2018, 62) in his treatment of a potential NATO-Russian war.\n## Disclosure statement\nNo potential conflict of interest was reported by the authors.\n## Notes on contributors\nSamuel Žilinčík holds a master's degree in Security and Strategic Studies from Masaryk University in Brno, Czech Republic. In his doctoral research, he focuses on strategic theory and strategic history. He has authored and co-authored several scientific papers examining the character and nature of contemporary warfare.\nMichael Myklín is a doctoral student at Masaryk University in Brno, Czech Republic where he also obtained his masteŕs degree in Security and Strategy Studies. His area of interest is Russian nonlinear warfare, particularly its information and cyber aspects. He has a professional background in the field of cyber security analysis.\nLieutenant colonel Petr Kovanda is a leader of the Section for the Examination of the Art of War at the University of Defense. In his research he focuses on cyber operations, information warfare and the changing character of war. He has also directly participated in several missions to Iraq and Kosovo.\n## References\nAwad, M. and E. Leiss. 2018. “Did Technology Fail Us?: Security Concerns in Safeguarding Democracy.” Proceedings of the 11th International Conference on Theory and Practice of Electronic Governance. Galway, Ireland. pp. 626--630.\nBetz, D. 2012. “Cyberpower in Strategic Affairs: Neither Unthinkable nor Blessed.” Journal of Strategic Studies 35 (5): 689--711.\nCarr, J. 2012. Inside Cyber Warfare. Sebastopol: O'Reilly Media.\nCharap, S. 2015. “The Ghost of Hybrid War.” Survival 57 (6): 51--58.\nClausewitz, C. 2000. “On War.” In The Book of War: Sun-Tzu's “The Art of War” and Karl Von Clausewitz's “On War”, edited by Ralph Peters, 264--950. New York: The Modern Library.\nCreveld, M. V. 1991. The Transformation of War. New York: Free Press.\nEccles, H. 1965. Military Concepts and Philosophy. New Brunswick: Rutgers University Press.\nEchevarria, A. 2007. Clausewitz and Contemporary War. Oxford: Oxford University Press.\nEchevarria, A. 2017. Military Strategy: A Very Short Introduction. Oxford: Oxford University Press.\nFasana, K. 2018. “Another Manifestation of Cyber Conflict: Attaining Military Objectives Through Cyber Avenues of Approach.” Defence Studies 18 (2): 167--187.\nFutter, A. 2018. “‘Cyber' Semantics: why we Should Retire the Latest Buzzword in Security Studies.” Journal of Cyber Policy 3 (2): 201--216.\nGray, Colin S. 1990. “The Definitions and Assumptions of Deterrence: Questions of Theory and Practice.” Journal of Strategic Studies 13 (4): 1--18.\nGray, Colin S. 1999. Modern Strategy. Oxford: Oxford University Press.\nGray, Colin S. 2001. Weapons for Strategic Effect: How Important is Technology? Alabama: Air War College.\nGray, Colin S. 2013. Making Strategic Sense of Cyber-Power: Why the Sky is Not Falling. Carlisle: Strategic Studies Institute.\nGray, Colin S. 2016. The Strategy Bridge: Theory for Practice. Oxford: Oxford University Press. pp. 336.\nHenrotin, J. 2016. The Art of War in the Network Age. Hoboken: John Wiley & Sons, Inc.\nHoffman, Frank G. 2007. Conflict in the 21st Century: The Rise of Hybrid Wars. Potomac Institute for Policy Studies: Arlington.\nJacobsen, J. T. 2014. The Cyberwar Mirage and the Utility of Cyberattacks in War: How to Make Real Use of Clausewitz in the Age of Cyberspace. Copenhagen: Danish Institute for International Studies.\nKaldor, M. 2013. “In Defence of New Wars.” Stability: International Journal of Security and Development 2 (1): 1--16.\nKalyvas, S. N. 2001. “‘New' and ‘Old' Civil Wars: A Valid Distinction?” World Politics 54 (1): 99--118.\nKaratzogianni, A. 2009. Cyber-Conflict and Global Politics. (ed). New York: Routledge.\nKello, L. 2013. “The Meaning of the Cyber Revolution: Perils to Theory and Statecraft.” International Security 38 (2): 7--40.\nKorotayev, A. K. Meshcherina, and A. Shishkina. 2018. “A Wave of Global Sociopolitical Destabilization of the 2010s: A Quantitative Analysis.” Democracy and Security 14 (4): 331--357.\nKuehl, D. F. 2009. “From Cyberspace to Cyberpower: Defining the Problem.” In Cyberpower and National Security, edited by F. D. Kramer, S. H. Starr, and L. K. Wentz, 24--42. Lincoln: Potomac Books.\nLibicki, M. C. 2007. Conquest in Cyberspace. Cambridge: Cambridge University Press.\nLiff, P. A. 2012. “Cyberwar: A New ‘Absolute Weapon'? The Proliferation of Cyberwarfare Capabilities and Interstate War.” Journal of Strategic Studies 35 (3): 401--428.\nLonsdale, D. J. 2004. The Nature of War in the Information Age. London: Frank Cass.\nLonsdale, D. J. 2007. Alexander the Great: Lessons in Strategy. New York: Routledge.\nMcCurry, J. 2018. “System error: Japan cybersecurity minister admits he has never used a computer.” The Guardian, 15th Nov. Available at: https://www.theguardian.com/world/2018/nov/15/japan-cyber-security-ministernever-used-computer-yoshitaka-sakurada.\nMcGraw, G. 2013. “Cyber War is Inevitable (Unless We Build Security In).” Journal of Strategic Studies 36 (1): 109--119.\nMilevski, L. 2012. “Revisiting J.C. Wylie's Dichotomy of Strategy: The Effects of Sequential and Cumulative Patterns of Operations.” Journal of Strategic Studies 35 (2): 223--242.\nMilevski, L. 2015. “Asymmetry is Strategy, Strategy is Asymmetry.” Joint Force Quarterly 75 (4): 77--83.\nMilevski, L. 2018. “Prospective Strategy for Baltic Defense.” Military Review 98 (1): 59--69.\nMitchell, A. H. Brown, and E. Guskin. 2012. “The Role of Social Media in the Arab Uprisings.” Pew Research Center. http://www.journalism.org/2012/11/28/role-social-media-arab-uprisings/.\nOsborne, C. 2018. “Industroyer: An in-depth look at the culprit behind Ukraine's power grid blackout.” https://www.zdnet.com/article/industroyer-an-in-depth-look-at-the-culprit-behind-ukraines-power-grid-blackout/.\nRid, T. 2012. “Cyber War Will Not Take Place.” Journal of Strategic Studies 35 (1): 5--32.\nRid, T. 2013. Cyber War Will Not Take Place. New York: Oxford University Press.\nRid, T. and B. Buchanan. 2014. “Attributing Cyber Attacks.” Survival 38 (1-2): 4--37.\nRid, T. and P. McBurney. 2012. “Cyber-Weapons.” RUSI Journal 157 (1): 6--13.\nRosinski, H. 1958. The Evolution of the Conduct of War and of Strategic Thinking. Newport: Naval War College.\nRosinski, H. 1977. The Development of Naval Thought: Essays. Newport: Naval War College Press.\nSanger, D. 2018. The Perfect Weapon: War, Sabotage, and Fear in the Cyber Age. New York: Crown.\nSANS, E-ISAC. 2016. Analysis of the Cyber Attack on the Ukrainian Power Grid. https://ics.sans.org/media/E-ISAC_SANS_Ukraine_DUC_5.pdf.\nScott, Anthony. 2008. The Vietnam War Era's Impact on American Society. Thesis. New York: State University of New York.\nSinger, P. W. and A. Friedman. 2014. Cybersecurity and Cyberwar. Oxford: Oxford University Press.\nStone, J. 2013. “Cyber War Will Take Place!.” Journal of Strategic Studies 36 (1): 101--108.\nStrachan, Hew. 2008. “Strategy as a Balancing Act.” RUSI Journal 153 (3): 6--10.\nStrachan, Hew. 2013. The Direction of War. Cambridge: Cambridge University Press.\nTibken, S. 2018. “Questions to Mark Zuckerberg show many senators don't get Facebook.” Cnet. https://www.cnet.com/news/some-senators-in-congress-capitol-hill-just-dont-get-facebook-and-mark-zuckerberg/.\nTor, U. 2017. “‘Cumulative Deterrence' as a New Paradigm for Cyber Deterrence.” Journal of Strategic Studies 40 (1-2): 92--117.\nJOURNAL OF CYBER POLICY\n301\nUS Department of Justice. 2016. \"Chinese National Pleads Guilty to Conspiring to Hack into U.S. Defense Contractors' Systems to Steal Sensitive Military Information.\" https://www.justice.gov/opa/pr/chinese-national-pleads-guilty-conspiring-hack-us-defense-contractors-systems-steal-sensitive.\nValeriano, B., and R. Maness. 2014. \"The Dynamics of Cyber Conflict Between Rival Antagonists, 2001–11.\" Journal of Peace Research 51 (3): 347–360.\nValeriano, B., and R. Maness. 2015. Cyber War Versus Cyber Realities. Oxford: Oxford University Press.\nWylie, J. C. 1967. Military Strategy: A General Theory of Power Control. Annapolis: Naval Institute Press."
  ],
  "flat_text": "CYBER POLICY Journal of Cyber Policy Routledge Taylor &amp; Francis Group ISSN: 2373-8871 (Print) 2373-8898 (Online) Journal homepage: www.tandfonline.com/journals/rcyb20 # Cyber power and control: a perspective from strategic theory Samuel Zilincik, Michael Myklin &amp; Petr Kovanda To cite this article: Samuel Zilincik, Michael Myklin &amp; Petr Kovanda (2019) Cyber power and control: a perspective from strategic theory, Journal of Cyber Policy, 4:2, 290-301, DOI: 10.1080/23738871.2019.1635177 To link to this article: https://doi.org/10.1080/23738871.2019.1635177 Published online: 07 Jul 2019.\nSubmit your article to this journal Article views: 840 View related articles View Crossmark data Citing articles: 1 View citing articles Full Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rcyb20 JOURNAL OF CYBER POLICY 2019, VOL. 4, NO. 2, 290-301 https://doi.org/10.1080/23738871.2019.1635177 Routledge Taylor &amp; Francis Group Check for updates # Cyber power and control: a perspective from strategic theory Samuel Zilincikᵃ, Michael Myklinᵃ and Petr Kovandaᵇ ᵃMasarykova Univerzita Fakulta socialnich studii; ᵇIng Univerzita obrany ## ABSTRACT Cyber power has not been sufficiently examined from the perspective of strategic theory. This research aims to fill this gap by closely analysing the connection between cyber power and the concept of control. For this purpose, the authors use the method of theoretical analysis augmented by an examination of particular historical examples. The findings indicate that cyber sabotage and cyber subversion may be able to produce varying levels of control depending on the particular context of each situation. Cyber espionage alone is unable to produce any level of control, but it may enable other instruments to achieve a level of control.\n## ARTICLE HISTORY Received 15 October 2018 Revised 21 February 2019 Accepted 11 May 2019 ## KEYWORDS Cyber power; strategy; control; espionage; subversion; sabotage # Introduction While the destructive potentials of cyber and nuclear power are vastly dissimilar, they do share one key attribute. They both attract flocks of thinkers, academics, analysts and journalists, and intrude into almost every aspect of contemporary thinking about security and strategy. In fields such as security studies and international relations, concepts related to cyberspace are securing their place among deterrence and conflict theories. Cyber has gradually become a buzzword¹ yet journalists and policymakers often fail to understand the basics of the technology involved in cybersecurity even though they are directly engaged in cyber policymaking.² There is one related field of study where the trend still has not become the dominant issue. In strategic studies, that unique discipline at the borderline between political science and military history, hot topics are sometimes much slower to gain traction or credit. The source of this scepticism within the community may lie in the frequent engagement with supposedly novel concepts, which often fail rigorous conceptual scrutiny.³ On the other hand, this scepticism may have consequences that might be damaging to the long-term development of the field. As Strachan (2008, 8) points out, strategy is the best tool for understanding the character of any war and then managing it. Without delving deep into the debate of whether cyber activities can indeed constitute an instance of war⁴, it is reasonable to expect that strategy may also be necessary to understand conflicts taking place in cyberspace. Conversely, the lack of attention dedicated to cyber power may hinder the fulfilment of the primary purpose of strategy.\n© 2019 Chatham House Not much work has been done towards understanding cyber power from the perspective of strategic theory, especially compared to the research conducted on the topics of land power, naval power and air power. The main reason for this relative lack of research may be that most contemporary strategists feel very uncertain about the new domain and they lack technical expertise or the will to explore it. Another reason might be that they tend to give priority to other domains of warfare, because they consider those to be much more influential in shaping the character of contemporary warfare (Ibid.). On the other hand, cyber specialists and technicians often lack sound education in strategic theory, and so they tend to examine cyber power solely from technological and tactical perspectives.\nThe purpose of this article is to fill this gap in the discussion at least partially. We aim to examine the concept of control and its relation to cyber power. The following questions will guide the research: Are operations in cyberspace able to achieve some measure of control over an adversary? If so, what level of control can they produce? Answers to these questions should provide a valuable contribution to the missing link between general strategic theory and the new domain of warfare.\nThe methodology of the research will be as follows. First, the concept of control will be examined through the lenses of conceptual history. In the process, the concept will be operationalised in order to enable the measurement of different levels of control. Then a theoretical analysis will be employed to evaluate three basic tactical cyber activities in terms of their potential for producing control in the abstract setting. Following this, the findings from the previous chapter will be reflected upon in the light of real-world impediments to the successful production of control. The data for characteristics of cyber power have been collected from expert monographs and articles describing particular qualities of cyber power. The data for strategic theory have been derived from the volumes of various strategic thinkers throughout military history.\nThe article is loosely divided into a theoretical part and an empirical part. In the former, the authors introduce and conceptualise the fundamental concepts of both control and cyber power and analyse their components. In the latter, the authors analyse cyber power using the tools introduced in the theoretical part. The second analysis then follows, focused on real-world impediments to the exercise of control. In conclusion, the findings are summarised and avenues for further research are discussed.\n### Definitions and concepts The concept of control over an adversary was first introduced into the literature on strategic theory by Admiral J. C. Wylie, who in this regard had been intellectually inspired by the writings of Herbert Rosinski. In Military Strategy: A General Theory of Power Control, the concept constitutes a crucial element of Wylie's strategic theory. He first introduces the concept as the second of four fundamental assumptions about war in general. Here Wylie famously claims that ‘the aim of war is some measure of control over the enemy.' Discussing the means by which this effect is to be achieved, Wylie claims that: ‘The ultimate determinant in war is the man on the scene with the gun. This man is the final power in war. He is in control. He determines who wins.' Moving on, Wylie clarified that it is, in fact, the control of the strategic weights, or centres of gravity, in any war, which is the fundamental key to the conduct of warfare.\nHe then summarises his general theory in the following terms: ‘The primary aim of the strategist in the conduct of war is some selected degree of control of the enemy for the strategist's own purpose, this is achieved by control of the pattern of war, and this control of the pattern of war is had by manipulation of the centre of gravity of war to the advantage of the strategist and the disadvantage of the opponent... The successful strategist is the one who controls the nature and the placement and the timing and the weight of the centres of gravity of war, and who exploits the resulting control of the pattern of war toward his own ends.' Stated more clearly, control is the desired effect, which needs to be produced, while the manipulation of centres of gravity and of the overall patterns of war constitutes the means to achieve this purpose.\nWylie never really defines what he means by the centre of gravity (CoG). From the way he uses the term, it can be deduced that he considers it to be the most important theatre of war, though it may not necessarily reside in the physical realm. He borrows this concept from Carl von Clausewitz, who defines it in several contradictory and not particularly helpful ways. One of the most authoritative modern interpreters of Clausewitz defines the concept as: ‘a focal point, the destruction of which leads to the collapse of the whole enemy's endeavour'. This definition is in line both with some of Clausewitz's ideas and with Wylie's assertion that the manipulation of this point can influence the general patterns of war. For this reason, Echevarria's definition of the centre of gravity will be used throughout this article.\nFrom its introduction, the concept gradually gained popularity among military professionals and academics in the field of strategic studies. Nowadays, the concept is regularly employed by several contemporary strategic thinkers such as Gray (1999), Lonsdale (2007) and Milevski (2015, 81) operationalised the concept into a useful analytical tool. The author differentiates three distinct levels of control which can be achieved over the adversary. On the first level, the actor is only able to avoid being controlled by the adversary. On the second level, the actor is able to actively reduce the opponent's freedom of action. On the final level, the actor can influence the adversary's policy and force him to accept the actor's will. These three levels of control will form the overarching framework for the examination of cyber power in this paper.\nAnother important term to define is cyber power. There are numerous definitions offered by contemporary experts. One of them defines cyber power as ‘the ability to use cyberspace to create advantages and influence events in all the operational environments and across the instruments of power.'. Colin Gray (2013, 9) says essentially the same thing, only in much more simple language: ‘Cyber power is the ability to do something strategically useful in cyber space.' Both definitions capture the essence associated with the utilisation of cyber operations for the generation of control. For the sake of expediency, this research will operate with Gray's definition.\nIt is also necessary to examine the tools by which cyber power can be exercised. There are three basic activities through which an actor can ‘do something useful in cyberspace'. The trio is composed of subversion, espionage and sabotage. Rid defines sabotage as: ‘a deliberate attempt to weaken or destroy an economic or military system.' He defines espionage as: ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information.' Subversion is then ‘a deliberate attempt to undermine the authority, the integrity, and the constitution of an established authority or order'. In the following analysis, each kind of action will be examined for its potential to produce control.\nWhen looking for real-world impediments to the production of control, one can do worse than to consult Carl von Clausewitz. According to the Prussian's theory, every war in human history has been composed of three constantly interacting elements: passions, chance and reason. This trinity is an excellent tool for understanding the specific character of any conflict, but it may also be suitable for casting some light on real-world difficulties in exercising control. This is because there is no good reason to assume that any of these real-world impediments is missing from the conflicts taking place in cyberspace, as any conflict in that space is only relevant when it impacts the lives of humans.\n### Exercising cyber power in an abstract setting ### Sabotage and control Sabotage has been defined as ‘a deliberate attempt to weaken or destroy an economic or military system.' The main characteristic of sabotage is its capability to destroy things. This capability is closely related to the technical development and dependency of a particular society and its government and military. Due to this characteristic, the capability of sabotage to achieve any level of control depends on the technological sophistication of the adversary. It has been observed by one scholar of strategy that cyber power can cause serious destruction through sabotage. However, the kind of destruction produced by cyber sabotage is often unintended and very imprecise. Echevarria (2017, 104) agrees that the destruction caused by sabotage usually constitutes only collateral damage. Hence destruction can be produced, but it is not automatically converted into control.\nWith regard to the first level of control, sabotage arguably cannot stop the adversary from exercising his control unless that control depends on his technology. In cases when some sophisticated technology does play a role in the adversary's ability to control our actions, it may be possible to eliminate that control through the destruction of the very instruments that guarantee that control. Possession of nuclear weapons may be a fine example of this scenario. If the adversary owns some of these weapons and we do not, he may be able to achieve control over us by a threat of nuclear attack. However, when we use cyber sabotage to destroy some munition stocks or development facilities for these weapons, we may be able to completely eliminate the control he enjoys over us.\nRegarding the second level of control, the destructive power of cyber sabotage may also be able to reduce the opponent's freedom of action, as it may effectively disarm him. This disarmament is produced by the destruction of important pieces of weaponry or facilities for its production. The most well-known case of cyber sabotage, Stuxnet, indicates that it may be possible to impair an adversary's freedom of action by this kind of disarmament. On the other hand, the effects of the sabotage, in this case, were only temporary and within a year Iran more than recovered from the attack.\nRegarding the third level of control, it is highly questionable whether the sheer destructive potential of sabotage may be enough to control an adversary's policy. His will may or may not be dependent on the functioning of some technological devices. This issue is further complicated by the problems of attribution associated with the exercise of cyber power. Any form of direct coercion is thus very hard in cyber-space. Even if we accept the idea that the population of a state can be considered its CoG, incidents of cyber sabotage conducted in recent years do not seem to have produced the third level of control. For example, in 2015 there was a cyber sabotage conducted by Russians against a segment of the Ukrainian public. In the middle of winter, some 230,000 people in Ukraine were left without electricity for a couple of hours (SANS, E-ISAC 2016). A similar situation also occurred the following year. Whether the Russian goal was to force the Ukrainian government to reconsider its halt of export of Russian natural gas, to intimidate it, or to discredit it by showing its inability to provide basic services for the population, none was achieved. Modern societies, though dependent upon many technological inventions, seem to be highly resilient in the face of the brief disruptions of basic services. Of course, all this might change should there emerge some rapid advancements in the destructive potential of cyber sabotage. We can only imagine how the situation in Ukraine might have turned out if the attacks had been considerably more extensive, affected millions of people and lasted longer. But for now, with specific cases on the table, the capacity of cyber sabotage to produce the third level of control, whether directly or indirectly, seems to be lacking.\n### Espionage and control Espionage has been defined as ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information'. As such, it is the most common exercise of cyber power by several actors. This is probably because the technical requirements for espionage are less demanding than for sabotage. The main purpose of espionage is to gather information, not to directly shape the real world.\nThe simple fact that espionage is more about understanding the world than about changing it means that it cannot directly produce any level of control. That said, it still has an important potential to identify centres of gravity and thus facilitate their manipulation. As Jacobsen (2014, 20) points out, it can easily identify vulnerabilities before a conflict even begins. Subsequently, it may be possible to use espionage to gain information on how to reduce an adversary's control over us, how to reduce his freedom of action and also how to influence his policy. In this sense, espionage can be perceived as one of the key indirect enablers of all the levels of control.\nA good example of this comes from the Chinese attempts at espionage against the United States which were revealed to the public in 2016. In that year, a Chinese national pleaded guilty to conspiring to hack into US defence contractors' systems to steal sensitive military information, including technical documentation for the multirole fighter jet F-35 Lightning II and the tactical fighter jet F-22 Raptor (Department of Justice 2016). Thanks to this kind of espionage, China might have gained a better understanding of high-end US weapon systems and thus might be able to come up with effective countermeasures to them. This may then effectively reduce the potential of the US to exercise control over China, and it may also reduce the former's freedom of action.\nSubversion and control Subversion has been defined as ‘a deliberate attempt to undermine some authority, its integrity or order in general'. The main characteristic of subversion activities is that they target the cohesion of political collectives, their beliefs and mutual trust in general. Among the means of subversion, propaganda is now the most popular.\nWith regard to the first level of control, subversion, whether conducted in cyberspace or through more traditional means, seems to be able to prevent an adversary from exercising his control over us. For example, the outcome of the Vietnam War was partly influenced by this kind of information-based subversion. The population of the United States was the centre of gravity on the American side, because, due to its democratic political institutions, the polity was dependent upon public support to continue the war. Thus, when a particular kind of information was transferred to the American public via the media, this led to widespread protests against the government's policies on the domestic front. These protests then negatively affected the willingness of the US to participate in the conflict.\nSome subversive activities of recent years have shown us that cyber subversion can produce the other two levels of control too. One example of this may be the subversive activities which took place in Libya, Egypt and several other countries in the years 2010 and 2011. Some of these activities later took the form of violent insurgencies, but the protests were first initiated and mobilised by the use of social media (Mitchell, Brown, and Guskin 2012). In the end, these activities not only reduced governments' freedom of action but also directly influenced their policies (Korotayev, Meshcherina, and Shishkina 2018). Similarly, Milevski (2018) hypothesises a similar scenario taking place in a potential conflict between NATO and Russia. He argues that in such a conflict, the Russian centre of gravity may be the public opinion of its population. Milevski also points to the fact that the Russian regime is well aware of this and that it already uses widespread censorship to prevent this from happening. Liberal democracies of the West might be even more vulnerable to this, because of the direct influence their citizens have on the state's policy and because it is much harder to enforce effective censorship in these kinds of political systems. An important illustration of this vulnerability was the hack of the emails of the US Democratic National Convention and the subsequent leakage of electronic communication to the public. The content of emails caused outrage among Democrat voters, hindered the presidential campaign of Hillary Clinton and it may also have contributed to Donald Trump's victory in the 2016 presidential election. This, though quite indirectly, could have produced control on the third level, as it effectively introduced changes to American internal and external policy.\n### Impediments to control posed by the real world ### Calculating adversary As Clausewitz makes clear on the first pages of his book, war can be thought of like a wrestling match on a larger scale. Here he emphasizes the fact that war is about a dynamic interaction of belligerents, which implies that the adversary is always present. But he is not only present, he actively pursues his own objectives and tries to tailor his strategy in some rational manner (Ibid.). This is a fact that often seems to pass unnoticed, especially in the highly technical field of cyber. But the exercise of cyber power does not constitute an act of force against some inanimate object (though of course, the inanimate object constitutes the means). Instead, cyber power is all about influencing a thinking adversary who has his own will.\nThis has serious implications for the production of control in cyberspace. The presence of a thinking adversary means that all our perfectly crafted cyber operations may be countered by equally crafty defence measures. For example, it is perfectly possible that the enemy is preparing and improving his defence against our meticulously planned sophisticated sabotage, which we have prepared for so long because his own espionage operation against us revealed it. Or maybe the adversary can actively strive to improve the resilience of his population against our attempts at subversion. In the end, the very presence of an intelligent adversary also means that even if one enjoys technological superiority in one moment, this is usually only a temporary condition. An adversary may adapt to the evolving situation and any technological advantage on one side may be erased or even reversed as a result.\nOne of the more important disadvantages of fighting a calculating adversary is that he does not have to keep the competition in cyberspace. He can choose to escalate the conflict in a different domain, not excluding the use of military power. Of course, this is mainly the case with states possessing considerable military capacity. In fact, the creation and exploitation of these kinds of asymmetries is one of the fundamental functions of strategy. When militarily strong states find themselves at a disadvantage in cyberspace, they can do worse than shift the conduct of warfare to the dimension they prefer, and in this way, completely remove any form of control they might have suffered from the adversary.\nThe adversary in conflict always has some influence on how the events unfold. Thus, it may be possible to put ourselves beyond the adversary's capacity to control us, but it is a very different thing to reduce his freedom of action or to influence his policy. The third level of control can really only be achieved if the adversary chooses to cooperate.\n### Uncertainty, chance and friction Clausewitz argues that war, in general, is so saturated with uncertainty and chance that it is futile to search for any certainty within it. In fact, he argues that war is influenced by chance much more than any other human activity. In war, everything is quite simple in theory, but much more difficult in practice. This can be the result of both human and natural actions as well as of the inherent characteristics of instruments in use. In the case of cyberspace, the technological nature of the domain contains many opportunities for chance and friction to exercise their influence.\nIf the manipulation of the centre of gravity is necessary to achieve some control over the adversary, then the identification of the centre of gravity is of crucial importance. However, due to constant uncertainties, the process of this identification can be much more difficult than the actor anticipates. Even if the centre of gravity is accurately identified, the dynamics of the conflict may lead to a shift of the centre of gravity at any given moment. To anticipate these changes and then to manipulate the centres of gravity might prove to be almost impossible, as pure chance can always render these attempts futile.\nAnother source of uncertainty and friction is inherent to the very instruments used in the cyber domain. They are hardly obedient and the results they are supposed to create may not only fail initial expectations but also produce negative effects instead. As Jacobsen (2014, 18--19) points out: ‘Computer code always does what it is programmed to do, but rarely exactly as intended.' Hence the exercises of cyber power are often prone to produce confusion rather than control. This problem is augmented by the technical complications which may arise due to the large amount of time it takes for cyber instruments to take any effect.\n### Passions and emotions Emotions and passions can exert a powerful influence on any actor participating in war. They are often present in the very motivations which give rise to war and then they also shape its conduct. They can easily influence both individual leaders as well as the public.\nWhat this means for the exercise of cyber power is that even if a thinking adversary decides to cooperate and one is able to somehow bypass all the friction and uncertainty, there are still emotional elements and those can bring a lot of non-linearity into the conflict. In the case of cyber conflicts, these elements may impede rational calculation, they might multiply chance and uncertainty and they can also contribute to the escalation of violence from the cyber domain to the real world.\nPassions are present in any important decision-making process, which in turn is likely to be the target of any ambitious exercise of cyber power. Emotions may lead to the misidentification of the centre of gravity or its negligence and the pursuit of less important goals. Passions can also lead espionage to gather unimportant information, sabotage to target unimportant infrastructure and subversion to backfire because of cultural differences or misunderstandings.\n## Conclusions This paper supports the previous findings that cyber power can be usefully analysed from the perspective of a general strategy. The findings indicate that the exercise of cyber power can, in the abstract setting, produce various levels of control over an adversary. First, sabotage in cyberspace may be able to reduce or remove the control an adversary enjoys over one's behaviour and it may also be possible to limit the adversary's freedom of action, but it does not yet seem to have the potential to directly influence his policy or to make him bow to one's will. Second, cyber subversion seems to be able to produce all three levels of control, but the effect very much depends on the political system of the adversary. Last, espionage cannot produce control, but it may serve as an enabler of any level of control by gathering the necessary information about the centre of gravity in the conflict.\nOn the other hand, there are also real-world impediments to the production of control. Every conflict includes an intelligent adversary, uncertainty, friction and factors of irrationality represented by emotions and passions. It is not possible to avoid these elements, whether one wants to exercise power over land, in the air, on the sea or in cyberspace. All of these elements can, in their unique ways, produce challenges that will make the production of control much harder, if not impossible. The real level of control produced by any kind of cyber activity ultimately depends on the particular interaction of these elements. For this reason, production is effectively unpredictable, although some trends may be identified in the future if more data about cases of cyber activities emerge.\nThere are several possible avenues for further research. Other scholars could aim to examine different concepts from strategic theory and their relation to cyberspace. So-called principles of war could prove to be decent candidates. Several methods could be used for this purpose. Case studies combined with the method of process-tracing could yield interesting results. A greater data set of documented cyber actions would be useful for this purpose, though it might take some time for that to emerge.",
  "citations": {
    "style": "author_year",
    "flat_text": "CYBER POLICY Journal of Cyber Policy Routledge Taylor &amp; Francis Group ISSN: 2373-8871 (Print) 2373-8898 (Online) Journal homepage: www.tandfonline.com/journals/rcyb20 # Cyber power and control: a perspective from strategic theory Samuel Zilincik, Michael Myklin &amp; Petr Kovanda To cite this article: Samuel Zilincik, Michael Myklin &amp; Petr Kovanda (2019) Cyber power and control: a perspective from strategic theory, Journal of Cyber Policy, 4:2, 290-301, DOI: 10.1080/23738871.2019.1635177 To link to this article: https://doi.org/10.1080/23738871.2019.1635177 Published online: 07 Jul 2019.\nSubmit your article to this journal Article views: 840 View related articles View Crossmark data Citing articles: 1 View citing articles Full Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rcyb20 JOURNAL OF CYBER POLICY 2019, VOL. 4, NO. 2, 290-301 https://doi.org/10.1080/23738871.2019.1635177 Routledge Taylor &amp; Francis Group Check for updates # Cyber power and control: a perspective from strategic theory Samuel Zilincikᵃ, Michael Myklinᵃ and Petr Kovandaᵇ ᵃMasarykova Univerzita Fakulta socialnich studii; ᵇIng Univerzita obrany ## ABSTRACT Cyber power has not been sufficiently examined from the perspective of strategic theory. This research aims to fill this gap by closely analysing the connection between cyber power and the concept of control. For this purpose, the authors use the method of theoretical analysis augmented by an examination of particular historical examples. The findings indicate that cyber sabotage and cyber subversion may be able to produce varying levels of control depending on the particular context of each situation. Cyber espionage alone is unable to produce any level of control, but it may enable other instruments to achieve a level of control.\n## ARTICLE HISTORY Received 15 October 2018 Revised 21 February 2019 Accepted 11 May 2019 ## KEYWORDS Cyber power; strategy; control; espionage; subversion; sabotage # Introduction While the destructive potentials of cyber and nuclear power are vastly dissimilar, they do share one key attribute. They both attract flocks of thinkers, academics, analysts and journalists, and intrude into almost every aspect of contemporary thinking about security and strategy. In fields such as security studies and international relations, concepts related to cyberspace are securing their place among deterrence and conflict theories. Cyber has gradually become a buzzword¹ yet journalists and policymakers often fail to understand the basics of the technology involved in cybersecurity even though they are directly engaged in cyber policymaking.² There is one related field of study where the trend still has not become the dominant issue. In strategic studies, that unique discipline at the borderline between political science and military history, hot topics are sometimes much slower to gain traction or credit. The source of this scepticism within the community may lie in the frequent engagement with supposedly novel concepts, which often fail rigorous conceptual scrutiny.³ On the other hand, this scepticism may have consequences that might be damaging to the long-term development of the field. As Strachan (2008, 8) points out, strategy is the best tool for understanding the character of any war and then managing it. Without delving deep into the debate of whether cyber activities can indeed constitute an instance of war⁴, it is reasonable to expect that strategy may also be necessary to understand conflicts taking place in cyberspace. Conversely, the lack of attention dedicated to cyber power may hinder the fulfilment of the primary purpose of strategy.\n© 2019 Chatham House Not much work has been done towards understanding cyber power from the perspective of strategic theory, especially compared to the research conducted on the topics of land power, naval power and air power. The main reason for this relative lack of research may be that most contemporary strategists feel very uncertain about the new domain and they lack technical expertise or the will to explore it. Another reason might be that they tend to give priority to other domains of warfare, because they consider those to be much more influential in shaping the character of contemporary warfare (Ibid.). On the other hand, cyber specialists and technicians often lack sound education in strategic theory, and so they tend to examine cyber power solely from technological and tactical perspectives.\nThe purpose of this article is to fill this gap in the discussion at least partially. We aim to examine the concept of control and its relation to cyber power. The following questions will guide the research: Are operations in cyberspace able to achieve some measure of control over an adversary? If so, what level of control can they produce? Answers to these questions should provide a valuable contribution to the missing link between general strategic theory and the new domain of warfare.\nThe methodology of the research will be as follows. First, the concept of control will be examined through the lenses of conceptual history. In the process, the concept will be operationalised in order to enable the measurement of different levels of control. Then a theoretical analysis will be employed to evaluate three basic tactical cyber activities in terms of their potential for producing control in the abstract setting. Following this, the findings from the previous chapter will be reflected upon in the light of real-world impediments to the successful production of control. The data for characteristics of cyber power have been collected from expert monographs and articles describing particular qualities of cyber power. The data for strategic theory have been derived from the volumes of various strategic thinkers throughout military history.\nThe article is loosely divided into a theoretical part and an empirical part. In the former, the authors introduce and conceptualise the fundamental concepts of both control and cyber power and analyse their components. In the latter, the authors analyse cyber power using the tools introduced in the theoretical part. The second analysis then follows, focused on real-world impediments to the exercise of control. In conclusion, the findings are summarised and avenues for further research are discussed.\n### Definitions and concepts The concept of control over an adversary was first introduced into the literature on strategic theory by Admiral J. C. Wylie, who in this regard had been intellectually inspired by the writings of Herbert Rosinski. In Military Strategy: A General Theory of Power Control, the concept constitutes a crucial element of Wylie's strategic theory. He first introduces the concept as the second of four fundamental assumptions about war in general. Here Wylie famously claims that ‘the aim of war is some measure of control over the enemy.' Discussing the means by which this effect is to be achieved, Wylie claims that: ‘The ultimate determinant in war is the man on the scene with the gun. This man is the final power in war. He is in control. He determines who wins.' Moving on, Wylie clarified that it is, in fact, the control of the strategic weights, or centres of gravity, in any war, which is the fundamental key to the conduct of warfare.\nHe then summarises his general theory in the following terms: ‘The primary aim of the strategist in the conduct of war is some selected degree of control of the enemy for the strategist's own purpose, this is achieved by control of the pattern of war, and this control of the pattern of war is had by manipulation of the centre of gravity of war to the advantage of the strategist and the disadvantage of the opponent... The successful strategist is the one who controls the nature and the placement and the timing and the weight of the centres of gravity of war, and who exploits the resulting control of the pattern of war toward his own ends.' Stated more clearly, control is the desired effect, which needs to be produced, while the manipulation of centres of gravity and of the overall patterns of war constitutes the means to achieve this purpose.\nWylie never really defines what he means by the centre of gravity (CoG). From the way he uses the term, it can be deduced that he considers it to be the most important theatre of war, though it may not necessarily reside in the physical realm. He borrows this concept from Carl von Clausewitz, who defines it in several contradictory and not particularly helpful ways. One of the most authoritative modern interpreters of Clausewitz defines the concept as: ‘a focal point, the destruction of which leads to the collapse of the whole enemy's endeavour'. This definition is in line both with some of Clausewitz's ideas and with Wylie's assertion that the manipulation of this point can influence the general patterns of war. For this reason, Echevarria's definition of the centre of gravity will be used throughout this article.\nFrom its introduction, the concept gradually gained popularity among military professionals and academics in the field of strategic studies. Nowadays, the concept is regularly employed by several contemporary strategic thinkers such as Gray (1999), Lonsdale (2007) and Milevski (2015, 81) operationalised the concept into a useful analytical tool. The author differentiates three distinct levels of control which can be achieved over the adversary. On the first level, the actor is only able to avoid being controlled by the adversary. On the second level, the actor is able to actively reduce the opponent's freedom of action. On the final level, the actor can influence the adversary's policy and force him to accept the actor's will. These three levels of control will form the overarching framework for the examination of cyber power in this paper.\nAnother important term to define is cyber power. There are numerous definitions offered by contemporary experts. One of them defines cyber power as ‘the ability to use cyberspace to create advantages and influence events in all the operational environments and across the instruments of power.'. Colin Gray (2013, 9) says essentially the same thing, only in much more simple language: ‘Cyber power is the ability to do something strategically useful in cyber space.' Both definitions capture the essence associated with the utilisation of cyber operations for the generation of control. For the sake of expediency, this research will operate with Gray's definition.\nIt is also necessary to examine the tools by which cyber power can be exercised. There are three basic activities through which an actor can ‘do something useful in cyberspace'. The trio is composed of subversion, espionage and sabotage. Rid defines sabotage as: ‘a deliberate attempt to weaken or destroy an economic or military system.' He defines espionage as: ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information.' Subversion is then ‘a deliberate attempt to undermine the authority, the integrity, and the constitution of an established authority or order'. In the following analysis, each kind of action will be examined for its potential to produce control.\nWhen looking for real-world impediments to the production of control, one can do worse than to consult Carl von Clausewitz. According to the Prussian's theory, every war in human history has been composed of three constantly interacting elements: passions, chance and reason. This trinity is an excellent tool for understanding the specific character of any conflict, but it may also be suitable for casting some light on real-world difficulties in exercising control. This is because there is no good reason to assume that any of these real-world impediments is missing from the conflicts taking place in cyberspace, as any conflict in that space is only relevant when it impacts the lives of humans.\n### Exercising cyber power in an abstract setting ### Sabotage and control Sabotage has been defined as ‘a deliberate attempt to weaken or destroy an economic or military system.' The main characteristic of sabotage is its capability to destroy things. This capability is closely related to the technical development and dependency of a particular society and its government and military. Due to this characteristic, the capability of sabotage to achieve any level of control depends on the technological sophistication of the adversary. It has been observed by one scholar of strategy that cyber power can cause serious destruction through sabotage. However, the kind of destruction produced by cyber sabotage is often unintended and very imprecise. Echevarria (2017, 104) agrees that the destruction caused by sabotage usually constitutes only collateral damage. Hence destruction can be produced, but it is not automatically converted into control.\nWith regard to the first level of control, sabotage arguably cannot stop the adversary from exercising his control unless that control depends on his technology. In cases when some sophisticated technology does play a role in the adversary's ability to control our actions, it may be possible to eliminate that control through the destruction of the very instruments that guarantee that control. Possession of nuclear weapons may be a fine example of this scenario. If the adversary owns some of these weapons and we do not, he may be able to achieve control over us by a threat of nuclear attack. However, when we use cyber sabotage to destroy some munition stocks or development facilities for these weapons, we may be able to completely eliminate the control he enjoys over us.\nRegarding the second level of control, the destructive power of cyber sabotage may also be able to reduce the opponent's freedom of action, as it may effectively disarm him. This disarmament is produced by the destruction of important pieces of weaponry or facilities for its production. The most well-known case of cyber sabotage, Stuxnet, indicates that it may be possible to impair an adversary's freedom of action by this kind of disarmament. On the other hand, the effects of the sabotage, in this case, were only temporary and within a year Iran more than recovered from the attack.\nRegarding the third level of control, it is highly questionable whether the sheer destructive potential of sabotage may be enough to control an adversary's policy. His will may or may not be dependent on the functioning of some technological devices. This issue is further complicated by the problems of attribution associated with the exercise of cyber power. Any form of direct coercion is thus very hard in cyber-space. Even if we accept the idea that the population of a state can be considered its CoG, incidents of cyber sabotage conducted in recent years do not seem to have produced the third level of control. For example, in 2015 there was a cyber sabotage conducted by Russians against a segment of the Ukrainian public. In the middle of winter, some 230,000 people in Ukraine were left without electricity for a couple of hours (SANS, E-ISAC 2016). A similar situation also occurred the following year. Whether the Russian goal was to force the Ukrainian government to reconsider its halt of export of Russian natural gas, to intimidate it, or to discredit it by showing its inability to provide basic services for the population, none was achieved. Modern societies, though dependent upon many technological inventions, seem to be highly resilient in the face of the brief disruptions of basic services. Of course, all this might change should there emerge some rapid advancements in the destructive potential of cyber sabotage. We can only imagine how the situation in Ukraine might have turned out if the attacks had been considerably more extensive, affected millions of people and lasted longer. But for now, with specific cases on the table, the capacity of cyber sabotage to produce the third level of control, whether directly or indirectly, seems to be lacking.\n### Espionage and control Espionage has been defined as ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information'. As such, it is the most common exercise of cyber power by several actors. This is probably because the technical requirements for espionage are less demanding than for sabotage. The main purpose of espionage is to gather information, not to directly shape the real world.\nThe simple fact that espionage is more about understanding the world than about changing it means that it cannot directly produce any level of control. That said, it still has an important potential to identify centres of gravity and thus facilitate their manipulation. As Jacobsen (2014, 20) points out, it can easily identify vulnerabilities before a conflict even begins. Subsequently, it may be possible to use espionage to gain information on how to reduce an adversary's control over us, how to reduce his freedom of action and also how to influence his policy. In this sense, espionage can be perceived as one of the key indirect enablers of all the levels of control.\nA good example of this comes from the Chinese attempts at espionage against the United States which were revealed to the public in 2016. In that year, a Chinese national pleaded guilty to conspiring to hack into US defence contractors' systems to steal sensitive military information, including technical documentation for the multirole fighter jet F-35 Lightning II and the tactical fighter jet F-22 Raptor (Department of Justice 2016). Thanks to this kind of espionage, China might have gained a better understanding of high-end US weapon systems and thus might be able to come up with effective countermeasures to them. This may then effectively reduce the potential of the US to exercise control over China, and it may also reduce the former's freedom of action.\nSubversion and control Subversion has been defined as ‘a deliberate attempt to undermine some authority, its integrity or order in general'. The main characteristic of subversion activities is that they target the cohesion of political collectives, their beliefs and mutual trust in general. Among the means of subversion, propaganda is now the most popular.\nWith regard to the first level of control, subversion, whether conducted in cyberspace or through more traditional means, seems to be able to prevent an adversary from exercising his control over us. For example, the outcome of the Vietnam War was partly influenced by this kind of information-based subversion. The population of the United States was the centre of gravity on the American side, because, due to its democratic political institutions, the polity was dependent upon public support to continue the war. Thus, when a particular kind of information was transferred to the American public via the media, this led to widespread protests against the government's policies on the domestic front. These protests then negatively affected the willingness of the US to participate in the conflict.\nSome subversive activities of recent years have shown us that cyber subversion can produce the other two levels of control too. One example of this may be the subversive activities which took place in Libya, Egypt and several other countries in the years 2010 and 2011. Some of these activities later took the form of violent insurgencies, but the protests were first initiated and mobilised by the use of social media (Mitchell, Brown, and Guskin 2012). In the end, these activities not only reduced governments' freedom of action but also directly influenced their policies (Korotayev, Meshcherina, and Shishkina 2018). Similarly, Milevski (2018) hypothesises a similar scenario taking place in a potential conflict between NATO and Russia. He argues that in such a conflict, the Russian centre of gravity may be the public opinion of its population. Milevski also points to the fact that the Russian regime is well aware of this and that it already uses widespread censorship to prevent this from happening. Liberal democracies of the West might be even more vulnerable to this, because of the direct influence their citizens have on the state's policy and because it is much harder to enforce effective censorship in these kinds of political systems. An important illustration of this vulnerability was the hack of the emails of the US Democratic National Convention and the subsequent leakage of electronic communication to the public. The content of emails caused outrage among Democrat voters, hindered the presidential campaign of Hillary Clinton and it may also have contributed to Donald Trump's victory in the 2016 presidential election. This, though quite indirectly, could have produced control on the third level, as it effectively introduced changes to American internal and external policy.\n### Impediments to control posed by the real world ### Calculating adversary As Clausewitz makes clear on the first pages of his book, war can be thought of like a wrestling match on a larger scale. Here he emphasizes the fact that war is about a dynamic interaction of belligerents, which implies that the adversary is always present. But he is not only present, he actively pursues his own objectives and tries to tailor his strategy in some rational manner (Ibid.). This is a fact that often seems to pass unnoticed, especially in the highly technical field of cyber. But the exercise of cyber power does not constitute an act of force against some inanimate object (though of course, the inanimate object constitutes the means). Instead, cyber power is all about influencing a thinking adversary who has his own will.\nThis has serious implications for the production of control in cyberspace. The presence of a thinking adversary means that all our perfectly crafted cyber operations may be countered by equally crafty defence measures. For example, it is perfectly possible that the enemy is preparing and improving his defence against our meticulously planned sophisticated sabotage, which we have prepared for so long because his own espionage operation against us revealed it. Or maybe the adversary can actively strive to improve the resilience of his population against our attempts at subversion. In the end, the very presence of an intelligent adversary also means that even if one enjoys technological superiority in one moment, this is usually only a temporary condition. An adversary may adapt to the evolving situation and any technological advantage on one side may be erased or even reversed as a result.\nOne of the more important disadvantages of fighting a calculating adversary is that he does not have to keep the competition in cyberspace. He can choose to escalate the conflict in a different domain, not excluding the use of military power. Of course, this is mainly the case with states possessing considerable military capacity. In fact, the creation and exploitation of these kinds of asymmetries is one of the fundamental functions of strategy. When militarily strong states find themselves at a disadvantage in cyberspace, they can do worse than shift the conduct of warfare to the dimension they prefer, and in this way, completely remove any form of control they might have suffered from the adversary.\nThe adversary in conflict always has some influence on how the events unfold. Thus, it may be possible to put ourselves beyond the adversary's capacity to control us, but it is a very different thing to reduce his freedom of action or to influence his policy. The third level of control can really only be achieved if the adversary chooses to cooperate.\n### Uncertainty, chance and friction Clausewitz argues that war, in general, is so saturated with uncertainty and chance that it is futile to search for any certainty within it. In fact, he argues that war is influenced by chance much more than any other human activity. In war, everything is quite simple in theory, but much more difficult in practice. This can be the result of both human and natural actions as well as of the inherent characteristics of instruments in use. In the case of cyberspace, the technological nature of the domain contains many opportunities for chance and friction to exercise their influence.\nIf the manipulation of the centre of gravity is necessary to achieve some control over the adversary, then the identification of the centre of gravity is of crucial importance. However, due to constant uncertainties, the process of this identification can be much more difficult than the actor anticipates. Even if the centre of gravity is accurately identified, the dynamics of the conflict may lead to a shift of the centre of gravity at any given moment. To anticipate these changes and then to manipulate the centres of gravity might prove to be almost impossible, as pure chance can always render these attempts futile.\nAnother source of uncertainty and friction is inherent to the very instruments used in the cyber domain. They are hardly obedient and the results they are supposed to create may not only fail initial expectations but also produce negative effects instead. As Jacobsen (2014, 18--19) points out: ‘Computer code always does what it is programmed to do, but rarely exactly as intended.' Hence the exercises of cyber power are often prone to produce confusion rather than control. This problem is augmented by the technical complications which may arise due to the large amount of time it takes for cyber instruments to take any effect.\n### Passions and emotions Emotions and passions can exert a powerful influence on any actor participating in war. They are often present in the very motivations which give rise to war and then they also shape its conduct. They can easily influence both individual leaders as well as the public.\nWhat this means for the exercise of cyber power is that even if a thinking adversary decides to cooperate and one is able to somehow bypass all the friction and uncertainty, there are still emotional elements and those can bring a lot of non-linearity into the conflict. In the case of cyber conflicts, these elements may impede rational calculation, they might multiply chance and uncertainty and they can also contribute to the escalation of violence from the cyber domain to the real world.\nPassions are present in any important decision-making process, which in turn is likely to be the target of any ambitious exercise of cyber power. Emotions may lead to the misidentification of the centre of gravity or its negligence and the pursuit of less important goals. Passions can also lead espionage to gather unimportant information, sabotage to target unimportant infrastructure and subversion to backfire because of cultural differences or misunderstandings.\n## Conclusions This paper supports the previous findings that cyber power can be usefully analysed from the perspective of a general strategy. The findings indicate that the exercise of cyber power can, in the abstract setting, produce various levels of control over an adversary. First, sabotage in cyberspace may be able to reduce or remove the control an adversary enjoys over one's behaviour and it may also be possible to limit the adversary's freedom of action, but it does not yet seem to have the potential to directly influence his policy or to make him bow to one's will. Second, cyber subversion seems to be able to produce all three levels of control, but the effect very much depends on the political system of the adversary. Last, espionage cannot produce control, but it may serve as an enabler of any level of control by gathering the necessary information about the centre of gravity in the conflict.\nOn the other hand, there are also real-world impediments to the production of control. Every conflict includes an intelligent adversary, uncertainty, friction and factors of irrationality represented by emotions and passions. It is not possible to avoid these elements, whether one wants to exercise power over land, in the air, on the sea or in cyberspace. All of these elements can, in their unique ways, produce challenges that will make the production of control much harder, if not impossible. The real level of control produced by any kind of cyber activity ultimately depends on the particular interaction of these elements. For this reason, production is effectively unpredictable, although some trends may be identified in the future if more data about cases of cyber activities emerge.\nThere are several possible avenues for further research. Other scholars could aim to examine different concepts from strategic theory and their relation to cyberspace. So-called principles of war could prove to be decent candidates. Several methods could be used for this purpose. Case studies combined with the method of process-tracing could yield interesting results. A greater data set of documented cyber actions would be useful for this purpose, though it might take some time for that to emerge.",
    "footnotes": {
      "items": {},
      "intext": [],
      "stats": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "missing_intext_indices": [],
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "missing_footnotes_for_seen_intext": [],
        "uncited_footnote_total": 0,
        "uncited_footnote_indices": [],
        "style": "footnotes"
      }
    },
    "tex": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "CYBER POLICY\nJournal of Cyber Policy\nRoutledge Taylor &amp; Francis Group\nISSN: 2373-8871 (Print) 2373-8898 (Online) Journal homepage: www.tandfonline.com/journals/rcyb20\n# Cyber power and control: a perspective from strategic theory\nSamuel Zilincik, Michael Myklin &amp; Petr Kovanda\nTo cite this article: Samuel Zilincik, Michael Myklin &amp; Petr Kovanda (2019) Cyber power and control: a perspective from strategic theory, Journal of Cyber Policy, 4:2, 290-301, DOI: 10.1080/23738871.2019.1635177\nTo link to this article: https://doi.org/10.1080/23738871.2019.1635177\nPublished online: 07 Jul 2019.\nSubmit your article to this journal\nArticle views: 840\nView related articles\nView Crossmark data\nCiting articles: 1 View citing articles\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rcyb20\nJOURNAL OF CYBER POLICY\n2019, VOL. 4, NO. 2, 290-301\nhttps://doi.org/10.1080/23738871.2019.1635177\nRoutledge Taylor &amp; Francis Group\nCheck for updates\n# Cyber power and control: a perspective from strategic theory\nSamuel Zilincikᵃ, Michael Myklinᵃ and Petr Kovandaᵇ\nᵃMasarykova Univerzita Fakulta socialnich studii; ᵇIng Univerzita obrany\n## ABSTRACT\nCyber power has not been sufficiently examined from the perspective of strategic theory. This research aims to fill this gap by closely analysing the connection between cyber power and the concept of control. For this purpose, the authors use the method of theoretical analysis augmented by an examination of particular historical examples. The findings indicate that cyber sabotage and cyber subversion may be able to produce varying levels of control depending on the particular context of each situation. Cyber espionage alone is unable to produce any level of control, but it may enable other instruments to achieve a level of control.\n## ARTICLE HISTORY\nReceived 15 October 2018\nRevised 21 February 2019\nAccepted 11 May 2019\n## KEYWORDS\nCyber power; strategy; control; espionage; subversion; sabotage\n# Introduction\nWhile the destructive potentials of cyber and nuclear power are vastly dissimilar, they do share one key attribute. They both attract flocks of thinkers, academics, analysts and journalists, and intrude into almost every aspect of contemporary thinking about security and strategy. In fields such as security studies and international relations, concepts related to cyberspace are securing their place among deterrence and conflict theories (Karatzogianni 2009; Kello 2013; Singer and Friedman 2014; Valeriano and Maness 2014). Cyber has gradually become a buzzword¹ yet journalists and policymakers often fail to understand the basics of the technology involved in cybersecurity even though they are directly engaged in cyber policymaking (Valeriano and Maness 2015, 3–19).²\nThere is one related field of study where the trend still has not become the dominant issue. In strategic studies, that unique discipline at the borderline between political science and military history, hot topics are sometimes much slower to gain traction or credit. The source of this scepticism within the community may lie in the frequent engagement with supposedly novel concepts, which often fail rigorous conceptual scrutiny.³\nOn the other hand, this scepticism may have consequences that might be damaging to the long-term development of the field. As Strachan (2008, 8) points out, strategy is the best tool for understanding the character of any war and then managing it. Without delving deep into the debate of whether cyber activities can indeed constitute an instance of war⁴, it is reasonable to expect that strategy may also be necessary to understand conflicts taking place in cyberspace. Conversely, the lack of attention dedicated to cyber power may hinder the fulfilment of the primary purpose of strategy.\n© 2019 Chatham House\nNot much work has been done towards understanding cyber power from the perspective of strategic theory, especially compared to the research conducted on the topics of land power, naval power and air power. The main reason for this relative lack of research may be that most contemporary strategists feel very uncertain about the new domain and they lack technical expertise or the will to explore it (Gray 2013, 6). Another reason might be that they tend to give priority to other domains of warfare, because they consider those to be much more influential in shaping the character of contemporary warfare (Ibid.). On the other hand, cyber specialists and technicians often lack sound education in strategic theory, and so they tend to examine cyber power solely from technological and tactical perspectives (Gray 2013, 6--7).\nThe purpose of this article is to fill this gap in the discussion at least partially. We aim to examine the concept of control and its relation to cyber power. The following questions will guide the research: Are operations in cyberspace able to achieve some measure of control over an adversary? If so, what level of control can they produce? Answers to these questions should provide a valuable contribution to the missing link between general strategic theory and the new domain of warfare.\nThe methodology of the research will be as follows. First, the concept of control will be examined through the lenses of conceptual history. In the process, the concept will be operationalised in order to enable the measurement of different levels of control. Then a theoretical analysis will be employed to evaluate three basic tactical cyber activities in terms of their potential for producing control in the abstract setting. Following this, the findings from the previous chapter will be reflected upon in the light of real-world impediments to the successful production of control. The data for characteristics of cyber power have been collected from expert monographs and articles describing particular qualities of cyber power. The data for strategic theory have been derived from the volumes of various strategic thinkers throughout military history.\nThe article is loosely divided into a theoretical part and an empirical part. In the former, the authors introduce and conceptualise the fundamental concepts of both control and cyber power and analyse their components. In the latter, the authors analyse cyber power using the tools introduced in the theoretical part. The second analysis then follows, focused on real-world impediments to the exercise of control. In conclusion, the findings are summarised and avenues for further research are discussed.\n### Definitions and concepts\nThe concept of control over an adversary was first introduced into the literature on strategic theory by Admiral J. C. Wylie, who in this regard had been intellectually inspired by the writings of Herbert Rosinski. In Military Strategy: A General Theory of Power Control, the concept constitutes a crucial element of Wylie's strategic theory. He first introduces the concept as the second of four fundamental assumptions about war in general. Here Wylie famously claims that ‘the aim of war is some measure of control over the enemy.' (Wylie 1967, 66) Discussing the means by which this effect is to be achieved, Wylie claims that: ‘The ultimate determinant in war is the man on the scene with the gun. This man is the final power in war. He is in control. He determines who wins.' (Wylie 1967, 72)\nMoving on, Wylie clarified that it is, in fact, the control of the strategic weights, or centres of gravity, in any war, which is the fundamental key to the conduct of warfare.\nHe then summarises his general theory in the following terms: ‘The primary aim of the strategist in the conduct of war is some selected degree of control of the enemy for the strategist's own purpose, this is achieved by control of the pattern of war, and this control of the pattern of war is had by manipulation of the centre of gravity of war to the advantage of the strategist and the disadvantage of the opponent ... The successful strategist is the one who controls the nature and the placement and the timing and the weight of the centres of gravity of war, and who exploits the resulting control of the pattern of war toward his own ends.' (Wylie 1967, 77) Stated more clearly, control is the desired effect, which needs to be produced, while the manipulation of centres of gravity and of the overall patterns of war constitutes the means to achieve this purpose (Wylie 1967, 77).\nWylie never really defines what he means by the centre of gravity (CoG). From the way he uses the term, it can be deduced that he considers it to be the most important theatre of war, though it may not necessarily reside in the physical realm (Wylie 1967, 89--90). He borrows this concept from Carl von Clausewitz, who defines it in several contradictory and not particularly helpful ways (Clausewitz 2000). One of the most authoritative modern interpreters of Clausewitz defines the concept as: ‘a focal point, the destruction of which leads to the collapse of the whole enemy's endeavour' (Echevarria 2007, 184--185). This definition is in line both with some of Clausewitz's ideas and with Wylie's assertion that the manipulation of this point can influence the general patterns of war. For this reason, Echevarria's definition of the centre of gravity will be used throughout this article.\nFrom its introduction, the concept gradually gained popularity among military professionals and academics in the field of strategic studies. Nowadays, the concept is regularly employed by several contemporary strategic thinkers such as Gray (1999), Lonsdale (2007) and Milevski (2015, 81) operationalised the concept into a useful analytical tool. The author differentiates three distinct levels of control which can be achieved over the adversary. On the first level, the actor is only able to avoid being controlled by the adversary. On the second level, the actor is able to actively reduce the opponent's freedom of action. On the final level, the actor can influence the adversary's policy and force him to accept the actor's will (Milevski 2015). These three levels of control will form the overarching framework for the examination of cyber power in this paper.\nAnother important term to define is cyber power. There are numerous definitions offered by contemporary experts. One of them defines cyber power as ‘the ability to use cyberspace to create advantages and influence events in all the operational environments and across the instruments of power.' (Kuehl 2009, 35). Colin Gray (2013, 9) says essentially the same thing, only in much more simple language: ‘Cyber power is the ability to do something strategically useful in cyber space.' Both definitions capture the essence associated with the utilisation of cyber operations for the generation of control. For the sake of expediency, this research will operate with Gray's definition.\nIt is also necessary to examine the tools by which cyber power can be exercised. There are three basic activities through which an actor can ‘do something useful in cyberspace'. The trio is composed of subversion, espionage and sabotage (Rid 2012, 15). Rid defines sabotage as: ‘a deliberate attempt to weaken or destroy an economic or military system.' He defines espionage as: ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information.' Subversion is then ‘a deliberate attempt to undermine the authority, the integrity, and the constitution of an established\nauthority or order' (Rid 2012, 16--22). In the following analysis, each kind of action will be examined for its potential to produce control.\nWhen looking for real-world impediments to the production of control, one can do worse than to consult Carl von Clausewitz. According to the Prussian's theory, every war in human history has been composed of three constantly interacting elements: passions, chance and reason (Clausewitz 2000, 282). This trinity is an excellent tool for understanding the specific character of any conflict, but it may also be suitable for casting some light on real-world difficulties in exercising control. This is because there is no good reason to assume that any of these real-world impediments is missing from the conflicts taking place in cyberspace, as any conflict in that space is only relevant when it impacts the lives of humans.\n### Exercising cyber power in an abstract setting\n### Sabotage and control\nSabotage has been defined as ‘a deliberate attempt to weaken or destroy an economic or military system.' The main characteristic of sabotage is its capability to destroy things. This capability is closely related to the technical development and dependency of a particular society and its government and military (Rid 2012, 16). Due to this characteristic, the capability of sabotage to achieve any level of control depends on the technological sophistication of the adversary. It has been observed by one scholar of strategy that cyber power can cause serious destruction through sabotage (Echevarria 2017, 104). However, the kind of destruction produced by cyber sabotage is often unintended and very imprecise (Libicki 2007, 72). Echevarria (2017, 104) agrees that the destruction caused by sabotage usually constitutes only collateral damage. Hence destruction can be produced, but it is not automatically converted into control.\nWith regard to the first level of control, sabotage arguably cannot stop the adversary from exercising his control unless that control depends on his technology. In cases when some sophisticated technology does play a role in the adversary's ability to control our actions, it may be possible to eliminate that control through the destruction of the very instruments that guarantee that control. Possession of nuclear weapons may be a fine example of this scenario. If the adversary owns some of these weapons and we do not, he may be able to achieve control over us by a threat of nuclear attack. However, when we use cyber sabotage to destroy some munition stocks or development facilities for these weapons, we may be able to completely eliminate the control he enjoys over us.\nRegarding the second level of control, the destructive power of cyber sabotage may also be able to reduce the opponent's freedom of action, as it may effectively disarm him. This disarmament is produced by the destruction of important pieces of weaponry or facilities for its production. The most well-known case of cyber sabotage, Stuxnet, indicates that it may be possible to impair an adversary's freedom of action by this kind of disarmament (Carr 2012; Singer and Friedman 2014, 114--120). On the other hand, the effects of the sabotage, in this case, were only temporary and within a year Iran more than recovered from the attack (Sanger 2018).\nRegarding the third level of control, it is highly questionable whether the sheer destructive potential of sabotage may be enough to control an adversary's policy. His will may or\nmay not be dependent on the functioning of some technological devices. This issue is further complicated by the problems of attribution associated with the exercise of cyber power (Rid and Buchanan 2014). Any form of direct coercion is thus very hard in cyber-space (Liff 2012, 414; Singer and Friedman 2014, 73). Even if we accept the idea that the population of a state can be considered its CoG, incidents of cyber sabotage conducted in recent years do not seem to have produced the third level of control. For example, in 2015 there was a cyber sabotage conducted by Russians against a segment of the Ukrainian public. In the middle of winter, some 230,000 people in Ukraine were left without electricity for a couple of hours (SANS, E-ISAC 2016). A similar situation also occurred the following year (Osborne 2018). Whether the Russian goal was to force the Ukrainian government to reconsider its halt of export of Russian natural gas, to intimidate it, or to discredit it by showing its inability to provide basic services for the population, none was achieved. Modern societies, though dependent upon many technological inventions, seem to be highly resilient in the face of the brief disruptions of basic services (Lonsdale 2004). Of course, all this might change should there emerge some rapid advancements in the destructive potential of cyber sabotage. We can only imagine how the situation in Ukraine might have turned out if the attacks had been considerably more extensive, affected millions of people and lasted longer. But for now, with specific cases on the table, the capacity of cyber sabotage to produce the third level of control, whether directly or indirectly, seems to be lacking.\n### Espionage and control\nEspionage has been defined as ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information' (Rid 2012). As such, it is the most common exercise of cyber power by several actors. This is probably because the technical requirements for espionage are less demanding than for sabotage. The main purpose of espionage is to gather information, not to directly shape the real world (Rid 2012, 20).\nThe simple fact that espionage is more about understanding the world than about changing it means that it cannot directly produce any level of control. That said, it still has an important potential to identify centres of gravity and thus facilitate their manipulation. As Jacobsen (2014, 20) points out, it can easily identify vulnerabilities before a conflict even begins. Subsequently, it may be possible to use espionage to gain information on how to reduce an adversary's control over us, how to reduce his freedom of action and also how to influence his policy. In this sense, espionage can be perceived as one of the key indirect enablers of all the levels of control.\nA good example of this comes from the Chinese attempts at espionage against the United States which were revealed to the public in 2016. In that year, a Chinese national pleaded guilty to conspiring to hack into US defence contractors' systems to steal sensitive military information, including technical documentation for the multirole fighter jet F-35 Lightning II and the tactical fighter jet F-22 Raptor (Department of Justice 2016). Thanks to this kind of espionage, China might have gained a better understanding of high-end US weapon systems and thus might be able to come up with effective countermeasures to them. This may then effectively reduce the potential of the US to exercise control over China, and it may also reduce the former's freedom of action.\nSubversion and control\nSubversion has been defined as ‘a deliberate attempt to undermine some authority, its integrity or order in general' (Rid 2012). The main characteristic of subversion activities is that they target the cohesion of political collectives, their beliefs and mutual trust in general. Among the means of subversion, propaganda is now the most popular (Rid 2012, 22).\nWith regard to the first level of control, subversion, whether conducted in cyberspace or through more traditional means, seems to be able to prevent an adversary from exercising his control over us. For example, the outcome of the Vietnam War was partly influenced by this kind of information-based subversion. The population of the United States was the centre of gravity on the American side, because, due to its democratic political institutions, the polity was dependent upon public support to continue the war. Thus, when a particular kind of information was transferred to the American public via the media, this led to widespread protests against the government's policies on the domestic front. These protests then negatively affected the willingness of the US to participate in the conflict (Scott 2008).\nSome subversive activities of recent years have shown us that cyber subversion can produce the other two levels of control too. One example of this may be the subversive activities which took place in Libya, Egypt and several other countries in the years 2010 and 2011. Some of these activities later took the form of violent insurgencies, but the protests were first initiated and mobilised by the use of social media (Mitchell, Brown, and Guskin 2012). In the end, these activities not only reduced governments' freedom of action but also directly influenced their policies (Korotayev, Meshcherina, and Shishkina 2018). Similarly, Milevski (2018) hypothesises a similar scenario taking place in a potential conflict between NATO and Russia. He argues that in such a conflict, the Russian centre of gravity may be the public opinion of its population. Milevski also points to the fact that the Russian regime is well aware of this and that it already uses widespread censorship to prevent this from happening (Milevski 2018). Liberal democracies of the West might be even more vulnerable to this, because of the direct influence their citizens have on the state's policy and because it is much harder to enforce effective censorship in these kinds of political systems. An important illustration of this vulnerability was the hack of the emails of the US Democratic National Convention and the subsequent leakage of electronic communication to the public. The content of emails caused outrage among Democrat voters, hindered the presidential campaign of Hillary Clinton and it may also have contributed to Donald Trump's victory in the 2016 presidential election (Awad and Leiss 2018). This, though quite indirectly, could have produced control on the third level, as it effectively introduced changes to American internal and external policy.\n### Impediments to control posed by the real world\n### Calculating adversary\nAs Clausewitz makes clear on the first pages of his book, war can be thought of like a wrestling match on a larger scale (Clausewitz 2000, 264). Here he emphasizes the fact that war is about a dynamic interaction of belligerents, which implies that the adversary is always present. But he is not only present, he actively pursues his own objectives and tries to tailor his strategy in some rational manner (Ibid.). This is a fact that often seems to pass\nunnoticed, especially in the highly technical field of cyber. But the exercise of cyber power does not constitute an act of force against some inanimate object (though of course, the inanimate object constitutes the means). Instead, cyber power is all about influencing a thinking adversary who has his own will.\nThis has serious implications for the production of control in cyberspace. The presence of a thinking adversary means that all our perfectly crafted cyber operations may be countered by equally crafty defence measures. For example, it is perfectly possible that the enemy is preparing and improving his defence against our meticulously planned sophisticated sabotage, which we have prepared for so long because his own espionage operation against us revealed it. Or maybe the adversary can actively strive to improve the resilience of his population against our attempts at subversion. In the end, the very presence of an intelligent adversary also means that even if one enjoys technological superiority in one moment, this is usually only a temporary condition (Gray 2001, 36; Strachan 2013, 191). An adversary may adapt to the evolving situation and any technological advantage on one side may be erased or even reversed as a result.\nOne of the more important disadvantages of fighting a calculating adversary is that he does not have to keep the competition in cyberspace. He can choose to escalate the conflict in a different domain, not excluding the use of military power. Of course, this is mainly the case with states possessing considerable military capacity (Jacobsen 2014, 20). In fact, the creation and exploitation of these kinds of asymmetries is one of the fundamental functions of strategy (Milevski 2015, 79). When militarily strong states find themselves at a disadvantage in cyberspace, they can do worse than shift the conduct of warfare to the dimension they prefer, and in this way, completely remove any form of control they might have suffered from the adversary.\nThe adversary in conflict always has some influence on how the events unfold. Thus, it may be possible to put ourselves beyond the adversary's capacity to control us, but it is a very different thing to reduce his freedom of action or to influence his policy. The third level of control can really only be achieved if the adversary chooses to cooperate.\n### Uncertainty, chance and friction\nClausewitz argues that war, in general, is so saturated with uncertainty and chance that it is futile to search for any certainty within it. In fact, he argues that war is influenced by chance much more than any other human activity. In war, everything is quite simple in theory, but much more difficult in practice. This can be the result of both human and natural actions as well as of the inherent characteristics of instruments in use (Clausewitz 2000, 276--278). In the case of cyberspace, the technological nature of the domain contains many opportunities for chance and friction to exercise their influence.\nIf the manipulation of the centre of gravity is necessary to achieve some control over the adversary, then the identification of the centre of gravity is of crucial importance. However, due to constant uncertainties, the process of this identification can be much more difficult than the actor anticipates. Even if the centre of gravity is accurately identified, the dynamics of the conflict may lead to a shift of the centre of gravity at any given moment. To anticipate these changes and then to manipulate the centres of gravity might prove to be almost impossible, as pure chance can always render these attempts futile.\nAnother source of uncertainty and friction is inherent to the very instruments used in the cyber domain. They are hardly obedient and the results they are supposed to create may not only fail initial expectations but also produce negative effects instead. As Jacobsen (2014, 18--19) points out: ‘Computer code always does what it is programmed to do, but rarely exactly as intended.' Hence the exercises of cyber power are often prone to produce confusion rather than control (Libicki 2007, 72). This problem is augmented by the technical complications which may arise due to the large amount of time it takes for cyber instruments to take any effect.\n### Passions and emotions\nEmotions and passions can exert a powerful influence on any actor participating in war. They are often present in the very motivations which give rise to war and then they also shape its conduct. They can easily influence both individual leaders as well as the public (Clausewitz 2000, 264--268, 340--341).\nWhat this means for the exercise of cyber power is that even if a thinking adversary decides to cooperate and one is able to somehow bypass all the friction and uncertainty, there are still emotional elements and those can bring a lot of non-linearity into the conflict. In the case of cyber conflicts, these elements may impede rational calculation, they might multiply chance and uncertainty and they can also contribute to the escalation of violence from the cyber domain to the real world.\nPassions are present in any important decision-making process, which in turn is likely to be the target of any ambitious exercise of cyber power. Emotions may lead to the misidentification of the centre of gravity or its negligence and the pursuit of less important goals. Passions can also lead espionage to gather unimportant information, sabotage to target unimportant infrastructure and subversion to backfire because of cultural differences or misunderstandings.\n## Conclusions\nThis paper supports the previous findings that cyber power can be usefully analysed from the perspective of a general strategy. The findings indicate that the exercise of cyber power can, in the abstract setting, produce various levels of control over an adversary. First, sabotage in cyberspace may be able to reduce or remove the control an adversary enjoys over one's behaviour and it may also be possible to limit the adversary's freedom of action, but it does not yet seem to have the potential to directly influence his policy or to make him bow to one's will. Second, cyber subversion seems to be able to produce all three levels of control, but the effect very much depends on the political system of the adversary. Last, espionage cannot produce control, but it may serve as an enabler of any level of control by gathering the necessary information about the centre of gravity in the conflict.\nOn the other hand, there are also real-world impediments to the production of control. Every conflict includes an intelligent adversary, uncertainty, friction and factors of irrationality represented by emotions and passions. It is not possible to avoid these elements, whether one wants to exercise power over land, in the air, on the sea or in cyberspace. All of these elements can, in their unique ways, produce challenges that will make the production of control much harder, if not impossible. The real level of control produced by\nany kind of cyber activity ultimately depends on the particular interaction of these elements. For this reason, production is effectively unpredictable, although some trends may be identified in the future if more data about cases of cyber activities emerge.\nThere are several possible avenues for further research. Other scholars could aim to examine different concepts from strategic theory and their relation to cyberspace. So-called principles of war could prove to be decent candidates. Several methods could be used for this purpose. Case studies combined with the method of process-tracing could yield interesting results. A greater data set of documented cyber actions would be useful for this purpose, though it might take some time for that to emerge."
    },
    "numeric": {
      "total": {
        "intext_total": 0,
        "success_occurrences": 0,
        "success_unique": 0,
        "bib_unique_total": 0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "style": "numeric"
      },
      "results": [],
      "flat_text": "CYBER POLICY\nJournal of Cyber Policy\nRoutledge Taylor &amp; Francis Group\nISSN: 2373-8871 (Print) 2373-8898 (Online) Journal homepage: www.tandfonline.com/journals/rcyb20\n# Cyber power and control: a perspective from strategic theory\nSamuel Zilincik, Michael Myklin &amp; Petr Kovanda\nTo cite this article: Samuel Zilincik, Michael Myklin &amp; Petr Kovanda (2019) Cyber power and control: a perspective from strategic theory, Journal of Cyber Policy, 4:2, 290-301, DOI: 10.1080/23738871.2019.1635177\nTo link to this article: https://doi.org/10.1080/23738871.2019.1635177\nPublished online: 07 Jul 2019.\nSubmit your article to this journal\nArticle views: 840\nView related articles\nView Crossmark data\nCiting articles: 1 View citing articles\nFull Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rcyb20\nJOURNAL OF CYBER POLICY\n2019, VOL. 4, NO. 2, 290-301\nhttps://doi.org/10.1080/23738871.2019.1635177\nRoutledge Taylor &amp; Francis Group\nCheck for updates\n# Cyber power and control: a perspective from strategic theory\nSamuel Zilincikᵃ, Michael Myklinᵃ and Petr Kovandaᵇ\nᵃMasarykova Univerzita Fakulta socialnich studii; ᵇIng Univerzita obrany\n## ABSTRACT\nCyber power has not been sufficiently examined from the perspective of strategic theory. This research aims to fill this gap by closely analysing the connection between cyber power and the concept of control. For this purpose, the authors use the method of theoretical analysis augmented by an examination of particular historical examples. The findings indicate that cyber sabotage and cyber subversion may be able to produce varying levels of control depending on the particular context of each situation. Cyber espionage alone is unable to produce any level of control, but it may enable other instruments to achieve a level of control.\n## ARTICLE HISTORY\nReceived 15 October 2018\nRevised 21 February 2019\nAccepted 11 May 2019\n## KEYWORDS\nCyber power; strategy; control; espionage; subversion; sabotage\n# Introduction\nWhile the destructive potentials of cyber and nuclear power are vastly dissimilar, they do share one key attribute. They both attract flocks of thinkers, academics, analysts and journalists, and intrude into almost every aspect of contemporary thinking about security and strategy. In fields such as security studies and international relations, concepts related to cyberspace are securing their place among deterrence and conflict theories (Karatzogianni 2009; Kello 2013; Singer and Friedman 2014; Valeriano and Maness 2014). Cyber has gradually become a buzzword¹ yet journalists and policymakers often fail to understand the basics of the technology involved in cybersecurity even though they are directly engaged in cyber policymaking (Valeriano and Maness 2015, 3–19).²\nThere is one related field of study where the trend still has not become the dominant issue. In strategic studies, that unique discipline at the borderline between political science and military history, hot topics are sometimes much slower to gain traction or credit. The source of this scepticism within the community may lie in the frequent engagement with supposedly novel concepts, which often fail rigorous conceptual scrutiny.³\nOn the other hand, this scepticism may have consequences that might be damaging to the long-term development of the field. As Strachan (2008, 8) points out, strategy is the best tool for understanding the character of any war and then managing it. Without delving deep into the debate of whether cyber activities can indeed constitute an instance of war⁴, it is reasonable to expect that strategy may also be necessary to understand conflicts taking place in cyberspace. Conversely, the lack of attention dedicated to cyber power may hinder the fulfilment of the primary purpose of strategy.\n© 2019 Chatham House\nNot much work has been done towards understanding cyber power from the perspective of strategic theory, especially compared to the research conducted on the topics of land power, naval power and air power. The main reason for this relative lack of research may be that most contemporary strategists feel very uncertain about the new domain and they lack technical expertise or the will to explore it (Gray 2013, 6). Another reason might be that they tend to give priority to other domains of warfare, because they consider those to be much more influential in shaping the character of contemporary warfare (Ibid.). On the other hand, cyber specialists and technicians often lack sound education in strategic theory, and so they tend to examine cyber power solely from technological and tactical perspectives (Gray 2013, 6--7).\nThe purpose of this article is to fill this gap in the discussion at least partially. We aim to examine the concept of control and its relation to cyber power. The following questions will guide the research: Are operations in cyberspace able to achieve some measure of control over an adversary? If so, what level of control can they produce? Answers to these questions should provide a valuable contribution to the missing link between general strategic theory and the new domain of warfare.\nThe methodology of the research will be as follows. First, the concept of control will be examined through the lenses of conceptual history. In the process, the concept will be operationalised in order to enable the measurement of different levels of control. Then a theoretical analysis will be employed to evaluate three basic tactical cyber activities in terms of their potential for producing control in the abstract setting. Following this, the findings from the previous chapter will be reflected upon in the light of real-world impediments to the successful production of control. The data for characteristics of cyber power have been collected from expert monographs and articles describing particular qualities of cyber power. The data for strategic theory have been derived from the volumes of various strategic thinkers throughout military history.\nThe article is loosely divided into a theoretical part and an empirical part. In the former, the authors introduce and conceptualise the fundamental concepts of both control and cyber power and analyse their components. In the latter, the authors analyse cyber power using the tools introduced in the theoretical part. The second analysis then follows, focused on real-world impediments to the exercise of control. In conclusion, the findings are summarised and avenues for further research are discussed.\n### Definitions and concepts\nThe concept of control over an adversary was first introduced into the literature on strategic theory by Admiral J. C. Wylie, who in this regard had been intellectually inspired by the writings of Herbert Rosinski. In Military Strategy: A General Theory of Power Control, the concept constitutes a crucial element of Wylie's strategic theory. He first introduces the concept as the second of four fundamental assumptions about war in general. Here Wylie famously claims that ‘the aim of war is some measure of control over the enemy.' (Wylie 1967, 66) Discussing the means by which this effect is to be achieved, Wylie claims that: ‘The ultimate determinant in war is the man on the scene with the gun. This man is the final power in war. He is in control. He determines who wins.' (Wylie 1967, 72)\nMoving on, Wylie clarified that it is, in fact, the control of the strategic weights, or centres of gravity, in any war, which is the fundamental key to the conduct of warfare.\nHe then summarises his general theory in the following terms: ‘The primary aim of the strategist in the conduct of war is some selected degree of control of the enemy for the strategist's own purpose, this is achieved by control of the pattern of war, and this control of the pattern of war is had by manipulation of the centre of gravity of war to the advantage of the strategist and the disadvantage of the opponent ... The successful strategist is the one who controls the nature and the placement and the timing and the weight of the centres of gravity of war, and who exploits the resulting control of the pattern of war toward his own ends.' (Wylie 1967, 77) Stated more clearly, control is the desired effect, which needs to be produced, while the manipulation of centres of gravity and of the overall patterns of war constitutes the means to achieve this purpose (Wylie 1967, 77).\nWylie never really defines what he means by the centre of gravity (CoG). From the way he uses the term, it can be deduced that he considers it to be the most important theatre of war, though it may not necessarily reside in the physical realm (Wylie 1967, 89--90). He borrows this concept from Carl von Clausewitz, who defines it in several contradictory and not particularly helpful ways (Clausewitz 2000). One of the most authoritative modern interpreters of Clausewitz defines the concept as: ‘a focal point, the destruction of which leads to the collapse of the whole enemy's endeavour' (Echevarria 2007, 184--185). This definition is in line both with some of Clausewitz's ideas and with Wylie's assertion that the manipulation of this point can influence the general patterns of war. For this reason, Echevarria's definition of the centre of gravity will be used throughout this article.\nFrom its introduction, the concept gradually gained popularity among military professionals and academics in the field of strategic studies. Nowadays, the concept is regularly employed by several contemporary strategic thinkers such as Gray (1999), Lonsdale (2007) and Milevski (2015, 81) operationalised the concept into a useful analytical tool. The author differentiates three distinct levels of control which can be achieved over the adversary. On the first level, the actor is only able to avoid being controlled by the adversary. On the second level, the actor is able to actively reduce the opponent's freedom of action. On the final level, the actor can influence the adversary's policy and force him to accept the actor's will (Milevski 2015). These three levels of control will form the overarching framework for the examination of cyber power in this paper.\nAnother important term to define is cyber power. There are numerous definitions offered by contemporary experts. One of them defines cyber power as ‘the ability to use cyberspace to create advantages and influence events in all the operational environments and across the instruments of power.' (Kuehl 2009, 35). Colin Gray (2013, 9) says essentially the same thing, only in much more simple language: ‘Cyber power is the ability to do something strategically useful in cyber space.' Both definitions capture the essence associated with the utilisation of cyber operations for the generation of control. For the sake of expediency, this research will operate with Gray's definition.\nIt is also necessary to examine the tools by which cyber power can be exercised. There are three basic activities through which an actor can ‘do something useful in cyberspace'. The trio is composed of subversion, espionage and sabotage (Rid 2012, 15). Rid defines sabotage as: ‘a deliberate attempt to weaken or destroy an economic or military system.' He defines espionage as: ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information.' Subversion is then ‘a deliberate attempt to undermine the authority, the integrity, and the constitution of an established\nauthority or order' (Rid 2012, 16--22). In the following analysis, each kind of action will be examined for its potential to produce control.\nWhen looking for real-world impediments to the production of control, one can do worse than to consult Carl von Clausewitz. According to the Prussian's theory, every war in human history has been composed of three constantly interacting elements: passions, chance and reason (Clausewitz 2000, 282). This trinity is an excellent tool for understanding the specific character of any conflict, but it may also be suitable for casting some light on real-world difficulties in exercising control. This is because there is no good reason to assume that any of these real-world impediments is missing from the conflicts taking place in cyberspace, as any conflict in that space is only relevant when it impacts the lives of humans.\n### Exercising cyber power in an abstract setting\n### Sabotage and control\nSabotage has been defined as ‘a deliberate attempt to weaken or destroy an economic or military system.' The main characteristic of sabotage is its capability to destroy things. This capability is closely related to the technical development and dependency of a particular society and its government and military (Rid 2012, 16). Due to this characteristic, the capability of sabotage to achieve any level of control depends on the technological sophistication of the adversary. It has been observed by one scholar of strategy that cyber power can cause serious destruction through sabotage (Echevarria 2017, 104). However, the kind of destruction produced by cyber sabotage is often unintended and very imprecise (Libicki 2007, 72). Echevarria (2017, 104) agrees that the destruction caused by sabotage usually constitutes only collateral damage. Hence destruction can be produced, but it is not automatically converted into control.\nWith regard to the first level of control, sabotage arguably cannot stop the adversary from exercising his control unless that control depends on his technology. In cases when some sophisticated technology does play a role in the adversary's ability to control our actions, it may be possible to eliminate that control through the destruction of the very instruments that guarantee that control. Possession of nuclear weapons may be a fine example of this scenario. If the adversary owns some of these weapons and we do not, he may be able to achieve control over us by a threat of nuclear attack. However, when we use cyber sabotage to destroy some munition stocks or development facilities for these weapons, we may be able to completely eliminate the control he enjoys over us.\nRegarding the second level of control, the destructive power of cyber sabotage may also be able to reduce the opponent's freedom of action, as it may effectively disarm him. This disarmament is produced by the destruction of important pieces of weaponry or facilities for its production. The most well-known case of cyber sabotage, Stuxnet, indicates that it may be possible to impair an adversary's freedom of action by this kind of disarmament (Carr 2012; Singer and Friedman 2014, 114--120). On the other hand, the effects of the sabotage, in this case, were only temporary and within a year Iran more than recovered from the attack (Sanger 2018).\nRegarding the third level of control, it is highly questionable whether the sheer destructive potential of sabotage may be enough to control an adversary's policy. His will may or\nmay not be dependent on the functioning of some technological devices. This issue is further complicated by the problems of attribution associated with the exercise of cyber power (Rid and Buchanan 2014). Any form of direct coercion is thus very hard in cyber-space (Liff 2012, 414; Singer and Friedman 2014, 73). Even if we accept the idea that the population of a state can be considered its CoG, incidents of cyber sabotage conducted in recent years do not seem to have produced the third level of control. For example, in 2015 there was a cyber sabotage conducted by Russians against a segment of the Ukrainian public. In the middle of winter, some 230,000 people in Ukraine were left without electricity for a couple of hours (SANS, E-ISAC 2016). A similar situation also occurred the following year (Osborne 2018). Whether the Russian goal was to force the Ukrainian government to reconsider its halt of export of Russian natural gas, to intimidate it, or to discredit it by showing its inability to provide basic services for the population, none was achieved. Modern societies, though dependent upon many technological inventions, seem to be highly resilient in the face of the brief disruptions of basic services (Lonsdale 2004). Of course, all this might change should there emerge some rapid advancements in the destructive potential of cyber sabotage. We can only imagine how the situation in Ukraine might have turned out if the attacks had been considerably more extensive, affected millions of people and lasted longer. But for now, with specific cases on the table, the capacity of cyber sabotage to produce the third level of control, whether directly or indirectly, seems to be lacking.\n### Espionage and control\nEspionage has been defined as ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information' (Rid 2012). As such, it is the most common exercise of cyber power by several actors. This is probably because the technical requirements for espionage are less demanding than for sabotage. The main purpose of espionage is to gather information, not to directly shape the real world (Rid 2012, 20).\nThe simple fact that espionage is more about understanding the world than about changing it means that it cannot directly produce any level of control. That said, it still has an important potential to identify centres of gravity and thus facilitate their manipulation. As Jacobsen (2014, 20) points out, it can easily identify vulnerabilities before a conflict even begins. Subsequently, it may be possible to use espionage to gain information on how to reduce an adversary's control over us, how to reduce his freedom of action and also how to influence his policy. In this sense, espionage can be perceived as one of the key indirect enablers of all the levels of control.\nA good example of this comes from the Chinese attempts at espionage against the United States which were revealed to the public in 2016. In that year, a Chinese national pleaded guilty to conspiring to hack into US defence contractors' systems to steal sensitive military information, including technical documentation for the multirole fighter jet F-35 Lightning II and the tactical fighter jet F-22 Raptor (Department of Justice 2016). Thanks to this kind of espionage, China might have gained a better understanding of high-end US weapon systems and thus might be able to come up with effective countermeasures to them. This may then effectively reduce the potential of the US to exercise control over China, and it may also reduce the former's freedom of action.\nSubversion and control\nSubversion has been defined as ‘a deliberate attempt to undermine some authority, its integrity or order in general' (Rid 2012). The main characteristic of subversion activities is that they target the cohesion of political collectives, their beliefs and mutual trust in general. Among the means of subversion, propaganda is now the most popular (Rid 2012, 22).\nWith regard to the first level of control, subversion, whether conducted in cyberspace or through more traditional means, seems to be able to prevent an adversary from exercising his control over us. For example, the outcome of the Vietnam War was partly influenced by this kind of information-based subversion. The population of the United States was the centre of gravity on the American side, because, due to its democratic political institutions, the polity was dependent upon public support to continue the war. Thus, when a particular kind of information was transferred to the American public via the media, this led to widespread protests against the government's policies on the domestic front. These protests then negatively affected the willingness of the US to participate in the conflict (Scott 2008).\nSome subversive activities of recent years have shown us that cyber subversion can produce the other two levels of control too. One example of this may be the subversive activities which took place in Libya, Egypt and several other countries in the years 2010 and 2011. Some of these activities later took the form of violent insurgencies, but the protests were first initiated and mobilised by the use of social media (Mitchell, Brown, and Guskin 2012). In the end, these activities not only reduced governments' freedom of action but also directly influenced their policies (Korotayev, Meshcherina, and Shishkina 2018). Similarly, Milevski (2018) hypothesises a similar scenario taking place in a potential conflict between NATO and Russia. He argues that in such a conflict, the Russian centre of gravity may be the public opinion of its population. Milevski also points to the fact that the Russian regime is well aware of this and that it already uses widespread censorship to prevent this from happening (Milevski 2018). Liberal democracies of the West might be even more vulnerable to this, because of the direct influence their citizens have on the state's policy and because it is much harder to enforce effective censorship in these kinds of political systems. An important illustration of this vulnerability was the hack of the emails of the US Democratic National Convention and the subsequent leakage of electronic communication to the public. The content of emails caused outrage among Democrat voters, hindered the presidential campaign of Hillary Clinton and it may also have contributed to Donald Trump's victory in the 2016 presidential election (Awad and Leiss 2018). This, though quite indirectly, could have produced control on the third level, as it effectively introduced changes to American internal and external policy.\n### Impediments to control posed by the real world\n### Calculating adversary\nAs Clausewitz makes clear on the first pages of his book, war can be thought of like a wrestling match on a larger scale (Clausewitz 2000, 264). Here he emphasizes the fact that war is about a dynamic interaction of belligerents, which implies that the adversary is always present. But he is not only present, he actively pursues his own objectives and tries to tailor his strategy in some rational manner (Ibid.). This is a fact that often seems to pass\nunnoticed, especially in the highly technical field of cyber. But the exercise of cyber power does not constitute an act of force against some inanimate object (though of course, the inanimate object constitutes the means). Instead, cyber power is all about influencing a thinking adversary who has his own will.\nThis has serious implications for the production of control in cyberspace. The presence of a thinking adversary means that all our perfectly crafted cyber operations may be countered by equally crafty defence measures. For example, it is perfectly possible that the enemy is preparing and improving his defence against our meticulously planned sophisticated sabotage, which we have prepared for so long because his own espionage operation against us revealed it. Or maybe the adversary can actively strive to improve the resilience of his population against our attempts at subversion. In the end, the very presence of an intelligent adversary also means that even if one enjoys technological superiority in one moment, this is usually only a temporary condition (Gray 2001, 36; Strachan 2013, 191). An adversary may adapt to the evolving situation and any technological advantage on one side may be erased or even reversed as a result.\nOne of the more important disadvantages of fighting a calculating adversary is that he does not have to keep the competition in cyberspace. He can choose to escalate the conflict in a different domain, not excluding the use of military power. Of course, this is mainly the case with states possessing considerable military capacity (Jacobsen 2014, 20). In fact, the creation and exploitation of these kinds of asymmetries is one of the fundamental functions of strategy (Milevski 2015, 79). When militarily strong states find themselves at a disadvantage in cyberspace, they can do worse than shift the conduct of warfare to the dimension they prefer, and in this way, completely remove any form of control they might have suffered from the adversary.\nThe adversary in conflict always has some influence on how the events unfold. Thus, it may be possible to put ourselves beyond the adversary's capacity to control us, but it is a very different thing to reduce his freedom of action or to influence his policy. The third level of control can really only be achieved if the adversary chooses to cooperate.\n### Uncertainty, chance and friction\nClausewitz argues that war, in general, is so saturated with uncertainty and chance that it is futile to search for any certainty within it. In fact, he argues that war is influenced by chance much more than any other human activity. In war, everything is quite simple in theory, but much more difficult in practice. This can be the result of both human and natural actions as well as of the inherent characteristics of instruments in use (Clausewitz 2000, 276--278). In the case of cyberspace, the technological nature of the domain contains many opportunities for chance and friction to exercise their influence.\nIf the manipulation of the centre of gravity is necessary to achieve some control over the adversary, then the identification of the centre of gravity is of crucial importance. However, due to constant uncertainties, the process of this identification can be much more difficult than the actor anticipates. Even if the centre of gravity is accurately identified, the dynamics of the conflict may lead to a shift of the centre of gravity at any given moment. To anticipate these changes and then to manipulate the centres of gravity might prove to be almost impossible, as pure chance can always render these attempts futile.\nAnother source of uncertainty and friction is inherent to the very instruments used in the cyber domain. They are hardly obedient and the results they are supposed to create may not only fail initial expectations but also produce negative effects instead. As Jacobsen (2014, 18--19) points out: ‘Computer code always does what it is programmed to do, but rarely exactly as intended.' Hence the exercises of cyber power are often prone to produce confusion rather than control (Libicki 2007, 72). This problem is augmented by the technical complications which may arise due to the large amount of time it takes for cyber instruments to take any effect.\n### Passions and emotions\nEmotions and passions can exert a powerful influence on any actor participating in war. They are often present in the very motivations which give rise to war and then they also shape its conduct. They can easily influence both individual leaders as well as the public (Clausewitz 2000, 264--268, 340--341).\nWhat this means for the exercise of cyber power is that even if a thinking adversary decides to cooperate and one is able to somehow bypass all the friction and uncertainty, there are still emotional elements and those can bring a lot of non-linearity into the conflict. In the case of cyber conflicts, these elements may impede rational calculation, they might multiply chance and uncertainty and they can also contribute to the escalation of violence from the cyber domain to the real world.\nPassions are present in any important decision-making process, which in turn is likely to be the target of any ambitious exercise of cyber power. Emotions may lead to the misidentification of the centre of gravity or its negligence and the pursuit of less important goals. Passions can also lead espionage to gather unimportant information, sabotage to target unimportant infrastructure and subversion to backfire because of cultural differences or misunderstandings.\n## Conclusions\nThis paper supports the previous findings that cyber power can be usefully analysed from the perspective of a general strategy. The findings indicate that the exercise of cyber power can, in the abstract setting, produce various levels of control over an adversary. First, sabotage in cyberspace may be able to reduce or remove the control an adversary enjoys over one's behaviour and it may also be possible to limit the adversary's freedom of action, but it does not yet seem to have the potential to directly influence his policy or to make him bow to one's will. Second, cyber subversion seems to be able to produce all three levels of control, but the effect very much depends on the political system of the adversary. Last, espionage cannot produce control, but it may serve as an enabler of any level of control by gathering the necessary information about the centre of gravity in the conflict.\nOn the other hand, there are also real-world impediments to the production of control. Every conflict includes an intelligent adversary, uncertainty, friction and factors of irrationality represented by emotions and passions. It is not possible to avoid these elements, whether one wants to exercise power over land, in the air, on the sea or in cyberspace. All of these elements can, in their unique ways, produce challenges that will make the production of control much harder, if not impossible. The real level of control produced by\nany kind of cyber activity ultimately depends on the particular interaction of these elements. For this reason, production is effectively unpredictable, although some trends may be identified in the future if more data about cases of cyber activities emerge.\nThere are several possible avenues for further research. Other scholars could aim to examine different concepts from strategic theory and their relation to cyberspace. So-called principles of war could prove to be decent candidates. Several methods could be used for this purpose. Case studies combined with the method of process-tracing could yield interesting results. A greater data set of documented cyber actions would be useful for this purpose, though it might take some time for that to emerge."
    },
    "author_year": {
      "total": {
        "intext_total": 39,
        "success_occurrences": 39,
        "success_unique": 22,
        "bib_unique_total": 59,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.3728813559322034,
        "success_percentage": 100.0,
        "style": "author_year"
      },
      "results": [
        {
          "index": "karatzogianni|2009",
          "intext_citation": "(Karatzogianni 2009; Kello 2013; Singer and Friedman 2014; Valeriano and Maness 2014)",
          "preceding_text": "In fields such as security studies and international relations, concepts related to cyberspace are securing their place among deterrence and conflict theories",
          "footnote": "Karatzogianni, A. 2009. Cyber-Conflict and Global Politics. (ed). New York: Routledge."
        },
        {
          "index": "valeriano|2015",
          "intext_citation": "(Valeriano and Maness 2015, 3–19)",
          "preceding_text": "and Friedman 2014; Valeriano and Maness 2014). Cyber has gradually become a buzzword¹ yet journalists and policymakers often fail to understand the basics of the technology involved in cybersecurity even though they are directly engaged in cyber policymaking",
          "footnote": "Valeriano, B., and R. Maness. 2015. Cyber War Versus Cyber Realities. Oxford: Oxford University Press."
        },
        {
          "index": "gray|2013",
          "intext_citation": "(Gray 2013, 6)",
          "preceding_text": "The main reason for this relative lack of research may be that most contemporary strategists feel very uncertain about the new domain and they lack technical expertise or the will to explore it",
          "footnote": "Gray, Colin S. 2013. Making Strategic Sense of Cyber-Power: Why the Sky is Not Falling. Carlisle: Strategic Studies Institute."
        },
        {
          "index": "gray|2013",
          "intext_citation": "(Gray 2013, 6--7)",
          "preceding_text": "On the other hand, cyber specialists and technicians often lack sound education in strategic theory, and so they tend to examine cyber power solely from technological and tactical perspectives",
          "footnote": "Gray, Colin S. 2013. Making Strategic Sense of Cyber-Power: Why the Sky is Not Falling. Carlisle: Strategic Studies Institute."
        },
        {
          "index": "wylie|1967",
          "intext_citation": "(Wylie 1967, 66)",
          "preceding_text": "He first introduces the concept as the second of four fundamental assumptions about war in general. Here Wylie famously claims that ‘the aim of war is some measure of control over the enemy.'",
          "footnote": "Wylie, J. C. 1967. Military Strategy: A General Theory of Power Control. Annapolis: Naval Institute Press."
        },
        {
          "index": "wylie|1967",
          "intext_citation": "(Wylie 1967, 72)",
          "preceding_text": "This man is the final power in war. He is in control. He determines who wins.'",
          "footnote": "Wylie, J. C. 1967. Military Strategy: A General Theory of Power Control. Annapolis: Naval Institute Press."
        },
        {
          "index": "wylie|1967",
          "intext_citation": "(Wylie 1967, 77)",
          "preceding_text": "disadvantage of the opponent ... The successful strategist is the one who controls the nature and the placement and the timing and the weight of the centres of gravity of war, and who exploits the resulting control of the pattern of war toward his own ends.'",
          "footnote": "Wylie, J. C. 1967. Military Strategy: A General Theory of Power Control. Annapolis: Naval Institute Press."
        },
        {
          "index": "wylie|1967",
          "intext_citation": "(Wylie 1967, 77)",
          "preceding_text": "pattern of war toward his own ends.' (Wylie 1967, 77) Stated more clearly, control is the desired effect, which needs to be produced, while the manipulation of centres of gravity and of the overall patterns of war constitutes the means to achieve this purpose",
          "footnote": "Wylie, J. C. 1967. Military Strategy: A General Theory of Power Control. Annapolis: Naval Institute Press."
        },
        {
          "index": "wylie|1967",
          "intext_citation": "(Wylie 1967, 89--90)",
          "preceding_text": "From the way he uses the term, it can be deduced that he considers it to be the most important theatre of war, though it may not necessarily reside in the physical realm",
          "footnote": "Wylie, J. C. 1967. Military Strategy: A General Theory of Power Control. Annapolis: Naval Institute Press."
        },
        {
          "index": "clausewitz|2000",
          "intext_citation": "(Clausewitz 2000)",
          "preceding_text": "He borrows this concept from Carl von Clausewitz, who defines it in several contradictory and not particularly helpful ways",
          "footnote": "Clausewitz, C. 2000. “On War.” In The Book of War: Sun-Tzu's “The Art of War” and Karl Von Clausewitz's “On War”, edited by Ralph Peters, 264--950. New York: The Modern Library."
        },
        {
          "index": "echevarria|2007",
          "intext_citation": "(Echevarria 2007, 184--185)",
          "preceding_text": "One of the most authoritative modern interpreters of Clausewitz defines the concept as: ‘a focal point, the destruction of which leads to the collapse of the whole enemy's endeavour'",
          "footnote": "Echevarria, A. 2007. Clausewitz and Contemporary War. Oxford: Oxford University Press."
        },
        {
          "index": "milevski|2015",
          "intext_citation": "(Milevski 2015)",
          "preceding_text": "On the second level, the actor is able to actively reduce the opponent's freedom of action. On the final level, the actor can influence the adversary's policy and force him to accept the actor's will",
          "footnote": "Milevski, L. 2015. “Asymmetry is Strategy, Strategy is Asymmetry.” Joint Force Quarterly 75 (4): 77--83."
        },
        {
          "index": "kuehl|2009",
          "intext_citation": "(Kuehl 2009, 35)",
          "preceding_text": "One of them defines cyber power as ‘the ability to use cyberspace to create advantages and influence events in all the operational environments and across the instruments of power.'",
          "footnote": "Kuehl, D. F. 2009. “From Cyberspace to Cyberpower: Defining the Problem.” In Cyberpower and National Security, edited by F. D. Kramer, S. H. Starr, and L. K. Wentz, 24--42. Lincoln: Potomac Books."
        },
        {
          "index": "rid|2012",
          "intext_citation": "(Rid 2012, 15)",
          "preceding_text": "There are three basic activities through which an actor can ‘do something useful in cyberspace'. The trio is composed of subversion, espionage and sabotage",
          "footnote": "Rid, T. 2012. “Cyber War Will Not Take Place.” Journal of Strategic Studies 35 (1): 5--32."
        },
        {
          "index": "rid|2012",
          "intext_citation": "(Rid 2012, 16--22)",
          "preceding_text": "authority or order'",
          "footnote": "Rid, T. 2012. “Cyber War Will Not Take Place.” Journal of Strategic Studies 35 (1): 5--32."
        },
        {
          "index": "clausewitz|2000",
          "intext_citation": "(Clausewitz 2000, 282)",
          "preceding_text": "According to the Prussian's theory, every war in human history has been composed of three constantly interacting elements: passions, chance and reason",
          "footnote": "Clausewitz, C. 2000. “On War.” In The Book of War: Sun-Tzu's “The Art of War” and Karl Von Clausewitz's “On War”, edited by Ralph Peters, 264--950. New York: The Modern Library."
        },
        {
          "index": "rid|2012",
          "intext_citation": "(Rid 2012, 16)",
          "preceding_text": "This capability is closely related to the technical development and dependency of a particular society and its government and military",
          "footnote": "Rid, T. 2012. “Cyber War Will Not Take Place.” Journal of Strategic Studies 35 (1): 5--32."
        },
        {
          "index": "echevarria|2017",
          "intext_citation": "(Echevarria 2017, 104)",
          "preceding_text": "It has been observed by one scholar of strategy that cyber power can cause serious destruction through sabotage",
          "footnote": "Echevarria, A. 2017. Military Strategy: A Very Short Introduction. Oxford: Oxford University Press."
        },
        {
          "index": "libicki|2007",
          "intext_citation": "(Libicki 2007, 72)",
          "preceding_text": "However, the kind of destruction produced by cyber sabotage is often unintended and very imprecise",
          "footnote": "Libicki, M. C. 2007. Conquest in Cyberspace. Cambridge: Cambridge University Press."
        },
        {
          "index": "carr|2012",
          "intext_citation": "(Carr 2012; Singer and Friedman 2014, 114--120)",
          "preceding_text": "The most well-known case of cyber sabotage, Stuxnet, indicates that it may be possible to impair an adversary's freedom of action by this kind of disarmament",
          "footnote": "Carr, J. 2012. Inside Cyber Warfare. Sebastopol: O'Reilly Media."
        },
        {
          "index": "sanger|2018",
          "intext_citation": "(Sanger 2018)",
          "preceding_text": "On the other hand, the effects of the sabotage, in this case, were only temporary and within a year Iran more than recovered from the attack",
          "footnote": "Sanger, D. 2018. The Perfect Weapon: War, Sabotage, and Fear in the Cyber Age. New York: Crown."
        },
        {
          "index": "rid|2014",
          "intext_citation": "(Rid and Buchanan 2014)",
          "preceding_text": "This issue is further complicated by the problems of attribution associated with the exercise of cyber power",
          "footnote": "Rid, T. and B. Buchanan. 2014. “Attributing Cyber Attacks.” Survival 38 (1-2): 4--37."
        },
        {
          "index": "liff|2012",
          "intext_citation": "(Liff 2012, 414; Singer and Friedman 2014, 73)",
          "preceding_text": "This issue is further complicated by the problems of attribution associated with the exercise of cyber power (Rid and Buchanan 2014). Any form of direct coercion is thus very hard in cyber-space",
          "footnote": "Liff, P. A. 2012. “Cyberwar: A New ‘Absolute Weapon'? The Proliferation of Cyberwarfare Capabilities and Interstate War.” Journal of Strategic Studies 35 (3): 401--428."
        },
        {
          "index": "osborne|2018",
          "intext_citation": "(Osborne 2018)",
          "preceding_text": "In the middle of winter, some 230,000 people in Ukraine were left without electricity for a couple of hours (SANS, E-ISAC 2016). A similar situation also occurred the following year",
          "footnote": "Osborne, C. 2018. “Industroyer: An in-depth look at the culprit behind Ukraine's power grid blackout.” https://www.zdnet.com/article/industroyer-an-in-depth-look-at-the-culprit-behind-ukraines-power-grid-blackout/."
        },
        {
          "index": "lonsdale|2004",
          "intext_citation": "(Lonsdale 2004)",
          "preceding_text": "Modern societies, though dependent upon many technological inventions, seem to be highly resilient in the face of the brief disruptions of basic services",
          "footnote": "Lonsdale, D. J. 2004. The Nature of War in the Information Age. London: Frank Cass."
        },
        {
          "index": "rid|2012",
          "intext_citation": "(Rid 2012)",
          "preceding_text": "Espionage has been defined as ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information'",
          "footnote": "Rid, T. 2012. “Cyber War Will Not Take Place.” Journal of Strategic Studies 35 (1): 5--32."
        },
        {
          "index": "rid|2012",
          "intext_citation": "(Rid 2012, 20)",
          "preceding_text": "This is probably because the technical requirements for espionage are less demanding than for sabotage. The main purpose of espionage is to gather information, not to directly shape the real world",
          "footnote": "Rid, T. 2012. “Cyber War Will Not Take Place.” Journal of Strategic Studies 35 (1): 5--32."
        },
        {
          "index": "rid|2012",
          "intext_citation": "(Rid 2012)",
          "preceding_text": "Subversion has been defined as ‘a deliberate attempt to undermine some authority, its integrity or order in general'",
          "footnote": "Rid, T. 2012. “Cyber War Will Not Take Place.” Journal of Strategic Studies 35 (1): 5--32."
        },
        {
          "index": "rid|2012",
          "intext_citation": "(Rid 2012, 22)",
          "preceding_text": "Among the means of subversion, propaganda is now the most popular",
          "footnote": "Rid, T. 2012. “Cyber War Will Not Take Place.” Journal of Strategic Studies 35 (1): 5--32."
        },
        {
          "index": "scott|2008",
          "intext_citation": "(Scott 2008)",
          "preceding_text": "These protests then negatively affected the willingness of the US to participate in the conflict",
          "footnote": "Scott, Anthony. 2008. The Vietnam War Era's Impact on American Society. Thesis. New York: State University of New York."
        },
        {
          "index": "milevski|2018",
          "intext_citation": "(Milevski 2018)",
          "preceding_text": "Milevski also points to the fact that the Russian regime is well aware of this and that it already uses widespread censorship to prevent this from happening",
          "footnote": "Milevski, L. 2018. “Prospective Strategy for Baltic Defense.” Military Review 98 (1): 59--69."
        },
        {
          "index": "awad|2018",
          "intext_citation": "(Awad and Leiss 2018)",
          "preceding_text": "t leakage of electronic communication to the public. The content of emails caused outrage among Democrat voters, hindered the presidential campaign of Hillary Clinton and it may also have contributed to Donald Trump's victory in the 2016 presidential election",
          "footnote": "Awad, M. and E. Leiss. 2018. “Did Technology Fail Us?: Security Concerns in Safeguarding Democracy.” Proceedings of the 11th International Conference on Theory and Practice of Electronic Governance. Galway, Ireland. pp. 626--630."
        },
        {
          "index": "clausewitz|2000",
          "intext_citation": "(Clausewitz 2000, 264)",
          "preceding_text": "As Clausewitz makes clear on the first pages of his book, war can be thought of like a wrestling match on a larger scale",
          "footnote": "Clausewitz, C. 2000. “On War.” In The Book of War: Sun-Tzu's “The Art of War” and Karl Von Clausewitz's “On War”, edited by Ralph Peters, 264--950. New York: The Modern Library."
        },
        {
          "index": "gray|2001",
          "intext_citation": "(Gray 2001, 36; Strachan 2013, 191)",
          "preceding_text": "In the end, the very presence of an intelligent adversary also means that even if one enjoys technological superiority in one moment, this is usually only a temporary condition",
          "footnote": "Gray, Colin S. 2001. Weapons for Strategic Effect: How Important is Technology? Alabama: Air War College."
        },
        {
          "index": "jacobsen|2014",
          "intext_citation": "(Jacobsen 2014, 20)",
          "preceding_text": "He can choose to escalate the conflict in a different domain, not excluding the use of military power. Of course, this is mainly the case with states possessing considerable military capacity",
          "footnote": "Jacobsen, J. T. 2014. The Cyberwar Mirage and the Utility of Cyberattacks in War: How to Make Real Use of Clausewitz in the Age of Cyberspace. Copenhagen: Danish Institute for International Studies."
        },
        {
          "index": "milevski|2015",
          "intext_citation": "(Milevski 2015, 79)",
          "preceding_text": "In fact, the creation and exploitation of these kinds of asymmetries is one of the fundamental functions of strategy",
          "footnote": "Milevski, L. 2015. “Asymmetry is Strategy, Strategy is Asymmetry.” Joint Force Quarterly 75 (4): 77--83."
        },
        {
          "index": "clausewitz|2000",
          "intext_citation": "(Clausewitz 2000, 276--278)",
          "preceding_text": "This can be the result of both human and natural actions as well as of the inherent characteristics of instruments in use",
          "footnote": "Clausewitz, C. 2000. “On War.” In The Book of War: Sun-Tzu's “The Art of War” and Karl Von Clausewitz's “On War”, edited by Ralph Peters, 264--950. New York: The Modern Library."
        },
        {
          "index": "libicki|2007",
          "intext_citation": "(Libicki 2007, 72)",
          "preceding_text": "also produce negative effects instead. As Jacobsen (2014, 18--19) points out: ‘Computer code always does what it is programmed to do, but rarely exactly as intended.' Hence the exercises of cyber power are often prone to produce confusion rather than control",
          "footnote": "Libicki, M. C. 2007. Conquest in Cyberspace. Cambridge: Cambridge University Press."
        },
        {
          "index": "clausewitz|2000",
          "intext_citation": "(Clausewitz 2000, 264--268, 340--341)",
          "preceding_text": "They are often present in the very motivations which give rise to war and then they also shape its conduct. They can easily influence both individual leaders as well as the public",
          "footnote": "Clausewitz, C. 2000. “On War.” In The Book of War: Sun-Tzu's “The Art of War” and Karl Von Clausewitz's “On War”, edited by Ralph Peters, 264--950. New York: The Modern Library."
        }
      ],
      "flat_text": "CYBER POLICY Journal of Cyber Policy Routledge Taylor &amp; Francis Group ISSN: 2373-8871 (Print) 2373-8898 (Online) Journal homepage: www.tandfonline.com/journals/rcyb20 # Cyber power and control: a perspective from strategic theory Samuel Zilincik, Michael Myklin &amp; Petr Kovanda To cite this article: Samuel Zilincik, Michael Myklin &amp; Petr Kovanda (2019) Cyber power and control: a perspective from strategic theory, Journal of Cyber Policy, 4:2, 290-301, DOI: 10.1080/23738871.2019.1635177 To link to this article: https://doi.org/10.1080/23738871.2019.1635177 Published online: 07 Jul 2019.\nSubmit your article to this journal Article views: 840 View related articles View Crossmark data Citing articles: 1 View citing articles Full Terms &amp; Conditions of access and use can be found at https://www.tandfonline.com/action/journalInformation?journalCode=rcyb20 JOURNAL OF CYBER POLICY 2019, VOL. 4, NO. 2, 290-301 https://doi.org/10.1080/23738871.2019.1635177 Routledge Taylor &amp; Francis Group Check for updates # Cyber power and control: a perspective from strategic theory Samuel Zilincikᵃ, Michael Myklinᵃ and Petr Kovandaᵇ ᵃMasarykova Univerzita Fakulta socialnich studii; ᵇIng Univerzita obrany ## ABSTRACT Cyber power has not been sufficiently examined from the perspective of strategic theory. This research aims to fill this gap by closely analysing the connection between cyber power and the concept of control. For this purpose, the authors use the method of theoretical analysis augmented by an examination of particular historical examples. The findings indicate that cyber sabotage and cyber subversion may be able to produce varying levels of control depending on the particular context of each situation. Cyber espionage alone is unable to produce any level of control, but it may enable other instruments to achieve a level of control.\n## ARTICLE HISTORY Received 15 October 2018 Revised 21 February 2019 Accepted 11 May 2019 ## KEYWORDS Cyber power; strategy; control; espionage; subversion; sabotage # Introduction While the destructive potentials of cyber and nuclear power are vastly dissimilar, they do share one key attribute. They both attract flocks of thinkers, academics, analysts and journalists, and intrude into almost every aspect of contemporary thinking about security and strategy. In fields such as security studies and international relations, concepts related to cyberspace are securing their place among deterrence and conflict theories. Cyber has gradually become a buzzword¹ yet journalists and policymakers often fail to understand the basics of the technology involved in cybersecurity even though they are directly engaged in cyber policymaking.² There is one related field of study where the trend still has not become the dominant issue. In strategic studies, that unique discipline at the borderline between political science and military history, hot topics are sometimes much slower to gain traction or credit. The source of this scepticism within the community may lie in the frequent engagement with supposedly novel concepts, which often fail rigorous conceptual scrutiny.³ On the other hand, this scepticism may have consequences that might be damaging to the long-term development of the field. As Strachan (2008, 8) points out, strategy is the best tool for understanding the character of any war and then managing it. Without delving deep into the debate of whether cyber activities can indeed constitute an instance of war⁴, it is reasonable to expect that strategy may also be necessary to understand conflicts taking place in cyberspace. Conversely, the lack of attention dedicated to cyber power may hinder the fulfilment of the primary purpose of strategy.\n© 2019 Chatham House Not much work has been done towards understanding cyber power from the perspective of strategic theory, especially compared to the research conducted on the topics of land power, naval power and air power. The main reason for this relative lack of research may be that most contemporary strategists feel very uncertain about the new domain and they lack technical expertise or the will to explore it. Another reason might be that they tend to give priority to other domains of warfare, because they consider those to be much more influential in shaping the character of contemporary warfare (Ibid.). On the other hand, cyber specialists and technicians often lack sound education in strategic theory, and so they tend to examine cyber power solely from technological and tactical perspectives.\nThe purpose of this article is to fill this gap in the discussion at least partially. We aim to examine the concept of control and its relation to cyber power. The following questions will guide the research: Are operations in cyberspace able to achieve some measure of control over an adversary? If so, what level of control can they produce? Answers to these questions should provide a valuable contribution to the missing link between general strategic theory and the new domain of warfare.\nThe methodology of the research will be as follows. First, the concept of control will be examined through the lenses of conceptual history. In the process, the concept will be operationalised in order to enable the measurement of different levels of control. Then a theoretical analysis will be employed to evaluate three basic tactical cyber activities in terms of their potential for producing control in the abstract setting. Following this, the findings from the previous chapter will be reflected upon in the light of real-world impediments to the successful production of control. The data for characteristics of cyber power have been collected from expert monographs and articles describing particular qualities of cyber power. The data for strategic theory have been derived from the volumes of various strategic thinkers throughout military history.\nThe article is loosely divided into a theoretical part and an empirical part. In the former, the authors introduce and conceptualise the fundamental concepts of both control and cyber power and analyse their components. In the latter, the authors analyse cyber power using the tools introduced in the theoretical part. The second analysis then follows, focused on real-world impediments to the exercise of control. In conclusion, the findings are summarised and avenues for further research are discussed.\n### Definitions and concepts The concept of control over an adversary was first introduced into the literature on strategic theory by Admiral J. C. Wylie, who in this regard had been intellectually inspired by the writings of Herbert Rosinski. In Military Strategy: A General Theory of Power Control, the concept constitutes a crucial element of Wylie's strategic theory. He first introduces the concept as the second of four fundamental assumptions about war in general. Here Wylie famously claims that ‘the aim of war is some measure of control over the enemy.' Discussing the means by which this effect is to be achieved, Wylie claims that: ‘The ultimate determinant in war is the man on the scene with the gun. This man is the final power in war. He is in control. He determines who wins.' Moving on, Wylie clarified that it is, in fact, the control of the strategic weights, or centres of gravity, in any war, which is the fundamental key to the conduct of warfare.\nHe then summarises his general theory in the following terms: ‘The primary aim of the strategist in the conduct of war is some selected degree of control of the enemy for the strategist's own purpose, this is achieved by control of the pattern of war, and this control of the pattern of war is had by manipulation of the centre of gravity of war to the advantage of the strategist and the disadvantage of the opponent... The successful strategist is the one who controls the nature and the placement and the timing and the weight of the centres of gravity of war, and who exploits the resulting control of the pattern of war toward his own ends.' Stated more clearly, control is the desired effect, which needs to be produced, while the manipulation of centres of gravity and of the overall patterns of war constitutes the means to achieve this purpose.\nWylie never really defines what he means by the centre of gravity (CoG). From the way he uses the term, it can be deduced that he considers it to be the most important theatre of war, though it may not necessarily reside in the physical realm. He borrows this concept from Carl von Clausewitz, who defines it in several contradictory and not particularly helpful ways. One of the most authoritative modern interpreters of Clausewitz defines the concept as: ‘a focal point, the destruction of which leads to the collapse of the whole enemy's endeavour'. This definition is in line both with some of Clausewitz's ideas and with Wylie's assertion that the manipulation of this point can influence the general patterns of war. For this reason, Echevarria's definition of the centre of gravity will be used throughout this article.\nFrom its introduction, the concept gradually gained popularity among military professionals and academics in the field of strategic studies. Nowadays, the concept is regularly employed by several contemporary strategic thinkers such as Gray (1999), Lonsdale (2007) and Milevski (2015, 81) operationalised the concept into a useful analytical tool. The author differentiates three distinct levels of control which can be achieved over the adversary. On the first level, the actor is only able to avoid being controlled by the adversary. On the second level, the actor is able to actively reduce the opponent's freedom of action. On the final level, the actor can influence the adversary's policy and force him to accept the actor's will. These three levels of control will form the overarching framework for the examination of cyber power in this paper.\nAnother important term to define is cyber power. There are numerous definitions offered by contemporary experts. One of them defines cyber power as ‘the ability to use cyberspace to create advantages and influence events in all the operational environments and across the instruments of power.'. Colin Gray (2013, 9) says essentially the same thing, only in much more simple language: ‘Cyber power is the ability to do something strategically useful in cyber space.' Both definitions capture the essence associated with the utilisation of cyber operations for the generation of control. For the sake of expediency, this research will operate with Gray's definition.\nIt is also necessary to examine the tools by which cyber power can be exercised. There are three basic activities through which an actor can ‘do something useful in cyberspace'. The trio is composed of subversion, espionage and sabotage. Rid defines sabotage as: ‘a deliberate attempt to weaken or destroy an economic or military system.' He defines espionage as: ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information.' Subversion is then ‘a deliberate attempt to undermine the authority, the integrity, and the constitution of an established authority or order'. In the following analysis, each kind of action will be examined for its potential to produce control.\nWhen looking for real-world impediments to the production of control, one can do worse than to consult Carl von Clausewitz. According to the Prussian's theory, every war in human history has been composed of three constantly interacting elements: passions, chance and reason. This trinity is an excellent tool for understanding the specific character of any conflict, but it may also be suitable for casting some light on real-world difficulties in exercising control. This is because there is no good reason to assume that any of these real-world impediments is missing from the conflicts taking place in cyberspace, as any conflict in that space is only relevant when it impacts the lives of humans.\n### Exercising cyber power in an abstract setting ### Sabotage and control Sabotage has been defined as ‘a deliberate attempt to weaken or destroy an economic or military system.' The main characteristic of sabotage is its capability to destroy things. This capability is closely related to the technical development and dependency of a particular society and its government and military. Due to this characteristic, the capability of sabotage to achieve any level of control depends on the technological sophistication of the adversary. It has been observed by one scholar of strategy that cyber power can cause serious destruction through sabotage. However, the kind of destruction produced by cyber sabotage is often unintended and very imprecise. Echevarria (2017, 104) agrees that the destruction caused by sabotage usually constitutes only collateral damage. Hence destruction can be produced, but it is not automatically converted into control.\nWith regard to the first level of control, sabotage arguably cannot stop the adversary from exercising his control unless that control depends on his technology. In cases when some sophisticated technology does play a role in the adversary's ability to control our actions, it may be possible to eliminate that control through the destruction of the very instruments that guarantee that control. Possession of nuclear weapons may be a fine example of this scenario. If the adversary owns some of these weapons and we do not, he may be able to achieve control over us by a threat of nuclear attack. However, when we use cyber sabotage to destroy some munition stocks or development facilities for these weapons, we may be able to completely eliminate the control he enjoys over us.\nRegarding the second level of control, the destructive power of cyber sabotage may also be able to reduce the opponent's freedom of action, as it may effectively disarm him. This disarmament is produced by the destruction of important pieces of weaponry or facilities for its production. The most well-known case of cyber sabotage, Stuxnet, indicates that it may be possible to impair an adversary's freedom of action by this kind of disarmament. On the other hand, the effects of the sabotage, in this case, were only temporary and within a year Iran more than recovered from the attack.\nRegarding the third level of control, it is highly questionable whether the sheer destructive potential of sabotage may be enough to control an adversary's policy. His will may or may not be dependent on the functioning of some technological devices. This issue is further complicated by the problems of attribution associated with the exercise of cyber power. Any form of direct coercion is thus very hard in cyber-space. Even if we accept the idea that the population of a state can be considered its CoG, incidents of cyber sabotage conducted in recent years do not seem to have produced the third level of control. For example, in 2015 there was a cyber sabotage conducted by Russians against a segment of the Ukrainian public. In the middle of winter, some 230,000 people in Ukraine were left without electricity for a couple of hours (SANS, E-ISAC 2016). A similar situation also occurred the following year. Whether the Russian goal was to force the Ukrainian government to reconsider its halt of export of Russian natural gas, to intimidate it, or to discredit it by showing its inability to provide basic services for the population, none was achieved. Modern societies, though dependent upon many technological inventions, seem to be highly resilient in the face of the brief disruptions of basic services. Of course, all this might change should there emerge some rapid advancements in the destructive potential of cyber sabotage. We can only imagine how the situation in Ukraine might have turned out if the attacks had been considerably more extensive, affected millions of people and lasted longer. But for now, with specific cases on the table, the capacity of cyber sabotage to produce the third level of control, whether directly or indirectly, seems to be lacking.\n### Espionage and control Espionage has been defined as ‘an attempt to penetrate an adversarial system for purposes of extracting sensitive or protected information'. As such, it is the most common exercise of cyber power by several actors. This is probably because the technical requirements for espionage are less demanding than for sabotage. The main purpose of espionage is to gather information, not to directly shape the real world.\nThe simple fact that espionage is more about understanding the world than about changing it means that it cannot directly produce any level of control. That said, it still has an important potential to identify centres of gravity and thus facilitate their manipulation. As Jacobsen (2014, 20) points out, it can easily identify vulnerabilities before a conflict even begins. Subsequently, it may be possible to use espionage to gain information on how to reduce an adversary's control over us, how to reduce his freedom of action and also how to influence his policy. In this sense, espionage can be perceived as one of the key indirect enablers of all the levels of control.\nA good example of this comes from the Chinese attempts at espionage against the United States which were revealed to the public in 2016. In that year, a Chinese national pleaded guilty to conspiring to hack into US defence contractors' systems to steal sensitive military information, including technical documentation for the multirole fighter jet F-35 Lightning II and the tactical fighter jet F-22 Raptor (Department of Justice 2016). Thanks to this kind of espionage, China might have gained a better understanding of high-end US weapon systems and thus might be able to come up with effective countermeasures to them. This may then effectively reduce the potential of the US to exercise control over China, and it may also reduce the former's freedom of action.\nSubversion and control Subversion has been defined as ‘a deliberate attempt to undermine some authority, its integrity or order in general'. The main characteristic of subversion activities is that they target the cohesion of political collectives, their beliefs and mutual trust in general. Among the means of subversion, propaganda is now the most popular.\nWith regard to the first level of control, subversion, whether conducted in cyberspace or through more traditional means, seems to be able to prevent an adversary from exercising his control over us. For example, the outcome of the Vietnam War was partly influenced by this kind of information-based subversion. The population of the United States was the centre of gravity on the American side, because, due to its democratic political institutions, the polity was dependent upon public support to continue the war. Thus, when a particular kind of information was transferred to the American public via the media, this led to widespread protests against the government's policies on the domestic front. These protests then negatively affected the willingness of the US to participate in the conflict.\nSome subversive activities of recent years have shown us that cyber subversion can produce the other two levels of control too. One example of this may be the subversive activities which took place in Libya, Egypt and several other countries in the years 2010 and 2011. Some of these activities later took the form of violent insurgencies, but the protests were first initiated and mobilised by the use of social media (Mitchell, Brown, and Guskin 2012). In the end, these activities not only reduced governments' freedom of action but also directly influenced their policies (Korotayev, Meshcherina, and Shishkina 2018). Similarly, Milevski (2018) hypothesises a similar scenario taking place in a potential conflict between NATO and Russia. He argues that in such a conflict, the Russian centre of gravity may be the public opinion of its population. Milevski also points to the fact that the Russian regime is well aware of this and that it already uses widespread censorship to prevent this from happening. Liberal democracies of the West might be even more vulnerable to this, because of the direct influence their citizens have on the state's policy and because it is much harder to enforce effective censorship in these kinds of political systems. An important illustration of this vulnerability was the hack of the emails of the US Democratic National Convention and the subsequent leakage of electronic communication to the public. The content of emails caused outrage among Democrat voters, hindered the presidential campaign of Hillary Clinton and it may also have contributed to Donald Trump's victory in the 2016 presidential election. This, though quite indirectly, could have produced control on the third level, as it effectively introduced changes to American internal and external policy.\n### Impediments to control posed by the real world ### Calculating adversary As Clausewitz makes clear on the first pages of his book, war can be thought of like a wrestling match on a larger scale. Here he emphasizes the fact that war is about a dynamic interaction of belligerents, which implies that the adversary is always present. But he is not only present, he actively pursues his own objectives and tries to tailor his strategy in some rational manner (Ibid.). This is a fact that often seems to pass unnoticed, especially in the highly technical field of cyber. But the exercise of cyber power does not constitute an act of force against some inanimate object (though of course, the inanimate object constitutes the means). Instead, cyber power is all about influencing a thinking adversary who has his own will.\nThis has serious implications for the production of control in cyberspace. The presence of a thinking adversary means that all our perfectly crafted cyber operations may be countered by equally crafty defence measures. For example, it is perfectly possible that the enemy is preparing and improving his defence against our meticulously planned sophisticated sabotage, which we have prepared for so long because his own espionage operation against us revealed it. Or maybe the adversary can actively strive to improve the resilience of his population against our attempts at subversion. In the end, the very presence of an intelligent adversary also means that even if one enjoys technological superiority in one moment, this is usually only a temporary condition. An adversary may adapt to the evolving situation and any technological advantage on one side may be erased or even reversed as a result.\nOne of the more important disadvantages of fighting a calculating adversary is that he does not have to keep the competition in cyberspace. He can choose to escalate the conflict in a different domain, not excluding the use of military power. Of course, this is mainly the case with states possessing considerable military capacity. In fact, the creation and exploitation of these kinds of asymmetries is one of the fundamental functions of strategy. When militarily strong states find themselves at a disadvantage in cyberspace, they can do worse than shift the conduct of warfare to the dimension they prefer, and in this way, completely remove any form of control they might have suffered from the adversary.\nThe adversary in conflict always has some influence on how the events unfold. Thus, it may be possible to put ourselves beyond the adversary's capacity to control us, but it is a very different thing to reduce his freedom of action or to influence his policy. The third level of control can really only be achieved if the adversary chooses to cooperate.\n### Uncertainty, chance and friction Clausewitz argues that war, in general, is so saturated with uncertainty and chance that it is futile to search for any certainty within it. In fact, he argues that war is influenced by chance much more than any other human activity. In war, everything is quite simple in theory, but much more difficult in practice. This can be the result of both human and natural actions as well as of the inherent characteristics of instruments in use. In the case of cyberspace, the technological nature of the domain contains many opportunities for chance and friction to exercise their influence.\nIf the manipulation of the centre of gravity is necessary to achieve some control over the adversary, then the identification of the centre of gravity is of crucial importance. However, due to constant uncertainties, the process of this identification can be much more difficult than the actor anticipates. Even if the centre of gravity is accurately identified, the dynamics of the conflict may lead to a shift of the centre of gravity at any given moment. To anticipate these changes and then to manipulate the centres of gravity might prove to be almost impossible, as pure chance can always render these attempts futile.\nAnother source of uncertainty and friction is inherent to the very instruments used in the cyber domain. They are hardly obedient and the results they are supposed to create may not only fail initial expectations but also produce negative effects instead. As Jacobsen (2014, 18--19) points out: ‘Computer code always does what it is programmed to do, but rarely exactly as intended.' Hence the exercises of cyber power are often prone to produce confusion rather than control. This problem is augmented by the technical complications which may arise due to the large amount of time it takes for cyber instruments to take any effect.\n### Passions and emotions Emotions and passions can exert a powerful influence on any actor participating in war. They are often present in the very motivations which give rise to war and then they also shape its conduct. They can easily influence both individual leaders as well as the public.\nWhat this means for the exercise of cyber power is that even if a thinking adversary decides to cooperate and one is able to somehow bypass all the friction and uncertainty, there are still emotional elements and those can bring a lot of non-linearity into the conflict. In the case of cyber conflicts, these elements may impede rational calculation, they might multiply chance and uncertainty and they can also contribute to the escalation of violence from the cyber domain to the real world.\nPassions are present in any important decision-making process, which in turn is likely to be the target of any ambitious exercise of cyber power. Emotions may lead to the misidentification of the centre of gravity or its negligence and the pursuit of less important goals. Passions can also lead espionage to gather unimportant information, sabotage to target unimportant infrastructure and subversion to backfire because of cultural differences or misunderstandings.\n## Conclusions This paper supports the previous findings that cyber power can be usefully analysed from the perspective of a general strategy. The findings indicate that the exercise of cyber power can, in the abstract setting, produce various levels of control over an adversary. First, sabotage in cyberspace may be able to reduce or remove the control an adversary enjoys over one's behaviour and it may also be possible to limit the adversary's freedom of action, but it does not yet seem to have the potential to directly influence his policy or to make him bow to one's will. Second, cyber subversion seems to be able to produce all three levels of control, but the effect very much depends on the political system of the adversary. Last, espionage cannot produce control, but it may serve as an enabler of any level of control by gathering the necessary information about the centre of gravity in the conflict.\nOn the other hand, there are also real-world impediments to the production of control. Every conflict includes an intelligent adversary, uncertainty, friction and factors of irrationality represented by emotions and passions. It is not possible to avoid these elements, whether one wants to exercise power over land, in the air, on the sea or in cyberspace. All of these elements can, in their unique ways, produce challenges that will make the production of control much harder, if not impossible. The real level of control produced by any kind of cyber activity ultimately depends on the particular interaction of these elements. For this reason, production is effectively unpredictable, although some trends may be identified in the future if more data about cases of cyber activities emerge.\nThere are several possible avenues for further research. Other scholars could aim to examine different concepts from strategic theory and their relation to cyberspace. So-called principles of war could prove to be decent candidates. Several methods could be used for this purpose. Case studies combined with the method of process-tracing could yield interesting results. A greater data set of documented cyber actions would be useful for this purpose, though it might take some time for that to emerge."
    }
  },
  "citation_summary": {
    "style": "author_year",
    "dominant_bucket": "author_year",
    "dominant": {
      "intext_total": 39.0,
      "success_occurrences": 39.0,
      "success_unique": 22.0,
      "bib_unique_total": 59.0,
      "occurrence_match_rate": 1.0,
      "bib_coverage_rate": 0.3728813559322034,
      "success_percentage": 100.0,
      "missing_intext_expected_total": 0,
      "highest_intext_index": 0,
      "missing_footnotes_for_seen_total": 0,
      "uncited_footnote_total": 0,
      "style": "author_year"
    },
    "buckets": {
      "footnotes": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0.0,
        "highest_intext_index": 0.0,
        "missing_footnotes_for_seen_total": 0.0,
        "uncited_footnote_total": 0.0,
        "style": "footnotes"
      },
      "tex": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "numeric": {
        "intext_total": 0.0,
        "success_occurrences": 0.0,
        "success_unique": 0.0,
        "bib_unique_total": 0.0,
        "occurrence_match_rate": 0.0,
        "bib_coverage_rate": 0.0,
        "success_percentage": 0.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "numeric"
      },
      "author_year": {
        "intext_total": 39.0,
        "success_occurrences": 39.0,
        "success_unique": 22.0,
        "bib_unique_total": 59.0,
        "occurrence_match_rate": 1.0,
        "bib_coverage_rate": 0.3728813559322034,
        "success_percentage": 100.0,
        "missing_intext_expected_total": 0,
        "highest_intext_index": 0,
        "missing_footnotes_for_seen_total": 0,
        "uncited_footnote_total": 0,
        "style": "author_year"
      }
    }
  },
  "metadata": {
    "title": "Cyber power and control: a perspective from strategic theory",
    "subtitle": "To link to this article: https://doi.org/10.1080/23738871.2019.1635177",
    "document_type": "journal_article",
    "venue": "Journal of Cyber Policy",
    "publication_year": 2019,
    "authors": [
      "Routledge Taylor",
      "Francis Group",
      "Samuel Zilincik",
      "Michael Myklin",
      "Petr Kovanda",
      "View Crossmark data"
    ],
    "affiliations": [],
    "emails": [],
    "orcids": [],
    "corresponding_author_line": "",
    "abstract": "Cyber power has not been sufficiently examined from the perspective of strategic theory. This research aims to fill this gap by closely analysing the connection between cyber power and the concept of control. For this purpose, the authors use the method of theoretical analysis augmented by an examination of particular historical examples. The findings indicate that cyber sabotage and cyber subversion may be able to produce varying levels of control depending on the particular context of each situation. Cyber espionage alone is unable to produce any level of control, but it may enable other instruments to achieve a level of control.",
    "keywords": [
      "Cyber power",
      "strategy",
      "control",
      "espionage",
      "subversion",
      "sabotage"
    ],
    "publication_dates": {
      "received": "15 October 2018",
      "revised": "21 February 2019",
      "accepted": "11 May 2019",
      "published": "07 Jul 2019",
      "online": "07 Jul 2019"
    },
    "identifiers": {
      "doi": [
        "10.1080/23738871.2019.1635177"
      ],
      "issn": [
        "ISSN: 2373-8871"
      ],
      "isbn": [],
      "arxiv": [],
      "pmid": [],
      "pmcid": [],
      "urls": [
        "www.tandfonline.com/journals/rcyb20",
        "https://doi.org/10.1080/23738871.2019.1635177",
        "https://www.tandfonline.com/action/journalInformation?journalCode=rcyb20"
      ]
    },
    "references_block_count": 1,
    "references_entries_estimated": 54,
    "heading_count": 19,
    "max_heading_level": 3,
    "partial_document": {
      "is_partial_document": false,
      "reasons": [],
      "toc_dot_lines": 0
    }
  },
  "validation": {
    "dominant_quality": {
      "intext_total": 39,
      "index_coverage": 1.0,
      "intext_citation_coverage": 1.0,
      "preceding_text_coverage": 1.0,
      "footnote_coverage": 1.0,
      "unique_index_count": 22
    },
    "footnotes_quality": {
      "intext_total": 0,
      "index_coverage": 0.0,
      "intext_citation_coverage": 0.0,
      "preceding_text_coverage": 0.0,
      "footnote_coverage": 0.0,
      "unique_index_count": 0,
      "items_total": 0
    },
    "style_validation": {
      "detected_style": "author_year",
      "recommended_style": "unknown",
      "aligned": true,
      "signals": {
        "superscript_hits": 4,
        "superscript_definition_lines": 0,
        "numeric_bracket_hits": 0,
        "numeric_endnote_lines": 0,
        "author_year_hits": 0
      }
    },
    "coverage_validation": {
      "dominant_bib_total": 59.0,
      "dominant_bib_coverage_rate": 0.3728813559322034,
      "dominant_link_target": "bibliography",
      "dominant_unresolved_flag": "unresolved_reference_links"
    },
    "heading_validation": {
      "heading_count": 19,
      "max_heading_level": 3,
      "level_jump_violations": 1,
      "numbering_parent_violations": 0,
      "has_reference_heading": true,
      "has_subheadings": true
    },
    "metadata_validation": {
      "field_presence": {
        "title": true,
        "authors": true,
        "affiliations": false,
        "emails": false,
        "orcids": false,
        "abstract": true,
        "keywords": true,
        "venue": true,
        "persistent_identifier": true,
        "headings": true,
        "partial_document": false
      },
      "counts": {
        "authors": 6,
        "affiliations": 0,
        "emails": 0,
        "orcids": 0,
        "keywords": 6,
        "doi": 1,
        "issn": 1,
        "isbn": 0,
        "arxiv": 0,
        "pmid": 0,
        "pmcid": 0,
        "urls": 3
      },
      "coverage": {
        "core_coverage": 0.8333333333333334,
        "email_author_link_rate": 0.0
      },
      "partial_document": {
        "is_partial_document": false,
        "reasons": [],
        "toc_dot_lines": 0
      },
      "flags": []
    },
    "flags": [
      "low_bib_coverage",
      "heading_level_jump_violation"
    ]
  },
  "updated_at_utc": "2026-02-14T08:29:04.505171+00:00"
}